Repository: pluzanov/pg-doc-ru
Catalog: 9.6/*.po
Languages: lo

source: The <filename>lo</filename> module provides support for managing Large Objects (also called LOs or BLOBs). This includes a data type <type>lo</type> and a trigger <function>lo_manage</function>.
lo: Модуль <filename>lo</filename> поддерживает управление большими объектами (БО или LO, Large Objects, иногда BLOB, Binary Large OBjects). Он реализует тип данных <type>lo</type> и триггер <function>lo_manage</function>.

source: Rationale
lo: Обоснование

source: One of the problems with the JDBC driver (and this affects the ODBC driver also), is that the specification assumes that references to BLOBs (Binary Large OBjects) are stored within a table, and if that entry is changed, the associated BLOB is deleted from the database.
lo: Одна из проблема драйвера JDBC (она распространяется и на драйвер ODBC) в том, что спецификация типа предполагает, что ссылки на BLOB хранятся в таблице, и если запись меняется, связанный BLOB удаляется из базы.

source: As <productname>PostgreSQL</productname> stands, this doesn't occur. Large objects are treated as objects in their own right; a table entry can reference a large object by OID, but there can be multiple table entries referencing the same large object OID, so the system doesn't delete the large object just because you change or remove one such entry.
lo: Но с <productname>PostgreSQL</productname> этого не происходит. Большие объекты обрабатываются как самостоятельные объекты; запись в таблице может ссылаться на большой объект по OID, но при этом на один и тот же объект могут ссылаться несколько записей таблицы, так что система не удаляет большой объект, только потому что вы меняете или удаляете такую запись.

source: Now this is fine for <productname>PostgreSQL</productname>-specific applications, but standard code using JDBC or ODBC won't delete the objects, resulting in orphan objects &mdash; objects that are not referenced by anything, and simply occupy disk space.
lo: Это не проблема для приложений, ориентированных на <productname>PostgreSQL</productname>, но стандартный код, использующий JDBC или ODBC, не будет удалять эти объекты, в результате чего они окажутся потерянными &mdash; объектами, которые никак не задействованы, а просто занимают место на диске.

source: The <filename>lo</filename> module allows fixing this by attaching a trigger to tables that contain LO reference columns. The trigger essentially just does a <function>lo_unlink</function> whenever you delete or modify a value referencing a large object. When you use this trigger, you are assuming that there is only one database reference to any large object that is referenced in a trigger-controlled column!
lo: Модуль <filename>lo</filename> позволяет решить эту проблему, добавляя триггер к таблицам, которые содержат столбцы, ссылающиеся на БО. Этот триггер по сути просто вызывает <function>lo_unlink</function>, когда вы удаляете или изменяете значение, ссылающееся на большой объект. Данный триггер предполагает, что на любой большой объект, на который ссылается контролируемый им столбец, указывает только одна ссылка!

source: The module also provides a data type <type>lo</type>, which is really just a domain of the <type>oid</type> type. This is useful for differentiating database columns that hold large object references from those that are OIDs of other things. You don't have to use the <type>lo</type> type to use the trigger, but it may be convenient to use it to keep track of which columns in your database represent large objects that you are managing with the trigger. It is also rumored that the ODBC driver gets confused if you don't use <type>lo</type> for BLOB columns.
lo: Этот модуль также предоставляет тип данных <type>lo</type>, который просто является доменом на базе <type>oid</type>. Он может быть полезен для выделения столбцов, содержащих ссылки на большие объекты, среди столбцов, содержащих другие OID. Для использования триггера применять тип <type>lo</type> необязательно, но этот тип может быть полезен для отслеживания столбцов в вашей базе, представляющих большие объекты, с которыми работает триггер. Кроме того, поступали сообщения, что драйвер ODBC не работает корректно, если для столбцов BLOB используется не тип <type>lo</type>.

source: How to Use It
lo: Как его использовать

source: Here's a simple example of usage:
lo: Пример его использования:

source: For each column that will contain unique references to large objects, create a <literal>BEFORE UPDATE OR DELETE</literal> trigger, and give the column name as the sole trigger argument. You can also restrict the trigger to only execute on updates to the column by using <literal>BEFORE UPDATE OF</literal> <replaceable class="parameter">column_name</replaceable>. If you need multiple <type>lo</type> columns in the same table, create a separate trigger for each one, remembering to give a different name to each trigger on the same table.
lo: Для каждого столбца, который будет содержать уникальные ссылки на большие объекты, создайте триггер <literal>BEFORE UPDATE OR DELETE</literal> и передайте имя столбца в качестве единственного аргумента триггера. Вы также можете сделать, чтобы триггер срабатывал только при изменениях в столбце, указав <literal>BEFORE UPDATE OF</literal> <replaceable class="parameter">имя_столбца</replaceable>. Если вам нужно иметь в одной таблице несколько столбцов <type>lo</type>, создайте отдельный триггер для каждого (при этом обязательно нужно дать всем триггерам в одной таблице разные имена).

source: Limitations
lo: Ограничения

source: Dropping a table will still orphan any objects it contains, as the trigger is not executed. You can avoid this by preceding the <command>DROP TABLE</command> with <command>DELETE FROM <replaceable>table</replaceable></command>.
lo: При удалении таблицы, однако, всё равно будут потеряны относящиеся к ней объекты, так как триггер не будет выполняться. Этого можно избежать, выполнив перед <command>DROP TABLE</command> команду <command>DELETE FROM <replaceable>таблица</replaceable></command>.

source: <command>TRUNCATE</command> has the same hazard.
lo: То же касается и команды <command>TRUNCATE</command>.

source: If you already have, or suspect you have, orphaned large objects, see the <xref linkend="vacuumlo"/> module to help you clean them up. It's a good idea to run <application>vacuumlo</application> occasionally as a back-stop to the <function>lo_manage</function> trigger.
lo: Если у вас уже есть, или вы подозреваете, что есть потерянные большие объекты, обратите внимание на модуль <xref linkend="vacuumlo"/>, который может помочь вычистить их. Имеет смысл периодически запускать <application>vacuumlo</application> в качестве меры, дополняющей действие триггера <function>lo_manage</function>.

source: Some frontends may create their own tables, and will not create the associated trigger(s). Also, users may not remember (or know) to create the triggers.
lo: Некоторые клиентские программы могут создавать собственные таблицы, но не создавать для них соответствующие триггеры. Кроме того, и пользователи могут не создавать такие триггеры (забывая о них, либо не зная, как это сделать).

source: Author
lo: Автор

source: Peter Mount <email>peter@retep.org.uk</email>
lo: Питер Маунт <email>peter@retep.org.uk</email>
