Repository: pluzanov/pg-doc-ru
Catalog: 9.6/advanced.po
Languages: ru

source: A window function call always contains an <literal>OVER</literal> clause directly following the window function's name and argument(s). This is what syntactically distinguishes it from a regular function or aggregate function. The <literal>OVER</literal> clause determines exactly how the rows of the query are split up for processing by the window function. The <literal>PARTITION BY</literal> list within <literal>OVER</literal> specifies dividing the rows into groups, or partitions, that share the same values of the <literal>PARTITION BY</literal> expression(s). For each row, the window function is computed across the rows that fall into the same partition as the current row.
ru: Вызов оконной функции всегда содержит предложение <literal>OVER</literal>, следующее за названием и аргументами оконной функции. Это синтаксически отличает её от обычной или агрегатной функции. Предложение <literal>OVER</literal> определяет, как именно нужно разделить строки запроса для обработки оконной функцией. Предложение <literal>PARTITION BY</literal>, дополняющее <literal>OVER</literal>, указывает, что строки нужно разделить по группам или разделам, объединяя одинаковые значения выражений <literal>PARTITION BY</literal>. Оконная функция вычисляется по строкам, попадающим в один раздел с текущей строкой.

source: You can also control the order in which rows are processed by window functions using <literal>ORDER BY</literal> within <literal>OVER</literal>. (The window <literal>ORDER BY</literal> does not even have to match the order in which the rows are output.) Here is an example: <placeholder-1/> <screen> depname | empno | salary | rank -----------+-------+--------+------ develop | 8 | 6000 | 1 develop | 10 | 5200 | 2 develop | 11 | 5200 | 2 develop | 9 | 4500 | 4 develop | 7 | 4200 | 5 personnel | 2 | 3900 | 1 personnel | 5 | 3500 | 2 sales | 1 | 5000 | 1 sales | 4 | 4800 | 2 sales | 3 | 4800 | 2 (10 rows)</screen> As shown here, the <function>rank</function> function produces a numerical rank within the current row's partition for each distinct <literal>ORDER BY</literal> value, in the order defined by the <literal>ORDER BY</literal> clause. <function>rank</function> needs no explicit parameter, because its behavior is entirely determined by the <literal>OVER</literal> clause.
ru: Вы можете также определять порядок, в котором строки будут обрабатываться оконными функциями, используя <literal>ORDER BY</literal> в <literal>OVER</literal>. (Порядок <literal>ORDER BY</literal> для окна может даже не совпадать с порядком, в котором выводятся строки.) Например: <placeholder-1/> <screen> depname | empno | salary | rank -----------+-------+--------+------ develop | 8 | 6000 | 1 develop | 10 | 5200 | 2 develop | 11 | 5200 | 2 develop | 9 | 4500 | 4 develop | 7 | 4200 | 5 personnel | 2 | 3900 | 1 personnel | 5 | 3500 | 2 sales | 1 | 5000 | 1 sales | 4 | 4800 | 2 sales | 3 | 4800 | 2 (10 rows)</screen> Как показано здесь, функция <function>rank</function> выдаёт порядковый номер в разделе текущей строки для каждого уникального значения, по которому выполняет сортировку предложение <literal>ORDER BY</literal>. У функции <function>rank</function> нет параметров, так как её поведение полностью определяется предложением <literal>OVER</literal>.

source: The rows considered by a window function are those of the <quote>virtual table</quote> produced by the query's <literal>FROM</literal> clause as filtered by its <literal>WHERE</literal>, <literal>GROUP BY</literal>, and <literal>HAVING</literal> clauses if any. For example, a row removed because it does not meet the <literal>WHERE</literal> condition is not seen by any window function. A query can contain multiple window functions that slice up the data in different ways by means of different <literal>OVER</literal> clauses, but they all act on the same collection of rows defined by this virtual table.
ru: Строки, обрабатываемые оконной функцией, представляют собой <quote>виртуальные таблицы</quote>, созданные из предложения <literal>FROM</literal> и затем прошедшие через фильтрацию и группировку <literal>WHERE</literal> и <literal>GROUP BY</literal> и, возможно, условие <literal>HAVING</literal>. Например, строка, отфильтрованная из-за нарушения условия <literal>WHERE</literal>, не будет видна для оконных функций. Запрос может содержать несколько оконных функций, разделяющих данные по-разному с помощью разных предложений <literal>OVER</literal>, но все они будут обрабатывать один и тот же набор строк этой виртуальной таблицы.

source: We already saw that <literal>ORDER BY</literal> can be omitted if the ordering of rows is not important. It is also possible to omit <literal>PARTITION BY</literal>, in which case there is just one partition containing all the rows.
ru: Мы уже видели, что <literal>ORDER BY</literal> можно опустить, если порядок строк не важен. Также возможно опустить <literal>PARTITION BY</literal>, в этом случае будет только один раздел, содержащий все строки.

source: There are options to define the window frame in other ways, but this tutorial does not cover them. See <xref linkend="syntax-window-functions"/> for details.
ru: Рамки окна можно определять и другими способами, но в этом введении они не рассматриваются. Узнать о них подробнее вы можете в <xref remap="6" linkend="syntax-window-functions"/>.

source: There is another important concept associated with window functions: for each row, there is a set of rows within its partition called its <firstterm>window frame</firstterm>. Many (but not all) window functions act only on the rows of the window frame, rather than of the whole partition. By default, if <literal>ORDER BY</literal> is supplied then the frame consists of all rows from the start of the partition up through the current row, plus any following rows that are equal to the current row according to the <literal>ORDER BY</literal> clause. When <literal>ORDER BY</literal> is omitted the default frame consists of all rows in the partition. <placeholder-1/> Here is an example using <function>sum</function>:
ru: Есть ещё одно важное понятие, связанное с оконными функциями: для каждой строки существует набор строк в её разделе, называемый <firstterm>рамкой окна</firstterm>. По умолчанию, с указанием <literal>ORDER BY</literal> рамка состоит из всех строк от начала раздела до текущей строки и строк, равных текущей по значению выражения <literal>ORDER BY</literal>. Без <literal>ORDER BY</literal> рамка по умолчанию состоит из всех строк раздела. <placeholder-1/> Посмотрите на пример использования <function>sum</function>:

source: Above, since there is no <literal>ORDER BY</literal> in the <literal>OVER</literal> clause, the window frame is the same as the partition, which for lack of <literal>PARTITION BY</literal> is the whole table; in other words each sum is taken over the whole table and so we get the same result for each output row. But if we add an <literal>ORDER BY</literal> clause, we get very different results:
ru: Так как в этом примере нет указания <literal>ORDER BY</literal> в предложении <literal>OVER</literal>, рамка окна содержит все строки раздела, а он, в свою очередь, без предложения <literal>PARTITION BY</literal> включает все строки таблицы; другими словами, сумма вычисляется по всей таблице и мы получаем один результат для каждой строки результата. Но если мы добавим <literal>ORDER BY</literal>, мы получим совсем другие результаты:

source: Here the sum is taken from the first (lowest) salary up through the current one, including any duplicates of the current one (notice the results for the duplicated salaries).
ru: Здесь в сумме накапливаются зарплаты от первой (самой низкой) до текущей, включая повторяющиеся текущие значения (обратите внимание на результат в строках с одинаковой зарплатой).

source: Window functions are permitted only in the <literal>SELECT</literal> list and the <literal>ORDER BY</literal> clause of the query. They are forbidden elsewhere, such as in <literal>GROUP BY</literal>, <literal>HAVING</literal> and <literal>WHERE</literal> clauses. This is because they logically execute after the processing of those clauses. Also, window functions execute after regular aggregate functions. This means it is valid to include an aggregate function call in the arguments of a window function, but not vice versa.
ru: Оконные функции разрешается использовать в запросе только в списке <literal>SELECT</literal> и предложении <literal>ORDER BY</literal>. Во всех остальных предложениях, включая <literal>GROUP BY</literal>, <literal>HAVING</literal> и <literal>WHERE</literal>, они запрещены. Это объясняется тем, что логически они выполняются после обычных агрегатных функций, а значит агрегатную функцию можно вызвать из оконной, но не наоборот.

source: If there is a need to filter or group rows after the window calculations are performed, you can use a sub-select. For example: <placeholder-1/> The above query only shows the rows from the inner query having <literal>rank</literal> less than 3.
ru: Если вам нужно отфильтровать или сгруппировать строки после вычисления оконных функций, вы можете использовать вложенный запрос. Например: <placeholder-1/> Данный запрос покажет только те строки внутреннего запроса, у которых <literal>rank</literal> (порядковый номер) меньше 3.

source: When a query involves multiple window functions, it is possible to write out each one with a separate <literal>OVER</literal> clause, but this is duplicative and error-prone if the same windowing behavior is wanted for several functions. Instead, each windowing behavior can be named in a <literal>WINDOW</literal> clause and then referenced in <literal>OVER</literal>. For example: <placeholder-1/>
ru: Когда в запросе вычисляются несколько оконных функций для одинаково определённых окон, конечно можно написать для каждой из них отдельное предложение <literal>OVER</literal>, но при этом оно будет дублироваться, что неизбежно будет провоцировать ошибки. Поэтому лучше определение окна выделить в предложение <literal>WINDOW</literal>, а затем ссылаться на него в <literal>OVER</literal>. Например: <placeholder-1/>

source: More details about window functions can be found in <xref linkend="syntax-window-functions"/>, <xref linkend="functions-window"/>, <xref linkend="queries-window"/>, and the <xref linkend="sql-select"/> reference page.
ru: Подробнее об оконных функциях можно узнать в <xref remap="6" linkend="syntax-window-functions"/>, <xref remap="6" linkend="functions-window"/>, <xref remap="6" linkend="queries-window"/> и в справке <xref linkend="sql-select"/>.

source: Inheritance
ru: Наследование

source: <primary>inheritance</primary>
ru: <primary>наследование</primary>

source: Inheritance is a concept from object-oriented databases. It opens up interesting new possibilities of database design.
ru: Наследование &mdash; это концепция, взятая из объектно-ориентированных баз данных. Она открывает множество интересных возможностей при проектировании баз данных.

source: CREATE TABLE capitals ( name text, population real, altitude int, -- (in ft) state char(2) ); CREATE TABLE non_capitals ( name text, population real, altitude int -- (in ft) ); CREATE VIEW cities AS SELECT name, population, altitude FROM capitals UNION SELECT name, population, altitude FROM non_capitals;
ru: CREATE TABLE capitals ( name text, population real, altitude int, -- (высота в футах) state char(2) ); CREATE TABLE non_capitals ( name text, population real, altitude int -- (высота в футах) ); CREATE VIEW cities AS SELECT name, population, altitude FROM capitals UNION SELECT name, population, altitude FROM non_capitals;

source: Let's create two tables: A table <classname>cities</classname> and a table <classname>capitals</classname>. Naturally, capitals are also cities, so you want some way to show the capitals implicitly when you list all cities. If you're really clever you might invent some scheme like this: <placeholder-1/> This works OK as far as querying goes, but it gets ugly when you need to update several rows, for one thing.
ru: Давайте создадим две таблицы: <classname>cities</classname> (города) и <classname>capitals</classname> (столицы штатов). Естественно, столицы штатов также являются городами, поэтому нам нужно явным образом добавлять их в результат, когда мы хотим просмотреть все города. Если вы проявите смекалку, вы можете предложить, например, такое решение: <placeholder-1/> Оно может устраивать, пока мы извлекаем данные, но если нам потребуется изменить несколько строк, это будет выглядеть некрасиво.

source: CREATE TABLE cities ( name text, population real, altitude int -- (in ft) ); CREATE TABLE capitals ( state char(2) ) INHERITS (cities);
ru: CREATE TABLE cities ( name text, population real, altitude int -- (высота в футах) ); CREATE TABLE capitals ( state char(2) ) INHERITS (cities);

source: A better solution is this: <placeholder-1/>
ru: Поэтому есть лучшее решение: <placeholder-1/>

source: In this case, a row of <classname>capitals</classname> <firstterm>inherits</firstterm> all columns (<structfield>name</structfield>, <structfield>population</structfield>, and <structfield>altitude</structfield>) from its <firstterm>parent</firstterm>, <classname>cities</classname>. The type of the column <structfield>name</structfield> is <type>text</type>, a native <productname>PostgreSQL</productname> type for variable length character strings. State capitals have an extra column, <structfield>state</structfield>, that shows their state. In <productname>PostgreSQL</productname>, a table can inherit from zero or more other tables.
ru: В данном случае строка таблицы <classname>capitals</classname> <firstterm>наследует</firstterm> все столбцы (<structfield>name</structfield>, <structfield>population</structfield> и <structfield>altitude</structfield>) от <firstterm>родительской таблицы</firstterm> <classname>cities</classname>. Столбец <structfield>name</structfield> имеет тип <type>text</type>, собственный тип <productname>PostgreSQL</productname> для текстовых строк переменной длины. А в таблицу столиц добавлен дополнительный столбец <structfield>state</structfield>, в котором будет указан штат. В <productname>PostgreSQL</productname> таблица может наследоваться от нуля или нескольких других таблиц.

source: For example, the following query finds the names of all cities, including state capitals, that are located at an altitude over 500 feet: <placeholder-1/> which returns: <screen> name | altitude -----------+---------- Las Vegas | 2174 Mariposa | 1953 Madison | 845 (3 rows)</screen>
ru: Например, следующий запрос выведет названия всех городов, включая столицы, находящихся выше 500 футов над уровнем моря: <placeholder-1/> Результат его выполнения: <screen> name | altitude -----------+---------- Las Vegas | 2174 Mariposa | 1953 Madison | 845 (3 rows)</screen>

source: On the other hand, the following query finds all the cities that are not state capitals and are situated at an altitude over 500 feet: <placeholder-1/> <screen> name | altitude -----------+---------- Las Vegas | 2174 Mariposa | 1953 (2 rows)</screen>
ru: А следующий запрос находит все города, которые не являются столицами штатов, но также находятся выше 500 футов: <placeholder-1/> <screen> name | altitude -----------+---------- Las Vegas | 2174 Mariposa | 1953 (2 rows)</screen>

source: Here the <literal>ONLY</literal> before <literal>cities</literal> indicates that the query should be run over only the <classname>cities</classname> table, and not tables below <classname>cities</classname> in the inheritance hierarchy. Many of the commands that we have already discussed &mdash; <command>SELECT</command>, <command>UPDATE</command>, and <command>DELETE</command> &mdash; support this <literal>ONLY</literal> notation.
ru: Здесь слово <literal>ONLY</literal> перед названием таблицы <literal>cities</literal> указывает, что запрос следует выполнять только для строк таблицы <classname>cities</classname>, не включая таблицы, унаследованные от <classname>cities</classname>. Многие операторы, которые мы уже обсудили &mdash; <command>SELECT</command>, <command>UPDATE</command> и <command>DELETE</command> &mdash; поддерживают указание <literal>ONLY</literal>.

source: Although inheritance is frequently useful, it has not been integrated with unique constraints or foreign keys, which limits its usefulness. See <xref linkend="ddl-inherit"/> for more detail.
ru: Хотя наследование часто бывает полезно, оно не интегрировано с ограничениями уникальности и внешними ключами, что ограничивает его применимость. Подробнее это описывается в <xref remap="6" linkend="ddl-inherit"/>.

source: Conclusion
ru: Заключение

source: <productname>PostgreSQL</productname> has many features not touched upon in this tutorial introduction, which has been oriented toward newer users of <acronym>SQL</acronym>. These features are discussed in more detail in the remainder of this book.
ru: <productname>PostgreSQL</productname> имеет множество возможностей, не затронутых в этом кратком введении, рассчитанном на начинающих пользователей <acronym>SQL</acronym>. Эти возможности будут рассмотрены в деталях в продолжении книги.

source: If you feel you need more introductory material, please visit the PostgreSQL <ulink url="http://www.postgresql.org">web site</ulink> for links to more resources.
ru: Если вам необходима дополнительная вводная информация, посетите <ulink url="http://www.postgresql.org">сайт PostgreSQL</ulink>, там вы найдёте ссылки на другие ресурсы.
