Repository: pluzanov/pg-doc-ru
Catalog: 9.6/advanced.po
Languages: ru

source: Advanced Features
ru: Расширенные возможности

source: Introduction
ru: Введение

source: In the previous chapter we have covered the basics of using <acronym>SQL</acronym> to store and access your data in <productname>PostgreSQL</productname>. We will now discuss some more advanced features of <acronym>SQL</acronym> that simplify management and prevent loss or corruption of your data. Finally, we will look at some <productname>PostgreSQL</productname> extensions.
ru: В предыдущей главе мы изучили азы использования <acronym>SQL</acronym> для хранения и обработки данных в <productname>PostgreSQL</productname>. Теперь мы обсудим более сложные возможности <acronym>SQL</acronym>, помогающие управлять данными и предотвратить их потерю или порчу. В конце главы мы рассмотрим некоторые расширения <productname>PostgreSQL</productname>.

source: This chapter will on occasion refer to examples found in <xref linkend="tutorial-sql"/> to change or improve them, so it will be useful to have read that chapter. Some examples from this chapter can also be found in <filename>advanced.sql</filename> in the tutorial directory. This file also contains some sample data to load, which is not repeated here. (Refer to <xref linkend="tutorial-sql-intro"/> for how to use the file.)
ru: В этой главе мы будем время от времени ссылаться на примеры, приведённые в <xref remap="6" linkend="tutorial-sql"/> и изменять или развивать их, поэтому будет полезно сначала прочитать предыдущую главу. Некоторые примеры этой главы также можно найти в файле <filename>advanced.sql</filename> в каталоге tutorial. Кроме того, этот файл содержит пример данных для загрузки (здесь она повторно не рассматривается). Если вы не знаете, как использовать этот файл, обратитесь к <xref remap="3" linkend="tutorial-sql-intro"/>.

source: Views
ru: Представления

source: <primary>view</primary>
ru: <primary>представление</primary>

source: Refer back to the queries in <xref linkend="tutorial-join"/>. Suppose the combined listing of weather records and city location is of particular interest to your application, but you do not want to type the query each time you need it. You can create a <firstterm>view</firstterm> over the query, which gives a name to the query that you can refer to like an ordinary table: <placeholder-1/>
ru: Вспомните запросы, с которыми мы имели дело в <xref remap="6" linkend="tutorial-join"/>. Предположим, что вас интересует составной список из погодных записей и координат городов, но вы не хотите каждый раз вводить весь этот запрос. Вы можете создать <firstterm>представление</firstterm> по данному запросу, фактически присвоить имя запросу, а затем обращаться к нему как к обычной таблице: <placeholder-1/>

source: Making liberal use of views is a key aspect of good SQL database design. Views allow you to encapsulate the details of the structure of your tables, which might change as your application evolves, behind consistent interfaces.
ru: Активное использование представлений &mdash; это ключевой аспект хорошего проектирования баз данных SQL. Представления позволяют вам скрыть внутреннее устройство ваших таблиц, которые могут меняться по мере развития приложения, за надёжными интерфейсами.

source: Views can be used in almost any place a real table can be used. Building views upon other views is not uncommon.
ru: Представления можно использовать практически везде, где можно использовать обычные таблицы. И довольно часто представления создаются на базе других представлений.

source: Foreign Keys
ru: Внешние ключи

source: <primary>foreign key</primary>
ru: <primary>внешний ключ</primary>

source: <primary>referential integrity</primary>
ru: <primary>ссылочная целостность</primary>

source: Recall the <classname>weather</classname> and <classname>cities</classname> tables from <xref linkend="tutorial-sql"/>. Consider the following problem: You want to make sure that no one can insert rows in the <classname>weather</classname> table that do not have a matching entry in the <classname>cities</classname> table. This is called maintaining the <firstterm>referential integrity</firstterm> of your data. In simplistic database systems this would be implemented (if at all) by first looking at the <classname>cities</classname> table to check if a matching record exists, and then inserting or rejecting the new <classname>weather</classname> records. This approach has a number of problems and is very inconvenient, so <productname>PostgreSQL</productname> can do this for you.
ru: Вспомните таблицы <classname>weather</classname> и <classname>cities</classname> из <xref remap="2" linkend="tutorial-sql"/>. Давайте рассмотрим следующую задачу: вы хотите добиться, чтобы никто не мог вставить в таблицу <classname>weather</classname> строки, для которых не находится соответствующая строка в таблице <classname>cities</classname>. Это называется обеспечением <firstterm>ссылочной целостности</firstterm> данных. В простых СУБД это пришлось бы реализовать (если это вообще возможно) так: сначала явно проверить, есть ли соответствующие записи в таблице <classname>cities</classname>, а затем отклонить или вставить новые записи в таблицу <classname>weather</classname>. Этот подход очень проблематичен и неудобен, поэтому всё это <productname>PostgreSQL</productname> может сделать за вас.

source: The new declaration of the tables would look like this: <placeholder-1/> Now try inserting an invalid record: <placeholder-2/> <screen>ERROR: insert or update on table "weather" violates foreign key constraint "weather_city_fkey" DETAIL: Key (city)=(Berkeley) is not present in table "cities".</screen>
ru: Новое объявление таблицы будет выглядеть так: <placeholder-1/> Теперь попробуйте вставить недопустимую запись: <placeholder-2/> <screen>ОШИБКА: INSERT или UPDATE в таблице "weather" нарушает ограничение внешнего ключа "weather_city_fkey" ПОДРОБНОСТИ: Ключ (city)=(Berkeley) отсутствует в таблице "cities".</screen>

source: The behavior of foreign keys can be finely tuned to your application. We will not go beyond this simple example in this tutorial, but just refer you to <xref linkend="ddl"/> for more information. Making correct use of foreign keys will definitely improve the quality of your database applications, so you are strongly encouraged to learn about them.
ru: Поведение внешних ключей можно подстроить согласно требованиям вашего приложения. Мы не будем усложнять этот простой пример в данном введении, но вы можете обратиться за дополнительной информацией к <xref remap="3" linkend="ddl"/>. Правильно применяя внешние ключи, вы определённо создадите более качественные приложения, поэтому мы настоятельно рекомендуем изучить их.

source: Transactions
ru: Транзакции

source: <primary>transaction</primary>
ru: <primary>транзакция</primary>

source: <firstterm>Transactions</firstterm> are a fundamental concept of all database systems. The essential point of a transaction is that it bundles multiple steps into a single, all-or-nothing operation. The intermediate states between the steps are not visible to other concurrent transactions, and if some failure occurs that prevents the transaction from completing, then none of the steps affect the database at all.
ru: <firstterm>Транзакции</firstterm> &mdash; это фундаментальное понятие во всех СУБД. Суть транзакции в том, что она объединяет последовательность действий в одну операцию "всё или ничего". Промежуточные состояния внутри последовательности не видны другим транзакциям, и если что-то помешает успешно завершить транзакцию, ни один из результатов этих действий не сохранится в базе данных.

source: For example, consider a bank database that contains balances for various customer accounts, as well as total deposit balances for branches. Suppose that we want to record a payment of $100.00 from Alice's account to Bob's account. Simplifying outrageously, the SQL commands for this might look like: <placeholder-1/>
ru: Например, рассмотрим базу данных банка, в которой содержится информация о счетах клиентов, а также общие суммы по отделениям банка. Предположим, что мы хотим перевести 100 долларов со счёта Алисы на счёт Боба. Простоты ради, соответствующие SQL-команды можно записать так: <placeholder-1/>

source: The details of these commands are not important here; the important point is that there are several separate updates involved to accomplish this rather simple operation. Our bank's officers will want to be assured that either all these updates happen, or none of them happen. It would certainly not do for a system failure to result in Bob receiving $100.00 that was not debited from Alice. Nor would Alice long remain a happy customer if she was debited without Bob being credited. We need a guarantee that if something goes wrong partway through the operation, none of the steps executed so far will take effect. Grouping the updates into a <firstterm>transaction</firstterm> gives us this guarantee. A transaction is said to be <firstterm>atomic</firstterm>: from the point of view of other transactions, it either happens completely or not at all.
ru: Точное содержание команд здесь не важно, важно лишь то, что для выполнения этой довольно простой операции потребовалось несколько отдельных действий. При этом с точки зрения банка необходимо, чтобы все эти действия выполнились вместе, либо не выполнились совсем. Если Боб получит 100 долларов, но они не будут списаны со счёта Алисы, объяснить это сбоем системы определённо не удастся. И наоборот, Алиса вряд ли будет довольна, если она переведёт деньги, а до Боба они не дойдут. Нам нужна гарантия, что если что-то помешает выполнить операцию до конца, ни одно из действий не оставит следа в базе данных. И мы получаем эту гарантию, объединяя действия в одну <firstterm>транзакцию</firstterm>. Говорят, что транзакция <firstterm>атомарна</firstterm>: с точки зрения других транзакций она либо выполняется и фиксируется полностью, либо не фиксируется совсем.

source: We also want a guarantee that once a transaction is completed and acknowledged by the database system, it has indeed been permanently recorded and won't be lost even if a crash ensues shortly thereafter. For example, if we are recording a cash withdrawal by Bob, we do not want any chance that the debit to his account will disappear in a crash just after he walks out the bank door. A transactional database guarantees that all the updates made by a transaction are logged in permanent storage (i.e., on disk) before the transaction is reported complete.
ru: Нам также нужна гарантия, что после завершения и подтверждения транзакции системой баз данных, её результаты в самом деле сохраняются и не будут потеряны, даже если вскоре произойдёт авария. Например, если мы списали сумму и выдали её Бобу, мы должны исключить возможность того, что сумма на его счёте восстановится, как только он выйдет за двери банка. Транзакционная база данных гарантирует, что все изменения записываются в постоянное хранилище (например, на диск) до того, как транзакция будет считаться завершённой.

source: Another important property of transactional databases is closely related to the notion of atomic updates: when multiple transactions are running concurrently, each one should not be able to see the incomplete changes made by others. For example, if one transaction is busy totalling all the branch balances, it would not do for it to include the debit from Alice's branch but not the credit to Bob's branch, nor vice versa. So transactions must be all-or-nothing not only in terms of their permanent effect on the database, but also in terms of their visibility as they happen. The updates made so far by an open transaction are invisible to other transactions until the transaction completes, whereupon all the updates become visible simultaneously.
ru: Другая важная характеристика транзакционных баз данных тесно связана с атомарностью изменений: когда одновременно выполняется множество транзакций, каждая из них не видит незавершённые изменения, произведённые другими. Например, если одна транзакция подсчитывает баланс по отделениям, будет неправильно, если она посчитает расход в отделении Алисы, но не учтёт приход в отделении Боба, или наоборот. Поэтому свойство транзакций "всё или ничего" должно определять не только, как изменения сохраняются в базе данных, но и как они видны в процессе работы. Изменения, производимые открытой транзакцией, невидимы для других транзакций, пока она не будет завершена, а затем они становятся видны все сразу.

source: BEGIN; UPDATE accounts SET balance = balance - 100.00 WHERE name = 'Alice'; -- etc etc COMMIT;
ru: BEGIN; UPDATE accounts SET balance = balance - 100.00 WHERE name = 'Alice'; -- ... COMMIT;

source: In <productname>PostgreSQL</productname>, a transaction is set up by surrounding the SQL commands of the transaction with <command>BEGIN</command> and <command>COMMIT</command> commands. So our banking transaction would actually look like: <placeholder-1/>
ru: В <productname>PostgreSQL</productname> транзакция определяется набором SQL-команд, окружённым командами <command>BEGIN</command> и <command>COMMIT</command>. Таким образом, наша банковская транзакция должна была бы выглядеть так: <placeholder-1/>

source: If, partway through the transaction, we decide we do not want to commit (perhaps we just noticed that Alice's balance went negative), we can issue the command <command>ROLLBACK</command> instead of <command>COMMIT</command>, and all our updates so far will be canceled.
ru: Если в процессе выполнения транзакции мы решим, что не хотим фиксировать её изменения (например, потому что оказалось, что баланс Алисы стал отрицательным), мы можем выполнить команду <command>ROLLBACK</command> вместо <command>COMMIT</command>, и все наши изменения будут отменены.

source: <productname>PostgreSQL</productname> actually treats every SQL statement as being executed within a transaction. If you do not issue a <command>BEGIN</command> command, then each individual statement has an implicit <command>BEGIN</command> and (if successful) <command>COMMIT</command> wrapped around it. A group of statements surrounded by <command>BEGIN</command> and <command>COMMIT</command> is sometimes called a <firstterm>transaction block</firstterm>.
ru: <productname>PostgreSQL</productname> на самом деле отрабатывает каждый SQL-оператор как транзакцию. Если вы не вставите команду <command>BEGIN</command>, то каждый отдельный оператор будет неявно окружён командами <command>BEGIN</command> и <command>COMMIT</command> (в случае успешного завершения). Группу операторов, окружённых командами <command>BEGIN</command> и <command>COMMIT</command> иногда называют <firstterm>блоком транзакции</firstterm>.

source: Some client libraries issue <command>BEGIN</command> and <command>COMMIT</command> commands automatically, so that you might get the effect of transaction blocks without asking. Check the documentation for the interface you are using.
ru: Некоторые клиентские библиотеки добавляют команды <command>BEGIN</command> и <command>COMMIT</command> автоматически и неявно создают за вас блоки транзакций. Подробнее об этом вы можете узнать в документации интересующего вас интерфейса.

source: It's possible to control the statements in a transaction in a more granular fashion through the use of <firstterm>savepoints</firstterm>. Savepoints allow you to selectively discard parts of the transaction, while committing the rest. After defining a savepoint with <command>SAVEPOINT</command>, you can if needed roll back to the savepoint with <command>ROLLBACK TO</command>. All the transaction's database changes between defining the savepoint and rolling back to it are discarded, but changes earlier than the savepoint are kept.
ru: Операторами в транзакции можно также управлять на более детальном уровне, используя <firstterm>точки сохранения</firstterm>. Точки сохранения позволяют выборочно отменять некоторые части транзакции и фиксировать все остальные. Определив точку сохранения с помощью <command>SAVEPOINT</command>, при необходимости вы можете вернуться к ней с помощью команды <command>ROLLBACK TO</command>. Все изменения в базе данных, произошедшие после точки сохранения и до момента отката, отменяются, но изменения, произведённые ранее, сохраняются.

source: After rolling back to a savepoint, it continues to be defined, so you can roll back to it several times. Conversely, if you are sure you won't need to roll back to a particular savepoint again, it can be released, so the system can free some resources. Keep in mind that either releasing or rolling back to a savepoint will automatically release all savepoints that were defined after it.
ru: Когда вы возвращаетесь к точке сохранения, она продолжает существовать, так что вы можете откатываться к ней несколько раз. С другой стороны, если вы уверены, что вам не придётся откатываться к определённой точке сохранения, её можно удалить, чтобы система высвободила ресурсы. Помните, что при удалении или откате к точке сохранения все точки сохранения, определённые после неё, автоматически уничтожаются.

source: All this is happening within the transaction block, so none of it is visible to other database sessions. When and if you commit the transaction block, the committed actions become visible as a unit to other sessions, while the rolled-back actions never become visible at all.
ru: Всё это происходит в блоке транзакции, так что в других сеансах работы с базой данных этого не видно. Совершённые действия становятся видны для других сеансов все сразу, только когда вы фиксируете транзакцию, а отменённые действия не видны вообще никогда.

source: BEGIN; UPDATE accounts SET balance = balance - 100.00 WHERE name = 'Alice'; SAVEPOINT my_savepoint; UPDATE accounts SET balance = balance + 100.00 WHERE name = 'Bob'; -- oops ... forget that and use Wally's account ROLLBACK TO my_savepoint; UPDATE accounts SET balance = balance + 100.00 WHERE name = 'Wally'; COMMIT;
ru: BEGIN; UPDATE accounts SET balance = balance - 100.00 WHERE name = 'Alice'; SAVEPOINT my_savepoint; UPDATE accounts SET balance = balance + 100.00 WHERE name = 'Bob'; -- ошибочное действие... забыть его и использовать счёт Уолли ROLLBACK TO my_savepoint; UPDATE accounts SET balance = balance + 100.00 WHERE name = 'Wally'; COMMIT;

source: Remembering the bank database, suppose we debit $100.00 from Alice's account, and credit Bob's account, only to find later that we should have credited Wally's account. We could do it using savepoints like this: <placeholder-1/>
ru: Вернувшись к банковской базе данных, предположим, что мы списываем 100 долларов со счёта Алисы, добавляем их на счёт Боба, и вдруг оказывается, что деньги нужно было перевести Уолли. В данном случае мы можем применить точки сохранения: <placeholder-1/>

source: This example is, of course, oversimplified, but there's a lot of control possible in a transaction block through the use of savepoints. Moreover, <command>ROLLBACK TO</command> is the only way to regain control of a transaction block that was put in aborted state by the system due to an error, short of rolling it back completely and starting again.
ru: Этот пример, конечно, несколько надуман, но он показывает, как можно управлять выполнением команд в блоке транзакций, используя точки сохранения. Более того, <command>ROLLBACK TO</command> &mdash; это единственный способ вернуть контроль над блоком транзакций, оказавшимся в прерванном состоянии из-за ошибки системы, не считая возможности полностью отменить её и начать снова.

source: Window Functions
ru: Оконные функции

source: <primary>window function</primary>
ru: <primary>оконная функция</primary>

source: A <firstterm>window function</firstterm> performs a calculation across a set of table rows that are somehow related to the current row. This is comparable to the type of calculation that can be done with an aggregate function. But unlike regular aggregate functions, use of a window function does not cause rows to become grouped into a single output row &mdash; the rows retain their separate identities. Behind the scenes, the window function is able to access more than just the current row of the query result.
ru: <firstterm>Оконная функция</firstterm> выполняет вычисления для набора строк, некоторым образом связанных с текущей строкой. Можно сравнить её с агрегатной функцией, но, в отличие от обычной агрегатной функции, при использовании оконной функции несколько строк не группируются в одну, а продолжают существовать отдельно. Внутри же, оконная функция, как и агрегатная, может обращаться не только к текущей строке результата запроса.

source: Here is an example that shows how to compare each employee's salary with the average salary in his or her department: <placeholder-1/> <screen> depname | empno | salary | avg -----------+-------+--------+----------------------- develop | 11 | 5200 | 5020.0000000000000000 develop | 7 | 4200 | 5020.0000000000000000 develop | 9 | 4500 | 5020.0000000000000000 develop | 8 | 6000 | 5020.0000000000000000 develop | 10 | 5200 | 5020.0000000000000000 personnel | 5 | 3500 | 3700.0000000000000000 personnel | 2 | 3900 | 3700.0000000000000000 sales | 3 | 4800 | 4866.6666666666666667 sales | 1 | 5000 | 4866.6666666666666667 sales | 4 | 4800 | 4866.6666666666666667 (10 rows)</screen> The first three output columns come directly from the table <structname>empsalary</structname>, and there is one output row for each row in the table. The fourth column represents an average taken across all the table rows that have the same <structfield>depname</structfield> value as the current row. (This actually is the same function as the regular <function>avg</function> aggregate function, but the <literal>OVER</literal> clause causes it to be treated as a window function and computed across an appropriate set of rows.)
ru: Вот пример, показывающий, как сравнить зарплату каждого сотрудника со средней зарплатой его отдела: <placeholder-1/> <screen> depname | empno | salary | avg -----------+-------+--------+----------------------- develop | 11 | 5200 | 5020.0000000000000000 develop | 7 | 4200 | 5020.0000000000000000 develop | 9 | 4500 | 5020.0000000000000000 develop | 8 | 6000 | 5020.0000000000000000 develop | 10 | 5200 | 5020.0000000000000000 personnel | 5 | 3500 | 3700.0000000000000000 personnel | 2 | 3900 | 3700.0000000000000000 sales | 3 | 4800 | 4866.6666666666666667 sales | 1 | 5000 | 4866.6666666666666667 sales | 4 | 4800 | 4866.6666666666666667 (10 rows)</screen> Первые три столбца извлекаются непосредственно из таблицы <structname>empsalary</structname>, при этом для каждой строки таблицы есть строка результата. В четвёртом столбце оказалось среднее значение, вычисленное по всем строкам, имеющим то же значение <structfield>depname</structfield>, что и текущая строка. (Фактически среднее вычисляет та же функция <function>avg</function>, которую мы знаем как агрегатную, но предложение <literal>OVER</literal> превращает её в оконную, так что она обрабатывает лишь заданный набор строк.)
