Repository: pluzanov/pg-doc-ru
Catalog: 9.6/arch-dev.po
Languages: ru

source: Overview of PostgreSQL Internals
ru: Обзор внутреннего устройства PostgreSQL

source: Author
ru: Автор

source: This chapter originated as part of <xref linkend="sim98"/>, Stefan Simkovics' Master's Thesis prepared at Vienna University of Technology under the direction of O.Univ.Prof.Dr. Georg Gottlob and Univ.Ass. Mag. Katrin Seyr.
ru: Основой этой главы послужил материал дипломной работы <xref linkend="sim98"/>, написанной Стефаном Симковичем (Stefan Simkovics) в Венском техническом университете под руководством профессора Георга Готлоба (Georg Gottlob) и его ассистентки Катрин Сейр (Katrin Seyr).

source: This chapter gives an overview of the internal structure of the backend of <productname>PostgreSQL</productname>. After having read the following sections you should have an idea of how a query is processed. This chapter does not aim to provide a detailed description of the internal operation of <productname>PostgreSQL</productname>, as such a document would be very extensive. Rather, this chapter is intended to help the reader understand the general sequence of operations that occur within the backend from the point at which a query is received, to the point at which the results are returned to the client.
ru: В этой главе даётся обзор внутренней организации сервера <productname>PostgreSQL</productname>. Прочитав следующие разделы, вы получите представление о том, как обрабатывается запрос. Здесь мы не стремились подробно описывать внутренние операции <productname>PostgreSQL</productname>, так как это заняло бы слишком большой объём. Основная цель этой главы другая — помочь читателю понять общую последовательность действий, выполняемых сервером с момента получения запроса до момента выдачи результатов клиенту.

source: The Path of a Query
ru: Путь запроса

source: Here we give a short overview of the stages a query has to pass in order to obtain a result.
ru: Ниже мы кратко опишем этапы, которые проходит запрос для получения результата.

source: A connection from an application program to the <productname>PostgreSQL</productname> server has to be established. The application program transmits a query to the server and waits to receive the results sent back by the server.
ru: Прикладная программа устанавливает подключение к серверу <productname>PostgreSQL</productname>. Эта программа передаёт запрос на сервер и ждёт от него результатов.

source: The <firstterm>parser stage</firstterm> checks the query transmitted by the application program for correct syntax and creates a <firstterm>query tree</firstterm>.
ru: На <firstterm>этапе разбора запроса</firstterm> сервер выполняет синтаксическую проверку запроса, переданного прикладной программой, и создаёт <firstterm>дерево запроса</firstterm>.

source: The <firstterm>rewrite system</firstterm> takes the query tree created by the parser stage and looks for any <firstterm>rules</firstterm> (stored in the <firstterm>system catalogs</firstterm>) to apply to the query tree. It performs the transformations given in the <firstterm>rule bodies</firstterm>.
ru: <firstterm>Система правил</firstterm> принимает дерево запроса, созданное на стадии разбора, и ищет в <firstterm>системных каталогах</firstterm> <firstterm>правила</firstterm> для применения к этому дереву. Обнаружив подходящие правила, она выполняет преобразования, заданные в <firstterm>теле правил</firstterm>.

source: One application of the rewrite system is in the realization of <firstterm>views</firstterm>. Whenever a query against a view (i.e., a <firstterm>virtual table</firstterm>) is made, the rewrite system rewrites the user's query to a query that accesses the <firstterm>base tables</firstterm> given in the <firstterm>view definition</firstterm> instead.
ru: Одно из применений системы правил заключается в реализации <firstterm>представлений</firstterm>. Когда выполняется запрос к представлению (т. е. <firstterm>виртуальной таблице</firstterm>), система правил преобразует запрос пользователя в запрос, обращающийся не к представлению, а к <firstterm>базовым таблицам</firstterm> из <firstterm>определения представления</firstterm>.

source: The <firstterm>planner/optimizer</firstterm> takes the (rewritten) query tree and creates a <firstterm>query plan</firstterm> that will be the input to the <firstterm>executor</firstterm>.
ru: <firstterm>Планировщик/оптимизатор</firstterm> принимает дерево запроса (возможно, переписанное) и создаёт <firstterm>план запроса</firstterm>, который будет передан <firstterm>исполнителю</firstterm>.

source: It does so by first creating all possible <firstterm>paths</firstterm> leading to the same result. For example if there is an index on a relation to be scanned, there are two paths for the scan. One possibility is a simple sequential scan and the other possibility is to use the index. Next the cost for the execution of each path is estimated and the cheapest path is chosen. The cheapest path is expanded into a complete plan that the executor can use.
ru: Он выбирает план, сначала рассматривая все возможные варианты получения одного и того же результата. Например, если для обрабатываемого отношения создан индекс, прочитать отношение можно двумя способами. Во-первых, можно выполнить простое последовательное сканирование, а во-вторых, можно использовать индекс. Затем оценивается стоимость каждого варианта и выбирается самый дешёвый. Затем выбранный вариант разворачивается в полноценный план, который сможет использовать исполнитель.

source: The executor recursively steps through the <firstterm>plan tree</firstterm> and retrieves rows in the way represented by the plan. The executor makes use of the <firstterm>storage system</firstterm> while scanning relations, performs <firstterm>sorts</firstterm> and <firstterm>joins</firstterm>, evaluates <firstterm>qualifications</firstterm> and finally hands back the rows derived.
ru: Исполнитель рекурсивно проходит по <firstterm>дереву плана</firstterm> и получает строки тем способом, который указан в плане. Он сканирует отношения, обращаясь к <firstterm>системе хранения</firstterm>, выполняет <firstterm>сортировку</firstterm> и <firstterm>соединения</firstterm>, вычисляет <firstterm>условия фильтра</firstterm> и, наконец, возвращает полученные строки.

source: In the following sections we will cover each of the above listed items in more detail to give a better understanding of <productname>PostgreSQL</productname>'s internal control and data structures.
ru: В следующих разделах мы более подробно рассмотрим каждый из этих этапов, чтобы дать представление о внутренних механизмах и структурах данных <productname>PostgreSQL</productname>.

source: How Connections are Established
ru: Как устанавливаются соединения

source: <productname>PostgreSQL</productname> is implemented using a simple <quote>process per user</quote> client/server model. In this model there is one <firstterm>client process</firstterm> connected to exactly one <firstterm>server process</firstterm>. As we do not know ahead of time how many connections will be made, we have to use a <firstterm>master process</firstterm> that spawns a new server process every time a connection is requested. This master process is called <literal>postgres</literal> and listens at a specified TCP/IP port for incoming connections. Whenever a request for a connection is detected the <literal>postgres</literal> process spawns a new server process. The server tasks communicate with each other using <firstterm>semaphores</firstterm> and <firstterm>shared memory</firstterm> to ensure data integrity throughout concurrent data access.
ru: <productname>PostgreSQL</productname> реализует простую клиент-серверную модель по схеме <quote>процесс для пользователя</quote>. В такой схеме один <firstterm>клиентский процесс</firstterm> подключается к одному отдельному <firstterm>серверному процессу</firstterm>. Так как мы не знаем заранее, сколько подключений будет, нам нужен <firstterm>главный процесс</firstterm>, который будет запускать новый процесс при каждом запросе подключения. Главный процесс называется <literal>postgres</literal> и принимает входящие подключения в заданном порту TCP/IP. Получив запрос на подключение, процесс <literal>postgres</literal> порождает новый серверный процесс. Серверные задачи взаимодействуют между собой через <firstterm>семафоры</firstterm> и <firstterm>разделяемую память</firstterm>, чтобы обеспечить целостность данных при одновременном обращении к ним.

source: The client process can be any program that understands the <productname>PostgreSQL</productname> protocol described in <xref linkend="protocol"/>. Many clients are based on the C-language library <application>libpq</application>, but several independent implementations of the protocol exist, such as the Java <application>JDBC</application> driver.
ru: Клиентским процессом может быть любая программа, которая понимает протокол <productname>PostgreSQL</productname>, описанный в <xref remap="6" linkend="protocol"/>. Многие клиенты базируются на библиотеке <application>libpq</application> для языка C, но есть и другие независимые реализации этого протокола, например, драйвер <application>JDBC</application> для Java.

source: Once a connection is established the client process can send a query to the <firstterm>backend</firstterm> (server). The query is transmitted using plain text, i.e., there is no parsing done in the <firstterm>frontend</firstterm> (client). The server parses the query, creates an <firstterm>execution plan</firstterm>, executes the plan and returns the retrieved rows to the client by transmitting them over the established connection.
ru: Установив подключение, клиентский процесс может передать запрос серверу. Запрос передаётся в обычном текстовом виде, клиент не занимается его анализом. Сервер разбирает запрос, строит <firstterm>план выполнения</firstterm>, выполняет его и возвращает полученные строки клиенту, передавая их через установленное подключение.

source: The Parser Stage
ru: Этап разбора

source: The <firstterm>parser</firstterm> defined in <filename>gram.y</filename> and <filename>scan.l</filename> is built using the Unix tools <application>bison</application> and <application>flex</application>.
ru: <firstterm>Разбор</firstterm>, алгоритм которого описан в <filename>gram.y</filename> и <filename>scan.l</filename>, а программный код генерируется инструментами Unix <application>bison</application> и <application>flex</application>.

source: The <firstterm>transformation process</firstterm> does modifications and augmentations to the data structures returned by the parser.
ru: <firstterm>Преобразование</firstterm>, в процессе которого модифицируются и дополняются структуры данных, полученные после разбора запроса.

source: The <firstterm>parser stage</firstterm> consists of two parts: <placeholder-1/>
ru: <firstterm>Этап разбора</firstterm> разделяется на две части: <placeholder-1/>

source: Parser
ru: Разбор

source: The parser has to check the query string (which arrives as plain text) for valid syntax. If the syntax is correct a <firstterm>parse tree</firstterm> is built up and handed back; otherwise an error is returned. The parser and lexer are implemented using the well-known Unix tools <application>bison</application> and <application>flex</application>.
ru: При разборе проверяется сначала синтаксис строки запроса (поступающей в виде неструктурированного текста). Если он правильный, строится <firstterm>дерево запроса</firstterm> и передаётся дальше, в противном случае возвращается ошибка. Лексический и синтаксический анализ реализован с применением хорошо известных средств Unix <application>bison</application> и <application>flex</application>.

source: The <firstterm>lexer</firstterm> is defined in the file <filename>scan.l</filename> and is responsible for recognizing <firstterm>identifiers</firstterm>, the <firstterm>SQL key words</firstterm> etc. For every key word or identifier that is found, a <firstterm>token</firstterm> is generated and handed to the parser.
ru: <firstterm>Лексическая структура</firstterm> определяется в файле <filename>scan.l</filename> и описывает <firstterm>идентификаторы</firstterm>, <firstterm>ключевые слова SQL</firstterm> и т. д. Для каждого найденного ключевого слова или идентификатора генерируется <firstterm>символ языка</firstterm>, который затем передаётся синтаксическому анализатору.

source: The parser is defined in the file <filename>gram.y</filename> and consists of a set of <firstterm>grammar rules</firstterm> and <firstterm>actions</firstterm> that are executed whenever a rule is fired. The code of the actions (which is actually C code) is used to build up the parse tree.
ru: Синтаксис языка определён в файле <filename>gram.y</filename> в виде набора <firstterm>грамматических правил</firstterm> и <firstterm>действий</firstterm>, которые должны выполняться при срабатывании правил. Для построения дерева разбора используется код действий (это действительно код на C).

source: The mentioned transformations and compilations are normally done automatically using the <firstterm>makefiles</firstterm> shipped with the <productname>PostgreSQL</productname> source distribution.
ru: Упомянутые преобразования и компиляция обычно производятся автоматически сборочными файлами <firstterm>Makefile</firstterm>, поставляемыми в составе дистрибутива <productname>PostgreSQL</productname>.

source: The file <filename>scan.l</filename> is transformed to the C source file <filename>scan.c</filename> using the program <application>flex</application> and <filename>gram.y</filename> is transformed to <filename>gram.c</filename> using <application>bison</application>. After these transformations have taken place a normal C compiler can be used to create the parser. Never make any changes to the generated C files as they will be overwritten the next time <application>flex</application> or <application>bison</application> is called. <placeholder-1/>
ru: Файл <filename>scan.l</filename> преобразуется в программу на C <filename>scan.c</filename> с помощью <application>flex</application>, а <filename>gram.y</filename> — в <filename>gram.c</filename> с помощью <application>bison</application>. После этих преобразований исполняемый код анализатора создаётся обычным компилятором C. Никогда не вносите коррективы в сгенерированные файлы C, так как они будут перезаписаны при следующем вызове <application>flex</application> или <application>bison</application>. <placeholder-1/>

source: A detailed description of <application>bison</application> or the grammar rules given in <filename>gram.y</filename> would be beyond the scope of this paper. There are many books and documents dealing with <application>flex</application> and <application>bison</application>. You should be familiar with <application>bison</application> before you start to study the grammar given in <filename>gram.y</filename> otherwise you won't understand what happens there.
ru: Подробное описание <application>bison</application> и грамматических правил в <filename>gram.y</filename> выходит за рамки данной главы. Узнать больше о <application>flex</application> и <application>bison</application> можно из книг и документации. Изучение грамматики, описанной в <filename>gram.y</filename>, следует начать со знакомства с <application>bison</application>, иначе будет трудно понять, что там происходит.

source: Transformation Process
ru: Преобразование

source: The parser stage creates a parse tree using only fixed rules about the syntactic structure of SQL. It does not make any lookups in the system catalogs, so there is no possibility to understand the detailed semantics of the requested operations. After the parser completes, the <firstterm>transformation process</firstterm> takes the tree handed back by the parser as input and does the semantic interpretation needed to understand which tables, functions, and operators are referenced by the query. The data structure that is built to represent this information is called the <firstterm>query tree</firstterm>.
ru: На этой стадии дерево разбора создаётся только с фиксированными знаниями о синтаксической структуре SQL. При его создании не просматриваются системные каталоги, что не даёт возможность понять конкретную семантику запрошенной операции. После этого выполняется <firstterm>процедура преобразования</firstterm>, которая принимает дерево разбора от анализатора и выполняет семантический анализ, необходимый для понимания, к каким именно таблицам, функциям и операторам обращается запрос. Структура данных, которая создаётся для представления этой информации, называется <firstterm>деревом запроса</firstterm>.

source: The reason for separating raw parsing from semantic analysis is that system catalog lookups can only be done within a transaction, and we do not wish to start a transaction immediately upon receiving a query string. The raw parsing stage is sufficient to identify the transaction control commands (<command>BEGIN</command>, <command>ROLLBACK</command>, etc), and these can then be correctly executed without any further analysis. Once we know that we are dealing with an actual query (such as <command>SELECT</command> or <command>UPDATE</command>), it is okay to start a transaction if we're not already in one. Only then can the transformation process be invoked.
ru: Синтетический разбор отделён от семантического анализа, потому что обращаться к системным каталогам можно только внутри транзакции, а начинать транзакцию сразу после получения строки с запросом нежелательно. Синтетического разбора достаточно, чтобы распознать команды управления транзакциями (<command>BEGIN</command>, <command>ROLLBACK</command> и т. д.), поэтому их можно выполнить без дальнейшего анализа. Убедившись, что мы имеем дело с собственно запросом (например, <command>SELECT</command> или <command>UPDATE</command>), можно начинать транзакцию, если она ещё не начата. Только после этого можно переходить к процедуре преобразования.

source: The query tree created by the transformation process is structurally similar to the raw parse tree in most places, but it has many differences in detail. For example, a <structname>FuncCall</structname> node in the parse tree represents something that looks syntactically like a function call. This might be transformed to either a <structname>FuncExpr</structname> or <structname>Aggref</structname> node depending on whether the referenced name turns out to be an ordinary function or an aggregate function. Also, information about the actual data types of columns and expression results is added to the query tree.
ru: Дерево запроса, создаваемое процедурой преобразования, по структуре во многом похоже на дерево разбора, но отличается во многих деталях. Например, узел <structname>FuncCall</structname> в дереве разбора представляет то, что по синтаксису похоже на вызов функции. Этот узел может быть преобразован в узел <structname>FuncExpr</structname> или <structname>Aggref</structname> в зависимости от того, какой (обычной или агрегатной) окажется функция с заданным именем. Кроме того, в дерево запроса добавляется информация о фактических типах данных столбцов и результатов выражений.

source: The <productname>PostgreSQL</productname> Rule System
ru: Система правил <productname>PostgreSQL</productname>

source: The first one worked using <firstterm>row level</firstterm> processing and was implemented deep in the <firstterm>executor</firstterm>. The rule system was called whenever an individual row had been accessed. This implementation was removed in 1995 when the last official release of the <productname>Berkeley Postgres</productname> project was transformed into <productname>Postgres95</productname>.
ru: Первый вариант производил обработку на <firstterm>уровне строк</firstterm> и был внедрён глубоко в <firstterm>исполнителе</firstterm>. Этот обработчик правил вызывался при обращении к каждой отдельной строке. Эта реализация была ликвидирована в 1995 г., когда последний официальный выпуск <productname>Berkeley Postgres</productname> превратился в <productname>Postgres95</productname>.

source: The second implementation of the rule system is a technique called <firstterm>query rewriting</firstterm>. The <firstterm>rewrite system</firstterm> is a module that exists between the <firstterm>parser stage</firstterm> and the <firstterm>planner/optimizer</firstterm>. This technique is still implemented.
ru: Во втором воплощении системы правил применили так называемое <firstterm>переписывание запроса</firstterm>. <firstterm>Система переписывания</firstterm> реализована в механизме, внедрённом между <firstterm>анализатором</firstterm> и <firstterm>планировщиком/оптимизатором</firstterm>. Этот механизм работает и сегодня.

source: <productname>PostgreSQL</productname> supports a powerful <firstterm>rule system</firstterm> for the specification of <firstterm>views</firstterm> and ambiguous <firstterm>view updates</firstterm>. Originally the <productname>PostgreSQL</productname> rule system consisted of two implementations: <placeholder-1/>
ru: <productname>PostgreSQL</productname> поддерживает мощную <firstterm>систему правил</firstterm> для создания <firstterm>представлений</firstterm> и возможности <firstterm>изменения представлений</firstterm>. Система правил <productname>PostgreSQL</productname> претерпела две реализации: <placeholder-1/>

source: The query rewriter is discussed in some detail in <xref linkend="rules"/>, so there is no need to cover it here. We will only point out that both the input and the output of the rewriter are query trees, that is, there is no change in the representation or level of semantic detail in the trees. Rewriting can be thought of as a form of macro expansion.
ru: Механизм переписывания запросов подробно обсуждается в <xref remap="6" linkend="rules"/>, так что здесь мы его не рассматриваем. Мы только отметим, что и на входе, и на выходе у него деревья запросов, то есть представление или уровень семантической детализации он не меняет. Переписывание запроса можно считать формой расширения макросов.

source: Planner/Optimizer
ru: Планировщик/оптимизатор

source: The task of the <firstterm>planner/optimizer</firstterm> is to create an optimal execution plan. A given SQL query (and hence, a query tree) can be actually executed in a wide variety of different ways, each of which will produce the same set of results. If it is computationally feasible, the query optimizer will examine each of these possible execution plans, ultimately selecting the execution plan that is expected to run the fastest.
ru: Задача <firstterm>планировщика/оптимизатора</firstterm> — построить наилучший план выполнения. Определённый SQL-запрос (а значит, и дерево запроса) на самом деле можно выполнить самыми разными способами, при этом получая одни и те же результаты. Если это не требует больших вычислений, оптимизатор запросов будет перебирать все возможные варианты планов, чтобы в итоге выбрать тот, который должен выполниться быстрее остальных.
