Repository: pluzanov/pg-doc-ru
Catalog: 9.6/arch-dev.po
Languages: ru

source: In some situations, examining each possible way in which a query can be executed would take an excessive amount of time and memory space. In particular, this occurs when executing queries involving large numbers of join operations. In order to determine a reasonable (not necessarily optimal) query plan in a reasonable amount of time, <productname>PostgreSQL</productname> uses a <firstterm>Genetic Query Optimizer</firstterm> (see <xref linkend="geqo"/>) when the number of joins exceeds a threshold (see <xref linkend="guc-geqo-threshold"/>).
ru: В некоторых ситуациях рассмотрение всех возможных вариантов выполнения запросов занимает слишком много времени и памяти. В частности, это имеет место при выполнении запросов с большим количеством операций соединения. Поэтому, чтобы выбрать разумный (но не обязательно наилучший) план запроса за приемлемое время, <productname>PostgreSQL</productname> использует <firstterm>генетический оптимизатор запросов</firstterm> (см. <xref remap="4" linkend="geqo"/>), когда количество соединений превышает некоторый предел (см. <xref remap="4" linkend="guc-geqo-threshold"/>).

source: The planner's search procedure actually works with data structures called <firstterm>paths</firstterm>, which are simply cut-down representations of plans containing only as much information as the planner needs to make its decisions. After the cheapest path is determined, a full-fledged <firstterm>plan tree</firstterm> is built to pass to the executor. This represents the desired execution plan in sufficient detail for the executor to run it. In the rest of this section we'll ignore the distinction between paths and plans.
ru: Процедура поиска лучшего плана на самом деле работает со структурами данных, называемыми <firstterm>путями</firstterm>, которые представляют собой упрощённые схемы планов, содержащие минимум информации, необходимый планировщику для принятия решений. Когда наиболее выгодный план выбран, строится полноценное <firstterm>дерево плана</firstterm>, которое и передаётся исполнителю. Оно описывает желаемый план выполнения достаточно подробно, чтобы исполнитель мог обработать его. В продолжении этого раздела мы будем считать, что планы и пути по сути одно и то же.

source: Generating Possible Plans
ru: Выработка возможных планов

source: The planner/optimizer starts by generating plans for scanning each individual relation (table) used in the query. The possible plans are determined by the available indexes on each relation. There is always the possibility of performing a sequential scan on a relation, so a sequential scan plan is always created. Assume an index is defined on a relation (for example a B-tree index) and a query contains the restriction <literal>relation.attribute OPR constant</literal>. If <literal>relation.attribute</literal> happens to match the key of the B-tree index and <literal>OPR</literal> is one of the operators listed in the index's <firstterm>operator class</firstterm>, another plan is created using the B-tree index to scan the relation. If there are further indexes present and the restrictions in the query happen to match a key of an index, further plans will be considered. Index scan plans are also generated for indexes that have a sort ordering that can match the query's <literal>ORDER BY</literal> clause (if any), or a sort ordering that might be useful for merge joining (see below).
ru: Сначала планировщик/оптимизатор вырабатывает планы для сканирования каждого отдельного отношения (таблицы), используемого в запросе. Множество возможных планов определяется в зависимости от наличия индексов в каждом отношении. Произвести последовательное сканирование отношения можно в любом случае, так что план последовательного сканирования создаётся всегда. Предположим, что для отношения создан индекс (например, индекс-B-дерево) и запрос содержит ограничение <literal>отношение.атрибут ОПЕР константа</literal>. Если окажется, что <literal>отношение.атрибут</literal> совпадает с ключом индекса-B-дерева и <literal>ОПЕР</literal> — один из операторов, входящих в <firstterm>класс операторов</firstterm> индекса, создаётся ещё один план, c использованием индекса-B-дерева для чтения отношения. Если находятся другие индексы, ключи которых соответствуют ограничениям запроса, могут добавиться и другие планы. Планы сканирования индекса также создаются для индексов, если их порядок сортировки соответствует предложению <literal>ORDER BY</literal> (если оно есть), или этот порядок может быть полезен для соединения слиянием (см. ниже).

source: <firstterm>nested loop join</firstterm>: The right relation is scanned once for every row found in the left relation. This strategy is easy to implement but can be very time consuming. (However, if the right relation can be scanned with an index scan, this can be a good strategy. It is possible to use values from the current row of the left relation as keys for the index scan of the right.)
ru: <firstterm>соединение с вложенным циклом</firstterm>: Правое отношение сканируется один раз для каждой строки, найденной в левом отношении. Эту стратегию легко реализовать, но она может быть очень трудоёмкой. (Однако, если правое отношение можно сканировать по индексу, эта стратегия может быть удачной. Тогда значения из текущей строки левого отношения могут использоваться как ключи для сканирования по индексу справа.)

source: <firstterm>merge join</firstterm>: Each relation is sorted on the join attributes before the join starts. Then the two relations are scanned in parallel, and matching rows are combined to form join rows. This kind of join is more attractive because each relation has to be scanned only once. The required sorting might be achieved either by an explicit sort step, or by scanning the relation in the proper order using an index on the join key.
ru: <firstterm>соединение слиянием</firstterm>: Каждое отношение сортируется по атрибутам соединения до начала соединения. Затем два отношения сканируются параллельно и соответствующие строки, объединяясь, формируют строки соединения. Этот тип соединения более привлекательный, так как каждое отношение сканируется только один раз. Требуемый порядок сортировки можно получить, либо добавив явный этап сортировки, либо просканировав отношение в нужном порядке, используя индекс по ключу соединения.

source: <firstterm>hash join</firstterm>: the right relation is first scanned and loaded into a hash table, using its join attributes as hash keys. Next the left relation is scanned and the appropriate values of every row found are used as hash keys to locate the matching rows in the table.
ru: <firstterm>соединение по хешу</firstterm>: сначала сканируется правое отношение и формируется хеш-таблица, ключ в которой вычисляется по атрибутам соединения. Затем сканируется левое отношение и по тем же атрибутам в каждой строке вычисляется ключ для поиска в этой хеш-таблице соответствующих строк справа.

source: If the query requires joining two or more relations, plans for joining relations are considered after all feasible plans have been found for scanning single relations. The three available join strategies are: <placeholder-1/>
ru: Если в запросе требуется соединить два или несколько отношений, после того, как будут определены все подходящие планы сканирования отдельных отношений, рассматриваются планы соединения. При этом возможны три стратегии соединения: <placeholder-1/>

source: When the query involves more than two relations, the final result must be built up by a tree of join steps, each with two inputs. The planner examines different possible join sequences to find the cheapest one.
ru: Когда в запросе задействованы более двух отношений, окончательный результат должен быть получен из дерева с узлами соединения, имеющими по два входа. Планировщик рассматривает все возможные последовательности соединения и выбирает самую выгодную.

source: If the query uses fewer than <xref linkend="guc-geqo-threshold"/> relations, a near-exhaustive search is conducted to find the best join sequence. The planner preferentially considers joins between any two relations for which there exist a corresponding join clause in the <literal>WHERE</literal> qualification (i.e., for which a restriction like <literal>where rel1.attr1=rel2.attr2</literal> exists). Join pairs with no join clause are considered only when there is no other choice, that is, a particular relation has no available join clauses to any other relation. All possible plans are generated for every join pair considered by the planner, and the one that is (estimated to be) the cheapest is chosen.
ru: Если число задействованных в запросе отношений меньше <xref linkend="guc-geqo-threshold"/>, для поиска оптимальной последовательности соединений производится практически полный перебор. Планировщик отдаёт предпочтение соединениям между двумя отношениями, для которых есть соответствующее предложение соединения в условии <literal>WHERE</literal> (то есть, для которых находится ограничение вида <literal>where табл1.атр1=табл2.атр2</literal>). Пары соединения без подобного предложения рассматриваются, только если нет другого выбора, то есть когда для определённого отношения не находятся предложения соединения с каким-либо другим отношением. Планировщик рассматривает все возможные планы для каждой пары соединения и выбирает самый выгодный из них (по его оценке).

source: When <varname>geqo_threshold</varname> is exceeded, the join sequences considered are determined by heuristics, as described in <xref linkend="geqo"/>. Otherwise the process is the same.
ru: Если <varname>geqo_threshold</varname> превышается, последовательность соединений выбирается эвристическим путём, как описано в <xref remap="6" linkend="geqo"/>. В остальном процесс планирования тот же.

source: The finished plan tree consists of sequential or index scans of the base relations, plus nested-loop, merge, or hash join nodes as needed, plus any auxiliary steps needed, such as sort nodes or aggregate-function calculation nodes. Most of these plan node types have the additional ability to do <firstterm>selection</firstterm> (discarding rows that do not meet a specified Boolean condition) and <firstterm>projection</firstterm> (computation of a derived column set based on given column values, that is, evaluation of scalar expressions where needed). One of the responsibilities of the planner is to attach selection conditions from the <literal>WHERE</literal> clause and computation of required output expressions to the most appropriate nodes of the plan tree.
ru: Законченное дерево плана содержит узлы сканирования по индексу или последовательного сканирования базовых отношений, плюс узлы соединения с вложенным циклом, соединения слиянием или соединения по хешу (если требуется), плюс, возможно, узлы дополнительных действий, например, сортировки или вычисления агрегатных функций. Большинство из этих узлов могут дополнительно производить <firstterm>отбор</firstterm> (отбрасывать строки, не удовлетворяющие заданному логическому условию) и <firstterm>расчёты</firstterm> (вычислять производный набор столбцов по значениям заданных столбцов, то есть вычислять скалярные выражения). Одна из задач планировщика — добавить условия отбора из предложения <literal>WHERE</literal> и вычисления требуемых выходных выражений к наиболее подходящим узлам дерева плана.

source: Executor
ru: Исполнитель

source: The <firstterm>executor</firstterm> takes the plan created by the planner/optimizer and recursively processes it to extract the required set of rows. This is essentially a demand-pull pipeline mechanism. Each time a plan node is called, it must deliver one more row, or report that it is done delivering rows.
ru: <firstterm>Исполнитель</firstterm> принимает план, созданный планировщиком/исполнителем и обрабатывает его рекурсивно, чтобы получить требуемый набор строк. Обработка выполняется по конвейеру, с получением данных по требованию. При вызове любого узла плана он должен выдать очередную строку, либо сообщить, что выдача строк завершена.

source: To provide a concrete example, assume that the top node is a <literal>MergeJoin</literal> node. Before any merge can be done two rows have to be fetched (one from each subplan). So the executor recursively calls itself to process the subplans (it starts with the subplan attached to <literal>lefttree</literal>). The new top node (the top node of the left subplan) is, let's say, a <literal>Sort</literal> node and again recursion is needed to obtain an input row. The child node of the <literal>Sort</literal> might be a <literal>SeqScan</literal> node, representing actual reading of a table. Execution of this node causes the executor to fetch a row from the table and return it up to the calling node. The <literal>Sort</literal> node will repeatedly call its child to obtain all the rows to be sorted. When the input is exhausted (as indicated by the child node returning a NULL instead of a row), the <literal>Sort</literal> code performs the sort, and finally is able to return its first output row, namely the first one in sorted order. It keeps the remaining rows stored so that it can deliver them in sorted order in response to later demands.
ru: В качестве более конкретного примера, давайте предположим, что верхним узлом плана оказался узел <literal>MergeJoin</literal>. Для того чтобы выполнить какое-либо соединение, необходимо выбрать две строки (одну из каждого вложенного плана). Поэтому исполнитель рекурсивно вызывает себя для обработки вложенных планов (он начинает с плана <literal>левого дерева</literal>). Новый верхний узел (верхний узел левого вложенного плана) может быть, например, узлом <literal>Sort</literal>, и тогда для получения входной строки снова требуется рекурсия. Дочерним узлом <literal>Sort</literal> может быть узел <literal>SeqScan</literal>, представляющий собственно чтение таблицы. В результате выполнения этого узла исполнитель выбирает одну строку из таблицы и возвращает её вызывающему узлу. Узел <literal>Sort</literal>, в свою очередь, будет продолжать вызывать дочерний узел, пока не получит все строки для сортировки. Когда строки закончатся (дочерний узел сообщит об этом, возвратив NULL вместо строки), узел <literal>Sort</literal> выполнит сортировку, и наконец сможет выдать свою первую строку, а именно строку первую по порядку сортировки. Остальные строки будут сохраняться в нём, чтобы он мог выдавать их по порядку при последующих вызовах.

source: The <literal>MergeJoin</literal> node similarly demands the first row from its right subplan. Then it compares the two rows to see if they can be joined; if so, it returns a join row to its caller. On the next call, or immediately if it cannot join the current pair of inputs, it advances to the next row of one table or the other (depending on how the comparison came out), and again checks for a match. Eventually, one subplan or the other is exhausted, and the <literal>MergeJoin</literal> node returns NULL to indicate that no more join rows can be formed.
ru: Узел <literal>MergeJoin</literal> подобным образом затребует первую строку и у вложенного плана справа. Затем он сравнивает две строки и определяет, можно ли их соединить; если да, он возвращает соединённую строки вызывающему узлу. При следующем вызове, или немедленно, если он не может соединить текущую пару поступивших строк, он переходит к следующей строке в одном отношении или в другом (в зависимости от результата сравнения) и снова проверяет соответствие. В конце концов, данные в одном или другом вложенном плане заканчиваются и узел <literal>MergeJoin</literal> возвращает NULL, показывая тем самым, что другие строки соединения получить нельзя.

source: Complex queries can involve many levels of plan nodes, but the general approach is the same: each node computes and returns its next output row each time it is called. Each node is also responsible for applying any selection or projection expressions that were assigned to it by the planner.
ru: Сложные запросы могут содержать много уровней вложенности узлов плана, но общий подход тот же: каждый узел вычисляет и возвращает следующую полученную строку при очередном вызове. Каждый узел также должен производить отбор и расчёты, которые были назначены ему планировщиком.

source: The executor mechanism is used to evaluate all four basic SQL query types: <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command>. For <command>SELECT</command>, the top-level executor code only needs to send each row returned by the query plan tree off to the client. For <command>INSERT</command>, each returned row is inserted into the target table specified for the <command>INSERT</command>. This is done in a special top-level plan node called <literal>ModifyTable</literal>. (A simple <command>INSERT ... VALUES</command> command creates a trivial plan tree consisting of a single <literal>Result</literal> node, which computes just one result row, and <literal>ModifyTable</literal> above it to perform the insertion. But <command>INSERT ... SELECT</command> can demand the full power of the executor mechanism.) For <command>UPDATE</command>, the planner arranges that each computed row includes all the updated column values, plus the <firstterm>TID</firstterm> (tuple ID, or row ID) of the original target row; this data is fed into a <literal>ModifyTable</literal> node, which uses the information to create a new updated row and mark the old row deleted. For <command>DELETE</command>, the only column that is actually returned by the plan is the TID, and the <literal>ModifyTable</literal> node simply uses the TID to visit each target row and mark it deleted.
ru: Механизм исполнителя применяется для обработки всех четырёх основных типов SQL-запросов: <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. С <command>SELECT</command> код исполнителя верхнего уровня должен только выдать клиенту все строки, полученные от дерева плана запроса. С <command>INSERT</command> все полученные строки вставляются в целевую таблицу <command>INSERT</command>. Эта операция выполняется в специальном узле на верхнем уровне плана запроса, называемом <literal>ModifyTable</literal>. (Простая команда <command>INSERT ... VALUES</command> создаёт простейшее дерево плана, состоящее из одного узла <literal>Result</literal>, который вычисляет одну строку результата, и узла <literal>ModifyTable</literal> над ним, который осуществляет добавление. Но с <command>INSERT ... SELECT</command> могут быть востребованы все возможности механизма исполнителя.) С <command>UPDATE</command> планировщик делает так, чтобы каждая вычисленная строка включала значения всех изменённых столбцов плюс <firstterm>TID</firstterm> (Tuple ID, идентификатор кортежа) исходной целевой строки; эти данные подаются в узел <literal>ModifyTable</literal>, который использует эту информацию, чтобы создать новую изменённую строку и пометить старую строку как удалённую. С <command>DELETE</command> план фактически возвращает только один столбец, TID, а узел <literal>ModifyTable</literal> использует значение TID, чтобы найти каждую целевую строку и пометить её как удалённую.
