Repository: pluzanov/pg-doc-ru
Catalog: 9.6/array.po
Languages: ru

source: Arrays
ru: Массивы

source: <primary>array</primary>
ru: <primary>массив</primary>

source: <productname>PostgreSQL</productname> allows columns of a table to be defined as variable-length multidimensional arrays. Arrays of any built-in or user-defined base type, enum type, or composite type can be created. Arrays of domains are not yet supported.
ru: <productname>PostgreSQL</productname> позволяет определять столбцы таблицы как многомерные массивы переменной длины. Элементами массивов могут быть любые встроенные или определённые пользователями типы, перечисления или составные типы. Массивы доменов в данный момент не поддерживаются.

source: Declaration of Array Types
ru: Объявления типов массивов

source: <primary>array</primary><secondary>declaration</secondary>
ru: <primary>массив</primary><secondary>объявление</secondary>

source: To illustrate the use of array types, we create this table: <placeholder-1/> As shown, an array data type is named by appending square brackets (<literal>[]</literal>) to the data type name of the array elements. The above command will create a table named <structname>sal_emp</structname> with a column of type <type>text</type> (<structfield>name</structfield>), a one-dimensional array of type <type>integer</type> (<structfield>pay_by_quarter</structfield>), which represents the employee's salary by quarter, and a two-dimensional array of <type>text</type> (<structfield>schedule</structfield>), which represents the employee's weekly schedule.
ru: Чтобы проиллюстрировать использовать массивов, мы создадим такую таблицу: <placeholder-1/> Как показано, для объявления типа массива к названию типа элементов добавляются квадратные скобки (<literal>[]</literal>). Показанная выше команда создаст таблицу <structname>sal_emp</structname> со столбцами типов <type>text</type> (<structfield>name</structfield>), одномерный массив с элементами <type>integer</type> (<structfield>pay_by_quarter</structfield>), представляющий квартальную зарплату работников, и двухмерный массив с элементами <type>text</type> (<structfield>schedule</structfield>), представляющий недельный график работника.

source: The syntax for <command>CREATE TABLE</command> allows the exact size of arrays to be specified, for example: <placeholder-1/> However, the current implementation ignores any supplied array size limits, i.e., the behavior is the same as for arrays of unspecified length.
ru: Команда <command>CREATE TABLE</command> позволяет также указать точный размер массивов, например так: <placeholder-1/> Однако текущая реализация игнорирует все указанные размеры, т. е. фактически размер массива остаётся неопределённым.

source: The current implementation does not enforce the declared number of dimensions either. Arrays of a particular element type are all considered to be of the same type, regardless of size or number of dimensions. So, declaring the array size or number of dimensions in <command>CREATE TABLE</command> is simply documentation; it does not affect run-time behavior.
ru: Текущая реализация также не ограничивает число размерностей. Все элементы массивов считаются одного типа, вне зависимости от его размера и числа размерностей. Поэтому явно указывать число элементов или размерностей в команде <command>CREATE TABLE</command> имеет смысл только для документирования, на механизм работы с массивом это не влияет.

source: An alternative syntax, which conforms to the SQL standard by using the keyword <literal>ARRAY</literal>, can be used for one-dimensional arrays. <structfield>pay_by_quarter</structfield> could have been defined as: <placeholder-1/> Or, if no array size is to be specified: <placeholder-2/> As before, however, <productname>PostgreSQL</productname> does not enforce the size restriction in any case.
ru: Для объявления одномерных массивов можно применять альтернативную запись с ключевым словом <literal>ARRAY</literal>, соответствующую стандарту SQL. Столбец <structfield>pay_by_quarter</structfield> можно было бы определить так: <placeholder-1/> Или без указания размера массива: <placeholder-2/> Заметьте, что и в этом случае <productname>PostgreSQL</productname> не накладывает ограничения на фактический размер массива.

source: Array Value Input
ru: Ввод значения массива

source: <primary>array</primary><secondary>constant</secondary>
ru: <primary>массив</primary><secondary>константа</secondary>

source: To write an array value as a literal constant, enclose the element values within curly braces and separate them by commas. (If you know C, this is not unlike the C syntax for initializing structures.) You can put double quotes around any element value, and must do so if it contains commas or curly braces. (More details appear below.) Thus, the general format of an array constant is the following: <synopsis>'{ <replaceable>val1</replaceable> <replaceable>delim</replaceable> <replaceable>val2</replaceable> <replaceable>delim</replaceable> ... }'</synopsis> where <replaceable>delim</replaceable> is the delimiter character for the type, as recorded in its <literal>pg_type</literal> entry. Among the standard data types provided in the <productname>PostgreSQL</productname> distribution, all use a comma (<literal>,</literal>), except for type <type>box</type> which uses a semicolon (<literal>;</literal>). Each <replaceable>val</replaceable> is either a constant of the array element type, or a subarray. An example of an array constant is: <placeholder-1/> This constant is a two-dimensional, 3-by-3 array consisting of three subarrays of integers.
ru: Чтобы записать значение массива в виде буквальной константы, заключите значения элементов в фигурные скобки и разделите их запятыми. (Если вам знаком C, вы найдёте, что это похоже на синтаксис инициализации структур в C.) Вы можете заключить значение любого элемента в двойные кавычки, а если он содержит запятые или фигурные скобки, это обязательно нужно сделать. (Подробнее это описано ниже.) Таким образом, общий формат константы массива выглядит так: <synopsis>'{ <replaceable>значение1</replaceable> <replaceable>разделитель</replaceable> <replaceable>значение2</replaceable> <replaceable>разделитель</replaceable> ... }'</synopsis> где <replaceable>разделитель</replaceable> &mdash; символ, указанный в качестве разделителя в соответствующей записи в таблице <literal>pg_type</literal>. Для стандартных типов данных, существующих в дистрибутиве <productname>PostgreSQL</productname>, разделителем является запятая (<literal>,</literal>), за исключением лишь типа <type>box</type>, в котором разделитель &mdash;точка с запятой (<literal>;</literal>). Каждое <replaceable>значение</replaceable> здесь &mdash; это либо константа типа элемента массива, либо вложенный массив. Например, константа массива может быть такой: <placeholder-1/> Эта константа определяет двухмерный массив 3x3, состоящий из трёх вложенных массивов целых чисел.

source: To set an element of an array constant to NULL, write <literal>NULL</literal> for the element value. (Any upper- or lower-case variant of <literal>NULL</literal> will do.) If you want an actual string value <quote>NULL</quote>, you must put double quotes around it.
ru: Чтобы присвоить элементу массива значение NULL, достаточно просто написать <literal>NULL</literal> (регистр символов при этом не имеет значения). Если же требуется добавить в массив строку, содержащую <quote>NULL</quote>, это слово нужно заключить в двойные кавычки.

source: (These kinds of array constants are actually only a special case of the generic type constants discussed in <xref linkend="sql-syntax-constants-generic"/>. The constant is initially treated as a string and passed to the array input conversion routine. An explicit type specification might be necessary.)
ru: (Такого рода константы массивов на самом деле представляют собой всего лишь частный случай констант, описанных в <xref remap="6" linkend="sql-syntax-constants-generic"/>. Константа изначально воспринимается как строка и передаётся процедуре преобразования вводимого массива. При этом может потребоваться явно указать целевой тип.)

source: Now we can show some <command>INSERT</command> statements: <placeholder-1/>
ru: Теперь мы можем показать несколько операторов <command>INSERT</command>: <placeholder-1/>

source: The result of the previous two inserts looks like this: <placeholder-1/>
ru: Результат двух предыдущих команд: <placeholder-1/>

source: INSERT INTO sal_emp VALUES ('Bill', '{10000, 10000, 10000, 10000}', '{{"meeting", "lunch"}, {"meeting"}}'); ERROR: multidimensional arrays must have array expressions with matching dimensions
ru: INSERT INTO sal_emp VALUES ('Bill', '{10000, 10000, 10000, 10000}', '{{"meeting", "lunch"}, {"meeting"}}'); ОШИБКА: для многомерных массивов должны задаваться выражения с соответствующими размерностями

source: Multidimensional arrays must have matching extents for each dimension. A mismatch causes an error, for example: <placeholder-1/>
ru: В многомерных массивов число элементов в каждой размерности должно быть одинаковым; в противном случае возникает ошибка. Например: <placeholder-1/>

source: The <literal>ARRAY</literal> constructor syntax can also be used: <placeholder-1/> Notice that the array elements are ordinary SQL constants or expressions; for instance, string literals are single quoted, instead of double quoted as they would be in an array literal. The <literal>ARRAY</literal> constructor syntax is discussed in more detail in <xref linkend="sql-syntax-array-constructors"/>.
ru: Также можно использовать синтаксис конструктора <literal>ARRAY</literal>: <placeholder-1/> Заметьте, что элементы массива здесь &mdash; это простые SQL-константы или выражения; и поэтому, например строки будут заключаться в одинарные апострофы, а не в двойные, как в буквальной константе массива. Более подробно конструктор <literal>ARRAY</literal> обсуждается в <xref remap="6" linkend="sql-syntax-array-constructors"/>.

source: Accessing Arrays
ru: Обращение к массивам

source: <primary>array</primary><secondary>accessing</secondary>
ru: <primary>массив</primary><secondary>обращение</secondary>

source: Now, we can run some queries on the table. First, we show how to access a single element of an array. This query retrieves the names of the employees whose pay changed in the second quarter: <placeholder-1/> The array subscript numbers are written within square brackets. By default <productname>PostgreSQL</productname> uses a one-based numbering convention for arrays, that is, an array of <replaceable>n</replaceable> elements starts with <literal>array[1]</literal> and ends with <literal>array[<replaceable>n</replaceable>]</literal>.
ru: Добавив данные в таблицу, мы можем перейти к выборкам. Сначала мы покажем, как получить один элемент массива. Этот запрос получает имена сотрудников, зарплата которых изменилась во втором квартале: <placeholder-1/> Индексы элементов массива записываются в квадратных скобках. По умолчанию в <productname>PostgreSQL</productname> действует соглашение о нумерации элементов массива с 1, то есть в массиве из <replaceable>n</replaceable> элементов первым считается <literal>array[1]</literal>, а последним &mdash; <literal>array[<replaceable>n</replaceable>]</literal>.

source: This query retrieves the third quarter pay of all employees: <placeholder-1/>
ru: Этот запрос выдаёт зарплату всех сотрудников в третьем квартале: <placeholder-1/>

source: We can also access arbitrary rectangular slices of an array, or subarrays. An array slice is denoted by writing <literal><replaceable>lower-bound</replaceable>:<replaceable>upper-bound</replaceable></literal> for one or more array dimensions. For example, this query retrieves the first item on Bill's schedule for the first two days of the week: <placeholder-1/> If any dimension is written as a slice, i.e., contains a colon, then all dimensions are treated as slices. Any dimension that has only a single number (no colon) is treated as being from 1 to the number specified. For example, <literal>[2]</literal> is treated as <literal>[1:2]</literal>, as in this example: <placeholder-2/> To avoid confusion with the non-slice case, it's best to use slice syntax for all dimensions, e.g., <literal>[1:2][1:1]</literal>, not <literal>[2][1:1]</literal>.
ru: Мы также можем получать обычные прямоугольные срезы массива, то есть подмассивы. Срез массива обозначается как <literal><replaceable>нижняя-граница</replaceable>:<replaceable>верхняя-граница</replaceable></literal> для одной или нескольких размерностей. Например, этот запрос получает первые пункты в графике Билла в первые два дня недели: <placeholder-1/> Если одна из размерностей записана в виде среза, то есть содержит двоеточие, тогда срез распространяется на все размерности. Если при этом для размерности указывается только одно число (без двоеточия), в срез войдут элемент от 1 до заданного номера. Например, в этом примере <literal>[2]</literal> будет равнозначно <literal>[1:2]</literal>: <placeholder-2/> Во избежание путаницы с обращением к одному элементу, срезы лучше всегда записывать явно для всех измерений, например <literal>[1:2][1:1]</literal> вместо <literal>[2][1:1]</literal>.

source: An array subscript expression will return null if either the array itself or any of the subscript expressions are null. Also, null is returned if a subscript is outside the array bounds (this case does not raise an error). For example, if <literal>schedule</literal> currently has the dimensions <literal>[1:3][1:2]</literal> then referencing <literal>schedule[3][3]</literal> yields NULL. Similarly, an array reference with the wrong number of subscripts yields a null rather than an error.
ru: Выражение обращения к элементу массива возвратит NULL, если сам массив или одно из выражений индексов элемента равны NULL. Значение NULL также возвращается, если индекс выходит за границы массива (это не считается ошибкой). Например, если <literal>schedule</literal> в настоящее время имеет размерности <literal>[1:3][1:2]</literal>, результатом обращения к <literal>schedule[3][3]</literal> будет NULL. Подобным образом, при обращении к элементу массива с неправильным числом индексов возвращается NULL, а не ошибка.

source: An array slice expression likewise yields null if the array itself or any of the subscript expressions are null. However, in other cases such as selecting an array slice that is completely outside the current array bounds, a slice expression yields an empty (zero-dimensional) array instead of null. (This does not match non-slice behavior and is done for historical reasons.) If the requested slice partially overlaps the array bounds, then it is silently reduced to just the overlapping region instead of returning null.
ru: Аналогично, NULL возвращается при обращении к срезу массива, если сам массив или одно из выражений, определяющих индексы элементов, равны NULL. Однако, в других случаях, например, когда границы среза выходят за рамки массива, возвращается не NULL, а пустой массив (с размерностью 0). (Так сложилось исторически, что в этом срезы отличаются от обращений к обычным элементам.) Если запрошенный срез пересекает границы массива, тогда возвращается не NULL, а срез, сокращённый до области пересечения.

source: The current dimensions of any array value can be retrieved with the <function>array_dims</function> function: <placeholder-1/> <function>array_dims</function> produces a <type>text</type> result, which is convenient for people to read but perhaps inconvenient for programs. Dimensions can also be retrieved with <function>array_upper</function> and <function>array_lower</function>, which return the upper and lower bound of a specified array dimension, respectively: <placeholder-2/> <function>array_length</function> will return the length of a specified array dimension: <placeholder-3/> <function>cardinality</function> returns the total number of elements in an array across all dimensions. It is effectively the number of rows a call to <function>unnest</function> would yield: <placeholder-4/>
ru: Текущие размеры значения массива можно получить с помощью функции <function>array_dims</function>: <placeholder-1/> <function>array_dims</function> выдаёт результат типа <type>text</type>, что удобно скорее для людей, чем для программ. Размеры массива также можно получить с помощью функций <function>array_upper</function> и <function>array_lower</function>, которые возвращают соответственно верхнюю и нижнюю границу для указанной размерности: <placeholder-2/> <function>array_length</function> возвращает число элементов в указанной размерности массива: <placeholder-3/> <function>cardinality</function> возвращает общее число элементов массива по всем измерениям. Фактически это число строк, которое вернёт функция <function>unnest</function>: <placeholder-4/>

source: Modifying Arrays
ru: Изменение массивов

source: <primary>array</primary><secondary>modifying</secondary>
ru: <primary>массив</primary><secondary>изменение</secondary>

source: A stored array value can be enlarged by assigning to elements not already present. Any positions between those previously present and the newly assigned elements will be filled with nulls. For example, if array <literal>myarray</literal> currently has 4 elements, it will have six elements after an update that assigns to <literal>myarray[6]</literal>; <literal>myarray[5]</literal> will contain null. Currently, enlargement in this fashion is only allowed for one-dimensional arrays, not multidimensional arrays.
ru: Сохранённый массив можно расширить, определив значения ранее отсутствовавших в нём элементов. При этом все элементы, располагающиеся между существовавшими ранее и новыми, принимают значения NULL. Например, если массив <literal>myarray</literal> содержит 4 элемента, после присвоения значения элементу <literal>myarray[6]</literal> его длина будет равна 6, а <literal>myarray[5]</literal> будет содержать NULL. В настоящее время подобное расширение поддерживается только для одномерных, но не многомерных массивов.

source: Subscripted assignment allows creation of arrays that do not use one-based subscripts. For example one might assign to <literal>myarray[-2:7]</literal> to create an array with subscript values from -2 to 7.
ru: Определяя элементы по индексам, можно создавать массивы, в которых нумерация элементов может начинаться не с 1. Например, можно присвоить значение выражению <literal>myarray[-2:7]</literal> и таким образом создать массив, в котором будут элементы с индексами от -2 до 7.

source: New array values can also be constructed using the concatenation operator, <literal>||</literal>: <placeholder-1/>
ru: Значения массива также можно сконструировать с помощью оператора конкатенации, <literal>||</literal>: <placeholder-1/>

source: The concatenation operator allows a single element to be pushed onto the beginning or end of a one-dimensional array. It also accepts two <replaceable>N</replaceable>-dimensional arrays, or an <replaceable>N</replaceable>-dimensional and an <replaceable>N+1</replaceable>-dimensional array.
ru: Оператор конкатенации позволяет вставить один элемент в начало или в конец одномерного массива. Он также может принять два <replaceable>N</replaceable>-мерных массива или массивы размерностей <replaceable>N</replaceable> и <replaceable>N+1</replaceable>.

source: When a single element is pushed onto either the beginning or end of a one-dimensional array, the result is an array with the same lower bound subscript as the array operand. For example: <placeholder-1/>
ru: Когда в начало или конец одномерного массива вставляется один элемент, в образованном в результате массиве будет та же нижняя граница, что и в массиве-операнде. Например: <placeholder-1/>

source: When two arrays with an equal number of dimensions are concatenated, the result retains the lower bound subscript of the left-hand operand's outer dimension. The result is an array comprising every element of the left-hand operand followed by every element of the right-hand operand. For example: <placeholder-1/>
ru: Когда складываются два массива одинаковых размерностей, в результате сохраняется нижняя граница внешней размерности левого операнда. Выходной массив включает все элементы левого операнда, после которых добавляются все элементы правого. Например: <placeholder-1/>

source: When an <replaceable>N</replaceable>-dimensional array is pushed onto the beginning or end of an <replaceable>N+1</replaceable>-dimensional array, the result is analogous to the element-array case above. Each <replaceable>N</replaceable>-dimensional sub-array is essentially an element of the <replaceable>N+1</replaceable>-dimensional array's outer dimension. For example: <placeholder-1/>
ru: Когда к массиву размерности <replaceable>N+1</replaceable> спереди или сзади добавляется <replaceable>N</replaceable>-мерный массив, он вставляется аналогично тому, как в массив вставляется элемент (это было описано выше). Любой <replaceable>N</replaceable>-мерный массив по сути является элементом во внешней размерности массива, имеющего размерность <replaceable>N+1</replaceable>. Например: <placeholder-1/>

source: An array can also be constructed by using the functions <function>array_prepend</function>, <function>array_append</function>, or <function>array_cat</function>. The first two only support one-dimensional arrays, but <function>array_cat</function> supports multidimensional arrays. Some examples: <placeholder-1/>
ru: Массив также можно сконструировать с помощью функций <function>array_prepend</function>, <function>array_append</function> и <function>array_cat</function>. Первые две функции поддерживают только одномерные массивы, а <function>array_cat</function> поддерживает и многомерные. Несколько примеров: <placeholder-1/>

source: SELECT ARRAY[1, 2] || '{3, 4}'; -- the untyped literal is taken as an array ?column? ----------- {1,2,3,4} SELECT ARRAY[1, 2] || '7'; -- so is this one ERROR: malformed array literal: "7" SELECT ARRAY[1, 2] || NULL; -- so is an undecorated NULL ?column? ---------- {1,2} (1 row) SELECT array_append(ARRAY[1, 2], NULL); -- this might have been meant array_append -------------- {1,2,NULL}
ru: SELECT ARRAY[1, 2] || '{3, 4}'; -- нетипизированная строка воспринимается как массив ?column? ----------- {1,2,3,4} SELECT ARRAY[1, 2] || '7'; -- как и эта ERROR: malformed array literal: "7" SELECT ARRAY[1, 2] || NULL; -- как и буквальный NULL ?column? ---------- {1,2} (1 row) SELECT array_append(ARRAY[1, 2], NULL); -- это могло иметься в виду на самом деле array_append -------------- {1,2,NULL}
