Repository: pluzanov/pg-doc-ru
Catalog: 9.6/array.po
Languages: ru

source: In simple cases, the concatenation operator discussed above is preferred over direct use of these functions. However, because the concatenation operator is overloaded to serve all three cases, there are situations where use of one of the functions is helpful to avoid ambiguity. For example consider: <placeholder-1/> In the examples above, the parser sees an integer array on one side of the concatenation operator, and a constant of undetermined type on the other. The heuristic it uses to resolve the constant's type is to assume it's of the same type as the operator's other input &mdash; in this case, integer array. So the concatenation operator is presumed to represent <function>array_cat</function>, not <function>array_append</function>. When that's the wrong choice, it could be fixed by casting the constant to the array's element type; but explicit use of <function>array_append</function> might be a preferable solution.
ru: В простых случаях описанный выше оператор конкатенации предпочтительнее непосредственного вызова этих функций. Однако, так как оператор конкатенации перегружен для решения всех трёх задач, возможны ситуации, когда лучше применить одну из этих функций во избежание неоднозначности. Например, рассмотрите: <placeholder-1/> В показанных примерах анализатор запроса видит целочисленный массив с одной стороны оператора конкатенации и константу неопределённого типа с другой. Согласно своим правилам разрешения типа констант, он полагает, что она имеет тот же тип, что и другой операнд &mdash; в данном случае, целочисленный массив. Поэтому предполагается, что оператор конкатенации здесь представляет функцию <function>array_cat</function>, а не <function>array_append</function>. Если это решение оказывается неверным, его можно скорректировать, приведя константу к типу элемента массива; однако может быть лучше явно использовать функцию <function>array_append</function>.

source: Searching in Arrays
ru: Поиск значений в массивах

source: <primary>array</primary><secondary>searching</secondary>
ru: <primary>массив</primary><secondary>поиск</secondary>

source: To search for a value in an array, each value must be checked. This can be done manually, if you know the size of the array. For example: <placeholder-1/> However, this quickly becomes tedious for large arrays, and is not helpful if the size of the array is unknown. An alternative method is described in <xref linkend="functions-comparisons"/>. The above query could be replaced by: <placeholder-2/> In addition, you can find rows where the array has all values equal to 10000 with: <placeholder-3/>
ru: Чтобы найти значение в массиве, необходимо проверить все его элементы. Это можно сделать вручную, если вы знаете размер массива. Например: <placeholder-1/> Однако с большим массивами этот метод становится утомительным, и к тому же он не работает, когда размер массива неизвестен. Альтернативный подход описан в <xref remap="6" linkend="functions-comparisons"/>. Показанный выше запрос можно было переписать так: <placeholder-2/> А так можно найти в таблице строки, в которых массивы содержат только значения, равные 10000: <placeholder-3/>

source: Alternatively, the <function>generate_subscripts</function> function can be used. For example: <placeholder-1/> This function is described in <xref linkend="functions-srf-subscripts"/>.
ru: Кроме того, для обращения к элементам массива можно использовать функцию <function>generate_subscripts</function>. Например так: <placeholder-1/> Эта функция описана в <xref remap="6" linkend="functions-srf-subscripts"/>.

source: You can also search an array using the <literal>&amp;&amp;</literal> operator, which checks whether the left operand overlaps with the right operand. For instance: <placeholder-1/> This and other array operators are further described in <xref linkend="functions-array"/>. It can be accelerated by an appropriate index, as described in <xref linkend="indexes-types"/>.
ru: Также искать в массиве значения можно, используя оператор <literal>&amp;&amp;</literal>, который проверяет, перекрывается ли левый операнд с правым. Например: <placeholder-1/> Этот и другие операторы для работы с массивами описаны в <xref remap="6" linkend="functions-array"/>. Он может быть ускорен с помощью подходящего индекса, как описано в <xref remap="6" linkend="indexes-types"/>.

source: You can also search for specific values in an array using the <function>array_position</function> and <function>array_positions</function> functions. The former returns the subscript of the first occurrence of a value in an array; the latter returns an array with the subscripts of all occurrences of the value in the array. For example: <placeholder-1/>
ru: Вы также можете искать определённые значения в массиве, используя функции <function>array_position</function> и <function>array_positions</function>. Первая функция возвращает позицию первого вхождения значения в массив, а вторая — массив позиций всех его вхождений. Например: <placeholder-1/>

source: Arrays are not sets; searching for specific array elements can be a sign of database misdesign. Consider using a separate table with a row for each item that would be an array element. This will be easier to search, and is likely to scale better for a large number of elements.
ru: Массивы &mdash; это не множества; необходимость поиска определённых элементов в массиве может быть признаком неудачно сконструированной базы данных. Возможно, вместо массива лучше использовать отдельную таблицу, строки которой будут содержать данные элементов массива. Это может быть лучше и для поиска, и для работы с большим количеством элементов.

source: Array Input and Output Syntax
ru: Синтаксис вводимых и выводимых значений массива

source: <primary>array</primary><secondary>I/O</secondary>
ru: <primary>массив</primary><secondary>ввод/вывод</secondary>

source: The external text representation of an array value consists of items that are interpreted according to the I/O conversion rules for the array's element type, plus decoration that indicates the array structure. The decoration consists of curly braces (<literal>{</literal> and <literal>}</literal>) around the array value plus delimiter characters between adjacent items. The delimiter character is usually a comma (<literal>,</literal>) but can be something else: it is determined by the <literal>typdelim</literal> setting for the array's element type. Among the standard data types provided in the <productname>PostgreSQL</productname> distribution, all use a comma, except for type <type>box</type>, which uses a semicolon (<literal>;</literal>). In a multidimensional array, each dimension (row, plane, cube, etc.) gets its own level of curly braces, and delimiters must be written between adjacent curly-braced entities of the same level.
ru: Внешнее текстовое представление значения массива состоит из записи элементов, интерпретируемых по правилам ввода/вывода для типа элемента массива, и оформления структуры массива. Оформление состоит из фигурных скобок (<literal>{</literal> и <literal>}</literal>), окружающих значение массива, и знаков-разделителей между его элементами. В качестве знака-разделителя обычно используется запятая (<literal>,</literal>), но это может быть и другой символ; он определяется параметром <literal>typdelim</literal> для типа элемента массива. Для стандартных типов данных, существующих в дистрибутиве <productname>PostgreSQL</productname>, разделителем является запятая (<literal>,</literal>), за исключением лишь типа <type>box</type>, в котором разделитель &mdash; точка с запятой (<literal>;</literal>). В многомерном массиве у каждой размерности (ряд, плоскость, куб и т. д.) есть свой уровень фигурных скобок, а соседние значения в фигурных скобках на одном уровне должны отделяться разделителями.

source: The array output routine will put double quotes around element values if they are empty strings, contain curly braces, delimiter characters, double quotes, backslashes, or white space, or match the word <literal>NULL</literal>. Double quotes and backslashes embedded in element values will be backslash-escaped. For numeric data types it is safe to assume that double quotes will never appear, but for textual data types one should be prepared to cope with either the presence or absence of quotes.
ru: Функция вывода массива заключает значение элемента в кавычки, если это пустая строка или оно содержит фигурные скобки, знаки-разделители, кавычки, обратную косую черту, пробельный символ или это текст <literal>NULL</literal>. Кавычки и обратная косая черта, включённые в такие значения, преобразуются в спецпоследовательность с обратной косой чертой. Для числовых типов данных можно рассчитывать на то, что значения никогда не будут выводиться в кавычках, но для текстовых типов следует быть готовым к тому, что выводимое значение массива может содержать кавычки.

source: By default, the lower bound index value of an array's dimensions is set to one. To represent arrays with other lower bounds, the array subscript ranges can be specified explicitly before writing the array contents. This decoration consists of square brackets (<literal>[]</literal>) around each array dimension's lower and upper bounds, with a colon (<literal>:</literal>) delimiter character in between. The array dimension decoration is followed by an equal sign (<literal>=</literal>). For example: <placeholder-1/> The array output routine will include explicit dimensions in its result only when there are one or more lower bounds different from one.
ru: По умолчанию нижняя граница всех размерностей массива равна одному. Чтобы представить массивы с другими нижними границами, перед содержимым массива можно указать диапазоны индексов. Такое оформление массива будет содержать квадратные скобки (<literal>[]</literal>) вокруг нижней и верхней границ каждой размерности с двоеточием (<literal>:</literal>) между ними. За таким указанием размерности следует знак равно (<literal>=</literal>). Например: <placeholder-1/> Процедура вывода массива включает в результат явное указание размерностей, только если нижняя граница в одной или нескольких размерностях отличается от 1.

source: If the value written for an element is <literal>NULL</literal> (in any case variant), the element is taken to be NULL. The presence of any quotes or backslashes disables this and allows the literal string value <quote>NULL</quote> to be entered. Also, for backward compatibility with pre-8.2 versions of <productname>PostgreSQL</productname>, the <xref linkend="guc-array-nulls"/> configuration parameter can be turned <literal>off</literal> to suppress recognition of <literal>NULL</literal> as a NULL.
ru: Если в качестве значения элемента задаётся <literal>NULL</literal> (в любом регистре), этот элемент считается равным непосредственно NULL. Если же оно включает кавычки или обратную косую черту, элементу присваивается текстовая строка <quote>NULL</quote>. Кроме того, для обратной совместимости с версиями <productname>PostgreSQL</productname> до 8.2, параметр конфигурации <xref linkend="guc-array-nulls"/> можно выключить (присвоив ему <literal>off</literal>), чтобы строки <literal>NULL</literal> не воспринимались как значения NULL.

source: As shown previously, when writing an array value you can use double quotes around any individual array element. You <emphasis>must</emphasis> do so if the element value would otherwise confuse the array-value parser. For example, elements containing curly braces, commas (or the data type's delimiter character), double quotes, backslashes, or leading or trailing whitespace must be double-quoted. Empty strings and strings matching the word <literal>NULL</literal> must be quoted, too. To put a double quote or backslash in a quoted array element value, use escape string syntax and precede it with a backslash. Alternatively, you can avoid quotes and use backslash-escaping to protect all data characters that would otherwise be taken as array syntax.
ru: Как было показано ранее, записывая значение массива, любой его элемент можно заключить в кавычки. Это <emphasis>нужно</emphasis> делать, если при разборе значения массива без кавычек возможна неоднозначность. Например, в кавычки необходимо заключать элементы, содержащие фигурные скобки, запятую (или разделитель, определённый для данного типа), кавычки, обратную косую черту, а также пробельные символы в начале или конце строки. Пустые строки и строки, содержащие одно слово <literal>NULL</literal>, также нужно заключать в кавычки. Чтобы включить кавычки или обратную косую черту в значение, заключённое в кавычки, используйте спецпоследовательности с обратной косой чертой. С другой стороны, чтобы обойтись без кавычек, такими спецпоследовательностями можно защитить все символы в данных, которые могут быть восприняты как часть синтаксиса массива.

source: You can add whitespace before a left brace or after a right brace. You can also add whitespace before or after any individual item string. In all of these cases the whitespace will be ignored. However, whitespace within double-quoted elements, or surrounded on both sides by non-whitespace characters of an element, is not ignored.
ru: Перед открывающей и после закрывающей скобки можно добавлять пробельные символы. Пробелы также могут окружать каждую отдельную строку значения. Во всех случаях такие пробельные символы игнорируются. Однако все пробелы в строках, заключённых в кавычки, или окружённые не пробельными символами, напротив, учитываются.

source: Remember that what you write in an SQL command will first be interpreted as a string literal, and then as an array. This doubles the number of backslashes you need. For example, to insert a <type>text</type> array value containing a backslash and a double quote, you'd need to write: <placeholder-1/> The escape string processor removes one level of backslashes, so that what arrives at the array-value parser looks like <literal>{"\\","\""}</literal>. In turn, the strings fed to the <type>text</type> data type's input routine become <literal>\</literal> and <literal>"</literal> respectively. (If we were working with a data type whose input routine also treated backslashes specially, <type>bytea</type> for example, we might need as many as eight backslashes in the command to get one backslash into the stored array element.) Dollar quoting (see <xref linkend="sql-syntax-dollar-quoting"/>) can be used to avoid the need to double backslashes.
ru: Помните, что написанная SQL-команда прежде всего интерпретируется как текстовая строка, а затем как массив. Вследствие этого число символов обратной косой черты удваивается. Например, чтобы ввести в массив значения типа <type>text</type> с обратной косой чертой и кавычками, команду нужно будет записать так: <placeholder-1/> Сначала обработчик спецпоследовательностей удаляет один уровень обратной косой черты, так что анализатор значения массива получает на вход <literal>{"\\","\""}</literal>. В свою очередь, он передаёт эти строки процедуре ввода значения типа <type>text</type>, где они преобразуются в <literal>\</literal> и <literal>"</literal> соответственно. (Если бы мы работали с типом данных, процедура ввода которого также интерпретирует обратную косую черту особым образом, например <type>bytea</type>, нам могло бы понадобиться уже восемь таких символов, чтобы сохранить этот символ в элементе массива.) Во избежание такого дублирования спецсимволов строки можно заключать в доллары (см. <xref remap="4" linkend="sql-syntax-dollar-quoting"/>).

source: The <literal>ARRAY</literal> constructor syntax (see <xref linkend="sql-syntax-array-constructors"/>) is often easier to work with than the array-literal syntax when writing array values in SQL commands. In <literal>ARRAY</literal>, individual element values are written the same way they would be written when not members of an array.
ru: Записывать значения массивов в командах SQL часто бывает удобнее с помощью конструктора <literal>ARRAY</literal> (см. <xref remap="4" linkend="sql-syntax-array-constructors"/>). В <literal>ARRAY</literal> отдельные значения элементов записываются так же, как если бы они не были членами массива.
