Repository: pluzanov/pg-doc-ru
Catalog: 9.6/auto-explain.po
Languages: ru

source: The <filename>auto_explain</filename> module provides a means for logging execution plans of slow statements automatically, without having to run <xref linkend="sql-explain"/> by hand. This is especially helpful for tracking down un-optimized queries in large applications.
ru: Модуль <filename>auto_explain</filename> предоставляет возможность автоматического протоколирования планов выполнения медленных операторов, что позволяет обойтись без выполнения <xref linkend="sql-explain"/> вручную. Это особенно полезно для выявления неоптимизированных запросов в больших приложениях.

source: The module provides no SQL-accessible functions. To use it, simply load it into the server. You can load it into an individual session: <placeholder-1/> (You must be superuser to do that.) More typical usage is to preload it into some or all sessions by including <literal>auto_explain</literal> in <xref linkend="guc-session-preload-libraries"/> or <xref linkend="guc-shared-preload-libraries"/> in <filename>postgresql.conf</filename>. Then you can track unexpectedly slow queries no matter when they happen. Of course there is a price in overhead for that.
ru: Этот модуль не предоставляет функций, доступных из SQL. Чтобы использовать его, просто загрузите его в процесс сервера. Это можно сделать в отдельном сеансе: <placeholder-1/> (Для этого нужно быть суперпользователем.) Более типична конфигурация, когда он загружается в некоторые или все сеансы в результате включения <literal>auto_explain</literal> в переменную <xref linkend="guc-session-preload-libraries"/> или в <xref linkend="guc-shared-preload-libraries"/> в файле <filename>postgresql.conf</filename>. Загрузив этот модуль, вы можете отслеживать исключительно медленные запросы, вне зависимости от того, когда они происходят. Конечно, это имеет свою цену.

source: Configuration Parameters
ru: Параметры конфигурации

source: There are several configuration parameters that control the behavior of <filename>auto_explain</filename>. Note that the default behavior is to do nothing, so you must set at least <varname>auto_explain.log_min_duration</varname> if you want any results.
ru: Есть несколько параметров конфигурации, которые управляют поведением <filename>auto_explain</filename>. Заметьте, что поведение по умолчанию сводится к бездействию, так что необходимо установить как минимум переменную <varname>auto_explain.log_min_duration</varname>, если вы хотите получить какие-либо результаты.

source: <primary><varname>auto_explain.log_min_duration</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_min_duration</varname></primary>

source: <varname>auto_explain.log_min_duration</varname> is the minimum statement execution time, in milliseconds, that will cause the statement's plan to be logged. Setting this to zero logs all plans. Minus-one (the default) disables logging of plans. For example, if you set it to <literal>250ms</literal> then all statements that run 250ms or longer will be logged. Only superusers can change this setting.
ru: Переменная <varname>auto_explain.log_min_duration</varname> задаёт время выполнения оператора, в миллисекундах, при превышении которого план оператора будет протоколироваться. Если это значение равно 0, протоколироваться будут планы всех операторов. При значении -1 (по умолчанию) протоколирование планов полностью отключается. Например, если вы установите значение <literal>250ms</literal>, протоколироваться будут все запросы, выполняющиеся 250 мс и дольше. Изменить этот параметр могут только суперпользователи.

source: <primary><varname>auto_explain.log_analyze</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_analyze</varname></primary>

source: <varname>auto_explain.log_analyze</varname> causes <command>EXPLAIN ANALYZE</command> output, rather than just <command>EXPLAIN</command> output, to be printed when an execution plan is logged. This parameter is off by default. Only superusers can change this setting.
ru: При включении параметра <varname>auto_explain.log_analyze</varname> в протокол будет записываться вывод команды <command>EXPLAIN ANALYZE</command>, а не простой <command>EXPLAIN</command>. По умолчанию этот параметр отключён. Изменить его могут только суперпользователи.

source: When this parameter is on, per-plan-node timing occurs for all statements executed, whether or not they run long enough to actually get logged. This can have an extremely negative impact on performance. Turning off <varname>auto_explain.log_timing</varname> ameliorates the performance cost, at the price of obtaining less information.
ru: Когда этот параметр включён, замер времени на уровне узлов плана производится для всех операторов, даже если они выполняются недостаточно долго для протоколирования. Это может оказать крайне негативное влияние на производительность. Отключение <varname>auto_explain.log_timing</varname> исключает это влияние, но при этом собирается меньше информации.

source: <primary><varname>auto_explain.log_buffers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_buffers</varname></primary>

source: <varname>auto_explain.log_buffers</varname> controls whether buffer usage statistics are printed when an execution plan is logged; it's equivalent to the <literal>BUFFERS</literal> option of <command>EXPLAIN</command>. This parameter has no effect unless <varname>auto_explain.log_analyze</varname> is enabled. This parameter is off by default. Only superusers can change this setting.
ru: Параметр <varname>auto_explain.log_buffers</varname> определяет, будет ли при протоколировании плана выполнения выводиться статистика об использовании буферов; он равносилен указанию <literal>BUFFERS</literal> команды <command>EXPLAIN</command>. Этот параметр действует, только если включён параметр <varname>auto_explain.log_analyze</varname>. По умолчанию этот параметр отключён. Изменить его могут только суперпользователи.

source: <primary><varname>auto_explain.log_timing</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_timing</varname></primary>

source: <varname>auto_explain.log_timing</varname> controls whether per-node timing information is printed when an execution plan is logged; it's equivalent to the <literal>TIMING</literal> option of <command>EXPLAIN</command>. The overhead of repeatedly reading the system clock can slow down queries significantly on some systems, so it may be useful to set this parameter to off when only actual row counts, and not exact times, are needed. This parameter has no effect unless <varname>auto_explain.log_analyze</varname> is enabled. This parameter is on by default. Only superusers can change this setting.
ru: Параметр <varname>auto_explain.log_timing</varname> определяет, будет ли при протоколировании плана выполнения выводиться длительность на уровне узлов: он равнозначен указанию <literal>TIMING</literal> команды <command>EXPLAIN</command>. Издержки от постоянного чтения системных часов могут значительно замедлить запросы в некоторых системах, так что может иметь смысл отключать этот параметр, когда нужно знать только знать количество строк, но не точную длительность каждого узла. Этот параметр действует, только если включён <varname>auto_explain.log_analyze</varname>. По умолчанию этот параметр отключён. Изменить его могут только суперпользователи.

source: <primary><varname>auto_explain.log_triggers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_triggers</varname></primary>

source: <varname>auto_explain.log_triggers</varname> causes trigger execution statistics to be included when an execution plan is logged. This parameter has no effect unless <varname>auto_explain.log_analyze</varname> is enabled. This parameter is off by default. Only superusers can change this setting.
ru: При включении параметра <varname>auto_explain.log_triggers</varname> в протокол будет записываться статистика выполнения триггеров. Этот параметр действует, только если включён параметр <varname>auto_explain.log_analyze</varname>. По умолчанию этот параметр отключён. Изменить его могут только суперпользователи.

source: <primary><varname>auto_explain.log_verbose</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_verbose</varname> configuration parameter</primary>

source: <varname>auto_explain.log_verbose</varname> controls whether verbose details are printed when an execution plan is logged; it's equivalent to the <literal>VERBOSE</literal> option of <command>EXPLAIN</command>. This parameter is off by default. Only superusers can change this setting.
ru: Параметр <varname>auto_explain.log_verbose</varname> определяет, будут ли при протоколировании плана выполнения выводиться подробные сведения; он равнозначен указанию <literal>VERBOSE</literal> команды <command>EXPLAIN</command>. По умолчанию этот параметр отключён. Изменить его могут только суперпользователи.

source: <primary><varname>auto_explain.log_format</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_format</varname></primary>

source: <varname>auto_explain.log_format</varname> selects the <command>EXPLAIN</command> output format to be used. The allowed values are <literal>text</literal>, <literal>xml</literal>, <literal>json</literal>, and <literal>yaml</literal>. The default is text. Only superusers can change this setting.
ru: Параметр <varname>auto_explain.log_format</varname> выбирает формат вывода для <command>EXPLAIN</command>. Он может принимать значение <literal>text</literal>, <literal>xml</literal>, <literal>json</literal> и <literal>yaml</literal>. Значение по умолчанию — text. Изменить этот параметр могут только суперпользователи.

source: <primary><varname>auto_explain.log_nested_statements</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>auto_explain.log_nested_statements</varname></primary>

source: <varname>auto_explain.log_nested_statements</varname> causes nested statements (statements executed inside a function) to be considered for logging. When it is off, only top-level query plans are logged. This parameter is off by default. Only superusers can change this setting.
ru: При включении параметра <varname>auto_explain.log_nested_statements</varname> протоколированию могут подлежать и вложенные операторы (операторы, выполняемые внутри функции). Когда он отключён, протоколируются планы запросов только верхнего уровня. Изменить этот параметр могут только суперпользователи.

source: In ordinary usage, these parameters are set in <filename>postgresql.conf</filename>, although superusers can alter them on-the-fly within their own sessions. Typical usage might be:
ru: В обычной ситуации эти параметры устанавливаются в <filename>postgresql.conf</filename>, хотя суперпользователи могут изменить их &laquo;на лету&raquo; в рамках своих сеансов. Типичное их использование может выглядеть так:

source: Example
ru: Пример

source: This might produce log output such as:
ru: В результате этих команд может быть получен такой вывод:

source: Author
ru: Автор

source: Takahiro Itagaki <email>itagaki.takahiro@oss.ntt.co.jp</email>
ru: Такахиро Итагаки <email>itagaki.takahiro@oss.ntt.co.jp</email>
