Repository: pluzanov/pg-doc-ru
Catalog: 9.6/backup.po
Languages: ru

source: Backup and Restore
ru: Резервное копирование и восстановление

source: <primary>backup</primary>
ru: <primary>резервная копия</primary>

source: As with everything that contains valuable data, <productname>PostgreSQL</productname> databases should be backed up regularly. While the procedure is essentially simple, it is important to have a clear understanding of the underlying techniques and assumptions.
ru: Как и всё, что содержит важные данные, базы данных <productname>PostgreSQL</productname> следует регулярно сохранять в резервной копии. Хотя эта процедура по существу проста, важно чётко понимать лежащие в её основе приёмы и положения.

source: <acronym>SQL</acronym> dump
ru: Выгрузка в <acronym>SQL</acronym>

source: File system level backup
ru: Копирование на уровне файлов

source: Continuous archiving
ru: Непрерывное архивирование

source: There are three fundamentally different approaches to backing up <productname>PostgreSQL</productname> data: <placeholder-1/> Each has its own strengths and weaknesses; each is discussed in turn in the following sections.
ru: Существует три фундаментально разных подхода к резервному копированию данных в <productname>PostgreSQL</productname>: <placeholder-1/> Каждый из них имеет свои сильные и слабые стороны; все они обсуждаются в следующих разделах.

source: <acronym>SQL</acronym> Dump
ru: Выгрузка в <acronym>SQL</acronym>

source: The idea behind this dump method is to generate a file with SQL commands that, when fed back to the server, will recreate the database in the same state as it was at the time of the dump. <productname>PostgreSQL</productname> provides the utility program <xref linkend="app-pgdump"/> for this purpose. The basic usage of this command is: <synopsis>pg_dump <replaceable class="parameter">dbname</replaceable> &gt; <replaceable class="parameter">outfile</replaceable></synopsis> As you see, <application>pg_dump</application> writes its result to the standard output. We will see below how this can be useful. While the above command creates a text file, <application>pg_dump</application> can create files in other formats that allow for parallelism and more fine-grained control of object restoration.
ru: Идея, стоящая за этим методом, заключается в генерации текстового файла с командами SQL, которые при выполнении на сервере пересоздадут базу данных в том же самом состоянии, в котором она была на момент выгрузки. <productname>PostgreSQL</productname> предоставляет для этой цели вспомогательную программу <xref linkend="app-pgdump"/>. Простейшее применение этой программы выглядит так: <synopsis>pg_dump <replaceable class="parameter">имя_базы</replaceable> &gt; <replaceable class="parameter">выходной_файл</replaceable></synopsis> Как видите, <application>pg_dump</application> записывает результаты своей работы в устройство стандартного вывода. Далее будет рассмотрено, чем это может быть полезно. В то время как вышеупомянутая команда создаёт текстовый файл, <application>pg_dump</application> может создать файлы и в других форматах, которые допускают параллельную обработку и более гибкое управление восстановлением объектов.

source: <application>pg_dump</application> is a regular <productname>PostgreSQL</productname> client application (albeit a particularly clever one). This means that you can perform this backup procedure from any remote host that has access to the database. But remember that <application>pg_dump</application> does not operate with special permissions. In particular, it must have read access to all tables that you want to back up, so in order to back up the entire database you almost always have to run it as a database superuser. (If you do not have sufficient privileges to back up the entire database, you can still back up portions of the database to which you do have access using options such as <option>-n <replaceable>schema</replaceable></option> or <option>-t <replaceable>table</replaceable></option>.)
ru: Программа <application>pg_dump</application> является для <productname>PostgreSQL</productname> обычным клиентским приложением (хотя и весьма умным). Это означает, что вы можете выполнять процедуру резервного копирования с любого удалённого компьютера, если имеете доступ к нужной базе данных. Но помните, что <application>pg_dump</application> не использует для своей работы какие-то специальные привилегии. В частности, ей обычно требуется доступ на чтение всех таблиц, которые вы хотите выгрузить, так что для копирования всей базы данных практически всегда её нужно запускать с правами суперпользователя СУБД. (Если у вас нет достаточных прав для резервного копирования всей базы данных, вы, тем не менее, можете сделать резервную копию той части базы, доступ к которой у вас есть, используя такие параметры, как <option>-n <replaceable>схема</replaceable></option> или <option>-t <replaceable>таблица</replaceable></option>.)

source: To specify which database server <application>pg_dump</application> should contact, use the command line options <option>-h <replaceable>host</replaceable></option> and <option>-p <replaceable>port</replaceable></option>. The default host is the local host or whatever your <envar>PGHOST</envar> environment variable specifies. Similarly, the default port is indicated by the <envar>PGPORT</envar> environment variable or, failing that, by the compiled-in default. (Conveniently, the server will normally have the same compiled-in default.)
ru: Указать, к какому серверу должна подключаться программа <application>pg_dump</application>, можно с помощью аргументов командной строки <option>-h <replaceable>сервер</replaceable></option> и <option>-p <replaceable>порт</replaceable></option>. По умолчанию в качестве сервера выбирается localhost или значение, указанное в переменной окружения <envar>PGHOST</envar>. Подобным образом, по умолчанию используется порт, заданный в переменной окружения <envar>PGPORT</envar>, а если она не задана, то порт, указанный по умолчанию при компиляции. (Для удобства при компиляции сервера обычно устанавливается то же значение по умолчанию.)

source: Like any other <productname>PostgreSQL</productname> client application, <application>pg_dump</application> will by default connect with the database user name that is equal to the current operating system user name. To override this, either specify the <option>-U</option> option or set the environment variable <envar>PGUSER</envar>. Remember that <application>pg_dump</application> connections are subject to the normal client authentication mechanisms (which are described in <xref linkend="client-authentication"/>).
ru: Как и любое другое клиентское приложение <productname>PostgreSQL</productname>, <application>pg_dump</application> по умолчанию будет подключаться к базе данных с именем пользователя, совпадающим с именем текущего пользователя операционной системы. Чтобы переопределить имя, либо добавьте параметр <option>-U</option>, либо установите переменную окружения <envar>PGUSER</envar>. Помните, что <application>pg_dump</application> подключается к серверу через обычные механизмы проверки подлинности клиента (которые описываются в <xref remap="6" linkend="client-authentication"/>).

source: An important advantage of <application>pg_dump</application> over the other backup methods described later is that <application>pg_dump</application>'s output can generally be re-loaded into newer versions of <productname>PostgreSQL</productname>, whereas file-level backups and continuous archiving are both extremely server-version-specific. <application>pg_dump</application> is also the only method that will work when transferring a database to a different machine architecture, such as going from a 32-bit to a 64-bit server.
ru: Важное преимущество <application>pg_dump</application> в сравнении с другими методами резервного копирования, описанными далее, состоит в том, что вывод <application>pg_dump</application> обычно можно загрузить в более новые версии <productname>PostgreSQL</productname>, в то время как резервная копия на уровне файловой системы и непрерывное архивирование жёстко зависят от версии сервера. Также, только метод с применением <application>pg_dump</application> будет работать при переносе базы данных на другую машинную архитектуру, например, при переносе с 32-битной на 64-битную версию сервера.

source: Dumps created by <application>pg_dump</application> are internally consistent, meaning, the dump represents a snapshot of the database at the time <application>pg_dump</application> began running. <application>pg_dump</application> does not block other operations on the database while it is working. (Exceptions are those operations that need to operate with an exclusive lock, such as most forms of <command>ALTER TABLE</command>.)
ru: Дампы, создаваемые <application>pg_dump</application>, являются внутренне согласованными, то есть, дамп представляет собой снимок базы данных на момент начала запуска <application>pg_dump</application>. <application>pg_dump</application> не блокирует другие операции с базой данных во время своей работы. (Исключение составляют операции, которым нужна исключительная блокировка, как например, большинство форм команды <command>ALTER TABLE</command>.)

source: Restoring the Dump
ru: Восстановление дампа

source: Text files created by <application>pg_dump</application> are intended to be read in by the <application>psql</application> program. The general command form to restore a dump is <synopsis>psql <replaceable class="parameter">dbname</replaceable> &lt; <replaceable class="parameter">infile</replaceable></synopsis> where <replaceable class="parameter">infile</replaceable> is the file output by the <application>pg_dump</application> command. The database <replaceable class="parameter">dbname</replaceable> will not be created by this command, so you must create it yourself from <literal>template0</literal> before executing <application>psql</application> (e.g., with <literal>createdb -T template0 <replaceable class="parameter">dbname</replaceable></literal>). <application>psql</application> supports options similar to <application>pg_dump</application> for specifying the database server to connect to and the user name to use. See the <xref linkend="app-psql"/> reference page for more information. Non-text file dumps are restored using the <xref linkend="app-pgrestore"/> utility.
ru: Текстовые файлы, созданные <application>pg_dump</application> предназначаются для последующего чтения программой <application>psql</application>. Общий вид команды для восстановления дампа: <synopsis>psql <replaceable class="parameter">имя_базы</replaceable> &lt; <replaceable class="parameter">входной_файл</replaceable></synopsis> где <replaceable class="parameter">входной_файл</replaceable> &mdash; это файл, содержащий вывод команды <application>pg_dump</application>. База данных, заданная параметром <replaceable class="parameter">имя_базы</replaceable>, не будет создана данной командой, так что вы должны создать её сами из базы <literal>template0</literal> перед запуском <application>psql</application> (например, с помощью команды <literal>createdb -T template0 <replaceable class="parameter">имя_базы</replaceable></literal>). Программа <application>psql</application> принимает параметры, указывающие сервер, к которому осуществляется подключение, и имя пользователя, подобно <application>pg_dump</application>. За дополнительными сведениями обратитесь к справке по <xref linkend="app-pgrestore"/>. Копии не текстовые восстанавливаются утилитой <xref linkend="app-pgrestore"/>.

source: Before restoring an SQL dump, all the users who own objects or were granted permissions on objects in the dumped database must already exist. If they do not, the restore will fail to recreate the objects with the original ownership and/or permissions. (Sometimes this is what you want, but usually it is not.)
ru: Перед восстановлением SQL-дампа все пользователи, которые владели объектами или имели права на объекты в выгруженной базе данных, должны уже существовать. Если их нет, при восстановлении будут ошибки пересоздания объектов с изначальными владельцами и/или правами. (Иногда это желаемый результат, но обычно нет).

source: psql --set ON_ERROR_STOP=on dbname &lt; infile
ru: psql --set ON_ERROR_STOP=on имя_базы &lt; входной_файл

source: By default, the <application>psql</application> script will continue to execute after an SQL error is encountered. You might wish to run <application>psql</application> with the <literal>ON_ERROR_STOP</literal> variable set to alter that behavior and have <application>psql</application> exit with an exit status of 3 if an SQL error occurs: <placeholder-1/> Either way, you will only have a partially restored database. Alternatively, you can specify that the whole dump should be restored as a single transaction, so the restore is either fully completed or fully rolled back. This mode can be specified by passing the <option>-1</option> or <option>--single-transaction</option> command-line options to <application>psql</application>. When using this mode, be aware that even a minor error can rollback a restore that has already run for many hours. However, that might still be preferable to manually cleaning up a complex database after a partially restored dump.
ru: По умолчанию, если происходит ошибка SQL, программа <application>psql</application> продолжает выполнение. Если же запустить <application>psql</application> с установленной переменной <literal>ON_ERROR_STOP</literal>, это поведение поменяется и <application>psql</application> завершится с кодом 3 в случае возникновения ошибки SQL: <placeholder-1/> В любом случае, вы получите только частично восстановленную базу данных. В качестве альтернативы можно указать, что весь дамп должен быть восстановлен в одной транзакции, так что восстановление либо полностью выполнится, либо полностью отменится. Включить данный режим можно, передав <application>psql</application> аргумент <option>-1</option> или <option>--single-transaction</option>. Выбирая этот режим, учтите, что даже незначительная ошибка может привести к откату восстановления, которое могло продолжаться несколько часов. Однако, это всё же может быть предпочтительней, чем вручную вычищать сложную базу данных после частично восстановленного дампа.

source: pg_dump -h <replaceable>host1</replaceable> <replaceable>dbname</replaceable> | psql -h <replaceable>host2</replaceable> <replaceable>dbname</replaceable>
ru: pg_dump -h <replaceable>host1</replaceable> <replaceable>имя_базы</replaceable> | psql -h <replaceable>host2</replaceable> <replaceable>имя_базы</replaceable>

source: The ability of <application>pg_dump</application> and <application>psql</application> to write to or read from pipes makes it possible to dump a database directly from one server to another, for example: <placeholder-1/>
ru: Благодаря способности <application>pg_dump</application> и <application>psql</application> писать и читать каналы ввода/вывода, можно скопировать базу данных непосредственно с одного сервера на другой, например: <placeholder-1/>

source: The dumps produced by <application>pg_dump</application> are relative to <literal>template0</literal>. This means that any languages, procedures, etc. added via <literal>template1</literal> will also be dumped by <application>pg_dump</application>. As a result, when restoring, if you are using a customized <literal>template1</literal>, you must create the empty database from <literal>template0</literal>, as in the example above.
ru: Дампы, которые выдаёт <application>pg_dump</application>, содержат определения относительно <literal>template0</literal>. Это означает, что любые языки, процедуры и т. п., добавленные в базу через <literal>template1</literal>, <application>pg_dump</application> также выгрузит в дамп. Как следствие, если при восстановлении вы используете модифицированный <literal>template1</literal>, вы должны создать пустую базу данных из <literal>template0</literal>, как показано в примере выше.

source: After restoring a backup, it is wise to run <xref linkend="sql-analyze"/> on each database so the query optimizer has useful statistics; see <xref linkend="vacuum-for-statistics"/> and <xref linkend="autovacuum"/> for more information. For more advice on how to load large amounts of data into <productname>PostgreSQL</productname> efficiently, refer to <xref linkend="populate"/>.
ru: После восстановления резервной копии имеет смысл запустить <xref linkend="sql-analyze"/> для каждой базы данных, чтобы оптимизатор запросов получил полезную статистику; за подробностями обратитесь к <xref remap="3" linkend="vacuum-for-statistics"/> и <xref remap="3" linkend="autovacuum"/>. Другие советы по эффективной загрузке больших объёмов данных в <productname>PostgreSQL</productname> вы можете найти в <xref remap="6" linkend="populate"/>.

source: Using <application>pg_dumpall</application>
ru: Использование <application>pg_dumpall</application>

source: <application>pg_dump</application> dumps only a single database at a time, and it does not dump information about roles or tablespaces (because those are cluster-wide rather than per-database). To support convenient dumping of the entire contents of a database cluster, the <xref linkend="app-pg-dumpall"/> program is provided. <application>pg_dumpall</application> backs up each database in a given cluster, and also preserves cluster-wide data such as role and tablespace definitions. The basic usage of this command is: <synopsis>pg_dumpall &gt; <replaceable>outfile</replaceable></synopsis> The resulting dump can be restored with <application>psql</application>: <synopsis>psql -f <replaceable class="parameter">infile</replaceable> postgres</synopsis> (Actually, you can specify any existing database name to start from, but if you are loading into an empty cluster then <literal>postgres</literal> should usually be used.) It is always necessary to have database superuser access when restoring a <application>pg_dumpall</application> dump, as that is required to restore the role and tablespace information. If you use tablespaces, make sure that the tablespace paths in the dump are appropriate for the new installation.
ru: Программа <application>pg_dump</application> выгружает только одну базу данных в один момент времени и не включает в дамп информацию о ролях и табличных пространствах (так как это информация уровня кластера, а не самой базы данных). Для удобства создания дампа всего содержимого кластера баз данных предоставляется программа <xref linkend="app-pg-dumpall"/>, которая делает резервную копию всех баз данных кластера, а также сохраняет данные уровня кластера, такие как роли и определения табличных пространств. Простое использование этой команды: <synopsis>pg_dumpall &gt; <replaceable>выходной_файл</replaceable></synopsis> Полученную копию можно восстановить с помощью <application>psql</application>: <synopsis>psql -f <replaceable class="parameter">входной_файл</replaceable> postgres</synopsis> (В принципе, здесь в качестве начальной базы данных можно указать имя любой существующей базы, но если вы загружаете копию в пустой кластер, обычно нужно использовать <literal>postgres</literal>). Восстанавливать дамп, который выдала <application>pg_dumpall</application>, всегда необходимо с правами суперпользователя, так как они требуются для восстановления информации о ролях и табличных пространствах. Если вы используете табличные пространства, убедитесь, что пути к табличным пространствам в дампе соответствуют новой среде.

source: <application>pg_dumpall</application> works by emitting commands to re-create roles, tablespaces, and empty databases, then invoking <application>pg_dump</application> for each database. This means that while each database will be internally consistent, the snapshots of different databases are not synchronized.
ru: <application>pg_dumpall</application> выдаёт команды, которые заново создают роли, табличные пространства и пустые базы данных, а затем вызывает для каждой базы <application>pg_dump</application>. Таким образом, хотя каждая база данных будет внутренне согласованной, состояние разных баз не будет синхронным.

source: Cluster-wide data can be dumped alone using the <application>pg_dumpall</application> <option>--globals-only</option> option. This is necessary to fully backup the cluster if running the <application>pg_dump</application> command on individual databases.
ru: Только глобальные данные кластера можно выгрузить, передав <application>pg_dumpall</application> ключ <option>--globals-only</option>. Это необходимо, чтобы полностью скопировать кластер, когда <application>pg_dump</application> выполняется для отдельных баз данных.

source: Handling Large Databases
ru: Управление большими базами данных

source: Some operating systems have maximum file size limits that cause problems when creating large <application>pg_dump</application> output files. Fortunately, <application>pg_dump</application> can write to the standard output, so you can use standard Unix tools to work around this potential problem. There are several possible methods:
ru: Некоторые операционные системы накладывают ограничение на максимальный размер файла, что приводит к проблемам при создании больших файлов с помощью <application>pg_dump</application>. К счастью, <application>pg_dump</application> может писать в стандартный вывод, так что вы можете использовать стандартные инструменты Unix для того, чтобы избежать потенциальных проблем. Вот несколько возможных методов:

source: Use compressed dumps.
ru: Используйте сжатые дампы.

source: pg_dump <replaceable class="parameter">dbname</replaceable> | gzip &gt; <replaceable class="parameter">filename</replaceable>.gz
ru: pg_dump <replaceable class="parameter">имя_базы</replaceable> | gzip &gt; <replaceable class="parameter">имя_файла</replaceable>.gz

source: gunzip -c <replaceable class="parameter">filename</replaceable>.gz | psql <replaceable class="parameter">dbname</replaceable>
ru: gunzip -c <replaceable class="parameter">имя_файла</replaceable>.gz | psql <replaceable class="parameter">имя_базы</replaceable>

source: cat <replaceable class="parameter">filename</replaceable>.gz | gunzip | psql <replaceable class="parameter">dbname</replaceable>
ru: cat <replaceable class="parameter">имя_файла</replaceable>.gz | gunzip | psql <replaceable class="parameter">имя_базы</replaceable>

source: You can use your favorite compression program, for example <application>gzip</application>: <placeholder-1/> Reload with: <placeholder-2/> or: <placeholder-3/>
ru: Вы можете использовать предпочитаемую программу сжатия, например <application>gzip</application>: <placeholder-1/> Затем загрузить сжатый дамп можно командой: <placeholder-2/> или: <placeholder-3/>

source: Use <command>split</command>.
ru: Используйте <command>split</command>.

source: pg_dump <replaceable class="parameter">dbname</replaceable> | split -b 1m - <replaceable class="parameter">filename</replaceable>
ru: pg_dump <replaceable class="parameter">имя_базы</replaceable> | split -b 1m - <replaceable class="parameter">имя_файла</replaceable>

source: cat <replaceable class="parameter">filename</replaceable>* | psql <replaceable class="parameter">dbname</replaceable>
ru: cat <replaceable class="parameter">имя_файла</replaceable>* | psql <replaceable class="parameter">имя_базы</replaceable>
