Repository: pluzanov/pg-doc-ru
Catalog: 9.6/backup.po
Languages: ru

source: Every time a new timeline is created, <productname>PostgreSQL</productname> creates a <quote>timeline history</quote> file that shows which timeline it branched off from and when. These history files are necessary to allow the system to pick the right WAL segment files when recovering from an archive that contains multiple timelines. Therefore, they are archived into the WAL archive area just like WAL segment files. The history files are just small text files, so it's cheap and appropriate to keep them around indefinitely (unlike the segment files which are large). You can, if you like, add comments to a history file to record your own notes about how and why this particular timeline was created. Such comments will be especially valuable when you have a thicket of different timelines as a result of experimentation.
ru: Каждый раз, когда образуется новая линия времени, <productname>PostgreSQL</productname> создаёт файл <quote>истории линии времени</quote>, показывающий, от какой линии времени ответвилась данная и когда. Эти файлы истории нужны, чтобы система могла выбрать правильные файлы-сегменты WAL при восстановлении из архива, содержащего несколько линий времени. Таким образом, они помещаются в область архивов WAL так же, как и файлы сегментов WAL. Файлы истории представляют собой небольшие текстовые файлы, так что они не занимают много места и их вполне можно сохранять неограниченно долго (в отличие от файлов сегментов, имеющих большой размер). Если хотите, вы можете добавлять в файл истории комментарии, свои собственные заметки о том, как и почему была создана эта конкретная линия времени. Такие комментарии будут особенно ценны, если в результате экспериментов у вас образуется хитросплетение разных линий времени.

source: The default behavior of recovery is to recover along the same timeline that was current when the base backup was taken. If you wish to recover into some child timeline (that is, you want to return to some state that was itself generated after a recovery attempt), you need to specify the target timeline ID in <filename>recovery.conf</filename>. You cannot recover into timelines that branched off earlier than the base backup.
ru: По умолчанию при восстановлении восстанавливается та же линия времени, которая была текущей при создании базовой резервной копии. Если вы хотите восстановить состояние на какой-либо дочерней линии времени, (то есть, хотите вернуться к некоторому состоянию, которое тоже было получено в результате попытки восстановления), вам необходимо указать идентификатор целевой линии времени в <filename>recovery.conf</filename>. Восстановить состояние в линии времени, ответвившейся раньше, чем была сделана базовая резервная копия, нельзя.

source: Tips and Examples
ru: Советы и примеры

source: Some tips for configuring continuous archiving are given here.
ru: Ниже мы дадим несколько советов по настройке непрерывного архивирования.

source: Standalone Hot Backups
ru: Обособленные горячие резервные копии

source: It is possible to use <productname>PostgreSQL</productname>'s backup facilities to produce standalone hot backups. These are backups that cannot be used for point-in-time recovery, yet are typically much faster to backup and restore than <application>pg_dump</application> dumps. (They are also much larger than <application>pg_dump</application> dumps, so in some cases the speed advantage might be negated.)
ru: Средства резервного копирования <productname>PostgreSQL</productname> можно применять для создания обособленных горячих копий. Эти копии нельзя использовать для восстановления на момент времени, но создаются и восстанавливаются они обычно гораздо быстрее, чем дампы <application>pg_dump</application>. (Они также намного больше, чем дампы <application>pg_dump</application>, так что в некоторых случаях выигрыш в скорости может быть потерян.)

source: As with base backups, the easiest way to produce a standalone hot backup is to use the <xref linkend="app-pgbasebackup"/> tool. If you include the <literal>-X</literal> parameter when calling it, all the transaction log required to use the backup will be included in the backup automatically, and no special action is required to restore the backup.
ru: Как и базовые резервные копии, обособленную горячую копию проще всего получить, используя программу <xref linkend="app-pgbasebackup"/>. Если вы вызовете эту программу с параметром <literal>-X</literal>, в эту копию автоматически будет включён весь журнал транзакций, необходимый для её использования, так что никакие особые действия для восстановления не потребуются.

source: If more flexibility in copying the backup files is needed, a lower level process can be used for standalone hot backups as well. To prepare for low level standalone hot backups, set <varname>wal_level</varname> to <literal>replica</literal> or higher, <varname>archive_mode</varname> to <literal>on</literal>, and set up an <varname>archive_command</varname> that performs archiving only when a <emphasis>switch file</emphasis> exists. For example: <placeholder-1/> This command will perform archiving when <filename>/var/lib/pgsql/backup_in_progress</filename> exists, and otherwise silently return zero exit status (allowing <productname>PostgreSQL</productname> to recycle the unwanted WAL file).
ru: Если нужна дополнительная гибкость в процессе копирования файлов, создавать обособленные горячие копии можно также на более низком уровне. Чтобы подготовиться к получению такой копии на низком уровне, установите в <varname>wal_level</varname> уровень <literal>replica</literal> (или выше), в <varname>archive_mode</varname> значение <literal>on</literal> и настройте команду <varname>archive_command</varname>, которая будет выполнять архивацию, только когда существует <emphasis>файл-переключатель</emphasis>. Например: <placeholder-1/> Данная команда выполнит архивацию, если будет существовать файл <filename>/var/lib/pgsql/backup_in_progress</filename>, а в противном случае просто вернёт нулевой код возврата (и тогда <productname>PostgreSQL</productname> сможет переработать ненужный файл WAL).

source: With this preparation, a backup can be taken using a script like the following: <placeholder-1/> The switch file <filename>/var/lib/pgsql/backup_in_progress</filename> is created first, enabling archiving of completed WAL files to occur. After the backup the switch file is removed. Archived WAL files are then added to the backup so that both base backup and all required WAL files are part of the same <application>tar</application> file. Please remember to add error handling to your backup scripts.
ru: После такой подготовки резервную копию можно создать, например таким скриптом: <placeholder-1/> Сначала создаётся файл-переключатель <filename>/var/lib/pgsql/backup_in_progress</filename>, включающий архивирование заполненных файлов WAL. По окончании резервного копирования файл-переключатель удаляется. Затем заархивированные файлы WAL тоже добавляются в резервную копию, так что в одном архиве <application>tar</application> оказывается и базовая резервная копия, и все требуемые файлы WAL. Пожалуйста, не забудьте добавить в ваши скрипты резервного копирования обработку ошибок.

source: Compressed Archive Logs
ru: Сжатие журналов в архиве

source: If archive storage size is a concern, you can use <application>gzip</application> to compress the archive files: <placeholder-1/> You will then need to use <application>gunzip</application> during recovery: <placeholder-2/>
ru: Если размер архива имеет большое значение, можно воспользоваться <application>gzip</application> и сжимать архивные файлы: <placeholder-1/> При этом для восстановления придётся использовать <application>gunzip</application>: <placeholder-2/>

source: <varname>archive_command</varname> Scripts
ru: Скрипты <varname>archive_command</varname>

source: Many people choose to use scripts to define their <varname>archive_command</varname>, so that their <filename>postgresql.conf</filename> entry looks very simple: <placeholder-1/> Using a separate script file is advisable any time you want to use more than a single command in the archiving process. This allows all complexity to be managed within the script, which can be written in a popular scripting language such as <application>bash</application> or <application>perl</application>.
ru: Многие в качестве команды <varname>archive_command</varname> используют скрипты, так что запись в <filename>postgresql.conf</filename> оказывается очень простой: <placeholder-1/> Применять отдельный файла скрипта целесообразно всегда, когда вы хотите использовать в процедуре архивирования несколько команд. Это позволяет управлять сложностью этой процедуры в рамках одного скрипта, который можно написать на любом популярном языке скриптов, например на <application>bash</application> или <application>perl</application>.

source: Copying data to secure off-site data storage
ru: Копирование данных в безопасное внешнее хранилище

source: Batching WAL files so that they are transferred every three hours, rather than one at a time
ru: Пакетная обработка файлов WAL, чтобы они передавались каждые три часа, а не по одному

source: Interfacing with other backup and recovery software
ru: Взаимодействие с другими приложениями резервного копирования и восстановления

source: Interfacing with monitoring software to report errors
ru: Взаимодействие со средствами мониторинга, регистрация ошибок

source: Examples of requirements that might be solved within a script include: <placeholder-1/>
ru: В частности, с помощью скриптов можно решить такие задачи: <placeholder-1/>

source: When using an <varname>archive_command</varname> script, it's desirable to enable <xref linkend="guc-logging-collector"/>. Any messages written to <systemitem>stderr</systemitem> from the script will then appear in the database server log, allowing complex configurations to be diagnosed easily if they fail.
ru: Когда в <varname>archive_command</varname> используется скрипт, желательно включить <xref linkend="guc-logging-collector"/>. Тогда все сообщения, которые скрипт выведет в <systemitem>stderr</systemitem>, будут записываться в журнал сервера баз данных, что позволит легко диагностировать ошибки в сложных конфигурациях.

source: Caveats
ru: Ограничения

source: Operations on hash indexes are not presently WAL-logged, so replay will not update these indexes. This will mean that any new inserts will be ignored by the index, updated rows will apparently disappear and deleted rows will still retain pointers. In other words, if you modify a table with a hash index on it then you will get incorrect query results on a standby server. When recovery completes it is recommended that you manually <xref linkend="sql-reindex"/> each such index after completing a recovery operation.
ru: Операции с хеш-индексами в настоящее время не проходят через WAL, так что при воспроизведении WAL эти индексы не меняются. Это означает, что добавление данных будет игнорироваться индексом, изменяемые строки будут исчезать, а на удалённые строки сохранятся ссылки. Другими словами, если вы изменяете таблицу, для которой есть хеш-индекс, на резервном сервере вы будете получать некорректные результаты запросов. Поэтому по завершении восстановления рекомендуется вручную выполнить <xref linkend="sql-reindex"/> для каждого такого индекса.

source: If a <xref linkend="sql-createdatabase"/> command is executed while a base backup is being taken, and then the template database that the <command>CREATE DATABASE</command> copied is modified while the base backup is still in progress, it is possible that recovery will cause those modifications to be propagated into the created database as well. This is of course undesirable. To avoid this risk, it is best not to modify any template databases while taking a base backup.
ru: Если во время создания базовой резервной копии выполняется команда <xref linkend="sql-createdatabase"/>, а затем база-шаблон, задействованная в <command>CREATE DATABASE</command>, изменяется, пока продолжается копирование, возможно, что при восстановлении эти изменения распространятся также и на созданную базу данных. Конечно, это нежелательно. Во избежание подобных рисков, лучше всего не изменять никакие базы-шаблоны во время получения базовой резервной копии.

source: <xref linkend="sql-createtablespace"/> commands are WAL-logged with the literal absolute path, and will therefore be replayed as tablespace creations with the same absolute path. This might be undesirable if the log is being replayed on a different machine. It can be dangerous even if the log is being replayed on the same machine, but into a new data directory: the replay will still overwrite the contents of the original tablespace. To avoid potential gotchas of this sort, the best practice is to take a new base backup after creating or dropping tablespaces.
ru: Команды <xref linkend="sql-createtablespace"/> записываются в WAL с абсолютным путём и, таким образом, при воспроизведении WAL будут выполнены с тем же абсолютным путём. Это может быть нежелательно, если журнал воспроизводится на другой машине. Но опасность есть, даже если журнал воспроизводится на той же машине, но в другом каталоге данных: при воспроизведении будет так же перезаписано содержимое исходных табличных пространств. Чтобы избежать потенциальных проблем такого рода, лучше всего делать новую базовую резервную копию после создания или удаления табличных пространств.

source: At this writing, there are several limitations of the continuous archiving technique. These will probably be fixed in future releases: <placeholder-1/>
ru: На момент написания документации методика непрерывного архивирования имеет несколько ограничений. Они могут быть ликвидированы в будущих версиях: <placeholder-1/>

source: It should also be noted that the default <acronym>WAL</acronym> format is fairly bulky since it includes many disk page snapshots. These page snapshots are designed to support crash recovery, since we might need to fix partially-written disk pages. Depending on your system hardware and software, the risk of partial writes might be small enough to ignore, in which case you can significantly reduce the total volume of archived logs by turning off page snapshots using the <xref linkend="guc-full-page-writes"/> parameter. (Read the notes and warnings in <xref linkend="wal"/> before you do so.) Turning off page snapshots does not prevent use of the logs for PITR operations. An area for future development is to compress archived WAL data by removing unnecessary page copies even when <varname>full_page_writes</varname> is on. In the meantime, administrators might wish to reduce the number of page snapshots included in WAL by increasing the checkpoint interval parameters as much as feasible.
ru: Также следует заметить, что стандартный формат <acronym>WAL</acronym> не очень компактный, так как включает много снимков дисковых страниц. Эти снимки страниц предназначены для поддержки восстановления после сбоя, на случай, если понадобится исправить страницы, записанные на диск частично. В зависимости от аппаратного и программного обеспечения вашей системы, риск частичной записи может быть достаточно мал, так что его можно игнорировать, и в этом случае можно существенно уменьшить общий объём архивируемых журналов, выключив снимки страниц с помощью параметра <xref linkend="guc-full-page-writes"/>. (Прежде чем делать это, прочтите замечания и предупреждения в <xref remap="6" linkend="wal"/>.) Выключение снимков страниц не препятствует использованию журналов для восстановления PITR. Одним из направлений разработки в будущем является сжатие архивируемых данных WAL, путём удаления ненужных копий страниц даже при включённом режиме <varname>full_page_writes</varname>. Тем временем администраторы могут сократить количество снимков страниц, включаемых в WAL, увеличив параметры интервала контрольных точек в разумных пределах.
