Repository: pluzanov/pg-doc-ru
Catalog: 9.6/backup.po
Languages: ru

source: The <command>split</command> command allows you to split the output into smaller files that are acceptable in size to the underlying file system. For example, to make chunks of 1 megabyte: <placeholder-1/> Reload with: <placeholder-2/>
ru: Команда <command>split</command> может разбивать выводимые данные на небольшие файлы, размер которых удовлетворяет ограничению нижележащей файловой системы. Например, чтобы получить части по 1 мегабайту: <placeholder-1/> Восстановить их можно так: <placeholder-2/>

source: Use <application>pg_dump</application>'s custom dump format.
ru: Используйте специальный формат дампа <application>pg_dump</application>.

source: pg_dump -Fc <replaceable class="parameter">dbname</replaceable> &gt; <replaceable class="parameter">filename</replaceable>
ru: pg_dump -Fc <replaceable class="parameter">имя_базы</replaceable> &gt; <replaceable class="parameter">имя_файла</replaceable>

source: pg_restore -d <replaceable class="parameter">dbname</replaceable> <replaceable class="parameter">filename</replaceable>
ru: pg_restore -d <replaceable class="parameter">имя_базы</replaceable> <replaceable class="parameter">имя_файла</replaceable>

source: If <productname>PostgreSQL</productname> was built on a system with the <application>zlib</application> compression library installed, the custom dump format will compress data as it writes it to the output file. This will produce dump file sizes similar to using <command>gzip</command>, but it has the added advantage that tables can be restored selectively. The following command dumps a database using the custom dump format: <placeholder-1/> A custom-format dump is not a script for <application>psql</application>, but instead must be restored with <application>pg_restore</application>, for example: <placeholder-2/> See the <xref linkend="app-pgdump"/> and <xref linkend="app-pgrestore"/> reference pages for details.
ru: Если при сборке <productname>PostgreSQL</productname> была подключена библиотека <application>zlib</application>, дамп в специальном формате будет записываться в файл в сжатом виде. В таком формате размер файла дампа будет близок к размеру, полученному с применением <command>gzip</command>, но он лучше тем, что позволяет восстанавливать таблицы выборочно. Следующая команда выгружает базу данных в специальном формате: <placeholder-1/> Дамп в специальном формате не является скриптом для <application>psql</application> и должен восстанавливаться с помощью команды <application>pg_restore</application>, например: <placeholder-2/> За подробностями обратитесь к справке по командам <xref linkend="app-pgdump"/> и <xref linkend="app-pgrestore"/>.

source: For very large databases, you might need to combine <command>split</command> with one of the other two approaches.
ru: Для очень больших баз данных может понадобиться сочетать <command>split</command> с одним из двух других методов.

source: Use <application>pg_dump</application>'s parallel dump feature.
ru: Используйте возможность параллельной выгрузки в <application>pg_dump</application>.

source: pg_dump -j <replaceable class="parameter">num</replaceable> -F d -f <replaceable class="parameter">out.dir</replaceable> <replaceable class="parameter">dbname</replaceable>
ru: pg_dump -j <replaceable class="parameter">число</replaceable> -F d -f <replaceable class="parameter">выходной_каталог</replaceable> <replaceable class="parameter">имя_базы</replaceable>

source: To speed up the dump of a large database, you can use <application>pg_dump</application>'s parallel mode. This will dump multiple tables at the same time. You can control the degree of parallelism with the <command>-j</command> parameter. Parallel dumps are only supported for the "directory" archive format. <placeholder-1/> You can use <command>pg_restore -j</command> to restore a dump in parallel. This will work for any archive of either the "custom" or the "directory" archive mode, whether or not it has been created with <command>pg_dump -j</command>.
ru: Чтобы ускорить выгрузку большой БД, вы можете использовать режим параллельной выгрузки в <application>pg_dump</application>. При этом одновременно будут выгружаться несколько таблиц. Управлять числом параллельных заданий позволяет параметр <command>-j</command>. Параллельная выгрузка поддерживается только для формата архива в каталоге. <placeholder-1/> Вы также можете восстановить копию в параллельном режиме с помощью <command>pg_restore -j</command>. Это поддерживается для любого архива в формате каталога или специальном формате, даже если архив создавался не командой <command>pg_dump -j</command>.

source: File System Level Backup
ru: Резервное копирование на уровне файлов

source: An alternative backup strategy is to directly copy the files that <productname>PostgreSQL</productname> uses to store the data in the database; <xref linkend="creating-cluster"/> explains where these files are located. You can use whatever method you prefer for doing file system backups; for example: <placeholder-1/>
ru: Альтернативной стратегией резервного копирования является непосредственное копирование файлов, в которых <productname>PostgreSQL</productname> хранит содержимое базы данных; в <xref remap="6" linkend="creating-cluster"/> рассказывается, где находятся эти файлы. Вы можете использовать любой способ копирования файлов по желанию, например: <placeholder-1/>

source: The database server <emphasis>must</emphasis> be shut down in order to get a usable backup. Half-way measures such as disallowing all connections will <emphasis>not</emphasis> work (in part because <command>tar</command> and similar tools do not take an atomic snapshot of the state of the file system, but also because of internal buffering within the server). Information about stopping the server can be found in <xref linkend="server-shutdown"/>. Needless to say, you also need to shut down the server before restoring the data.
ru: Чтобы полученная резервная копия была годной, сервер баз данных <emphasis>должен</emphasis> быть остановлен. Такие полумеры, как запрещение всех подключений к серверу, работать <emphasis>не</emphasis> будут (отчасти потому что <command>tar</command> и подобные средства не получают мгновенный снимок состояния файловой системы, но ещё и потому, что в сервере есть внутренние буферы). Узнать о том, как остановить сервер, можно в <xref remap="6" linkend="server-shutdown"/>. Необходимо отметить, что сервер нужно будет остановить и перед восстановлением данных.

source: If you have dug into the details of the file system layout of the database, you might be tempted to try to back up or restore only certain individual tables or databases from their respective files or directories. This will <emphasis>not</emphasis> work because the information contained in these files is not usable without the commit log files, <filename>pg_clog/*</filename>, which contain the commit status of all transactions. A table file is only usable with this information. Of course it is also impossible to restore only a table and the associated <filename>pg_clog</filename> data because that would render all other tables in the database cluster useless. So file system backups only work for complete backup and restoration of an entire database cluster.
ru: Если вы ознакомились с внутренней организацией базы данных в файловой системе, у вас может возникнуть соблазн скопировать или восстановить только отдельные таблицы или базы данных в соответствующих файлах или каталогах. Это <emphasis>не</emphasis> будет работать, потому что информацию, содержащуюся в этих файлах, нельзя использовать без файлов журналов транзакций, <filename>pg_clog/*</filename>, которые содержат состояние всех транзакций. Без этих данных файлы таблиц непригодны к использованию. Разумеется также невозможно восстановить только одну таблицу и соответствующие данные <filename>pg_clog</filename>, потому что в результате нерабочими станут все другие таблицы в кластере баз данных. Таким образом, копирование на уровне файловой системы будет работать, только если выполняется полное копирование и восстановление всего кластера баз данных.

source: There are two restrictions, however, which make this method impractical, or at least inferior to the <application>pg_dump</application> method: <placeholder-1/>
ru: Однако, существуют два ограничения, которые делают этот метод непрактичным или как минимум менее предпочтительным по сравнению с <application>pg_dump</application>: <placeholder-1/>

source: An alternative file-system backup approach is to make a <quote>consistent snapshot</quote> of the data directory, if the file system supports that functionality (and you are willing to trust that it is implemented correctly). The typical procedure is to make a <quote>frozen snapshot</quote> of the volume containing the database, then copy the whole data directory (not just parts, see above) from the snapshot to a backup device, then release the frozen snapshot. This will work even while the database server is running. However, a backup created in this way saves the database files in a state as if the database server was not properly shut down; therefore, when you start the database server on the backed-up data, it will think the previous server instance crashed and will replay the WAL log. This is not a problem; just be aware of it (and be sure to include the WAL files in your backup). You can perform a <command>CHECKPOINT</command> before taking the snapshot to reduce recovery time.
ru: Ещё один подход к резервному копированию файловой системы заключается в создании <quote>целостного снимка</quote> каталога с данными, если это поддерживает файловая система (и вы склонны считать, что эта функциональность реализована корректно). Типичная процедура включает создание <quote>замороженного снимка</quote> тома, содержащего базу данных, затем копирование всего каталога с данными (а не его избранных частей, см. выше) из этого снимка на устройство резервного копирования, и наконец освобождение замороженного снимка. При этом сервер базы данных может не прекращать свою работу. Однако резервная копия, созданная таким способом, содержит файлы базы данных в таком состоянии, как если бы сервер баз данных не был остановлен штатным образом; таким образом, когда вы запустите сервер баз данных с сохранёнными данными, он будет считать, что до этого процесс сервера был прерван аварийно, и будет накатывать журнал WAL. Это не проблема, просто имейте это в виду (и обязательно включите файлы WAL в резервную копию). Чтобы сократить время восстановления, можно выполнить команду <command>CHECKPOINT</command> перед созданием снимка.

source: If your database is spread across multiple file systems, there might not be any way to obtain exactly-simultaneous frozen snapshots of all the volumes. For example, if your data files and WAL log are on different disks, or if tablespaces are on different file systems, it might not be possible to use snapshot backup because the snapshots <emphasis>must</emphasis> be simultaneous. Read your file system documentation very carefully before trusting the consistent-snapshot technique in such situations.
ru: Если ваша база данных размещена в нескольких файловых системах, получить в точности одновременно замороженные снимки всех томов может быть невозможно. Например, если файлы данных и журналы WAL находятся на разных дисках или табличные пространства расположены в разных файловых системах, резервное копирование со снимками может быть неприменимо, потому что снимки <emphasis>должны</emphasis> быть одновременными. В таких ситуациях очень внимательно изучите документацию по вашей файловой системе, прежде чем довериться технологии согласованных снимков.

source: If simultaneous snapshots are not possible, one option is to shut down the database server long enough to establish all the frozen snapshots. Another option is to perform a continuous archiving base backup (<xref linkend="backup-base-backup"/>) because such backups are immune to file system changes during the backup. This requires enabling continuous archiving just during the backup process; restore is done using continuous archive recovery (<xref linkend="backup-pitr-recovery"/>).
ru: Если одновременные снимки невозможны, остаётся вариант с остановкой сервера баз данных на время, достаточное для получения всех замороженных снимков. Другое возможное решение — получить базовую копию путём непрерывного архивирования (см. <xref remap="4" linkend="backup-base-backup"/>), такие резервные копии не могут пострадать от изменений файловой системы в процессе резервного копирования. Для этого требуется включить непрерывное архивирование только на время резервного копирования; для восстановления применяется процедура восстановления из непрерывного архива (<xref linkend="backup-pitr-recovery"/>).

source: Another option is to use <application>rsync</application> to perform a file system backup. This is done by first running <application>rsync</application> while the database server is running, then shutting down the database server long enough to do an <command>rsync --checksum</command>. (<option>--checksum</option> is necessary because <command>rsync</command> only has file modification-time granularity of one second.) The second <application>rsync</application> will be quicker than the first, because it has relatively little data to transfer, and the end result will be consistent because the server was down. This method allows a file system backup to be performed with minimal downtime.
ru: Ещё один вариант — копировать содержимое файловой системы с помощью <application>rsync</application>. Для этого <application>rsync</application> запускается сначала во время работы сервера баз данных, а затем сервер останавливается на время, достаточное для запуска <command>rsync --checksum</command>. (Ключ <option>--checksum</option> необходим, потому что <command>rsync</command> различает время только с точностью до секунд.) Во второй раз <application>rsync</application> отработает быстрее, чем в первый, потому что скопировать надо будет относительно немного данных; и в итоге будет получен согласованный результат, так как сервер был остановлен. Данный метод позволяет получить копию на уровне файловой системы с минимальным временем простоя.

source: Note that a file system backup will typically be larger than an SQL dump. (<application>pg_dump</application> does not need to dump the contents of indexes for example, just the commands to recreate them.) However, taking a file system backup might be faster.
ru: Обратите внимание, что размер копии на уровне файлов обычно больше, чем дампа SQL. (Программе <application>pg_dump</application> не нужно, например, записывать содержимое индексов, достаточно команд для их пересоздания). Однако копирование на уровне файлов может выполняться быстрее.

source: Continuous Archiving and Point-in-Time Recovery (PITR)
ru: Непрерывное архивирование и восстановление на момент времени (Point-in-Time Recovery, PITR)

source: <primary>continuous archiving</primary>
ru: <primary>непрерывное архивирование</primary>

source: <primary>point-in-time recovery</primary>
ru: <primary>восстановление на момент времени</primary>

source: We do not need a perfectly consistent file system backup as the starting point. Any internal inconsistency in the backup will be corrected by log replay (this is not significantly different from what happens during crash recovery). So we do not need a file system snapshot capability, just <application>tar</application> or a similar archiving tool.
ru: В качестве начальной точки для восстановления необязательно иметь полностью согласованную копию на уровне файлов. Внутренняя несогласованность копии будет исправлена при воспроизведении журнала (практически то же самое происходит при восстановлении после краха). Таким образом, согласованный снимок файловой системы не требуется, вполне можно использовать <application>tar</application> или похожие средства архивации.

source: Since we can combine an indefinitely long sequence of WAL files for replay, continuous backup can be achieved simply by continuing to archive the WAL files. This is particularly valuable for large databases, where it might not be convenient to take a full backup frequently.
ru: Поскольку при воспроизведении можно обрабатывать неограниченную последовательность файлов WAL, непрерывную резервную копию можно получить, просто продолжая архивировать файлы WAL. Это особенно ценно для больших баз данных, полные резервные копии которых делать как минимум неудобно.

source: It is not necessary to replay the WAL entries all the way to the end. We could stop the replay at any point and have a consistent snapshot of the database as it was at that time. Thus, this technique supports <firstterm>point-in-time recovery</firstterm>: it is possible to restore the database to its state at any time since your base backup was taken.
ru: Воспроизводить все записи WAL до самого конца нет необходимости. Воспроизведение можно остановить в любой точке и получить целостный снимок базы данных на этот момент времени. Таким образом, данная технология поддерживает <firstterm>восстановление на момент времени</firstterm>: можно восстановить состояние базы данных на любое время с момента создания резервной копии.

source: If we continuously feed the series of WAL files to another machine that has been loaded with the same base backup file, we have a <firstterm>warm standby</firstterm> system: at any point we can bring up the second machine and it will have a nearly-current copy of the database.
ru: Если непрерывно передавать последовательность файлов WAL другому серверу, получившему данные из базовой копии того же кластера, получается система <firstterm>тёплого резерва</firstterm>: в любой момент мы можем запустить второй сервер и он будет иметь практически текущую копию баз данных.

source: At all times, <productname>PostgreSQL</productname> maintains a <firstterm>write ahead log</firstterm> (WAL) in the <filename>pg_xlog/</filename> subdirectory of the cluster's data directory. The log records every change made to the database's data files. This log exists primarily for crash-safety purposes: if the system crashes, the database can be restored to consistency by <quote>replaying</quote> the log entries made since the last checkpoint. However, the existence of the log makes it possible to use a third strategy for backing up databases: we can combine a file-system-level backup with backup of the WAL files. If recovery is needed, we restore the file system backup and then replay from the backed-up WAL files to bring the system to a current state. This approach is more complex to administer than either of the previous approaches, but it has some significant benefits: <placeholder-1/>
ru: Всё время в процессе работы <productname>PostgreSQL</productname> ведёт <firstterm>журнал упреждающей записи</firstterm> (WAL), который расположен в подкаталоге <filename>pg_xlog/</filename> каталога с данными кластера баз данных. В этот журнал записываются все изменения, вносимые в файлы данных. Прежде всего, журнал существует для безопасного восстановления после краха сервера: если происходит крах, целостность СУБД может быть восстановлена в результате <quote>воспроизведения</quote> записей, зафиксированных после последней контрольной точки. Однако наличие журнала делает возможным использование третьей стратегии копирования баз данных: можно сочетать резервное копирование на уровне файловой системы с копированием файлов WAL. Если потребуется восстановить данные, мы можем восстановить копию файлов, а затем воспроизвести журнал из скопированных файлов WAL, и таким образом привести систему в нужное состояние. Такой подход более сложен для администрирования, чем любой из описанных выше, но он имеет значительные преимущества: <placeholder-1/>

source: <application>pg_dump</application> and <application>pg_dumpall</application> do not produce file-system-level backups and cannot be used as part of a continuous-archiving solution. Such dumps are <emphasis>logical</emphasis> and do not contain enough information to be used by WAL replay.
ru: Программы <application>pg_dump</application> и <application>pg_dumpall</application> не создают копии на уровне файловой системы и не могут применяться как часть решения по непрерывной архивации. Создаваемые ими копии являются логическими и не содержат информации, необходимой для воспроизведения WAL.

source: As with the plain file-system-backup technique, this method can only support restoration of an entire database cluster, not a subset. Also, it requires a lot of archival storage: the base backup might be bulky, and a busy system will generate many megabytes of WAL traffic that have to be archived. Still, it is the preferred backup technique in many situations where high reliability is needed.
ru: Как и обычное резервное копирование файловой системы, этот метод позволяет восстанавливать только весь кластер баз данных целиком, но не его части. Кроме того, для архивов требуется большое хранилище: базовая резервная копия может быть объёмной, а нагруженные системы будут генерировать многие мегабайты трафика WAL, который необходимо архивировать. Тем не менее, этот метод резервного копирования предпочитается во многих ситуациях, где необходима высокая надёжность.

source: To recover successfully using continuous archiving (also called <quote>online backup</quote> by many database vendors), you need a continuous sequence of archived WAL files that extends back at least as far as the start time of your backup. So to get started, you should set up and test your procedure for archiving WAL files <emphasis>before</emphasis> you take your first base backup. Accordingly, we first discuss the mechanics of archiving WAL files.
ru: Для успешного восстановления с применением непрерывного архивирования (также называемого <quote>оперативным резервным копированием</quote> многими разработчиками СУБД), вам необходима непрерывная последовательность заархивированных файлов WAL, начинающаяся не позже, чем с момента начала копирования. Так что для начала вы должны настроить и протестировать процедуру архивирования файлов WAL <emphasis>до того</emphasis>, как получите первую базовую копию. Соответственно, сначала мы обсудим механику архивирования файлов WAL.

source: Setting Up WAL Archiving
ru: Настройка архивирования WAL
