Repository: pluzanov/pg-doc-ru
Catalog: 9.6/backup.po
Languages: ru

source: In an abstract sense, a running <productname>PostgreSQL</productname> system produces an indefinitely long sequence of WAL records. The system physically divides this sequence into WAL <firstterm>segment files</firstterm>, which are normally 16MB apiece (although the segment size can be altered when building <productname>PostgreSQL</productname>). The segment files are given numeric names that reflect their position in the abstract WAL sequence. When not using WAL archiving, the system normally creates just a few segment files and then <quote>recycles</quote> them by renaming no-longer-needed segment files to higher segment numbers. It's assumed that segment files whose contents precede the checkpoint-before-last are no longer of interest and can be recycled.
ru: В абстрактном смысле, запущенная СУБД <productname>PostgreSQL</productname> производит неограниченно длинную последовательность записей WAL. СУБД физически делит эту последовательность на <firstterm>файлы-сегменты</firstterm> WAL, которые обычно имеют размер в 16 МиБ (хотя размер сегмента может быть изменён при сборке <productname>PostgreSQL</productname>). Файлы-сегменты получают цифровые имена, которые отражают их позицию в абстрактной последовательности WAL. Когда архивирование WAL не применяется, система обычно создаёт только несколько файлов-сегментов и затем <quote>перерабатывает</quote> их, меняя номер в имени более не нужного файла-сегмента на больший. Предполагается, что файлы-сегменты, чьё содержимое предшествует последней контрольной точке, уже не представляют интереса и могут быть переработаны.

source: When archiving WAL data, we need to capture the contents of each segment file once it is filled, and save that data somewhere before the segment file is recycled for reuse. Depending on the application and the available hardware, there could be many different ways of <quote>saving the data somewhere</quote>: we could copy the segment files to an NFS-mounted directory on another machine, write them onto a tape drive (ensuring that you have a way of identifying the original name of each file), or batch them together and burn them onto CDs, or something else entirely. To provide the database administrator with flexibility, <productname>PostgreSQL</productname> tries not to make any assumptions about how the archiving will be done. Instead, <productname>PostgreSQL</productname> lets the administrator specify a shell command to be executed to copy a completed segment file to wherever it needs to go. The command could be as simple as a <literal>cp</literal>, or it could invoke a complex shell script &mdash; it's all up to you.
ru: При архивировании данных WAL необходимо считывать содержимое каждого файла-сегмента, как только он заполняется, и сохранять эти данные куда-то, прежде чем файл-сегмент будет переработан и использован повторно. В зависимости от применения и доступного аппаратного обеспечения, возможны разные способы <quote>сохранить данные куда-то</quote>: можно скопировать файлы-сегменты в смонтированный по NFS каталог на другую машину, записать их на ленту (убедившись, что у вас есть способ идентифицировать исходное имя каждого файла) или собрать их в пакет и записать на CD, либо какие-то совсем другие варианты. Чтобы у администратора баз данных была гибкость в этом плане, <productname>PostgreSQL</productname> пытается не делать каких-либо предположений о том, как будет выполняться архивация. Вместо этого, <productname>PostgreSQL</productname> позволяет администратору указать команду оболочки, которая будет запускаться для копирования завершённого файла-сегмента в нужное место. Эта команда может быть простой как <literal>cp</literal>, а может вызывать сложный скрипт оболочки &mdash; это решать вам.

source: To enable WAL archiving, set the <xref linkend="guc-wal-level"/> configuration parameter to <literal>replica</literal> or higher, <xref linkend="guc-archive-mode"/> to <literal>on</literal>, and specify the shell command to use in the <xref linkend="guc-archive-command"/> configuration parameter. In practice these settings will always be placed in the <filename>postgresql.conf</filename> file. In <varname>archive_command</varname>, <literal>%p</literal> is replaced by the path name of the file to archive, while <literal>%f</literal> is replaced by only the file name. (The path name is relative to the current working directory, i.e., the cluster's data directory.) Use <literal>%%</literal> if you need to embed an actual <literal>%</literal> character in the command. The simplest useful command is something like: <placeholder-1/> which will copy archivable WAL segments to the directory <filename>/mnt/server/archivedir</filename>. (This is an example, not a recommendation, and might not work on all platforms.) After the <literal>%p</literal> and <literal>%f</literal> parameters have been replaced, the actual command executed might look like this: <placeholder-2/> A similar command will be generated for each new file to be archived.
ru: Чтобы включить архивирование WAL, установите в параметре конфигурации <xref linkend="guc-wal-level"/> уровень <literal>replica</literal> (или выше), в <xref linkend="guc-archive-mode"/> — значение <literal>on</literal>, и задайте желаемую команду оболочки в параметре <xref linkend="guc-archive-command"/>. На практике эти параметры всегда задаются в файле <filename>postgresql.conf</filename>. В <varname>archive_command</varname> символы <literal>%p</literal> заменяются полным путём к файлу, подлежащему архивации, а <literal>%f</literal> заменяются только именем файла. (Путь задаётся относительно текущего рабочего каталога, т. е. каталога данных кластера). Если в команду нужно включить сам символ <literal>%</literal>, запишите <literal>%%</literal>. Простейшая команда, которая может быть полезна: <placeholder-1/> Она будет копировать архивируемые сегменты WAL в каталог /mnt/server/archivedir. (Команда дана как пример, а не как рекомендация, и может не работать на всех платформах.) После замены параметров <literal>%p</literal> и <literal>%f</literal> фактически запускаемая команда может выглядеть так: <placeholder-2/> Подобная команда будет генерироваться для каждого следующего архивируемого файла.

source: The archive command will be executed under the ownership of the same user that the <productname>PostgreSQL</productname> server is running as. Since the series of WAL files being archived contains effectively everything in your database, you will want to be sure that the archived data is protected from prying eyes; for example, archive into a directory that does not have group or world read access.
ru: Команда архивирования будет запущена от имени того же пользователя, от имени которого работает сервер <productname>PostgreSQL</productname>. Поскольку архивируемые последовательности файлов WAL фактически содержат всё, что есть в вашей базе данных, вам нужно будет защитить архивируемые данные от посторонних глаз; например, сохраните архив в каталог, чтение которого запрещено для группы и остальных пользователей.

source: It is important that the archive command return zero exit status if and only if it succeeds. Upon getting a zero result, <productname>PostgreSQL</productname> will assume that the file has been successfully archived, and will remove or recycle it. However, a nonzero status tells <productname>PostgreSQL</productname> that the file was not archived; it will try again periodically until it succeeds.
ru: Важно, чтобы команда архивирования возвращала нулевой код завершения, если и только если она завершилась успешно. Получив нулевой результат, <productname>PostgreSQL</productname> будет полагать, что файл успешно заархивирован и удалит его или переработает. Однако, ненулевой код состояния скажет <productname>PostgreSQL</productname>, что файл не заархивирован; попытки заархивировать его будут периодически повторяться, пока это не удастся.

source: The archive command should generally be designed to refuse to overwrite any pre-existing archive file. This is an important safety feature to preserve the integrity of your archive in case of administrator error (such as sending the output of two different servers to the same archive directory).
ru: Команда архивирования обычно разрабатывается так, чтобы не допускать перезаписи любых существующих архивных файлов. Это важная мера безопасности, позволяющая сохранить целостность архива в случае ошибки администратора (например, если архивируемые данные двух разных серверов будут сохраняться в одном каталоге).

source: It is advisable to test your proposed archive command to ensure that it indeed does not overwrite an existing file, <emphasis>and that it returns nonzero status in this case</emphasis>. The example command above for Unix ensures this by including a separate <command>test</command> step. On some Unix platforms, <command>cp</command> has switches such as <option>-i</option> that can be used to do the same thing less verbosely, but you should not rely on these without verifying that the right exit status is returned. (In particular, GNU <command>cp</command> will return status zero when <option>-i</option> is used and the target file already exists, which is <emphasis>not</emphasis> the desired behavior.)
ru: Рекомендуется протестировать команду архивирования, чтобы убедиться, что она действительно не перезаписывает существующие файлы, и что она <emphasis>возвращает ненулевое состояние в этом случае</emphasis>. В показанной выше команде для Unix для этого добавлен отдельный шаг <command>test</command>. На некоторых платформах Unix у <command>cp</command> есть ключ <option>-i</option>, который позволяет сделать то же, но менее явно; но не проверив, какой код состояния при этом возвращается, полагаться на этот ключ не следует. (В частности, GNU <command>cp</command> возвратит нулевой код состояния, если используется ключ <option>-i</option> и целевой файл существует, а это <emphasis>не то</emphasis>, что нужно.)

source: While designing your archiving setup, consider what will happen if the archive command fails repeatedly because some aspect requires operator intervention or the archive runs out of space. For example, this could occur if you write to tape without an autochanger; when the tape fills, nothing further can be archived until the tape is swapped. You should ensure that any error condition or request to a human operator is reported appropriately so that the situation can be resolved reasonably quickly. The <filename>pg_xlog/</filename> directory will continue to fill with WAL segment files until the situation is resolved. (If the file system containing <filename>pg_xlog/</filename> fills up, <productname>PostgreSQL</productname> will do a PANIC shutdown. No committed transactions will be lost, but the database will remain offline until you free some space.)
ru: Разрабатывая схему архивирования, подумайте, что произойдёт, если команда архивирования начнёт постоянно выдавать ошибку, потому что требуется вмешательство оператора или для архивирования не хватает места. Например, это может произойти, если вы записываете архивы на ленточное устройство без механизма автозамены; когда лента заполняется полностью, больше ничего архивироваться не будет, пока вы не замените кассету. Вы должны убедиться, что любые возникающие ошибки или обращения к человеку (оператору), обрабатываются так, чтобы проблема решалась достаточно быстро. Пока она не разрешится, каталог <filename>pg_xlog/</filename> продолжит наполняться файлами-сегментами WAL. (Если файловая система, в которой находится каталог <filename>pg_xlog/</filename> заполнится до конца, <productname>PostgreSQL</productname> завершит свою работу аварийно. Зафиксированные транзакции не потеряются, но база данных не будет работать, пока вы не освободите место.)

source: The speed of the archiving command is unimportant as long as it can keep up with the average rate at which your server generates WAL data. Normal operation continues even if the archiving process falls a little behind. If archiving falls significantly behind, this will increase the amount of data that would be lost in the event of a disaster. It will also mean that the <filename>pg_xlog/</filename> directory will contain large numbers of not-yet-archived segment files, which could eventually exceed available disk space. You are advised to monitor the archiving process to ensure that it is working as you intend.
ru: Не важно, с какой скоростью работает команда архивирования, если только она не ниже средней скорости, с которой сервер генерирует записи WAL. Обычно работа продолжается, даже если процесс архивирования немного отстаёт. Если же архивирование отстаёт значительно, это приводит к увеличению объёма данных, которые могут быть потеряны в случае аварии. При этом каталог <filename>pg_xlog/</filename> будет содержать большое количество ещё не заархивированных файлов-сегментов, которые в конце концов могут занять всё доступное дисковое пространство. Поэтому рекомендуется контролировать процесс архивации и следить за тем, чтобы он выполнялся как задумано.

source: In writing your archive command, you should assume that the file names to be archived can be up to 64 characters long and can contain any combination of ASCII letters, digits, and dots. It is not necessary to preserve the original relative path (<literal>%p</literal>) but it is necessary to preserve the file name (<literal>%f</literal>).
ru: При написании команды архивирования вы должны иметь в виду, что имена файлов для архивирования могут иметь длину до 64 символов и содержать любые комбинации из цифр, точек и букв ASCII. Сохранять исходный относительный путь (<literal>%p</literal>) необязательно, но необходимо сохранять имя файла (<literal>%f</literal>).

source: Note that although WAL archiving will allow you to restore any modifications made to the data in your <productname>PostgreSQL</productname> database, it will not restore changes made to configuration files (that is, <filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename> and <filename>pg_ident.conf</filename>), since those are edited manually rather than through SQL operations. You might wish to keep the configuration files in a location that will be backed up by your regular file system backup procedures. See <xref linkend="runtime-config-file-locations"/> for how to relocate the configuration files.
ru: Обратите внимание, что хотя архивирование WAL позволяет сохранить любые изменения данных, произведённые в базе данных <productname>PostgreSQL</productname>, оно не затрагивает изменения, внесённые в конфигурационные файлы (такие как <filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename> и <filename>pg_ident.conf</filename>), поскольку эти изменения выполняются вручную, а не через SQL. Поэтому имеет смысл разместить конфигурационные файлы там, где они будут заархивированы обычными процедурами копирования файлов. Как перемещать конфигурационные файлы, рассказывается в <xref remap="6" linkend="runtime-config-file-locations"/>.

source: The archive command is only invoked on completed WAL segments. Hence, if your server generates only little WAL traffic (or has slack periods where it does so), there could be a long delay between the completion of a transaction and its safe recording in archive storage. To put a limit on how old unarchived data can be, you can set <xref linkend="guc-archive-timeout"/> to force the server to switch to a new WAL segment file at least that often. Note that archived files that are archived early due to a forced switch are still the same length as completely full files. It is therefore unwise to set a very short <varname>archive_timeout</varname> &mdash; it will bloat your archive storage. <varname>archive_timeout</varname> settings of a minute or so are usually reasonable.
ru: Команда архивирования вызывается, только когда сегмент WAL заполнен до конца. Таким образом, если сервер постоянно генерирует небольшой трафик WAL (или есть продолжительные периоды, когда это происходит), между завершением транзакций и их безопасным сохранением в архиве может образоваться большая задержка. Чтобы ограничить время жизни неархивированных данных, можно установить <xref linkend="guc-archive-timeout"/>, чтобы сервер переключался на новый файл сегмента WAL как минимум с заданной частотой. Заметьте, что неполные файлы, архивируемые досрочно из-за принудительного переключения по таймауту, будут иметь тот же размер, что и заполненные файлы. Таким образом, устанавливать очень маленький <varname>archive_timeout</varname> &mdash; неразумно; это приведёт к неэффективному заполнению архива. Обычно подходящее значение <varname>archive_timeout</varname> — минута или около того.

source: Also, you can force a segment switch manually with <function>pg_switch_xlog</function> if you want to ensure that a just-finished transaction is archived as soon as possible. Other utility functions related to WAL management are listed in <xref linkend="functions-admin-backup-table"/>.
ru: Также вы можете принудительно переключить сегмент WAL вручную с помощью <function>pg_switch_xlog</function>, если хотите, чтобы только что завершённая транзакция заархивировалась как можно скорее. Другие полезные функции, относящиеся к управлению WAL, перечисляются в <xref remap="6" linkend="functions-admin-backup-table"/>.

source: When <varname>wal_level</varname> is <literal>minimal</literal> some SQL commands are optimized to avoid WAL logging, as described in <xref linkend="populate-pitr"/>. If archiving or streaming replication were turned on during execution of one of these statements, WAL would not contain enough information for archive recovery. (Crash recovery is unaffected.) For this reason, <varname>wal_level</varname> can only be changed at server start. However, <varname>archive_command</varname> can be changed with a configuration file reload. If you wish to temporarily stop archiving, one way to do it is to set <varname>archive_command</varname> to the empty string (<literal>''</literal>). This will cause WAL files to accumulate in <filename>pg_xlog/</filename> until a working <varname>archive_command</varname> is re-established.
ru: Когда <varname>wal_level</varname> имеет значение <literal>minimal</literal>, некоторые команды SQL выполняются в обход журнала WAL, как описывается в <xref remap="6" linkend="populate-pitr"/>. Если архивирование или потоковая репликация были включены во время выполнения таких операторов, WAL не будет содержать информацию, необходимую для восстановления. (На восстановление после краха это не распространяется). Поэтому <varname>wal_level</varname> можно изменить только при запуске сервера. Однако, чтобы изменить команду <varname>archive_command</varname>, достаточно перезагрузить файл конфигурации. Если вы хотите на время остановить архивирование, это можно сделать, например, задав в качестве значения <varname>archive_command</varname> пустую строку (''). В результате файлы WAL будут накапливаться в каталоге <filename>pg_xlog/</filename>, пока не будет восстановлена действующая команда <varname>archive_command</varname>.

source: Making a Base Backup
ru: Создание базовой резервной копии

source: The easiest way to perform a base backup is to use the <xref linkend="app-pgbasebackup"/> tool. It can create a base backup either as regular files or as a tar archive. If more flexibility than <xref linkend="app-pgbasebackup"/> can provide is required, you can also make a base backup using the low level API (see <xref linkend="backup-lowlevel-base-backup"/>).
ru: Проще всего получить базовую резервную копию, используя программу <xref linkend="app-pgbasebackup"/>. Эта программа сохраняет базовую копию в виде обычных файлов или в архиве tar. Если гибкости <xref linkend="app-pgbasebackup"/> не хватает, вы также можете получить базовую резервную копию, используя низкоуровневый API (см. <xref remap="4" linkend="backup-lowlevel-base-backup"/>).

source: It is not necessary to be concerned about the amount of time it takes to make a base backup. However, if you normally run the server with <varname>full_page_writes</varname> disabled, you might notice a drop in performance while the backup runs since <varname>full_page_writes</varname> is effectively forced on during backup mode.
ru: Продолжительность создания резервной копии обычно не имеет большого значения. Однако, если вы эксплуатируете сервер с отключённым режимом <varname>full_page_writes</varname>, вы можете заметить падение производительности в процессе резервного копирования, так как режим <varname>full_page_writes</varname> включается принудительно на время резервного копирования.

source: To make use of the backup, you will need to keep all the WAL segment files generated during and after the file system backup. To aid you in doing this, the base backup process creates a <firstterm>backup history file</firstterm> that is immediately stored into the WAL archive area. This file is named after the first WAL segment file that you need for the file system backup. For example, if the starting WAL file is <literal>0000000100001234000055CD</literal> the backup history file will be named something like <literal>0000000100001234000055CD.007C9330.backup</literal>. (The second part of the file name stands for an exact position within the WAL file, and can ordinarily be ignored.) Once you have safely archived the file system backup and the WAL segment files used during the backup (as specified in the backup history file), all archived WAL segments with names numerically less are no longer needed to recover the file system backup and can be deleted. However, you should consider keeping several backup sets to be absolutely certain that you can recover your data.
ru: Чтобы резервной копией можно было пользоваться, нужно сохранить все файлы сегментов WAL, сгенерированные во время и после копирования файлов. Для облегчения этой задачи, процесс создания базовой резервной копии записывает <firstterm>файл истории резервного копирования</firstterm>, который немедленно сохраняется в области архивации WAL. Данный файл получает имя по имени файла первого сегмента WAL, который потребуется для восстановления скопированных файлов. Например, если начальный файл WAL назывался <literal>0000000100001234000055CD</literal>, файл истории резервного копирования получит имя <literal>0000000100001234000055CD.007C9330.backup</literal>. (Вторая часть имени файла обозначает точную позицию внутри файла WAL и обычно может быть проигнорирована.) Как только вы заархивировали копии файлов данных и файлов сегментов WAL, полученных в процессе копирования (по сведениям в файле истории резервного копирования), все заархивированные сегменты WAL с именами, меньшими по номеру, становятся ненужными для восстановления файловой копии и могут быть удалены. Но всё же рассмотрите возможность хранения нескольких наборов резервных копий, чтобы быть абсолютно уверенными, что вы сможете восстановить ваши данные.

source: The backup history file is just a small text file. It contains the label string you gave to <xref linkend="app-pgbasebackup"/>, as well as the starting and ending times and WAL segments of the backup. If you used the label to identify the associated dump file, then the archived history file is enough to tell you which dump file to restore.
ru: Файл истории резервного копирования &mdash; это просто небольшой текстовый файл. В него записывается метка, которая была передана <xref linkend="app-pgbasebackup"/>, а также время и текущие сегменты WAL в момент начала и завершения резервной копии. Если вы связали с данной меткой соответствующий файл дампа, то заархивированного файла истории достаточно, чтобы найти файл дампа, нужный для восстановления.
