Repository: pluzanov/pg-doc-ru
Catalog: 9.6/backup.po
Languages: ru

source: Since you have to keep around all the archived WAL files back to your last base backup, the interval between base backups should usually be chosen based on how much storage you want to expend on archived WAL files. You should also consider how long you are prepared to spend recovering, if recovery should be necessary &mdash; the system will have to replay all those WAL segments, and that could take awhile if it has been a long time since the last base backup.
ru: Поскольку необходимо хранить все заархивированные файлы WAL с момента последней базовой резервной копии, интервал базового резервного копирования обычно выбирается в зависимости от того, сколько места может быть выделено для архива файлов WAL. Также стоит отталкиваться от того, сколько вы готовы ожидать восстановления, если оно понадобится — системе придётся воспроизвести все эти сегменты WAL, а этот процесс может быть долгим, если с момента последней базовой копии прошло много времени.

source: Making a Base Backup Using the Low Level API
ru: Создание базовой резервной копии через низкоуровневый API

source: The procedure for making a base backup using the low level APIs contains a few more steps than the <xref linkend="app-pgbasebackup"/> method, but is relatively simple. It is very important that these steps are executed in sequence, and that the success of a step is verified before proceeding to the next step.
ru: Процедура создания базовой резервной копии с использованием низкоуровневого API содержит чуть больше шагов, чем метод <xref linkend="app-pgbasebackup"/>, но всё же относительно проста. Очень важно, чтобы эти шаги выполнялись по порядку, и следующий шаг выполнялся, только если предыдущий успешен.

source: Low level base backups can be made in a non-exclusive or an exclusive way. The non-exclusive method is recommended and the exclusive one is deprecated and will eventually be removed.
ru: Резервное копирование на низком уровне можно произвести в монопольном или немонопольном режиме. Рекомендуется применять немонопольный метод, а монопольный считается устаревшим и в конце концов будет ликвидирован.

source: Making a non-exclusive low level backup
ru: Немонопольное резервное копирование на низком уровне

source: A non-exclusive low level backup is one that allows other concurrent backups to be running (both those started using the same backup API and those started using <xref linkend="app-pgbasebackup"/>.
ru: Немонопольное резервное копирование позволяет параллельно запускать другие процессы копирования (используя тот же API или <xref linkend="app-pgbasebackup"/>).

source: Ensure that WAL archiving is enabled and working.
ru: Убедитесь, что архивирование WAL включено и работает.

source: Connect to the server (it does not matter which database) as a user with rights to run pg_start_backup (superuser, or a user who has been granted EXECUTE on the function) and issue the command: <placeholder-1/> where <literal>label</literal> is any string you want to use to uniquely identify this backup operation. The connection calling <function>pg_start_backup</function> must be maintained until the end of the backup, or the backup will be automatically aborted.
ru: Подключитесь к серверу (к любой базе данных) как пользователь с правами на выполнение pg_start_backup (суперпользователь или пользователь, которому дано право EXECUTE для этой функции) и выполните команду: <placeholder-1/> где <literal>label</literal> &mdash; любая метка, по которой можно однозначно идентифицировать данную операцию резервного копирования. Соединение, через которое вызывается <function>pg_start_backup</function>, должно поддерживаться до окончания резервного копирования, иначе этот процесс будет автоматически прерван.

source: By default, <function>pg_start_backup</function> can take a long time to finish. This is because it performs a checkpoint, and the I/O required for the checkpoint will be spread out over a significant period of time, by default half your inter-checkpoint interval (see the configuration parameter <xref linkend="guc-checkpoint-completion-target"/>). This is usually what you want, because it minimizes the impact on query processing. If you want to start the backup as soon as possible, change the second parameter to <literal>true</literal>.
ru: По умолчанию <function>pg_start_backup</function> может выполняться длительное время. Это объясняется тем, что функция выполняет контрольную точку, а операции ввода/вывода, требуемые для этого, распределяются в интервале времени, по умолчанию равном половине интервала между контрольными точками (см. параметр <xref linkend="guc-checkpoint-completion-target"/>). Обычно это вполне приемлемо, так как при этом минимизируется влияние на выполнение других запросов. Если же вы хотите начать резервное копирование максимально быстро, передайте во втором параметре <literal>true</literal>.

source: The third parameter being <literal>false</literal> tells <function>pg_start_backup</function> to initiate a non-exclusive base backup.
ru: Третий параметр, имеющий значение <literal>false</literal>, указывает <function>pg_start_backup</function> начать немонопольное базовое копирование.

source: Perform the backup, using any convenient file-system-backup tool such as <application>tar</application> or <application>cpio</application> (not <application>pg_dump</application> or <application>pg_dumpall</application>). It is neither necessary nor desirable to stop normal operation of the database while you do this. See section <xref linkend="backup-lowlevel-base-backup-data"/> for things to consider during this backup.
ru: Скопируйте файлы, используя любое удобное средство резервного копирования, например, <application>tar</application> или <application>cpio</application> (не <application>pg_dump</application> или <application>pg_dumpall</application>). В процессе копирования останавливать работу базы данных не требуется, это ничего не даёт. В <xref remap="6" linkend="backup-lowlevel-base-backup-data"/> описано, что следует учитывать в процессе копирования.

source: In the same connection as before, issue the command: <placeholder-1/> This terminates the backup mode and performs an automatic switch to the next WAL segment. The reason for the switch is to arrange for the last WAL segment file written during the backup interval to be ready to archive.
ru: Через то же подключение, что и раньше, выполните команду: <placeholder-1/> Сервер выйдет из режима резервного копирования и автоматически переключится на следующий сегмент WAL. Это переключение выполняется для того, чтобы файл последнего сегмента WAL, записанного во время копирования, был готов к архивации.

source: The <function>pg_stop_backup</function> will return one row with three values. The second of these fields should be written to a file named <filename>backup_label</filename> in the root directory of the backup. The third field should be written to a file named <filename>tablespace_map</filename> unless the field is empty. These files are vital to the backup working, and must be written without modification.
ru: Функция <function>pg_stop_backup</function> возвратит одну строку с тремя значениями. Второе из них нужно записать в файл <filename>backup_label</filename> в корневой каталог резервной копии. Третье значение, если оно не пустое, должно быть записано в файл <filename>tablespace_map</filename>. Эти значения крайне важны для восстановления копии и должны записываться без изменений.

source: Once the WAL segment files active during the backup are archived, you are done. The file identified by <function>pg_stop_backup</function>'s first return value is the last segment that is required to form a complete set of backup files. If <varname>archive_mode</varname> is enabled, <function>pg_stop_backup</function> does not return until the last segment has been archived. Archiving of these files happens automatically since you have already configured <varname>archive_command</varname>. In most cases this happens quickly, but you are advised to monitor your archive system to ensure there are no delays. If the archive process has fallen behind because of failures of the archive command, it will keep retrying until the archive succeeds and the backup is complete. If you wish to place a time limit on the execution of <function>pg_stop_backup</function>, set an appropriate <varname>statement_timeout</varname> value, but make note that if <function>pg_stop_backup</function> terminates because of this your backup may not be valid.
ru: После этого останется заархивировать файлы сегментов WAL, активных во время создания резервной копии, и процедура резервного копирования будет завершена. Функция <function>pg_stop_backup</function> в первом значении результата указывает, какой последний сегмент требуется для формирования полного набора файлов резервной копии. Если включён режим архивации (параметр <varname>archive_mode</varname>), функция <function>pg_stop_backup</function> не завершится, пока не будет заархивирован последний сегмент. В этом случае файлы будут заархивированы автоматически, поскольку также должна быть настроена команда <varname>archive_command</varname>. Чаще всего это происходит быстро, но мы советуем наблюдать за системой архивации и проверять, не возникают ли задержки. Если архивирование остановится из-за ошибок команды архивации, попытки архивации будут продолжаться до успешного завершения, и только тогда резервная копия будет завершена. Если вы хотите ограничить время выполнения <function>pg_stop_backup</function>, установите соответствующее значение в <varname>statement_timeout</varname>, но заметьте, что в случае прерывания <function>pg_stop_backup</function> по времени резервная копия может оказаться негодной.

source: Making an exclusive low level backup
ru: Монопольное резервное копирование на низком уровне

source: The process for an exclusive backup is mostly the same as for a non-exclusive one, but it differs in a few key steps. It does not allow more than one concurrent backup to run, and there can be some issues on the server if it crashes during the backup. Prior to PostgreSQL 9.6, this was the only low-level method available, but it is now recommended that all users upgrade their scripts to use non-exclusive backups if possible.
ru: Монопольное резервное копирование во многом похоже на немонопольное, но имеет несколько важных отличий. Этот вариант не позволяет запустить больше одного процесса копирования одновременно, а в случае сбоя в процессе копирования возможны некоторые осложнения на сервере. До PostgreSQL 9.6 это был единственный возможный метод низкоуровневого копирования, но сейчас пользователям рекомендуется по возможности подкорректировать свои скрипты и перейти к использованию немонопольного варианта.

source: Connect to the server (it does not matter which database) as a user with rights to run pg_start_backup (superuser, or a user who has been granted EXECUTE on the function) and issue the command: <placeholder-1/> where <literal>label</literal> is any string you want to use to uniquely identify this backup operation. <function>pg_start_backup</function> creates a <firstterm>backup label</firstterm> file, called <filename>backup_label</filename>, in the cluster directory with information about your backup, including the start time and label string. The function also creates a <firstterm>tablespace map</firstterm> file, called <filename>tablespace_map</filename>, in the cluster directory with information about tablespace symbolic links in <filename>pg_tblspc/</filename> if one or more such link is present. Both files are critical to the integrity of the backup, should you need to restore from it.
ru: Подключитесь к серверу (к любой базе данных) как пользователь с правами на выполнение pg_start_backup (суперпользователь или пользователь, которому дано право EXECUTE для этой функции) и выполните команду: <placeholder-1/> где <literal>label</literal> &mdash; любая метка, по которой можно однозначно идентифицировать данную операцию резервного копирования. Функция <function>pg_start_backup</function> создаёт в каталоге кластера файл <firstterm>метки резервного копирования</firstterm>, называемый <filename>backup_label</filename>, в который помещается информация о резервной копии, включающая время начала и строку метки. Эта функция также создаёт в каталоге кластера файл <firstterm>карты табличных пространств</firstterm>, называемый <filename>tablespace_map</filename>, с информацией о символических ссылках табличных пространств в <filename>pg_tblspc/</filename>, если такие ссылки есть. Оба файла важны для целостности резервных копии и понадобятся при восстановлении.

source: By default, <function>pg_start_backup</function> can take a long time to finish. This is because it performs a checkpoint, and the I/O required for the checkpoint will be spread out over a significant period of time, by default half your inter-checkpoint interval (see the configuration parameter <xref linkend="guc-checkpoint-completion-target"/>). This is usually what you want, because it minimizes the impact on query processing. If you want to start the backup as soon as possible, use: <placeholder-1/> This forces the checkpoint to be done as quickly as possible.
ru: По умолчанию <function>pg_start_backup</function> может выполняться длительное время. Это объясняется тем, что функция выполняет контрольную точку, а операции ввода/вывода, требуемые для этого, распределяются в интервале времени, по умолчанию равном половине интервала между контрольными точками (см. параметр <xref linkend="guc-checkpoint-completion-target"/>). Обычно это вполне приемлемо, так как при этом минимизируется влияние на выполнение других запросов. Если же вы хотите начать резервное копирование максимально быстро, выполните: <placeholder-1/> При этом контрольная точка будет выполнена как можно скорее.

source: Again connect to the database as a user with rights to run pg_stop_backup (superuser, or a user who has been granted EXECUTE on the function), and issue the command: <placeholder-1/> This terminates the backup mode and performs an automatic switch to the next WAL segment. The reason for the switch is to arrange for the last WAL segment file written during the backup interval to be ready to archive.
ru: Снова подключитесь к базе данных как пользователь с правами на выполнение pg_stop_backup (суперпользователь или пользователь, которому дано право EXECUTE для этой функции) и выполните команду: <placeholder-1/> Сервер выйдет из режима резервного копирования и автоматически переключится на следующий сегмент WAL. Это переключение выполняется для того, чтобы файл последнего сегмента WAL, записанного во время копирования, был готов к архивации.

source: Once the WAL segment files active during the backup are archived, you are done. The file identified by <function>pg_stop_backup</function>'s result is the last segment that is required to form a complete set of backup files. If <varname>archive_mode</varname> is enabled, <function>pg_stop_backup</function> does not return until the last segment has been archived. Archiving of these files happens automatically since you have already configured <varname>archive_command</varname>. In most cases this happens quickly, but you are advised to monitor your archive system to ensure there are no delays. If the archive process has fallen behind because of failures of the archive command, it will keep retrying until the archive succeeds and the backup is complete. If you wish to place a time limit on the execution of <function>pg_stop_backup</function>, set an appropriate <varname>statement_timeout</varname> value, but make note that if <function>pg_stop_backup</function> terminates because of this your backup may not be valid.
ru: После этого останется заархивировать файлы сегментов WAL, активных во время создания резервной копии, и процедура резервного копирования будет завершена. Функция <function>pg_stop_backup</function> возвращает указание на файл последнего сегмента, который требуется для формирования полного набора файлов резервной копии. Если включён режим архивации (параметр <varname>archive_mode</varname>), функция <function>pg_stop_backup</function> не завершится, пока не будет заархивирован последний сегмент. В этом случае файлы будут заархивированы автоматически, поскольку также должна быть настроена команда <varname>archive_command</varname>. Чаще всего это происходит быстро, но мы советуем наблюдать за системой архивации и проверять, не возникают ли задержки. Если архивирование остановится из-за ошибок команды архивации, попытки архивации будут продолжаться до успешного завершения, и только тогда резервная копия будет завершена. Если вы хотите ограничить время выполнения <function>pg_stop_backup</function>, установите соответствующее значение в <varname>statement_timeout</varname>, но заметьте, что в случае прерывания <function>pg_stop_backup</function> по времени резервная копия может оказаться негодной.

source: Backing up the data directory
ru: Копирование каталога данных

source: Some file system backup tools emit warnings or errors if the files they are trying to copy change while the copy proceeds. When taking a base backup of an active database, this situation is normal and not an error. However, you need to ensure that you can distinguish complaints of this sort from real errors. For example, some versions of <application>rsync</application> return a separate exit code for <quote>vanished source files</quote>, and you can write a driver script to accept this exit code as a non-error case. Also, some versions of GNU <application>tar</application> return an error code indistinguishable from a fatal error if a file was truncated while <application>tar</application> was copying it. Fortunately, GNU <application>tar</application> versions 1.16 and later exit with 1 if a file was changed during the backup, and 2 for other errors. With GNU <application>tar</application> version 1.23 and later, you can use the warning options <literal>--warning=no-file-changed --warning=no-file-removed</literal> to hide the related warning messages.
ru: Некоторые средства резервного копирования файлов выдают предупреждения или ошибки, если файлы, которые они пытаются скопировать, изменяются в процессе копирования. При получении базовой резервной копии активной базы данных это вполне нормально и не является ошибкой. Однако, вам нужно знать, как отличить ошибки такого рода от реальных ошибок. Например, некоторые версии <application>rsync</application> возвращают отдельный код выхода для ситуации <quote>исчезнувшие исходные файлы</quote>, и вы можете написать управляющий скрипт, который примет этот код как не ошибочный. Также некоторые версии GNU <application>tar</application> возвращают код выхода, неотличимый от кода фатальной ошибки, если файл был усечён, когда <application>tar</application> копировал его. К счастью, GNU <application>tar</application> версий 1.16 и более поздних завершается с кодом 1, если файл был изменён во время копирования, и 2 в случае других ошибок. С GNU <application>tar</application> версии 1.23 и более поздними, вы можете использовать следующие ключи <literal>--warning=no-file-changed --warning=no-file-removed</literal>, чтобы скрыть соответствующие предупреждения.

source: Be certain that your backup includes all of the files under the database cluster directory (e.g., <filename>/usr/local/pgsql/data</filename>). If you are using tablespaces that do not reside underneath this directory, be careful to include them as well (and be sure that your backup archives symbolic links as links, otherwise the restore will corrupt your tablespaces).
ru: Убедитесь, что ваша резервная копия включает все файлы из каталога кластера баз данных (например, <filename>/usr/local/pgsql/data</filename>). Если вы используете табличные пространства, которые находятся не внутри этого каталога, не забудьте включить и их в резервную копию (также важно, чтобы при создании резервной копии символьные ссылки сохранялись как ссылки, иначе табличные пространства будут повреждены при восстановлении).

source: You should, however, omit from the backup the files within the cluster's <filename>pg_xlog/</filename> subdirectory. This slight adjustment is worthwhile because it reduces the risk of mistakes when restoring. This is easy to arrange if <filename>pg_xlog/</filename> is a symbolic link pointing to someplace outside the cluster directory, which is a common setup anyway for performance reasons. You might also want to exclude <filename>postmaster.pid</filename> and <filename>postmaster.opts</filename>, which record information about the running <application>postmaster</application>, not about the <application>postmaster</application> which will eventually use this backup. (These files can confuse <application>pg_ctl</application>.)
ru: Однако следует исключить из резервной копии файлы в подкаталоге данных кластера <filename>pg_xlog/</filename>. Эту небольшую корректировку стоит внести для снижения риска ошибок при восстановлении. Это легко организовать, если <filename>pg_xlog/</filename> — символическая ссылка на каталог за пределами каталога данных (так часто делают из соображений производительности). Также имеет смысл исключить файлы <filename>postmaster.pid</filename> и <filename>postmaster.opts</filename>, содержащие информацию о работающем процессе <application>postmaster</application> (а не о том процессе <application>postmaster</application>, который будет восстанавливать эту копию). (Эти файлы могут ввести <application>pg_ctl</application> в заблуждение.)

source: It is often a good idea to also omit from the backup the files within the cluster's <filename>pg_replslot/</filename> directory, so that replication slots that exist on the master do not become part of the backup. Otherwise, the subsequent use of the backup to create a standby may result in indefinite retention of WAL files on the standby, and possibly bloat on the master if hot standby feedback is enabled, because the clients that are using those replication slots will still be connecting to and updating the slots on the master, not the standby. Even if the backup is only intended for use in creating a new master, copying the replication slots isn't expected to be particularly useful, since the contents of those slots will likely be badly out of date by the time the new master comes on line.
ru: Часто также стоит исключать из резервной копии каталог <filename>pg_replslot/</filename> кластера, чтобы слоты репликации, существующие на главном сервере, не попадали в копию. В противном случае, при последующем восстановлении копии на резервном сервере может получиться так, что он будет неограниченно долго сохранять файлы WAL, а главный не будет очищаться, если он следит за горячим резервом, так как клиенты этих слотов репликации будут продолжать подключаться и изменять состояние слотов на главном, а не резервном сервере. Даже если резервная копия предназначена только для создания нового главного сервера, копирование слотов репликации вряд ли принесёт пользу, так как к моменту включения в работу этого нового сервера содержимое этих слотов станет абсолютно неактуальным.
