Repository: pluzanov/pg-doc-ru
Catalog: 9.6/backup.po
Languages: ru

source: The backup label file includes the label string you gave to <function>pg_start_backup</function>, as well as the time at which <function>pg_start_backup</function> was run, and the name of the starting WAL file. In case of confusion it is therefore possible to look inside a backup file and determine exactly which backup session the dump file came from. The tablespace map file includes the symbolic link names as they exist in the directory <filename>pg_tblspc/</filename> and the full path of each symbolic link. These files are not merely for your information; their presence and contents are critical to the proper operation of the system's recovery process.
ru: В файл метки резервной копии записывается строка метки, заданная при вызове <function>pg_start_backup</function>, время запуска функции <function>pg_start_backup</function> и имя начального файла WAL. Таким образом, в случае сомнений можно заглянуть внутрь архива резервной копии и точно определить, в каком сеансе резервного копирования он был создан. Файл карты табличных пространств содержит имена символических ссылок, как они существуют в каталоге <filename>pg_tblspc/</filename>, и полный путь каждой символической ссылки. Эти файлы не только к вашему сведению; их существование и содержание важны для правильного проведения процесса восстановления системы.

source: It is also possible to make a backup while the server is stopped. In this case, you obviously cannot use <function>pg_start_backup</function> or <function>pg_stop_backup</function>, and you will therefore be left to your own devices to keep track of which backup is which and how far back the associated WAL files go. It is generally better to follow the continuous archiving procedure above.
ru: Вы также можете создать резервную копию, когда сервер остановлен. В этом случае, вы, очевидно, не сможете вызвать <function>pg_start_backup</function> или <function>pg_stop_backup</function>, и следовательно, вам надо будет самостоятельно как-то идентифицировать резервные копии и понимать, какие файлы WAL должны быть заархивированы. Поэтому обычно всё-таки лучше следовать вышеописанной процедуре непрерывного архивирования.

source: Recovering Using a Continuous Archive Backup
ru: Восстановление непрерывной архивной копии

source: Stop the server, if it's running.
ru: Остановите сервер баз данных, если он запущен.

source: If you have the space to do so, copy the whole cluster data directory and any tablespaces to a temporary location in case you need them later. Note that this precaution will require that you have enough free space on your system to hold two copies of your existing database. If you do not have enough space, you should at least save the contents of the cluster's <filename>pg_xlog</filename> subdirectory, as it might contain logs which were not archived before the system went down.
ru: Если у вас есть место для этого, скопируйте весь текущий каталог кластера баз данных и все табличные пространства во временный каталог на случай, если они вам понадобятся. Учтите, что эта мера предосторожности требует, чтобы свободного места на диске было достаточно для размещения двух копий существующих данных. Если места недостаточно, необходимо сохранить как минимум содержимое подкаталога <filename>pg_xlog</filename> каталога кластера, так как он может содержать журналы, не попавшие в архив перед остановкой системы.

source: Remove all existing files and subdirectories under the cluster data directory and under the root directories of any tablespaces you are using.
ru: Удалите все существующие файлы и подкаталоги из каталога кластера и из корневых каталогов используемых табличных пространств.

source: Restore the database files from your file system backup. Be sure that they are restored with the right ownership (the database system user, not <literal>root</literal>!) and with the right permissions. If you are using tablespaces, you should verify that the symbolic links in <filename>pg_tblspc/</filename> were correctly restored.
ru: Восстановите файлы базы данных из архивной копии файлов. Важно, чтобы у восстановленных файлов были правильные разрешения и правильный владелец (пользователь, запускающий сервер, а не <literal>root</literal>!). Если вы используете табличные пространства, убедитесь также, что символьные ссылки в <filename>pg_tblspc/</filename> восстановились корректно.

source: Remove any files present in <filename>pg_xlog/</filename>; these came from the file system backup and are therefore probably obsolete rather than current. If you didn't archive <filename>pg_xlog/</filename> at all, then recreate it with proper permissions, being careful to ensure that you re-establish it as a symbolic link if you had it set up that way before.
ru: Удалите все файлы из <filename>pg_xlog/</filename>; они восстановились из резервной копии файлов и поэтому, скорее всего, будут старее текущих. Если вы вовсе не архивировали <filename>pg_xlog/</filename>, создайте этот каталог с правильными правами доступа, но если это была символьная ссылка, восстановите её.

source: If you have unarchived WAL segment files that you saved in step 2, copy them into <filename>pg_xlog/</filename>. (It is best to copy them, not move them, so you still have the unmodified files if a problem occurs and you have to start over.)
ru: Если на шаге 2 вы сохранили незаархивированные файлы с сегментами WAL, скопируйте их в <filename>pg_xlog/</filename>. (Лучше всего именно копировать, а не перемещать их, чтобы у вас остались неизменённые файлы на случай, если возникнет проблема и всё придётся начинать сначала.)

source: Create a recovery command file <filename>recovery.conf</filename> in the cluster data directory (see <xref linkend="recovery-config"/>). You might also want to temporarily modify <filename>pg_hba.conf</filename> to prevent ordinary users from connecting until you are sure the recovery was successful.
ru: Создайте командный файл восстановления <filename>recovery.conf</filename> в каталоге кластера баз данных (см. <xref remap="4" linkend="recovery-config"/>). Вы можете также временно изменить <filename>pg_hba.conf</filename>, чтобы обычные пользователи не могли подключаться, пока вы не будете уверены, что восстановление завершилось успешно.

source: Start the server. The server will go into recovery mode and proceed to read through the archived WAL files it needs. Should the recovery be terminated because of an external error, the server can simply be restarted and it will continue recovery. Upon completion of the recovery process, the server will rename <filename>recovery.conf</filename> to <filename>recovery.done</filename> (to prevent accidentally re-entering recovery mode later) and then commence normal database operations.
ru: Запустите сервер. Сервер запустится в режиме восстановления и начнёт считывать необходимые ему архивные файлы WAL. Если восстановление будет прервано из-за внешней ошибки, сервер можно просто перезапустить и он продолжит восстановление. По завершении процесса восстановления сервер переименует файл <filename>recovery.conf</filename> в <filename>recovery.done</filename> (чтобы предотвратить повторный запуск режима восстановления), а затем перейдёт к обычной работе с базой данных.

source: Inspect the contents of the database to ensure you have recovered to the desired state. If not, return to step 1. If all is well, allow your users to connect by restoring <filename>pg_hba.conf</filename> to normal.
ru: Просмотрите содержимое базы данных, чтобы убедиться, что вы вернули её к желаемому состоянию. Если это не так, вернитесь к шагу 1. Если всё хорошо, разрешите пользователям подключаться к серверу, восстановив обычный файл <filename>pg_hba.conf</filename>.

source: Okay, the worst has happened and you need to recover from your backup. Here is the procedure: <placeholder-1/>
ru: Допустим, худшее случилось и вам необходимо восстановить базу данных из резервной копии. Порядок действий таков: <placeholder-1/>

source: The key part of all this is to set up a recovery configuration file that describes how you want to recover and how far the recovery should run. You can use <filename>recovery.conf.sample</filename> (normally located in the installation's <filename>share/</filename> directory) as a prototype. The one thing that you absolutely must specify in <filename>recovery.conf</filename> is the <varname>restore_command</varname>, which tells <productname>PostgreSQL</productname> how to retrieve archived WAL file segments. Like the <varname>archive_command</varname>, this is a shell command string. It can contain <literal>%f</literal>, which is replaced by the name of the desired log file, and <literal>%p</literal>, which is replaced by the path name to copy the log file to. (The path name is relative to the current working directory, i.e., the cluster's data directory.) Write <literal>%%</literal> if you need to embed an actual <literal>%</literal> character in the command. The simplest useful command is something like: <placeholder-1/> which will copy previously archived WAL segments from the directory <filename>/mnt/server/archivedir</filename>. Of course, you can use something much more complicated, perhaps even a shell script that requests the operator to mount an appropriate tape.
ru: Ключевой момент этой процедуры заключается в создании файла конфигурации восстановления, описывающего, как будет выполняться восстановление и до какой точки. В качестве прототипа вы можете использовать файл <filename>recovery.conf.sample</filename> (он обычно помещается в каталог <filename>share/</filename> после установки). Единственное, что совершенно необходимо указать в <filename>recovery.conf</filename> &mdash; это команду <varname>restore_command</varname>, которая говорит <productname>PostgreSQL</productname>, как получать из архива файл-сегменты WAL. Как и <varname>archive_command</varname>, это командная строка для оболочки. Она может содержать символы <literal>%f</literal>, которые заменятся именем требующегося файла журнала, и <literal>%p</literal>, которые заменятся целевым путём для копирования этого файла. (Путь задаётся относительно текущего рабочего каталога, т. е. каталога кластера данных.) Если вам нужно включить в команду сам символ <literal>%</literal>, напишите <literal>%%</literal>. Простейшая команда, которая может быть полезна, такая: <placeholder-1/> Эта команда копирует заархивированные ранее сегменты WAL из каталога <filename>/mnt/server/archivedir</filename>. Разумеется, вы можете использовать что-то более сложное, возможно, даже скрипт оболочки, который укажет оператору установить соответствующую ленту.

source: It is important that the command return nonzero exit status on failure. The command <emphasis>will</emphasis> be called requesting files that are not present in the archive; it must return nonzero when so asked. This is not an error condition. An exception is that if the command was terminated by a signal (other than <systemitem>SIGTERM</systemitem>, which is used as part of a database server shutdown) or an error by the shell (such as command not found), then recovery will abort and the server will not start up.
ru: Важно, чтобы данная команда возвращала ненулевой код возврата в случае ошибки. Эта команда <emphasis>будет</emphasis> вызываться и с запросом файлов, отсутствующих в архиве; в этом случае она должна вернуть ненулевое значение и это считается штатной ситуацией. В исключительной ситуации, когда команда была прервана сигналом (кроме <systemitem>SIGTERM</systemitem>, который применяется в процессе остановки сервера базы данных) или произошла ошибка оболочки (например, команда не найдена), восстановление будет прервано и сервер не запустится.

source: Not all of the requested files will be WAL segment files; you should also expect requests for files with a suffix of <literal>.backup</literal> or <literal>.history</literal>. Also be aware that the base name of the <literal>%p</literal> path will be different from <literal>%f</literal>; do not expect them to be interchangeable.
ru: Не все запрашиваемые файлы будут сегментами WAL; следует также ожидать запросов файлов с суффиксом <literal>.backup</literal> или <literal>.history</literal>. Также учтите, что базовое имя пути <literal>%p</literal> будет отличаться от <literal>%f</literal>; не думайте, что они взаимозаменяемы.

source: WAL segments that cannot be found in the archive will be sought in <filename>pg_xlog/</filename>; this allows use of recent un-archived segments. However, segments that are available from the archive will be used in preference to files in <filename>pg_xlog/</filename>.
ru: Сегменты WAL, которые не найдутся в архиве, система будет искать в <filename>pg_xlog/</filename>; благодаря этому можно использовать последние незаархивированные сегменты. Однако файлы в <filename>pg_xlog/</filename> будут менее предпочтительными, если такие сегменты окажутся в архиве.

source: Normally, recovery will proceed through all available WAL segments, thereby restoring the database to the current point in time (or as close as possible given the available WAL segments). Therefore, a normal recovery will end with a <quote>file not found</quote> message, the exact text of the error message depending upon your choice of <varname>restore_command</varname>. You may also see an error message at the start of recovery for a file named something like <filename>00000001.history</filename>. This is also normal and does not indicate a problem in simple recovery situations; see <xref linkend="backup-timelines"/> for discussion.
ru: Обычно при восстановлении обрабатываются все доступные сегменты WAL и, таким образом, база данных восстанавливается до последнего момента времени (или максимально близкого к нему, в зависимости от наличия сегментов WAL). Таким образом, восстановление обычно завершается с сообщением <quote>файл не найден</quote>; точный текст сообщения об ошибке зависит от того, что делает <varname>restore_command</varname>. Вы также можете увидеть сообщение об ошибке в начале восстановления для файла с именем типа <filename>00000001.history</filename>. Это также нормально и обычно не говорит о какой-либо проблеме при восстановлении в простых ситуациях; подробнее об этом рассказывается в <xref remap="6" linkend="backup-timelines"/>.

source: If you want to recover to some previous point in time (say, right before the junior DBA dropped your main transaction table), just specify the required <link linkend="recovery-target-settings">stopping point</link> in <filename>recovery.conf</filename>. You can specify the stop point, known as the <quote>recovery target</quote>, either by date/time, named restore point or by completion of a specific transaction ID. As of this writing only the date/time and named restore point options are very usable, since there are no tools to help you identify with any accuracy which transaction ID to use.
ru: Если вы хотите восстановить базу на какой-то момент времени (скажем, до момента, когда неопытный администратор базы данных удалил основную таблицу транзакций), просто укажите требуемую <link linkend="recovery-target-settings">точку остановки</link> в <filename>recovery.conf</filename>. Вы можете задать точку останова, так называемую <quote>цель восстановления</quote>, по дате/времени, именованной точке восстановления или определённому идентификатору транзакции. На момент написания этой документации полезными могут быть только указания даты/времени или имени точки восстановления, пока нет никаких средств, позволяющих точно определить, какой идентификатор транзакции нужно выбрать.

source: The stop point must be after the ending time of the base backup, i.e., the end time of <function>pg_stop_backup</function>. You cannot use a base backup to recover to a time when that backup was in progress. (To recover to such a time, you must go back to your previous base backup and roll forward from there.)
ru: Точка останова должна указывать на момент после окончания базового копирования, т. е. после времени завершения <function>pg_stop_backup</function>. Использовать базовую резервную копию для восстановления на момент времени, когда она ещё только создавалась, нельзя. (Чтобы восстановить данные на этот момент времени, придётся вернуться к предыдущей базовой резервной копии и накатывать изменения с этой позиции.)

source: If recovery finds corrupted WAL data, recovery will halt at that point and the server will not start. In such a case the recovery process could be re-run from the beginning, specifying a <quote>recovery target</quote> before the point of corruption so that recovery can complete normally. If recovery fails for an external reason, such as a system crash or if the WAL archive has become inaccessible, then the recovery can simply be restarted and it will restart almost from where it failed. Recovery restart works much like checkpointing in normal operation: the server periodically forces all its state to disk, and then updates the <filename>pg_control</filename> file to indicate that the already-processed WAL data need not be scanned again.
ru: Если при восстановлении обнаруживаются повреждённые данные WAL, восстановление прерывается в этом месте и сервер не запускается. В этом случае процесс восстановления можно перезапустить с начала, указав <quote>цель восстановления</quote> до точки повреждения, чтобы восстановление могло завершиться нормально. Если восстановление завершается ошибкой из-за внешней причины, например, из-за краха системы или недоступности архива WAL, его можно просто перезапустить, и оно продолжится с того места, где было прервано. Перезапуск восстановления реализован по тому же принципу, что и контрольные точки при обычной работе: сервер периодически сохраняет всё текущее состояние на диске и отражает это в файле <filename>pg_control</filename>, чтобы уже обработанные данные WAL не приходилось сканировать снова.

source: Timelines
ru: Линии времени

source: <primary>timelines</primary>
ru: <primary>линии времени</primary>

source: The ability to restore the database to a previous point in time creates some complexities that are akin to science-fiction stories about time travel and parallel universes. For example, in the original history of the database, suppose you dropped a critical table at 5:15PM on Tuesday evening, but didn't realize your mistake until Wednesday noon. Unfazed, you get out your backup, restore to the point-in-time 5:14PM Tuesday evening, and are up and running. In <emphasis>this</emphasis> history of the database universe, you never dropped the table. But suppose you later realize this wasn't such a great idea, and would like to return to sometime Wednesday morning in the original history. You won't be able to if, while your database was up-and-running, it overwrote some of the WAL segment files that led up to the time you now wish you could get back to. Thus, to avoid this, you need to distinguish the series of WAL records generated after you've done a point-in-time recovery from those that were generated in the original database history.
ru: Возможность восстановить базу данных на некий предыдущий момент времени создаёт некоторые сложности, сродни научно-фантастическим историям о путешествиях во времени и параллельных мирах. Например, предположим, что в начальной истории базы данных вы удалили важную таблицу в 17:15 во вторник, но осознали эту ошибку только в среду в полдень. Вы можете спокойно взять резервную копию, восстановить данные на 17:14 во вторник и запустить сервер. В <emphasis>этой</emphasis> истории мира базы данных вы никогда не удаляли вышеупомянутую таблицу. Но предположим, что позже вы заметили, что это была не такая уж хорошая идея и захотели вернуться к утру среды в первоначальной истории базы данных. Вы не сможете сделать это, если в процессе работы базы данных она успеет перезаписать какие-либо файлы-сегменты WAL, приводящие к моменту времени, к которому вы хотите вернуться теперь. Таким образом, для получения желаемого результата необходимо как-то отличать последовательности записей WAL, добавленные после восстановления на какой-то момент времени от тех, что существовали в начальной истории базы данных.

source: To deal with this problem, <productname>PostgreSQL</productname> has a notion of <firstterm>timelines</firstterm>. Whenever an archive recovery completes, a new timeline is created to identify the series of WAL records generated after that recovery. The timeline ID number is part of WAL segment file names so a new timeline does not overwrite the WAL data generated by previous timelines. It is in fact possible to archive many different timelines. While that might seem like a useless feature, it's often a lifesaver. Consider the situation where you aren't quite sure what point-in-time to recover to, and so have to do several point-in-time recoveries by trial and error until you find the best place to branch off from the old history. Without timelines this process would soon generate an unmanageable mess. With timelines, you can recover to <emphasis>any</emphasis> prior state, including states in timeline branches that you abandoned earlier.
ru: Для решения этой проблемы в <productname>PostgreSQL</productname> есть такое понятие, как <firstterm>линия времени</firstterm>. Всякий раз, когда завершается восстановление из архива, создаётся новая линия времени, позволяющая идентифицировать последовательность записей WAL, добавленных после этого восстановления. Номер линии времени включается в имя файлов-сегментов WAL, так что файлы новой линии времени не перезаписывают файлы WAL, сгенерированные предыдущими линиями времени. Фактически это позволяет архивировать много различных линий времени. Хотя это может показаться бесполезной возможностью, на самом деле она часто бывает спасительной. Представьте, что вы не определились, какую точку времени выбрать для восстановления, и таким образом должны проводить восстановление методом проб и ошибок, пока не найдёте лучший момент для ответвления от старой истории. Без линий времени этот процесс быстро стал бы очень запутанным. А благодаря линиям времени, вы можете вернуться к <emphasis>любому</emphasis> предыдущему состоянию, включая состояния в ветках линий времени, покинутых ранее.
