Repository: pluzanov/pg-doc-ru
Catalog: 9.6/bgworker.po
Languages: ru

source: In some cases, a process which registers a background worker may wish to wait for the worker to start up. This can be accomplished by initializing <structfield>bgw_notify_pid</structfield> to <literal>MyProcPid</literal> and then passing the <type>BackgroundWorkerHandle *</type> obtained at registration time to <function>WaitForBackgroundWorkerStartup(<parameter>BackgroundWorkerHandle *handle</parameter>, <parameter>pid_t *</parameter>)</function> function. This function will block until the postmaster has attempted to start the background worker, or until the postmaster dies. If the background runner is running, the return value will <literal>BGWH_STARTED</literal>, and the PID will be written to the provided address. Otherwise, the return value will be <literal>BGWH_STOPPED</literal> or <literal>BGWH_POSTMASTER_DIED</literal>.
ru: В некоторых случаях процессу, регистрирующему рабочий процесс, может потребоваться дождаться завершения запуска этого процесса. Это можно реализовать, записав в <structfield>bgw_notify_pid</structfield> значение <literal>MyProcPid</literal>, а затем передав указатель <type>BackgroundWorkerHandle *</type>, полученный во время регистрации, функции <function>WaitForBackgroundWorkerStartup(<parameter>BackgroundWorkerHandle *handle</parameter>, <parameter>pid_t *</parameter>)</function>. Эта функция заблокирует выполнение, пока управляющий процесс не попытается запустить рабочий процесс, либо пока сам управляющий процесс не завершится. Если рабочий процесс запущен, возвращается значение <literal>BGWH_STARTED</literal>, и по переданному адресу записывается его PID. В противном случае возвращается значение <literal>BGWH_STOPPED</literal> или <literal>BGWH_POSTMASTER_DIED</literal>.

source: If a background worker sends asynchronous notifications with the <command>NOTIFY</command> command via the Server Programming Interface (<acronym>SPI</acronym>), it should call <function>ProcessCompletedNotifies</function> explicitly after committing the enclosing transaction so that any notifications can be delivered. If a background worker registers to receive asynchronous notifications with the <command>LISTEN</command> through <acronym>SPI</acronym>, the worker will log those notifications, but there is no programmatic way for the worker to intercept and respond to those notifications.
ru: Если фоновый рабочий процесс передаёт асинхронные уведомления, вызывая команду <command>NOTIFY</command> через <acronym>SPI</acronym> (Server Programming Interface, Интерфейс программирования сервера), он должен явно вызвать <function>ProcessCompletedNotifies</function> после фиксации окружающей транзакции, чтобы все эти уведомления были доставлены. Если рабочий процесс зарегистрируется для получения асинхронных уведомлений, вызвав <command>LISTEN</command> через <acronym>SPI</acronym>, уведомления будут выводиться, но перехватить и обработать эти уведомления программным образом нет возможности.

source: The <filename>src/test/modules/worker_spi</filename> module contains a working example, which demonstrates some useful techniques.
ru: Рабочий пример, демонстрирующий некоторые полезные приёмы, можно найти в модуле <filename>src/test/modules/worker_spi</filename>.

source: The maximum number of registered background workers is limited by <xref linkend="guc-max-worker-processes"/>.
ru: Максимальное число рабочих процессов, которые можно зарегистрировать, ограничивается значением <xref linkend="guc-max-worker-processes"/>.
