Repository: pluzanov/pg-doc-ru
Catalog: 9.6/client-auth.po
Languages: ru

source: The name or IP address of the RADIUS server to connect to. This parameter is required.
ru: Имя или IP-адрес сервера RADIUS, с которым будет проходить соединение. Это обязательный параметр.

source: The encryption vector used will only be cryptographically strong if <productname>PostgreSQL</productname> is built with support for <productname>OpenSSL</productname>. In other cases, the transmission to the RADIUS server should only be considered obfuscated, not secured, and external security measures should be applied if necessary.
ru: Шифровальный вектор будет достаточно эффективен только в том случае, если <productname>PostgreSQL</productname> собран с поддержкой <productname>OpenSSL</productname>. В противном случае, передача данных серверу RADIUS будет лишь замаскированной, но не защищённой, поэтому необходимо принять дополнительные меры безопасности.

source: The shared secret used when talking securely to the RADIUS server. This must have exactly the same value on the PostgreSQL and RADIUS servers. It is recommended that this be a string of at least 16 characters. This parameter is required. <placeholder-1/>
ru: Общий секрет, используемый при контактах с сервером RADIUS. Он должен иметь одинаковое значение на серверах PostgreSQL и RADIUS. Рекомендуется использовать строку как минимум из 16 символов. Это обязательный параметр. <placeholder-1/>

source: The port number on the RADIUS server to connect to. If no port is specified, the default port <literal>1812</literal> will be used.
ru: Номер порта для связи с сервером RADIUS. Если порт не указан, по умолчанию используется порт <literal>1812</literal>.

source: The string used as <literal>NAS Identifier</literal> in the RADIUS requests. This parameter can be used as a second parameter identifying for example which database user the user is attempting to authenticate as, which can be used for policy matching on the RADIUS server. If no identifier is specified, the default <literal>postgresql</literal> will be used.
ru: Строка, используемая в запросах сервера RADIUS как <literal>Идентификатор NAS</literal>. Этот параметр может использоваться как второй параметр, выявляющий, например, какой пользователь пытается подключиться под каким пользователем базы данных, что может быть использовано для формирования соответствий на сервере RADIUS. Если не указан идентификатор, по умолчанию используется <literal>postgresql</literal>.

source: The following configuration options are supported for RADIUS: <placeholder-1/>
ru: Для метода RADIUS доступны следующие параметры конфигурации: <placeholder-1/>

source: Certificate Authentication
ru: Аутентификация по сертификату

source: This authentication method uses SSL client certificates to perform authentication. It is therefore only available for SSL connections. When using this authentication method, the server will require that the client provide a valid certificate. No password prompt will be sent to the client. The <literal>cn</literal> (Common Name) attribute of the certificate will be compared to the requested database user name, and if they match the login will be allowed. User name mapping can be used to allow <literal>cn</literal> to be different from the database user name.
ru: Для аутентификации в рамках этого метода используется клиентский сертификат SSL, поэтому данный способ применим только для SSL подключений. Когда используется этот метод, сервер потребует от клиента предъявления действующего сертификата. Пароль у клиента не запрашивается. Атрибут <literal>cn</literal> (Обычное имя) сертификата сравнивается с запрашиваемым именем пользователя базы данных, и если они соответствуют, вход разрешается. Если <literal>cn</literal> отличается от имени пользователя базы данных, то может быть использован файл сопоставления имён пользователя.

source: The following configuration options are supported for SSL certificate authentication: <placeholder-1/>
ru: Для аутентификации по SSL сертификату доступны следующие параметры конфигурации: <placeholder-1/>

source: PAM Authentication
ru: Метод аутентификации PAM

source: PAM service name.
ru: Имя службы PAM

source: The following configuration options are supported for PAM: <placeholder-1/>
ru: Для аутентификации PAM доступны следующие параметры конфигурации:<placeholder-1/>

source: If PAM is set up to read <filename>/etc/shadow</filename>, authentication will fail because the PostgreSQL server is started by a non-root user. However, this is not an issue when PAM is configured to use LDAP or other authentication methods.
ru: Если PAM настроен для чтения <filename>/etc/shadow</filename>, произойдёт сбой аутентификации, потому что сервер PostgreSQL запущен не пользователем root. Однако это не имеет значения, когда PAM настроен для использования LDAP или других методов аутентификации.

source: Authentication Problems
ru: Проблемы аутентификации

source: Authentication failures and related problems generally manifest themselves through error messages like the following:
ru: Сбои и другие проблемы с аутентификацией обычно дают о себе знать через сообщения об ошибках, например:

source: <placeholder-1/> This is what you are most likely to get if you succeed in contacting the server, but it does not want to talk to you. As the message suggests, the server refused the connection request because it found no matching entry in its <filename>pg_hba.conf</filename> configuration file.
ru: <placeholder-1/> Это сообщение вы, скорее всего, получите, если сможете связаться с сервером, но он не захочет с вами общаться. В сообщении содержится предположение, что сервер отказывает вам в подключении, поскольку не может найти подходящую запись в файле <filename>pg_hba.conf</filename>.

source: <placeholder-1/> Messages like this indicate that you contacted the server, and it is willing to talk to you, but not until you pass the authorization method specified in the <filename>pg_hba.conf</filename> file. Check the password you are providing, or check your Kerberos or ident software if the complaint mentions one of those authentication types.
ru: <placeholder-1/> Такое сообщение показывает, что вы связались с сервером, он готов общаться с вами, но только после того, как вы прошли авторизацию по методу, указанному в файле <filename>pg_hba.conf</filename>. Проверьте пароль, который вы вводите, и как настроен Kerberos или ident, если в сообщении упоминается один из этих типов аутентификации.

source: <placeholder-1/> The indicated database user name was not found.
ru: <placeholder-1/> Указанное имя пользователя базы данных не найдено.

source: <placeholder-1/> The database you are trying to connect to does not exist. Note that if you do not specify a database name, it defaults to the database user name, which might or might not be the right thing.
ru: <placeholder-1/> База данных, к которой вы пытаетесь подключиться, не существует. Имейте в виду, что если вы не указали имя базы данных, по умолчанию берётся имя пользователя базы данных, что может приводить к ошибкам.

source: The server log might contain more information about an authentication failure than is reported to the client. If you are confused about the reason for a failure, check the server log.
ru: В журнале сервера может содержаться больше информации, чем в выдаваемых клиенту сообщениях об ошибке аутентификации, поэтому, если вас интересуют причины сбоя, проверьте журнал сервера.
