Repository: pluzanov/pg-doc-ru
Catalog: 9.6/client-auth.po
Languages: ru

source: Also, a reverse lookup is necessary to implement the suffix matching feature, because the actual client host name needs to be known in order to match it against the pattern.
ru: Также обратный запрос необходим для того, чтобы реализовать возможность соответствия суффиксов, поскольку для сопоставления с шаблоном требуется знать фактическое имя компьютера клиента.

source: Note that this behavior is consistent with other popular implementations of host name-based access control, such as the Apache HTTP Server and TCP Wrappers.
ru: Обратите внимание, что такое поведение согласуется с другими популярными реализациями контроля доступа на основе имён, такими как Apache HTTP Server и TCP Wrappers.

source: IP-address
ru: IP-адрес

source: IP-mask
ru: IP-маска

source: These two fields can be used as an alternative to the <replaceable>IP-address</replaceable><literal>/</literal><replaceable>mask-length</replaceable> notation. Instead of specifying the mask length, the actual mask is specified in a separate column. For example, <literal>255.0.0.0</literal> represents an IPv4 CIDR mask length of 8, and <literal>255.255.255.255</literal> represents a CIDR mask length of 32.
ru: Эти два поля могут быть использованы как альтернатива записи <replaceable>IP-адрес</replaceable><literal>/</literal><replaceable>длина-маски</replaceable>. Вместо того, чтобы указывать длину маски, в отдельном столбце указывается сама маска. Например, <literal>255.0.0.0</literal> представляет собой маску CIDR для IPv4 длиной 8 бит, а <literal>255.255.255.255</literal> представляет маску CIDR длиной 32 бита.

source: These fields only apply to <literal>host</literal>, <literal>hostssl</literal>, and <literal>hostnossl</literal> records.
ru: Эти поля применимы только к записям <literal>host</literal>, <literal>hostssl</literal> и <literal>hostnossl</literal>.

source: Allow the connection unconditionally. This method allows anyone that can connect to the <productname>PostgreSQL</productname> database server to login as any <productname>PostgreSQL</productname> user they wish, without the need for a password or any other authentication. See <xref linkend="auth-trust"/> for details.
ru: Разрешает безусловное подключение. Этот метод позволяет тому, кто может подключиться к серверу с базой данных <productname>PostgreSQL</productname>, войти под любым желаемым пользователем <productname>PostgreSQL</productname> без введения пароля и без какой-либо другой аутентификации. За подробностями обратитесь к <xref remap="3" linkend="auth-trust"/>.

source: Reject the connection unconditionally. This is useful for <quote>filtering out</quote> certain hosts from a group, for example a <literal>reject</literal> line could block a specific host from connecting, while a later line allows the remaining hosts in a specific network to connect.
ru: Отклоняет подключение безусловно. Эта возможность полезна для <quote>фильтрации</quote> некоторых серверов группы, например, строка <literal>reject</literal> может отклонить попытку подключения одного компьютера, при этом следующая строка позволяет подключиться остальным компьютерам в той же сети.

source: Require the client to supply a double-MD5-hashed password for authentication. See <xref linkend="auth-password"/> for details.
ru: Требует от клиента предоставить для аутентификации пароль, дважды хешированный алгоритмом MD5. За подробностями обратитесь к <xref remap="3" linkend="auth-password"/>.

source: Require the client to supply an unencrypted password for authentication. Since the password is sent in clear text over the network, this should not be used on untrusted networks. See <xref linkend="auth-password"/> for details.
ru: Требует для аутентификации введения клиентом незашифрованного пароля. Поскольку пароль посылается простым текстом через сеть, такой способ не стоит использовать, если сеть не вызывает доверия. За подробностями обратитесь к <xref remap="3" linkend="auth-password"/>.

source: Use GSSAPI to authenticate the user. This is only available for TCP/IP connections. See <xref linkend="gssapi-auth"/> for details.
ru: Для аутентификации пользователя использует GSSAPI. Этот способ доступен только для подключений по TCP/IP. За подробностями обратитесь к <xref remap="3" linkend="gssapi-auth"/>.

source: Use SSPI to authenticate the user. This is only available on Windows. See <xref linkend="sspi-auth"/> for details.
ru: Для аутентификации пользователя использует SSPI. Способ доступен только для Windows. За подробностями обратитесь к <xref remap="3" linkend="sspi-auth"/>.

source: Obtain the operating system user name of the client by contacting the ident server on the client and check if it matches the requested database user name. Ident authentication can only be used on TCP/IP connections. When specified for local connections, peer authentication will be used instead. See <xref linkend="auth-ident"/> for details.
ru: Получает имя пользователя операционной системы клиента, связываясь с сервером Ident, и проверяет, соответствует ли оно имени пользователя базы данных. Аутентификация ident может использоваться только для подключений по TCP/IP. Для локальных подключений применяется аутентификация peer. За подробностями обратитесь к <xref remap="3" linkend="auth-ident"/>.

source: Obtain the client's operating system user name from the operating system and check if it matches the requested database user name. This is only available for local connections. See <xref linkend="auth-peer"/> for details.
ru: Получает имя пользователя операционной системы клиента из операционной системы и проверяет, соответствует ли оно имени пользователя запрашиваемой базы данных. Доступно только для локальных подключений. За подробностями обратитесь к <xref remap="3" linkend="auth-peer"/>.

source: Authenticate using an <acronym>LDAP</acronym> server. See <xref linkend="auth-ldap"/> for details.
ru: Проводит аутентификацию, используя сервер <acronym>LDAP</acronym>. За подробностями обратитесь к <xref remap="3" linkend="auth-ldap"/>.

source: Authenticate using a RADIUS server. See <xref linkend="auth-radius"/> for details.
ru: Проводит аутентификацию, используя сервер RADIUS. За подробностями обратитесь к <xref remap="3" linkend="auth-radius"/>

source: Authenticate using SSL client certificates. See <xref linkend="auth-cert"/> for details.
ru: Проводит аутентификацию, используя клиентский сертификат SSL. За подробностями обратитесь к <xref remap="3" linkend="auth-cert"/>

source: Authenticate using the Pluggable Authentication Modules (PAM) service provided by the operating system. See <xref linkend="auth-pam"/> for details.
ru: Проводит аутентификацию, используя службу подключаемых модулей аутентификации (PAM), предоставляемую операционной системой. За подробностями обратитесь к <xref remap="3" linkend="auth-pam"/>.

source: Specifies the authentication method to use when a connection matches this record. The possible choices are summarized here; details are in <xref linkend="auth-methods"/>. <placeholder-1/>
ru: Указывает метод аутентификации, когда подключение соответствует этой записи. Варианты выбора приводятся ниже; подробности в <xref remap="6" linkend="auth-methods"/>. <placeholder-1/>.

source: After the <replaceable>auth-method</replaceable> field, there can be field(s) of the form <replaceable>name</replaceable><literal>=</literal><replaceable>value</replaceable> that specify options for the authentication method. Details about which options are available for which authentication methods appear below.
ru: После поля <replaceable>auth-method</replaceable> может идти поле (поля) вида <replaceable>name</replaceable><literal>=</literal><replaceable>value</replaceable>, определяющее параметры метода аутентификации. Подробнее о параметрах, доступных для различных методов аутентификации, рассказывается ниже.

source: A record can have one of the seven formats <synopsis>local <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> host <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>address</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostssl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>address</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostnossl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>address</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> host <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>IP-address</replaceable> <replaceable>IP-mask</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostssl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>IP-address</replaceable> <replaceable>IP-mask</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostnossl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>IP-address</replaceable> <replaceable>IP-mask</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional></synopsis> The meaning of the fields is as follows: <placeholder-1/>
ru: Запись может быть сделана в одном из семи форматов: <synopsis>local <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> host <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>address</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostssl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>address</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostnossl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>address</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> host <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>IP-address</replaceable> <replaceable>IP-mask</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostssl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>IP-address</replaceable> <replaceable>IP-mask</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional> hostnossl <replaceable>database</replaceable> <replaceable>user</replaceable> <replaceable>IP-address</replaceable> <replaceable>IP-mask</replaceable> <replaceable>auth-method</replaceable> <optional><replaceable>auth-options</replaceable></optional></synopsis> Значения полей описаны ниже: <placeholder-1/>

source: Files included by <literal>@</literal> constructs are read as lists of names, which can be separated by either whitespace or commas. Comments are introduced by <literal>#</literal>, just as in <filename>pg_hba.conf</filename>, and nested <literal>@</literal> constructs are allowed. Unless the file name following <literal>@</literal> is an absolute path, it is taken to be relative to the directory containing the referencing file.
ru: Файлы, включённые в конструкции, начинающиеся с <literal>@</literal>, читаются, как список имён, разделённых запятыми или пробелами. Комментарии предваряются знаком <literal>#</literal>, как и в файле <filename>pg_hba.conf</filename>, и вложенные <literal>@</literal> конструкции допустимы. Если только имя файла, начинающегося с <literal>@</literal> не является абсолютным путём.

source: Since the <filename>pg_hba.conf</filename> records are examined sequentially for each connection attempt, the order of the records is significant. Typically, earlier records will have tight connection match parameters and weaker authentication methods, while later records will have looser match parameters and stronger authentication methods. For example, one might wish to use <literal>trust</literal> authentication for local TCP/IP connections but require a password for remote TCP/IP connections. In this case a record specifying <literal>trust</literal> authentication for connections from 127.0.0.1 would appear before a record specifying password authentication for a wider range of allowed client IP addresses.
ru: Поскольку записи файла <filename>pg_hba.conf</filename> рассматриваются последовательно для каждого подключения, порядок записей имеет большое значение. Обычно, более ранние записи определяют чёткие критерии для соответствия параметров подключения, но для методов аутентификации допускают послабления. Напротив, записи более поздние смягчают требования к соответствию параметров подключения, но усиливают их в отношении методов аутентификации. Например, некто желает использовать <literal>trust</literal> аутентификацию для локального подключения по TCP/IP, но при этом запрашивать пароль для удалённых подключений по TCP/IP. В этом случае, запись, указывающая <literal>trust</literal> аутентификацию для подключения адреса 127.0.0.1 должна появиться до записи, определяющей аутентификацию через пароль для более широкого диапазона клиентских IP-адресов.

source: The <filename>pg_hba.conf</filename> file is read on start-up and when the main server process receives a <systemitem>SIGHUP</systemitem><placeholder-1/> signal. If you edit the file on an active system, you will need to signal the postmaster (using <literal>pg_ctl reload</literal> or <literal>kill -HUP</literal>) to make it re-read the file.
ru: Файл <filename>pg_hba.conf</filename> прочитывается во время запуска и в момент получения основным процессом сервера сигнала <systemitem>SIGHUP</systemitem><placeholder-1/>. Если вы редактируете файл во время работы системы, необходимо послать сигнал процессу postmaster (используя <literal>pg_ctl reload</literal> или <literal>kill -HUP</literal>), чтобы он прочел обновленный файл.

source: To connect to a particular database, a user must not only pass the <filename>pg_hba.conf</filename> checks, but must have the <literal>CONNECT</literal> privilege for the database. If you wish to restrict which users can connect to which databases, it's usually easier to control this by granting/revoking <literal>CONNECT</literal> privilege than to put the rules in <filename>pg_hba.conf</filename> entries.
ru: Чтобы подключиться к конкретной базе данных, пользователь не только должен пройти все проверки файла <filename>pg_hba.conf</filename>, но должен иметь привилегию <literal>CONNECT</literal> для подключения к базе данных. Если вы хотите ограничить доступ к базам данных для определённых пользователей, проще предоставить/отозвать привилегию <literal>CONNECT</literal>, нежели устанавливать правила в записях файла <filename>pg_hba.conf</filename>.

source: Some examples of <filename>pg_hba.conf</filename> entries are shown in <xref linkend="example-pg-hba.conf"/>. See the next section for details on the different authentication methods.
ru: Примеры записей файла <filename>pg_hba.conf</filename> показаны в <xref remap="6" linkend="example-pg-hba.conf"/>. Обратитесь к следующему разделу за более подробной информацией по методам аутентификации.

source: Example <filename>pg_hba.conf</filename> Entries
ru: Примеры записей <filename>pg_hba.conf</filename>

source: # Allow any user on the local system to connect to any database with # any database user name using Unix-domain sockets (the default for local # connections). # # TYPE DATABASE USER ADDRESS METHOD local all all trust # The same using local loopback TCP/IP connections. # # TYPE DATABASE USER ADDRESS METHOD host all all 127.0.0.1/32 trust # The same as the previous line, but using a separate netmask column # # TYPE DATABASE USER IP-ADDRESS IP-MASK METHOD host all all 127.0.0.1 255.255.255.255 trust # The same over IPv6. # # TYPE DATABASE USER ADDRESS METHOD host all all ::1/128 trust # The same using a host name (would typically cover both IPv4 and IPv6). # # TYPE DATABASE USER ADDRESS METHOD host all all localhost trust # Allow any user from any host with IP address 192.168.93.x to connect # to database "postgres" as the same user name that ident reports for # the connection (typically the operating system user name). # # TYPE DATABASE USER ADDRESS METHOD host postgres all 192.168.93.0/24 ident # Allow any user from host 192.168.12.10 to connect to database # "postgres" if the user's password is correctly supplied. # # TYPE DATABASE USER ADDRESS METHOD host postgres all 192.168.12.10/32 md5 # Allow any user from hosts in the example.com domain to connect to # any database if the user's password is correctly supplied. # # TYPE DATABASE USER ADDRESS METHOD host all all .example.com md5 # In the absence of preceding "host" lines, these two lines will # reject all connections from 192.168.54.1 (since that entry will be # matched first), but allow GSSAPI connections from anywhere else # on the Internet. The zero mask causes no bits of the host IP # address to be considered, so it matches any host. # # TYPE DATABASE USER ADDRESS METHOD host all all 192.168.54.1/32 reject host all all 0.0.0.0/0 gss # Allow users from 192.168.x.x hosts to connect to any database, if # they pass the ident check. If, for example, ident says the user is # "bryanh" and he requests to connect as PostgreSQL user "guest1", the # connection is allowed if there is an entry in pg_ident.conf for map # "omicron" that says "bryanh" is allowed to connect as "guest1". # # TYPE DATABASE USER ADDRESS METHOD host all all 192.168.0.0/16 ident map=omicron # If these are the only three lines for local connections, they will # allow local users to connect only to their own databases (databases # with the same name as their database user name) except for administrators # and members of role "support", who can connect to all databases. The file # $PGDATA/admins contains a list of names of administrators. Passwords # are required in all cases. # # TYPE DATABASE USER ADDRESS METHOD local sameuser all md5 local all @admins md5 local all +support md5 # The last two lines above can be combined into a single line: local all @admins,+support md5 # The database column can also use lists and file names: local db1,db2,@demodbs all md5
ru: # Позволяет любому пользователю локальной системы подключиться # к любой базе данных, используя любое имя базы данных через # доменные сокеты Unix (по умолчанию для локальных подключений). # # TYPE DATABASE USER ADDRESS METHOD local all all trust # То же, но для локальных замкнутых подключений по TCP/IP. # # TYPE DATABASE USER ADDRESS METHOD host all all 127.0.0.1/32 trust # То же, что и на предыдущей строке, но для подключений с указанием # сетевой маски в отдельном столбце # # TYPE DATABASE USER IP-ADDRESS IP-MASK METHOD host all all 127.0.0.1 255.255.255.255 trust # То же для IPv6. # # TYPE DATABASE USER ADDRESS METHOD host all all ::1/128 trust # То же самое, но с использованием имени сервера # (обычно покрывает и IPv4, и IPv6). # # TYPE DATABASE USER ADDRESS METHOD host all all localhost trust # Позволяет любому пользователю любого узла с IP-адресом # 192.168.93.x подключаться к базе данных "postgres" # как имени пользователя, которое сообщает для подключения ident # (как правило, имя пользователя операционной системы ). # # TYPE DATABASE USER ADDRESS METHOD host postgres all 192.168.93.0/24 ident # Позволяет любому пользователю сервера 192.168.12.10 подключиться # к базе данных "postgres" если пользователь ввел корректный пароль. # # TYPE DATABASE USER ADDRESS METHOD host postgres all 192.168.12.10/32 md5 # Позволяет пользователям поддоменов example.com подключиться #к любой базе данных при введении корректного пароля. # # TYPE DATABASE USER ADDRESS METHOD host all all .example.com md5 #В случае отсутствия предшествующих "host" строчек, эти две строки # откажут в подключении 192.168.54.1 (поскольку данная запись будет # сопоставляться первой), но разрешат подключения GSSAPI со всех других # адресов. Нулевая маска позволяет не рассматривать ни одного бита # из IP-адреса сервера, и поэтому любой адрес сервера будет соответствовать. # # TYPE DATABASE USER ADDRESS METHOD host all all 192.168.54.1/32 reject host all all 0.0.0.0/0 gss # Позволяет пользователям с любого сервера 192.168.x.x подключиться # к любой базе данных, если они проходят проверку ident. Если же ident # говорит, например, что это пользователь "bryanh" и он запрашивает # подключение как PostgreSQL пользователь "guest1", подключение # будет разрешено, если в файле pg_ident.conf есть запись для файла сопоставления # "omicron", позволяющая пользователю "bryanh" подключиться как "guest1". # # TYPE DATABASE USER ADDRESS METHOD host all all 192.168.0.0/16 ident map=omicron # Если для локальных подключений предусмотрены только эти три строки # они позволят локальным пользователям подключиться только к своим # базам данных (базам данных с такими же именами пользователя, # как и имя пользователя их базы данных) кроме администраторов # или членов роли "support", которые могут подключиться к любой БД. # Файл $PGDATA/admins включает в себя список имён администраторов. # Пароли запрашиваются в любом случае. # # TYPE DATABASE USER ADDRESS METHOD local sameuser all md5 local all @admins md5 local all +support md5 # Последние две строчки выше могут быть скомбинированы в одну: local all @admins,+support md5 # В столбце также могут указываться списки и имена файлов: local db1,db2,@demodbs all md5

source: User Name Maps
ru: Файл сопоставления имён пользователей

source: <primary>User name maps</primary>
ru: <primary>Файл сопоставления имён пользователей</primary>
