Repository: pluzanov/pg-doc-ru
Catalog: 9.6/client-auth.po
Languages: ru

source: User name maps are defined in the ident map file, which by default is named <filename>pg_ident.conf</filename><placeholder-1/> and is stored in the cluster's data directory. (It is possible to place the map file elsewhere, however; see the <xref linkend="guc-ident-file"/> configuration parameter.) The ident map file contains lines of the general form: <synopsis><replaceable>map-name</replaceable> <replaceable>system-username</replaceable> <replaceable>database-username</replaceable></synopsis> Comments and whitespace are handled in the same way as in <filename>pg_hba.conf</filename>. The <replaceable>map-name</replaceable> is an arbitrary name that will be used to refer to this mapping in <filename>pg_hba.conf</filename>. The other two fields specify an operating system user name and a matching database user name. The same <replaceable>map-name</replaceable> can be used repeatedly to specify multiple user-mappings within a single map.
ru: Сопоставления имён пользователя определяются в файле сопоставления ident, который по умолчанию называется <filename>pg_ident.conf</filename><placeholder-1/> и хранится в каталоге данных кластера. (Файл сопоставления может быть помещён и в другое место, обратитесь к информации о настройке параметра <xref linkend="guc-ident-file"/>.) Файл сопоставления ident содержит строки общей формы: <synopsis><replaceable>map-name</replaceable> <replaceable>system-username</replaceable> <replaceable>database-username</replaceable></synopsis> Комментарии и пробелы применяются так же, как и в файле <filename>pg_hba.conf</filename>. <replaceable>map-name</replaceable> является произвольным именем, на которое будет ссылаться файл сопоставления файла <filename>pg_hba.conf</filename>. Два других поля указывают имя пользователя операционной системы и соответствующее имя пользователя базы данных. Имя <replaceable>map-name</replaceable> может быть использовано неоднократно, чтобы указывать множественные сопоставления пользовательских имён в рамках одного файла сопоставления.

source: There is no restriction regarding how many database users a given operating system user can correspond to, nor vice versa. Thus, entries in a map should be thought of as meaning <quote>this operating system user is allowed to connect as this database user</quote>, rather than implying that they are equivalent. The connection will be allowed if there is any map entry that pairs the user name obtained from the external authentication system with the database user name that the user has requested to connect as.
ru: Нет никаких ограничений по количеству пользователей баз данных, на которые может ссылаться пользователь операционной системы, и наоборот. Тем не менее, записи в файле скорее подразумевают, что <quote> пользователь этой операционной системы может подключиться как пользователь этой базы данных</quote>, нежели показывают, что эти имена пользователей эквивалентны. Подключение разрешается, если существует запись в файле сопоставления, соединяющая имя, полученное от внешней системы аутентификации, с именем пользователя базы данных, под которым пользователь хочет подключиться.

source: If the <replaceable>system-username</replaceable> field starts with a slash (<literal>/</literal>), the remainder of the field is treated as a regular expression. (See <xref linkend="posix-syntax-details"/> for details of <productname>PostgreSQL</productname>'s regular expression syntax.) The regular expression can include a single capture, or parenthesized subexpression, which can then be referenced in the <replaceable>database-username</replaceable> field as <literal>\1</literal> (backslash-one). This allows the mapping of multiple user names in a single line, which is particularly useful for simple syntax substitutions. For example, these entries <placeholder-1/> will remove the domain part for users with system user names that end with <literal>@mydomain.com</literal>, and allow any user whose system name ends with <literal>@otherdomain.com</literal> to log in as <literal>guest</literal>.
ru: Если поле <replaceable>system-username</replaceable> начинается со знака (<literal>/</literal>), оставшаяся его часть рассматривается как регулярное выражение. (Подробнее синтаксис регулярных выражений <productname>PostgreSQL</productname> описан в <xref remap="6" linkend="posix-syntax-details"/>.) Регулярное выражение может включать в себя одну группу, или заключённое в скобки подвыражение, на которое можно сослаться в поле <replaceable>database-username</replaceable>, написав <literal>\1</literal> (с одной обратной косой). Это позволяет сопоставить несколько имён пользователя с одной строкой, что особенно удобно для простых замен. Например, эти строки <placeholder-1/> удалят часть домена для имён пользователей, которые заканчиваются на <literal>@mydomain.com</literal>, и позволят пользователям, чьё имя пользователя системы заканчивается на <literal>@otherdomain.com</literal>, подключиться как <literal>guest</literal>.

source: Keep in mind that by default, a regular expression can match just part of a string. It's usually wise to use <literal>^</literal> and <literal>$</literal>, as shown in the above example, to force the match to be to the entire system user name.
ru: Помните, что по умолчанию, регулярное выражение может совпасть только с частью строки. Разумным выходом будет использование символов <literal>^</literal> и <literal>$</literal>, как показано в примере выше, для принудительного совпадения со всем именем пользователя операционной системы

source: The <filename>pg_ident.conf</filename> file is read on start-up and when the main server process receives a <systemitem>SIGHUP</systemitem><placeholder-1/> signal. If you edit the file on an active system, you will need to signal the postmaster (using <literal>pg_ctl reload</literal> or <literal>kill -HUP</literal>) to make it re-read the file.
ru: Файл <filename>pg_ident.conf</filename> читается при запуске системы, а также в тот момент, когда основной сервер получает сигнал <systemitem>SIGHUP</systemitem><placeholder-1/>. Если вы редактируете файл во время работы системы, необходимо послать сигнал процессу postmaster (используя <literal>pg_ctl reload</literal> или <literal>kill -HUP</literal>), чтобы он прочел обновленный файл.

source: A <filename>pg_ident.conf</filename> file that could be used in conjunction with the <filename>pg_hba.conf</filename> file in <xref linkend="example-pg-hba.conf"/> is shown in <xref linkend="example-pg-ident.conf"/>. In this example, anyone logged in to a machine on the 192.168 network that does not have the operating system user name <literal>bryanh</literal>, <literal>ann</literal>, or <literal>robert</literal> would not be granted access. Unix user <literal>robert</literal> would only be allowed access when he tries to connect as <productname>PostgreSQL</productname> user <literal>bob</literal>, not as <literal>robert</literal> or anyone else. <literal>ann</literal> would only be allowed to connect as <literal>ann</literal>. User <literal>bryanh</literal> would be allowed to connect as either <literal>bryanh</literal> or as <literal>guest1</literal>.
ru: Файл <filename>pg_ident.conf</filename>, который может быть использован в сочетании с файлом <filename>pg_hba.conf</filename> (см. <xref remap="4" linkend="example-pg-hba.conf"/>), показан в <xref remap="6" linkend="example-pg-ident.conf"/>. В этом примере любым пользователям компьютеров в сети 192.168 с именами, отличными от <literal>bryanh</literal>, <literal>ann</literal> или <literal>robert</literal>, будет отказано в доступе. Пользователь системы <literal>robert</literal> получит доступ только тогда, когда подключается как пользователь <productname>PostgreSQL</productname> <literal>bob</literal>, а не как <literal>robert</literal>, или какой-либо другой пользователь. Пользователь <literal>ann</literal> сможет подключиться только как <literal>ann</literal>. Пользователь <literal>bryanh</literal> сможет подключиться как <literal>bryanh</literal> или как <literal>guest1</literal>.

source: An Example <filename>pg_ident.conf</filename> File
ru: Пример файла <filename>pg_ident.conf</filename>

source: # MAPNAME SYSTEM-USERNAME PG-USERNAME omicron bryanh bryanh omicron ann ann # bob has user name robert on these machines omicron robert bob # bryanh can also connect as guest1 omicron bryanh guest1
ru: # MAPNAME SYSTEM-USERNAME PG-USERNAME omicron bryanh bryanh omicron ann ann # на этих машинах bob может подключаться как robert omicron robert bob # bryanh также может подключаться как guest1 omicron bryanh guest1

source: Authentication Methods
ru: Методы аутентификации

source: The following subsections describe the authentication methods in more detail.
ru: Следующие подразделы содержат более детальную информацию о методах аутентификации.

source: Trust Authentication
ru: Метод аутентификации trust

source: When <literal>trust</literal> authentication is specified, <productname>PostgreSQL</productname> assumes that anyone who can connect to the server is authorized to access the database with whatever database user name they specify (even superuser names). Of course, restrictions made in the <literal>database</literal> and <literal>user</literal> columns still apply. This method should only be used when there is adequate operating-system-level protection on connections to the server.
ru: Когда указан способ аутентификации <literal>trust</literal>, <productname>PostgreSQL</productname> предполагает, что любой подключающийся к серверу авторизован для доступа к базе данных вне зависимости от указанного имени пользователя базы данных (даже если это имя суперпользователя). Конечно, ограничения, прописанные в столбцах <literal>database</literal> и <literal>user</literal>, продолжают работать. Этот метод должен применяться только в том случае, когда на уровне операционной системы обеспечена адекватная защита от подключений к серверу.

source: <literal>trust</literal> authentication is appropriate and very convenient for local connections on a single-user workstation. It is usually <emphasis>not</emphasis> appropriate by itself on a multiuser machine. However, you might be able to use <literal>trust</literal> even on a multiuser machine, if you restrict access to the server's Unix-domain socket file using file-system permissions. To do this, set the <varname>unix_socket_permissions</varname> (and possibly <varname>unix_socket_group</varname>) configuration parameters as described in <xref linkend="runtime-config-connection"/>. Or you could set the <varname>unix_socket_directories</varname> configuration parameter to place the socket file in a suitably restricted directory.
ru: Аутентификация <literal>trust</literal> очень удобна для локальных подключений на однопользовательской рабочей станции. Но сам по себе этот метод обычно <emphasis>не</emphasis> подходит для машин с несколькими пользователями. Однако вы можете использовать <literal>trust</literal> даже на многопользовательской машине, если ограничите доступ к файлу Unix-сокета сервера, используя систему разрешения файлов. Для этого установите конфигурационные параметры <varname>unix_socket_permissions</varname> (и, возможно, <varname>unix_socket_group</varname>) как описано в <xref remap="6" linkend="runtime-config-connection"/>. Вы также можете установить конфигурационные параметры <varname>unix_socket_directories</varname>, чтобы поместить файл сокета в подходящим образом защищённый каталог.

source: Setting file-system permissions only helps for Unix-socket connections. Local TCP/IP connections are not restricted by file-system permissions. Therefore, if you want to use file-system permissions for local security, remove the <literal>host ... 127.0.0.1 ...</literal> line from <filename>pg_hba.conf</filename>, or change it to a non-<literal>trust</literal> authentication method.
ru: Установка разрешений у файловой системы помогает только в случае подключений через Unix-сокеты. Локальные соединения по TCP/IP не ограничены разрешениями файловой системы. Поэтому, если вы хотите использовать разрешения файловой системы для обеспечения локальной безопасности, уберите строку <literal>host ... 127.0.0.1 ...</literal> из <filename>pg_hba.conf</filename> или смените метод аутентификации.

source: <literal>trust</literal> authentication is only suitable for TCP/IP connections if you trust every user on every machine that is allowed to connect to the server by the <filename>pg_hba.conf</filename> lines that specify <literal>trust</literal>. It is seldom reasonable to use <literal>trust</literal> for any TCP/IP connections other than those from <systemitem>localhost</systemitem> (127.0.0.1).
ru: Метод аутентификации <literal>trust</literal> для подключений по TCP/IP допустим только в случае, если вы доверяете каждому пользователю компьютера, получившему разрешение на подключение к серверу строками файла <filename>pg_hba.conf</filename>, указывающими метод <literal>trust</literal>. Не стоит использовать <literal>trust</literal> для любых подключений по TCP/IP, отличных от <systemitem>localhost</systemitem> (127.0.0.1).

source: Password Authentication
ru: Метод аутентификации password

source: <primary>password</primary><secondary>authentication</secondary>
ru: <primary>password</primary><secondary>Аутентификация</secondary>

source: The password-based authentication methods are <literal>md5</literal> and <literal>password</literal>. These methods operate similarly except for the way that the password is sent across the connection, namely MD5-hashed and clear-text respectively.
ru: Методы аутентификации с помощью пароля это <literal>md5</literal> и <literal>password</literal>. Эти методы работает сходным образом, за исключением пути, по которому отсылается пароль во время подключения, а именно, хешируется через MD5 или обрабатывается как простой текст.

source: If you are at all concerned about password <quote>sniffing</quote> attacks then <literal>md5</literal> is preferred. Plain <literal>password</literal> should always be avoided if possible. However, <literal>md5</literal> cannot be used with the <xref linkend="guc-db-user-namespace"/> feature. If the connection is protected by SSL encryption then <literal>password</literal> can be used safely (though SSL certificate authentication might be a better choice if one is depending on using SSL).
ru: Если вас беспокоит возможность перехвата трафика, предпочтительнее использовать метод <literal>md5</literal>. Простого метода <literal>password</literal> следует избегать всегда, если возможно. Однако, <literal>md5</literal> не может быть использован с параметром <xref linkend="guc-db-user-namespace"/>. Если подключение зашифровано по SSL, тогда <literal>password</literal> тоже может быть использован без опасений (хотя аутентификация через SSL сертификат будет наилучшим выбором для тех, кто зависит от использования SSL).

source: <productname>PostgreSQL</productname> database passwords are separate from operating system user passwords. The password for each database user is stored in the <literal>pg_authid</literal> system catalog. Passwords can be managed with the SQL commands <xref linkend="sql-createuser"/> and <xref linkend="sql-alterrole"/>, e.g., <userinput>CREATE USER foo WITH PASSWORD 'secret'</userinput>. If no password has been set up for a user, the stored password is null and password authentication will always fail for that user.
ru: База данных паролей <productname>PostgreSQL</productname> отделена от паролей пользователей операционной системы. Пароль для каждого пользователя базы данных хранится в системном каталоге <literal>pg_authid</literal>. Работать с паролями можно через команды SQL <xref linkend="sql-createuser"/> и <xref linkend="sql-alterrole"/>, например, <userinput>CREATE USER foo WITH PASSWORD 'secret'</userinput>. Если для пользователя не было установлено пароля, пароль сохраняется как null, и аутентификация через пароль для данного пользователя будет невозможна.

source: GSSAPI Authentication
ru: Аутентификация GSSAPI

source: <productname>GSSAPI</productname> is an industry-standard protocol for secure authentication defined in RFC 2743. <productname>PostgreSQL</productname> supports <productname>GSSAPI</productname> with <productname>Kerberos</productname> authentication according to RFC 1964. <productname>GSSAPI</productname> provides automatic authentication (single sign-on) for systems that support it. The authentication itself is secure, but the data sent over the database connection will be sent unencrypted unless <acronym>SSL</acronym> is used.
ru: <productname>GSSAPI</productname> является протоколом отраслевого стандарта для безопасной авторизации, определённым в RFC 2743. <productname>PostgreSQL</productname> поддерживает <productname>GSSAPI</productname> с <productname>Kerberos</productname> аутентификацией с соответствии с RFC 1964. <productname>GSSAPI</productname> обеспечивает автоматическую аутентификацию (single sign-on), для систем, которые её поддерживают. Сама по себе аутентификация безопасна, но данные, отсылаемые в ходе подключения к базе данных, не защищены, если не используется <acronym>SSL</acronym>.

source: GSSAPI support has to be enabled when <productname>PostgreSQL</productname> is built; see <xref linkend="installation"/> for more information.
ru: Поддержка GSSAPI должна быть включена при сборке <productname>PostgreSQL</productname>; за дополнительными сведениями обратитесь к <xref remap="3" linkend="installation"/>.

source: When <productname>GSSAPI</productname> uses <productname>Kerberos</productname>, it uses a standard principal in the format <literal><replaceable>servicename</replaceable>/<replaceable>hostname</replaceable>@<replaceable>realm</replaceable></literal>. The PostgreSQL server will accept any principal that is included in the keytab used by the server, but care needs to be taken to specify the correct principal details when making the connection from the client using the <literal>krbsrvname</literal> connection parameter. (See also <xref linkend="libpq-paramkeywords"/>.) The installation default can be changed from the default <literal>postgres</literal> at build time using <literal>./configure --with-krb-srvnam=</literal><replaceable>whatever</replaceable>. In most environments, this parameter never needs to be changed. Some Kerberos implementations might require a different service name, such as Microsoft Active Directory which requires the service name to be in upper case (<literal>POSTGRES</literal>).
ru: При работе с <productname>Kerberos</productname> <productname>GSSAPI</productname> использует стандартные учётные записи в формате <literal><replaceable>servicename</replaceable>/<replaceable>hostname</replaceable>@<replaceable>realm</replaceable></literal>. Сервер PostgreSQL примет любого принципала, включённого в используемый сервером файл таблицы ключей, но необходимо проявить осторожность в указании корректных деталей принципала в ходе соединения с клиентом, применяющим параметр подключения <literal>krbsrvname</literal>. (См. также <xref linkend="libpq-paramkeywords"/>.) Значение имени сервиса по умолчанию <literal>postgres</literal> может быть изменено во время сборки с помощью <literal>./configure --with-krb-srvnam=</literal><replaceable>whatever</replaceable>. В большинстве сред изменять данный параметр не требуется. Однако некоторые реализации Kerberos могут потребовать иного имени сервиса, например, Microsoft Active Directory требует, чтобы имя сервиса было набрано заглавными буквами (<literal>POSTGRES</literal>).

source: <replaceable>hostname</replaceable> is the fully qualified host name of the server machine. The service principal's realm is the preferred realm of the server machine.
ru: <replaceable>hostname</replaceable> здесь — это полное доменное имя компьютера, где работает сервер. Областью субъекта-службы является предпочитаемая область данного компьютера.

source: Client principals can be mapped to different <productname>PostgreSQL</productname> database user names with <filename>pg_ident.conf</filename>. For example, <literal>pgusername@realm</literal> could be mapped to just <literal>pgusername</literal>. Alternatively, you can use the full <literal>username@realm</literal> principal as the role name in <productname>PostgreSQL</productname> without any mapping.
ru: Принципалы клиентов могут быть сопоставлены с различными именами пользователей баз данных <productname>PostgreSQL</productname> в <filename>pg_ident.conf</filename>. Например, принципалу <literal>pgusername@realm</literal> может быть сопоставлено просто <literal>pgusername</literal>. Так же возможно использовать в качестве имени роли в <productname>PostgreSQL</productname> полное имя принципала <literal>username@realm</literal> без какого-либо сопоставления.

source: The keytab file is generated by the Kerberos software; see the Kerberos documentation for details. The following example is for MIT-compatible Kerberos 5 implementations: <screen><prompt>kadmin% </prompt><userinput>ank -randkey postgres/server.my.domain.org</userinput> <prompt>kadmin% </prompt><userinput>ktadd -k krb5.keytab postgres/server.my.domain.org</userinput></screen>
ru: Файл таблицы ключей генерируется программным обеспечением Kerberos; подробнее это описано в документации Kerberos. Следующий пример для MIT-совместимых реализаций Kerberos 5: <screen><prompt>kadmin% </prompt><userinput>ank -randkey postgres/server.my.domain.org</userinput> <prompt>kadmin% </prompt><userinput>ktadd -k krb5.keytab postgres/server.my.domain.org</userinput></screen>

source: When connecting to the database make sure you have a ticket for a principal matching the requested database user name. For example, for database user name <literal>fred</literal>, principal <literal>fred@EXAMPLE.COM</literal> would be able to connect. To also allow principal <literal>fred/users.example.com@EXAMPLE.COM</literal>, use a user name map, as described in <xref linkend="auth-username-maps"/>.
ru: При подключении к базе данных убедитесь, что у вас есть разрешение на сопоставление принципала с именем пользователя базы данных. Например, для имени пользователя базы данных <literal>fred</literal>, принципал <literal>fred@EXAMPLE.COM</literal> сможет подключиться. Чтобы дать разрешение на подключение принципалу <literal>fred/users.example.com@EXAMPLE.COM</literal>, используйте файл сопоставления имён пользователей, как описано в <xref remap="6" linkend="auth-username-maps"/>.

source: Allows for mapping between system and database user names. See <xref linkend="auth-username-maps"/> for details. For a GSSAPI/Kerberos principal, such as <literal>username@EXAMPLE.COM</literal> (or, less commonly, <literal>username/hostbased@EXAMPLE.COM</literal>), the user name used for mapping is <literal>username@EXAMPLE.COM</literal> (or <literal>username/hostbased@EXAMPLE.COM</literal>, respectively), unless <literal>include_realm</literal> has been set to 0, in which case <literal>username</literal> (or <literal>username/hostbased</literal>) is what is seen as the system user name when mapping.
ru: Разрешает сопоставление имён пользователей системы и пользователей баз данных. За подробностями обратитесь к <xref remap="3" linkend="auth-username-maps"/>. Для принципала GSSAPI/Kerberos, такого как <literal>username@EXAMPLE.COM</literal> (или более редкого <literal>username/hostbased@EXAMPLE.COM</literal>), именем пользователя в сопоставлении будет <literal>username@EXAMPLE.COM</literal> (или <literal>username/hostbased@EXAMPLE.COM</literal>, соответственно), если <literal>include_realm</literal> не равно 0; в противном случае именем системного пользователя в сопоставлении будет <literal>username</literal> (или <literal>username/hostbased</literal>).
