Repository: pluzanov/pg-doc-ru
Catalog: 9.6/client-auth.po
Languages: ru

source: Client Authentication
ru: Аутентификация клиентского приложения

source: <primary>client authentication</primary>
ru: <primary>аутентификация клиентского приложения</primary>

source: When a client application connects to the database server, it specifies which <productname>PostgreSQL</productname> database user name it wants to connect as, much the same way one logs into a Unix computer as a particular user. Within the SQL environment the active database user name determines access privileges to database objects &mdash; see <xref linkend="user-manag"/> for more information. Therefore, it is essential to restrict which database users can connect.
ru: При подключении к серверу базы данных, клиентское приложение указывает имя пользователя <productname>PostgreSQL</productname>, так же как и при обычном входе пользователя на компьютер с ОС Unix. При работе в среде SQL по имени пользователя определяется, какие у него есть права доступа к объектам базы данных (подробнее это описывается в <xref remap="6" linkend="user-manag"/>). Следовательно, важно указать на этом этапе, к каким базам пользователь имеет право подключиться.

source: As explained in <xref linkend="user-manag"/>, <productname>PostgreSQL</productname> actually does privilege management in terms of <quote>roles</quote>. In this chapter, we consistently use <firstterm>database user</firstterm> to mean <quote>role with the <literal>LOGIN</literal> privilege</quote>.
ru: Как можно узнать из <xref linkend="user-manag"/>, <productname>PostgreSQL</productname> управляет правами и привилегиями, используя термин <quote>роли</quote>. В этой главе под <firstterm>пользователем</firstterm> мы подразумеваем <quote>роль с привилегией <literal>LOGIN</literal></quote>.

source: <firstterm>Authentication</firstterm> is the process by which the database server establishes the identity of the client, and by extension determines whether the client application (or the user who runs the client application) is permitted to connect with the database user name that was requested.
ru: <firstterm>Аутентификация</firstterm> это процесс идентификации клиента сервером базы данных, а также определение того, может ли клиентское приложение (или пользователь запустивший приложение) подключиться с указанным именем пользователя.

source: <productname>PostgreSQL</productname> offers a number of different client authentication methods. The method used to authenticate a particular client connection can be selected on the basis of (client) host address, database, and user.
ru: <productname>PostgreSQL</productname> предлагает несколько различных методов аутентификации клиентов. Метод аутентификации конкретного клиентского соединения может основываться на адресе компьютера клиента, имени базы данных, имени пользователя.

source: <productname>PostgreSQL</productname> database user names are logically separate from user names of the operating system in which the server runs. If all the users of a particular server also have accounts on the server's machine, it makes sense to assign database user names that match their operating system user names. However, a server that accepts remote connections might have many database users who have no local operating system account, and in such cases there need be no connection between database user names and OS user names.
ru: Имена пользователей базы данных <productname>PostgreSQL</productname> не имеют прямой связи с пользователями операционной системы на которой запущен сервер. Если у всех пользователей базы данных заведена учётная запись в операционной системе сервера, то имеет смысл назначить им точно такие же имена для входа в <productname>PostgreSQL</productname>. Однако, сервер, принимающий удалённые подключения, может иметь большое количество пользователей базы данных, у которых нет учётной записи в ОС. В таких случаях не требуется соответствие между именами пользователей базы данных и именами пользователей операционной системы.

source: The <filename>pg_hba.conf</filename> File
ru: Файл <filename>pg_hba.conf</filename>

source: Client authentication is controlled by a configuration file, which traditionally is named <filename>pg_hba.conf</filename> and is stored in the database cluster's data directory. (<acronym>HBA</acronym> stands for host-based authentication.) A default <filename>pg_hba.conf</filename> file is installed when the data directory is initialized by <command>initdb</command>. It is possible to place the authentication configuration file elsewhere, however; see the <xref linkend="guc-hba-file"/> configuration parameter.
ru: Аутентификация клиентов управляется конфигурационным файлом, который традиционно называется <filename>pg_hba.conf</filename> и расположен в каталоге с данными кластера базы данных. (<acronym>HBA</acronym> расшифровывается как host-based authentication &mdash; аутентификации по имени узла.) Файл <filename>pg_hba.conf</filename>, со стандартным содержимым, создаётся командой <command>initdb</command> при инициализации каталога с данными. Однако его можно разместить в любом другом месте; см. конфигурационный параметр <xref linkend="guc-hba-file"/>.

source: The general format of the <filename>pg_hba.conf</filename> file is a set of records, one per line. Blank lines are ignored, as is any text after the <literal>#</literal> comment character. Records cannot be continued across lines. A record is made up of a number of fields which are separated by spaces and/or tabs. Fields can contain white space if the field value is double-quoted. Quoting one of the keywords in a database, user, or address field (e.g., <literal>all</literal> or <literal>replication</literal>) makes the word lose its special meaning, and just match a database, user, or host with that name.
ru: Обычный формат файла <filename>pg_hba.conf</filename> представляет собой набор записей, по одной в строке. Пустые строки игнорируются, как и любой текст комментария после знака <literal>#</literal>. Записи не продолжаются на следующей строке. Записи состоят из некоторого количества полей, разделённых между собой пробелом и/или tabs. В полях могут быть использованы пробелы, если они взяты в кавычки. Если в кавычки берётся какое-либо зарезервированное слово в поле базы данных, пользователя или адресации (например, <literal>all</literal> или <literal>replication</literal>), то слово теряет своё особое значение и просто обозначает базу данных, пользователя или сервер с данным именем.

source: Each record specifies a connection type, a client IP address range (if relevant for the connection type), a database name, a user name, and the authentication method to be used for connections matching these parameters. The first record with a matching connection type, client address, requested database, and user name is used to perform authentication. There is no <quote>fall-through</quote> or <quote>backup</quote>: if one record is chosen and the authentication fails, subsequent records are not considered. If no record matches, access is denied.
ru: Каждая запись обозначает тип соединения, диапазон IP-адресов клиента (если он соотносится с типом соединения), имя базы данных, имя пользователя, и способ аутентификации, который будет использован для соединения в соответствии с этими параметрами. Первая запись с соответствующим типом соединения, адресом клиента, указанной базой данных и именем пользователя применяется для аутентификации. Процедур <quote>fall-through</quote> или <quote>backup</quote> не предусмотрено: если выбрана запись и аутентификация не прошла, последующие записи не рассматриваются. Если же ни одна из записей не подошла, в доступе будет отказано.

source: This record matches connection attempts using Unix-domain sockets. Without a record of this type, Unix-domain socket connections are disallowed.
ru: Управляет подключениями через доменные сокеты Unix. Без подобной записи подключения через доменные сокеты Unix невозможны.

source: This record matches connection attempts made using TCP/IP. <literal>host</literal> records match either <acronym>SSL</acronym> or non-<acronym>SSL</acronym> connection attempts.
ru: Управляет подключениями, устанавливаемыми по TCP/IP. Записи <literal>host</literal> соответствуют подключениям с <acronym>SSL</acronym> и без <acronym>SSL</acronym>.

source: Remote TCP/IP connections will not be possible unless the server is started with an appropriate value for the <xref linkend="guc-listen-addresses"/> configuration parameter, since the default behavior is to listen for TCP/IP connections only on the local loopback address <literal>localhost</literal>.
ru: Удалённое соединение по TCP/IP невозможно, если сервер запущен без определения соответствующих значений для параметра конфигурации <xref linkend="guc-listen-addresses"/>, поскольку по умолчанию система принимает подключения по TCP/IP только для локального адреса замыкания <literal>localhost</literal>.

source: This record matches connection attempts made using TCP/IP, but only when the connection is made with <acronym>SSL</acronym> encryption.
ru: Управляет подключениями, устанавливаемыми по TCP/IP с применением шифрования <acronym>SSL</acronym>.

source: To make use of this option the server must be built with <acronym>SSL</acronym> support. Furthermore, <acronym>SSL</acronym> must be enabled at server start time by setting the <xref linkend="guc-ssl"/> configuration parameter (see <xref linkend="ssl-tcp"/> for more information).
ru: Чтобы использовать эту возможность, сервер изначально должен быть построен с поддержкой <acronym>SSL</acronym>. Более того, <acronym>SSL</acronym> должен быть включён на момент запуска сервера, для чего необходимо установить параметр конфигурации <xref linkend="guc-ssl"/> (подробнее это описано в <xref remap="6" linkend="ssl-tcp"/>).

source: This record type has the opposite behavior of <literal>hostssl</literal>; it only matches connection attempts made over TCP/IP that do not use <acronym>SSL</acronym>.
ru: Этот тип записей противоположен <literal>hostssl</literal>, ему соответствуют только подключения по TCP/IP без шифрования <acronym>SSL</acronym>.

source: Specifies which database name(s) this record matches. The value <literal>all</literal> specifies that it matches all databases. The value <literal>sameuser</literal> specifies that the record matches if the requested database has the same name as the requested user. The value <literal>samerole</literal> specifies that the requested user must be a member of the role with the same name as the requested database. (<literal>samegroup</literal> is an obsolete but still accepted spelling of <literal>samerole</literal>.) Superusers are not considered to be members of a role for the purposes of <literal>samerole</literal> unless they are explicitly members of the role, directly or indirectly, and not just by virtue of being a superuser. The value <literal>replication</literal> specifies that the record matches if a replication connection is requested (note that replication connections do not specify any particular database). Otherwise, this is the name of a specific <productname>PostgreSQL</productname> database. Multiple database names can be supplied by separating them with commas. A separate file containing database names can be specified by preceding the file name with <literal>@</literal>.
ru: Определяет, каким именам баз данных соответствует эта запись. Значение <literal>all</literal> определяет, что подходят все базы данных. Значение <literal>sameuser</literal> определяет, что данная запись соответствует только, если имя запрашиваемой базы данных совпадает с именем запрашиваемого пользователя. Значение <literal>samerole</literal> определяет, что запрашиваемый пользователь должен быть членом роли с таким же именем, как и у запрашиваемой базы данных. (<literal>samegroup</literal> - это устаревший, но допустимый вариант значения <literal>samerole</literal>.) Суперпользователи не становятся членами роли автоматически из-за <literal>samerole</literal>, а только если они являются явными членами роли, прямо или косвенно, и не только из-за того, что они суперпользователи. Значение <literal>replication</literal> показывает, что запись соответствует, если запрашивается подключение репликации (имейте в виду, что подключения репликации не определяют какую-то конкретную базу данных). В противном случае, это имя определённой базы данных <productname>PostgreSQL</productname>. Несколько имён баз данных можно указать, разделяя их запятыми. Файл, содержащий имена баз данных, можно указать, поставив знак <literal>@</literal> в начале его имени.

source: Specifies which database user name(s) this record matches. The value <literal>all</literal> specifies that it matches all users. Otherwise, this is either the name of a specific database user, or a group name preceded by <literal>+</literal>. (Recall that there is no real distinction between users and groups in <productname>PostgreSQL</productname>; a <literal>+</literal> mark really means <quote>match any of the roles that are directly or indirectly members of this role</quote>, while a name without a <literal>+</literal> mark matches only that specific role.) For this purpose, a superuser is only considered to be a member of a role if they are explicitly a member of the role, directly or indirectly, and not just by virtue of being a superuser. Multiple user names can be supplied by separating them with commas. A separate file containing user names can be specified by preceding the file name with <literal>@</literal>.
ru: Указывает, какому имени (или именам) пользователя базы данных соответствует эта запись. Значение <literal>all</literal> показывает, что это подходит всем пользователям. В противном случае, это либо имя конкретного пользователя базы данных, или имя группы, в начале которого стоит знак <literal>+</literal>. (Напомним, что в <productname>PostgreSQL</productname> нет никакой разницы между пользователем и группой; знак <literal>+</literal> означает <quote> совпадение любых ролей, которые прямо или косвенно являются членами роли</quote>, тогда как имя без знака <literal>+</literal> является подходящей только для этой конкретной роли.) В связи с этим, суперпользователь рассматривается как член роли, только если он явно является членом этой роли, прямо или косвенно, а не только потому, что он является суперпользователем. Несколько имён пользователей можно указать, разделяя их запятыми. Файл, содержащий имена пользователей, можно указать, поставив знак <literal>@</literal> в начале его имени.

source: Specifies the client machine address(es) that this record matches. This field can contain either a host name, an IP address range, or one of the special key words mentioned below.
ru: Указывает адрес (или адреса) клиентской машины, которым соответствует данная запись. Это поле может содержать или имя компьютера, или диапазон IP-адресов, или одно из нижеупомянутых ключевых слов.

source: An IP address range is specified using standard numeric notation for the range's starting address, then a slash (<literal>/</literal>) and a <acronym>CIDR</acronym> mask length. The mask length indicates the number of high-order bits of the client IP address that must match. Bits to the right of this should be zero in the given IP address. There must not be any white space between the IP address, the <literal>/</literal>, and the CIDR mask length.
ru: Диапазон IP-адресов указывается в виде начального адреса диапазона, дополненного косой чертой (<literal>/</literal>) и длиной маски <acronym>CIDR</acronym>. Длина маски задаёт количество старших битов клиентского IP-адреса, которые должны совпадать с битами IP-адреса диапазона. Биты, находящиеся правее, в указанном IP-адресе должны быть нулевыми. Между IP-адресом, знаком <literal>/</literal> и длиной маски CIDR не должно быть пробельных символов.

source: Typical examples of an IPv4 address range specified this way are <literal>172.20.143.89/32</literal> for a single host, or <literal>172.20.143.0/24</literal> for a small network, or <literal>10.6.0.0/16</literal> for a larger one. An IPv6 address range might look like <literal>::1/128</literal> for a single host (in this case the IPv6 loopback address) or <literal>fe80::7a31:c1ff:0000:0000/96</literal> for a small network. <literal>0.0.0.0/0</literal> represents all IPv4 addresses, and <literal>::0/0</literal> represents all IPv6 addresses. To specify a single host, use a mask length of 32 for IPv4 or 128 for IPv6. In a network address, do not omit trailing zeroes.
ru: Типичные примеры диапазонов адресов IPv4, указанных таким образом: <literal>172.20.143.89/32</literal> для одного компьютера, <literal>172.20.143.0/24</literal> для небольшой и <literal>10.6.0.0/16</literal> для крупной сети. Диапазон адресов IPv6 может выглядеть как <literal>::1/128</literal> для одного компьютера (это адрес замыкания IPv6) или как <literal>fe80::7a31:c1ff:0000:0000/96</literal> для небольшой сети. <literal>0.0.0.0/0</literal> представляет все адреса IPv4, а <literal>::0/0</literal> — все адреса IPv6. Чтобы указать один компьютер, используйте длину маски 32 для IPv4 или 128 для IPv6. Опускать замыкающие нули в сетевом адресе нельзя.

source: An entry given in IPv4 format will match only IPv4 connections, and an entry given in IPv6 format will match only IPv6 connections, even if the represented address is in the IPv4-in-IPv6 range. Note that entries in IPv6 format will be rejected if the system's C library does not have support for IPv6 addresses.
ru: Запись, сделанная в формате IPv4, подойдёт только для подключений по IPv4, а запись в формате IPv6 подойдёт только для подключений по IPv6, даже если представленный адрес находится в диапазоне IPv4-в-IPv6. Имейте в виду, что записи в формате IPv6 не будут приниматься, если системная библиотека С не поддерживает адреса IPv6.

source: You can also write <literal>all</literal> to match any IP address, <literal>samehost</literal> to match any of the server's own IP addresses, or <literal>samenet</literal> to match any address in any subnet that the server is directly connected to.
ru: Вы также можете прописать значение <literal>all</literal>, чтобы указать любой IP-адрес, <literal>samehost</literal>, чтобы указать любые IP-адреса данного сервера, или <literal>samenet</literal>, чтобы указать любой адрес любой подсети, к которой сервер подключён напрямую.

source: If a host name is specified (anything that is not an IP address range or a special key word is treated as a host name), that name is compared with the result of a reverse name resolution of the client's IP address (e.g., reverse DNS lookup, if DNS is used). Host name comparisons are case insensitive. If there is a match, then a forward name resolution (e.g., forward DNS lookup) is performed on the host name to check whether any of the addresses it resolves to are equal to the client's IP address. If both directions match, then the entry is considered to match. (The host name that is used in <filename>pg_hba.conf</filename> should be the one that address-to-name resolution of the client's IP address returns, otherwise the line won't be matched. Some host name databases allow associating an IP address with multiple host names, but the operating system will only return one host name when asked to resolve an IP address.)
ru: Если определено имя компьютера (всё, что не является диапазоном IP-адресов или специальным ключевым словом, воспринимается как имя компьютера), то оно сравнивается с результатом обратного преобразования IP-адреса клиента (например, обратного DNS-запроса, если используется DNS). При сравнении имён компьютеров регистр не учитывается. Если имена совпали, выполняется прямое преобразование имени (например, прямой DNS-запрос) для проверки, относится ли клиентский IP-адрес к адресам, соответствующим имени. Если двусторонняя проверка пройдена, запись считается соответствующей компьютеру. (В качестве имени узла в файле <filename>pg_hba.conf</filename> должно указываться то, что возвращается при преобразовании IP-адреса клиента в имя, иначе строка не будет соответствовать узлу. Некоторые базы данных имён позволяют связать с одним IP-адресом несколько имён узлов, но операционная система при попытке разрешить IP-адрес возвращает только одно имя.)

source: A host name specification that starts with a dot (<literal>.</literal>) matches a suffix of the actual host name. So <literal>.example.com</literal> would match <literal>foo.example.com</literal> (but not just <literal>example.com</literal>).
ru: Указание имени, начинающееся с точки (<literal>.</literal>), соответствует суффиксу актуального имени узла. Так, <literal>.example.com</literal> будет соответствовать <literal>foo.example.com</literal> (а не только <literal>example.com</literal>).

source: When host names are specified in <filename>pg_hba.conf</filename>, you should make sure that name resolution is reasonably fast. It can be of advantage to set up a local name resolution cache such as <command>nscd</command>. Also, you may wish to enable the configuration parameter <varname>log_hostname</varname> to see the client's host name instead of the IP address in the log.
ru: Когда в <filename>pg_hba.conf</filename> указываются имена узлов, следует добиться, чтобы разрешение имён выполнялось достаточно быстро. Для этого может быть полезен локальный кеш разрешения имён, например, <command>nscd</command>. Вы также можете включить конфигурационный параметр <varname>log_hostname</varname>, чтобы видеть в журналах имя компьютера клиента вместо IP-адреса.

source: This field only applies to <literal>host</literal>, <literal>hostssl</literal>, and <literal>hostnossl</literal> records.
ru: Это поле применимо только к записям <literal>host</literal>, <literal>hostssl</literal> и <literal>hostnossl</literal>.

source: Users sometimes wonder why host names are handled in this seemingly complicated way, with two name resolutions including a reverse lookup of the client's IP address. This complicates use of the feature in case the client's reverse DNS entry is not set up or yields some undesirable host name. It is done primarily for efficiency: this way, a connection attempt requires at most two resolver lookups, one reverse and one forward. If there is a resolver problem with some address, it becomes only that client's problem. A hypothetical alternative implementation that only did forward lookups would have to resolve every host name mentioned in <filename>pg_hba.conf</filename> during every connection attempt. That could be quite slow if many names are listed. And if there is a resolver problem with one of the host names, it becomes everyone's problem.
ru: Пользователи часто задаются вопросом, почему имена серверов обрабатываются таким сложным, на первый взгляд, способом, с разрешением двух имён, включая обратный запрос клиентского IP-адреса. Это усложняет процесс в случае, если обратная DNS-запись клиента не установлена или включает в себя нежелательное имя узла. Такой способ избран, в первую очередь, для повышения эффективности: в этом случае соединение требует максимум два запроса разрешения, один прямой и один обратный. Если есть проблема разрешения с каким-то адресом, то она остаётся проблемой этого клиента. Гипотетически, могла бы быть реализована возможность во время каждой попытки соединения выполнять только прямой запрос для разрешения каждого имени сервера, упомянутого в <filename>pg_hba.conf</filename>. Но если список имён велик, процесс был бы довольно медленным, а в случае наличия проблемы разрешения у одного имени сервера, это стало бы общей проблемой.
