Repository: pluzanov/pg-doc-ru
Catalog: 9.6/client-auth.po
Languages: ru

source: Sets the realm to match user principal names against. If this parameter is set, only users of that realm will be accepted. If it is not set, users of any realm can connect, subject to whatever user name mapping is done.
ru: Устанавливает область, с которой будут сверяться имена принципалов пользователей. Если этот параметр задан, подключаться смогут только пользователи из этой области. Если не задан, подключаться смогут пользователи из любой области, в зависимости от установленного сопоставления имён пользователей.

source: The following configuration options are supported for <productname>GSSAPI</productname>: <placeholder-1/>
ru: Для метода <productname>GSSAPI</productname> доступны следующие параметры конфигурации: <placeholder-1/>

source: SSPI Authentication
ru: Метод аутентификации SSPI

source: <productname>SSPI</productname> is a <productname>Windows</productname> technology for secure authentication with single sign-on. <productname>PostgreSQL</productname> will use SSPI in <literal>negotiate</literal> mode, which will use <productname>Kerberos</productname> when possible and automatically fall back to <productname>NTLM</productname> in other cases. <productname>SSPI</productname> authentication only works when both server and client are running <productname>Windows</productname>, or, on non-Windows platforms, when <productname>GSSAPI</productname> is available.
ru: <productname>SSPI</productname> — технология <productname>Windows</productname> для защищённой аутентификации с единственным входом. <productname>PostgreSQL</productname> использует SSPI в режиме <literal>negotiate</literal>, который применяет <productname>Kerberos</productname>, когда это возможно, и автоматически возвращается к <productname>NTLM</productname> в других случаях. Аутентификация <productname>SSPI</productname> работает только, когда и сервер, и клиент работают на платформе <productname>Windows</productname>, или, на не-Windows платформах, если доступен <productname>GSSAPI</productname>.

source: When using <productname>Kerberos</productname> authentication, <productname>SSPI</productname> works the same way <productname>GSSAPI</productname> does; see <xref linkend="gssapi-auth"/> for details.
ru: Если используется аутентификация <productname>Kerberos</productname>, <productname>SSPI</productname> работает так же, как <productname>GSSAPI</productname>; подробнее об этом рассказывается в <xref remap="6" linkend="gssapi-auth"/>.

source: Allows for mapping between system and database user names. See <xref linkend="auth-username-maps"/> for details. For a SSPI/Kerberos principal, such as <literal>username@EXAMPLE.COM</literal> (or, less commonly, <literal>username/hostbased@EXAMPLE.COM</literal>), the user name used for mapping is <literal>username@EXAMPLE.COM</literal> (or <literal>username/hostbased@EXAMPLE.COM</literal>, respectively), unless <literal>include_realm</literal> has been set to 0, in which case <literal>username</literal> (or <literal>username/hostbased</literal>) is what is seen as the system user name when mapping.
ru: Позволяет сопоставить пользователей системы с пользователями баз данных. За подробностями обратитесь к <xref remap="3" linkend="auth-username-maps"/>. Для принципала SSPI/Kerberos, такого как <literal>username@EXAMPLE.COM</literal> (или более редкого <literal>username/hostbased@EXAMPLE.COM</literal>), именем пользователя в сопоставлении будет <literal>username@EXAMPLE.COM</literal> (или <literal>username/hostbased@EXAMPLE.COM</literal>, соответственно), если <literal>include_realm</literal> не равно 0; в противном случае именем системного пользователя в сопоставлении будет <literal>username</literal> (или <literal>username/hostbased</literal>).

source: The following configuration options are supported for <productname>SSPI</productname>: <placeholder-1/>
ru: Для <productname>SSPI</productname> доступны следующие параметры конфигурации: <placeholder-1/>

source: Ident Authentication
ru: Метод аутентификации Ident

source: The ident authentication method works by obtaining the client's operating system user name from an ident server and using it as the allowed database user name (with an optional user name mapping). This is only supported on TCP/IP connections.
ru: Метод аутентификации ident работает, получая имя пользователя операционной системы клиента от сервера Ident и используя его в качестве разрешённого имени пользователя базы данных (с возможным сопоставлением имён пользователя). Способ доступен только для подключений по TCP/IP.

source: When ident is specified for a local (non-TCP/IP) connection, peer authentication (see <xref linkend="auth-peer"/>) will be used instead.
ru: Когда для локального подключения (не TCP/IP) указан ident, вместо него используется метод аутентификации peer (см. <xref remap="4" linkend="auth-peer"/>).

source: Allows for mapping between system and database user names. See <xref linkend="auth-username-maps"/> for details.
ru: Позволяет сопоставить имена пользователей системы и базы данных. За подробностями обратитесь к <xref remap="3" linkend="auth-username-maps"/>.

source: The following configuration options are supported for <productname>ident</productname>: <placeholder-1/>
ru: Для метода <productname>ident</productname> доступны следующие параметры конфигурации: <placeholder-1/>

source: The <quote>Identification Protocol</quote> is described in RFC 1413. Virtually every Unix-like operating system ships with an ident server that listens on TCP port 113 by default. The basic functionality of an ident server is to answer questions like <quote>What user initiated the connection that goes out of your port <replaceable>X</replaceable> and connects to my port <replaceable>Y</replaceable>?</quote>. Since <productname>PostgreSQL</productname> knows both <replaceable>X</replaceable> and <replaceable>Y</replaceable> when a physical connection is established, it can interrogate the ident server on the host of the connecting client and can theoretically determine the operating system user for any given connection.
ru: Протокол <quote>Identification</quote> (Ident) описан в RFC 1413. Практически каждая Unix-подобная операционная система поставляется с сервером Ident, по умолчанию слушающим TCP-порт 113. Базовая функция этого сервера — отвечать на вопросы, вроде <quote>Какой пользователь инициировал подключение, которое идет через твой порт <replaceable>X</replaceable> и подключается к моему порту <replaceable>Y</replaceable>?</quote>. Поскольку после установления физического подключения <productname>PostgreSQL</productname> знает и <replaceable>X</replaceable>, и <replaceable>Y</replaceable>, он может опрашивать сервер Ident на компьютере клиента и теоретически может определять пользователя операционной системы при каждом подключении.

source: The Identification Protocol is not intended as an authorization or access control protocol.
ru: Протокол Ident не предназначен для использования как протокол авторизации и контроля доступа.

source: Some ident servers have a nonstandard option that causes the returned user name to be encrypted, using a key that only the originating machine's administrator knows. This option <emphasis>must not</emphasis> be used when using the ident server with <productname>PostgreSQL</productname>, since <productname>PostgreSQL</productname> does not have any way to decrypt the returned string to determine the actual user name.
ru: У некоторых серверов Ident есть нестандартная возможность, позволяющая зашифровать возвращаемое имя пользователя, используя ключ, который известен только администратору исходного компьютера. Эту возможность <emphasis>нельзя</emphasis> использовать с <productname>PostgreSQL</productname>, поскольку <productname>PostgreSQL</productname> не сможет расшифровать возвращаемую строку и получить фактическое имя пользователя.

source: Peer Authentication
ru: Аутентификация peer

source: The peer authentication method works by obtaining the client's operating system user name from the kernel and using it as the allowed database user name (with optional user name mapping). This method is only supported on local connections.
ru: Метод аутентификации peer работает, получая имя пользователя операционной системы клиента из ядра и используя его в качестве разрешённого имени пользователя базы данных (с возможностью сопоставления имён пользователя). Этот метод поддерживается только для локальных подключений.

source: The following configuration options are supported for <productname>peer</productname>: <placeholder-1/>
ru: Для метода <productname>peer</productname> доступны следующие параметры конфигурации: <placeholder-1/>

source: Peer authentication is only available on operating systems providing the <function>getpeereid()</function> function, the <symbol>SO_PEERCRED</symbol> socket parameter, or similar mechanisms. Currently that includes <systemitem class="osname">Linux</systemitem>, most flavors of <systemitem class="osname">BSD</systemitem> including <systemitem class="osname">OS X</systemitem>, and <systemitem class="osname">Solaris</systemitem>.
ru: Аутентификация peer доступна только на операционных системах, поддерживающих функцию <function>getpeereid()</function>, параметр сокета <symbol>SO_PEERCRED</symbol> или сходные механизмы. В настоящее время это <systemitem class="osname">Linux</systemitem>, большая часть разновидностей <systemitem class="osname">BSD</systemitem>, включая <systemitem class="osname">OS X</systemitem>, и <systemitem class="osname">Solaris</systemitem>.

source: LDAP Authentication
ru: Метод аутентификации LDAP

source: This authentication method operates similarly to <literal>password</literal> except that it uses LDAP as the password verification method. LDAP is used only to validate the user name/password pairs. Therefore the user must already exist in the database before LDAP can be used for authentication.
ru: Данный метод аутентификации работает сходным с методом <literal>password</literal> образом, за исключением того, что он использует LDAP как метод подтверждения пароля. LDAP используется только для подтверждения пары "имя пользователя/пароль". Поэтому пользователь должен уже существовать в базе данных до того, как для аутентификации будет использован LDAP.

source: LDAP authentication can operate in two modes. In the first mode, which we will call the simple bind mode, the server will bind to the distinguished name constructed as <replaceable>prefix</replaceable> <replaceable>username</replaceable> <replaceable>suffix</replaceable>. Typically, the <replaceable>prefix</replaceable> parameter is used to specify <literal>cn=</literal>, or <replaceable>DOMAIN</replaceable><literal>\</literal> in an Active Directory environment. <replaceable>suffix</replaceable> is used to specify the remaining part of the DN in a non-Active Directory environment.
ru: Аутентификация LDAP может работать в двух режимах. Первый режим называется простое связывание. В ходе аутентификации сервер связывается с характерным именем, составленным следующим образом: <replaceable>prefix</replaceable> <replaceable>username</replaceable> <replaceable>suffix</replaceable>. Обычно, параметр <replaceable>prefix</replaceable> используется для указания <literal>cn=</literal> или <replaceable>DOMAIN</replaceable><literal>\</literal> в среде Active Directory. <replaceable>suffix</replaceable> используется для указания оставшейся части DN или в среде, отличной от Active Directory.

source: In the second mode, which we will call the search+bind mode, the server first binds to the LDAP directory with a fixed user name and password, specified with <replaceable>ldapbinddn</replaceable> and <replaceable>ldapbindpasswd</replaceable>, and performs a search for the user trying to log in to the database. If no user and password is configured, an anonymous bind will be attempted to the directory. The search will be performed over the subtree at <replaceable>ldapbasedn</replaceable>, and will try to do an exact match of the attribute specified in <replaceable>ldapsearchattribute</replaceable>. Once the user has been found in this search, the server disconnects and re-binds to the directory as this user, using the password specified by the client, to verify that the login is correct. This mode is the same as that used by LDAP authentication schemes in other software, such as Apache <literal>mod_authnz_ldap</literal> and <literal>pam_ldap</literal>. This method allows for significantly more flexibility in where the user objects are located in the directory, but will cause two separate connections to the LDAP server to be made.
ru: Во втором режиме, который мы называем поиск+связывание, сервер сначала связывается с каталогом LDAP с предопределённым именем пользователя и паролем, указанным в <replaceable>ldapbinddn</replaceable> и <replaceable>ldapbindpasswd</replaceable>, и выполняет поиск пользователя, пытающегося подключиться к базе данных. Если имя пользователя и пароль не определены, сервер пытается связаться с каталогом анонимно. Поиск выполняется в поддереве <replaceable>ldapbasedn</replaceable>, при этом проверятся точное соответствие имени пользователя атрибуту <replaceable>ldapsearchattribute</replaceable>. Как только при поиске находится пользователь, сервер отключается и заново связывается с каталогом уже как этот пользователь, с паролем, переданным клиентом, чтобы удостовериться, что учётная запись корректна. Этот же режим используется в схемах LDAP-аутентификации в другом программном обеспечении, например, в pam_ldap и mod_authnz_ldap в Apache. Данный вариант даёт больше гибкости в выборе расположения объектов пользователей, но при этом требует дважды подключаться к серверу LDAP.

source: Names or IP addresses of LDAP servers to connect to. Multiple servers may be specified, separated by spaces.
ru: Имена и IP-адреса LDAP-серверов для связи. Можно указать несколько серверов, разделяя их пробелами.

source: Port number on LDAP server to connect to. If no port is specified, the LDAP library's default port setting will be used.
ru: Номер порта для связи с LDAP-сервером. Если порт не указан, используется установленный по умолчанию порт библиотеки LDAP.

source: Set to 1 to make the connection between PostgreSQL and the LDAP server use TLS encryption. Note that this only encrypts the traffic to the LDAP server &mdash; the connection to the client will still be unencrypted unless SSL is used.
ru: Равен 1 для установки соединения между PostgreSQL и LDAP-сервером с использованием TLS-шифрования. Имейте в виду, что так шифруется только обмен данными с LDAP-сервером, а клиентское подключение остаётся незашифрованным, если только не применяется SSL.

source: String to prepend to the user name when forming the DN to bind as, when doing simple bind authentication.
ru: Эта строка подставляется перед именем пользователя во время формирования DN для связывания при аутентификации в режиме простого связывания.

source: String to append to the user name when forming the DN to bind as, when doing simple bind authentication.
ru: Эта строка размещается после имени пользователя во время формирования DN для связывания, при аутентификации в режиме простого связывания.

source: Root DN to begin the search for the user in, when doing search+bind authentication.
ru: Корневая папка DN для начала поиска пользователя при аутентификации в режиме поиск+связывание.

source: DN of user to bind to the directory with to perform the search when doing search+bind authentication.
ru: DN пользователя для связи с каталогом при выполнении поиска в ходе аутентификации в режиме поиск+связывание.

source: Password for user to bind to the directory with to perform the search when doing search+bind authentication.
ru: Пароль пользователя для связывания с каталогом при выполнении поиска в ходе аутентификации в режиме поиск+связывание.

source: Attribute to match against the user name in the search when doing search+bind authentication. If no attribute is specified, the <literal>uid</literal> attribute will be used.
ru: Атрибут для соотнесения с именем пользователя в ходе аутентификации поиск+связывание. Если атрибут не указан, будет использован атрибут <literal>uid</literal>.

source: An RFC 4516 LDAP URL. This is an alternative way to write some of the other LDAP options in a more compact and standard form. The format is <synopsis>ldap://<replaceable>host</replaceable>[:<replaceable>port</replaceable>]/<replaceable>basedn</replaceable>[?[<replaceable>attribute</replaceable>][?[<replaceable>scope</replaceable>]]]</synopsis> <replaceable>scope</replaceable> must be one of <literal>base</literal>, <literal>one</literal>, <literal>sub</literal>, typically the latter. Only one attribute is used, and some other components of standard LDAP URLs such as filters and extensions are not supported.
ru: Адрес RFC 4516 LDAP. Это альтернативный путь для написания некоторых функций LDAP в более компактной и стандартной форме. Формат записи таков: <synopsis>ldap://<replaceable>host</replaceable>[:<replaceable>port</replaceable>]/<replaceable>basedn</replaceable>[?[<replaceable>attribute</replaceable>][?[<replaceable>scope</replaceable>]]]</synopsis> <replaceable>scope</replaceable> должен быть представлен или <literal>base</literal>, или <literal>one</literal>, или <literal>sub</literal>, обычно последним. Используется один атрибут, некоторые компоненты стандартных LDAP-адресов, такие, как фильтры и расширения, не поддерживаются.

source: For non-anonymous binds, <literal>ldapbinddn</literal> and <literal>ldapbindpasswd</literal> must be specified as separate options.
ru: Для неанонимного связывания <literal>ldapbinddn</literal> и <literal>ldapbindpasswd</literal> должны быть указаны как раздельные параметры.

source: To use encrypted LDAP connections, the <literal>ldaptls</literal> option has to be used in addition to <literal>ldapurl</literal>. The <literal>ldaps</literal> URL scheme (direct SSL connection) is not supported.
ru: Для применения зашифрованных LDAP-подключений, в дополнение к параметру <literal>ldapurl</literal> необходимо использовать параметр <literal>ldaptls</literal>. URL-схема <literal>ldaps</literal> (прямое SSL-подключение) не поддерживается.

source: LDAP URLs are currently only supported with OpenLDAP, not on Windows.
ru: В настоящее время URL-адреса LDAP поддерживаются только с OpenLDAP, не в Windows.

source: The following configuration options are used in both modes: <placeholder-1/> The following options are used in simple bind mode only: <placeholder-2/> The following options are used in search+bind mode only: <placeholder-3/>
ru: Следующие параметры конфигурации доступны при аутентификации в обоих режимах: <placeholder-1/> Следующие параметры конфигурации доступны только при аутентификации в режиме простого связывания: <placeholder-2/> Следующие параметры конфигурации доступны только при аутентификации поиск+связывание: <placeholder-3/>

source: It is an error to mix configuration options for simple bind with options for search+bind.
ru: Нельзя путать параметры конфигурации для режима простого связывания с параметрами для режима поиск+связывание, это ошибка.

source: Here is an example for a simple-bind LDAP configuration: <placeholder-1/> When a connection to the database server as database user <literal>someuser</literal> is requested, PostgreSQL will attempt to bind to the LDAP server using the DN <literal>cn=someuser, dc=example, dc=net</literal> and the password provided by the client. If that connection succeeds, the database access is granted.
ru: Это пример конфигурации LDAP для простого связывания: <placeholder-1/> Когда запрашивается подключение к серверу базы данных в качестве пользователя базы данных <literal>someuser</literal>, PostgreSQL пытается связаться с LDAP-сервером, используя DN <literal>cn=someuser, dc=example, dc=net</literal> и пароль, предоставленный клиентом. Если это подключение удалось, то доступ к базе данных будет открыт.

source: Here is an example for a search+bind configuration: <placeholder-1/> When a connection to the database server as database user <literal>someuser</literal> is requested, PostgreSQL will attempt to bind anonymously (since <literal>ldapbinddn</literal> was not specified) to the LDAP server, perform a search for <literal>(uid=someuser)</literal> under the specified base DN. If an entry is found, it will then attempt to bind using that found information and the password supplied by the client. If that second connection succeeds, the database access is granted.
ru: Пример конфигурации для режима поиск+связывание: <placeholder-1/> Когда запрашивается подключение к серверу базы данных в качестве пользователя базы данных <literal>someuser</literal>, PostgreSQL пытается связаться с сервером LDAP анонимно (поскольку <literal>ldapbinddn</literal> не был указан), выполняет поиск для <literal>(uid=someuser)</literal> под указанной базой DN. Если запись найдена, проводится попытка связывание с использованием найденной информации и паролем, предоставленным клиентом. Если вторая попытка подключения проходит успешно, предоставляется доступ к базе данных.

source: Here is the same search+bind configuration written as a URL: <placeholder-1/> Some other software that supports authentication against LDAP uses the same URL format, so it will be easier to share the configuration.
ru: Пример той же конфигурации для режима поиск+связывание, но записанной в виде URL: <placeholder-1/> Такой URL-формат используется и другим программным обеспечением, поддерживающим аутентификацию по протоколу LDAP, поэтому распространять такую конфигурацию будет легче.

source: Since LDAP often uses commas and spaces to separate the different parts of a DN, it is often necessary to use double-quoted parameter values when configuring LDAP options, as shown in the examples.
ru: Поскольку LDAP часто применяет запятые и пробелы для разделения различных частей DN, необходимо использовать кавычки при определении значения параметров, как показано в наших примерах.

source: RADIUS Authentication
ru: Аутентификация RADIUS

source: This authentication method operates similarly to <literal>password</literal> except that it uses RADIUS as the password verification method. RADIUS is used only to validate the user name/password pairs. Therefore the user must already exist in the database before RADIUS can be used for authentication.
ru: Данный метод аутентификации работает сходным с методом <literal>password</literal> образом, за исключением того, что он использует RADIUS как метод проверки пароля. RADIUS используется только для подтверждения пары имя пользователя/пароль. Поэтому пользователь должен уже существовать в базе данных до того, как для аутентификации будет использован RADIUS.

source: When using RADIUS authentication, an Access Request message will be sent to the configured RADIUS server. This request will be of type <literal>Authenticate Only</literal>, and include parameters for <literal>user name</literal>, <literal>password</literal> (encrypted) and <literal>NAS Identifier</literal>. The request will be encrypted using a secret shared with the server. The RADIUS server will respond to this server with either <literal>Access Accept</literal> or <literal>Access Reject</literal>. There is no support for RADIUS accounting.
ru: В ходе аутентификации RADIUS на настроенный RADIUS-сервер посылается запрос доступа. Это сообщение типа <literal>Только Аутентификация</literal>, которое включает в себя параметры <literal>имя пользователя</literal>, <literal>пароль</literal> (зашифрованный) и <literal>идентификатор NAS</literal>. Запрос зашифровывается с использованием общего с сервером секрета. RADIUS-сервер отвечает на запрос сервера либо <literal>Доступ принят</literal>, либо <literal>Доступ отклонён</literal>. Система ведения учёта RADIUS не поддерживается.
