Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: To assign privileges, the <command>GRANT</command> command is used. For example, if <literal>joe</literal> is an existing role, and <literal>accounts</literal> is an existing table, the privilege to update the table can be granted with: <placeholder-1/> Writing <literal>ALL</literal> in place of a specific privilege grants all privileges that are relevant for the object type.
ru: Для назначения прав применяется команда <command>GRANT</command>. Например, если в базе данных есть роль <literal>joe</literal> и таблица <literal>accounts</literal>, право на изменение таблицы можно дать этой роли так: <placeholder-1/> Если вместо конкретного права написать <literal>ALL</literal>, роль получит все права, применимые для объекта этого типа.

source: The special <quote>role</quote> name <literal>PUBLIC</literal> can be used to grant a privilege to every role on the system. Also, <quote>group</quote> roles can be set up to help manage privileges when there are many users of a database &mdash; for details see <xref linkend="user-manag"/>.
ru: Для назначения права всем ролям в системе можно использовать специальное имя <quote>роли</quote>: <literal>PUBLIC</literal>. Также для упрощения управления ролями, когда в базе данных есть множество пользователей, можно настроить <quote>групповые</quote> роли; подробнее об этом см. <xref remap="4" linkend="user-manag"/>.

source: To revoke a privilege, use the fittingly named <command>REVOKE</command> command: <placeholder-1/> The special privileges of the object owner (i.e., the right to do <command>DROP</command>, <command>GRANT</command>, <command>REVOKE</command>, etc.) are always implicit in being the owner, and cannot be granted or revoked. But the object owner can choose to revoke their own ordinary privileges, for example to make a table read-only for themselves as well as others.
ru: Чтобы лишить пользователей прав, используйте команду <command>REVOKE</command>: <placeholder-1/> Особые права владельца объекта (то есть права на выполнение <command>DROP</command>, <command>GRANT</command>, <command>REVOKE</command> и т. д.) всегда неявно закреплены за владельцем и их нельзя назначить или отобрать. Но владелец объекта может лишить себя обычных прав, например, разрешить всем, включая себя, только чтение таблицы.

source: Ordinarily, only the object's owner (or a superuser) can grant or revoke privileges on an object. However, it is possible to grant a privilege <quote>with grant option</quote>, which gives the recipient the right to grant it in turn to others. If the grant option is subsequently revoked then all who received the privilege from that recipient (directly or through a chain of grants) will lose the privilege. For details see the <xref linkend="sql-grant"/> and <xref linkend="sql-revoke"/> reference pages.
ru: Обычно распоряжаться правами может только владелец объекта (или суперпользователь). Однако возможно дать право доступа к объекту <quote>с правом передачи</quote>, что позволит получившему такое право назначать его другим. Если такое право передачи впоследствии будет отозвано, то все, кто получил данное право доступа (непосредственно или по цепочке передачи), потеряют его. Подробнее об этом см. справку <xref linkend="sql-grant"/> и <xref linkend="sql-revoke"/>.

source: Row Security Policies
ru: Политики защиты строк

source: <primary>row-level security</primary>
ru: <primary>защита на уровне строк</primary>

source: <primary>policy</primary>
ru: <primary>политика</primary>

source: In addition to the SQL-standard <link linkend="ddl-priv">privilege system</link> available through <xref linkend="sql-grant"/>, tables can have <firstterm>row security policies</firstterm> that restrict, on a per-user basis, which rows can be returned by normal queries or inserted, updated, or deleted by data modification commands. This feature is also known as <firstterm>Row-Level Security</firstterm>. By default, tables do not have any policies, so that if a user has access privileges to a table according to the SQL privilege system, all rows within it are equally available for querying or updating.
ru: В дополнение к стандартной <link linkend="ddl-priv">системе прав</link> SQL, управляемой командой <xref linkend="sql-grant"/>, на уровне таблиц можно определить <firstterm>политики защиты строк</firstterm>, ограничивающие для пользователей наборы строк, которые могут быть возвращены обычными запросами или добавлены, изменены и удалены командами, изменяющими данные. Это называется также <firstterm>защитой на уровне строк</firstterm> (RLS, Row-Level Security). По умолчанию таблицы не имеют политик, так что если система прав SQL разрешает пользователю доступ к таблице, все строки в ней одинаково доступны для чтения или изменения.

source: When row security is enabled on a table (with <link linkend="sql-altertable">ALTER TABLE ... ENABLE ROW LEVEL SECURITY</link>), all normal access to the table for selecting rows or modifying rows must be allowed by a row security policy. (However, the table's owner is typically not subject to row security policies.) If no policy exists for the table, a default-deny policy is used, meaning that no rows are visible or can be modified. Operations that apply to the whole table, such as <command>TRUNCATE</command> and <literal>REFERENCES</literal>, are not subject to row security.
ru: Когда для таблицы включается защита строк (с помощью команды <link linkend="sql-altertable">ALTER TABLE ... ENABLE ROW LEVEL SECURITY</link>), все обычные запросы к таблице на выборку или модификацию строк должны разрешаться политикой защиты строк. (Однако на владельца таблицы такие политики обычно не действуют.) Если политика для таблицы не определена, применяется политика запрета по умолчанию, так что никакие строки в этой таблице нельзя увидеть или модифицировать. На операции с таблицей в целом, такие как <command>TRUNCATE</command> и <literal>REFERENCES</literal>, защита строк не распространяется.

source: Row security policies can be specific to commands, or to roles, or to both. A policy can be specified to apply to <literal>ALL</literal> commands, or to <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, or <literal>DELETE</literal>. Multiple roles can be assigned to a given policy, and normal role membership and inheritance rules apply.
ru: Политики защиты строк могут применяться к определённым командам и/или ролям. Политику можно определить как применяемую к командам <literal>ALL</literal> (всем), либо <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal> и <literal>DELETE</literal>. Кроме того, политику можно связать с несколькими ролями, при этом действуют обычные правила членства и наследования.

source: To specify which rows are visible or modifiable according to a policy, an expression is required that returns a Boolean result. This expression will be evaluated for each row prior to any conditions or functions coming from the user's query. (The only exceptions to this rule are <literal>leakproof</literal> functions, which are guaranteed to not leak information; the optimizer may choose to apply such functions ahead of the row-security check.) Rows for which the expression does not return <literal>true</literal> will not be processed. Separate expressions may be specified to provide independent control over the rows which are visible and the rows which are allowed to be modified. Policy expressions are run as part of the query and with the privileges of the user running the query, although security-definer functions can be used to access data not available to the calling user.
ru: Чтобы определить, какие строки будут видимыми или могут изменяться в таблице, для политики задаётся выражение, возвращающее логический результат. Это выражение будет вычисляться для каждой строки перед другими условиями или функциями, поступающими из запроса пользователя. (Единственным исключением из этого правила являются <literal>герметичные</literal> функции, которые гарантированно не допускают утечки информации; оптимизатор может решить выполнить эти функции до проверок защиты строк.) Строки, для которых это выражение возвращает не <literal>true</literal>, обрабатываться не будут. Чтобы независимо управлять набором строк, которые можно видеть, и набором строк, которые можно модифицировать, в политике можно задать отдельные выражения. Выражения политик обрабатываются в составе запроса с правами исполняющего его пользователя, но для обращения к данным, недоступным этому пользователю, в этих выражениях могут применяться функции, определяющие контекст безопасности.

source: Superusers and roles with the <literal>BYPASSRLS</literal> attribute always bypass the row security system when accessing a table. Table owners normally bypass row security as well, though a table owner can choose to be subject to row security with <link linkend="sql-altertable">ALTER TABLE ... FORCE ROW LEVEL SECURITY</link>.
ru: Суперпользователи и роли с атрибутом <literal>BYPASSRLS</literal> всегда обращаются к таблице, минуя систему защиты строк. На владельца таблицы защита строк тоже не действует, хотя он может включить её для себя принудительно, выполнив команду <link linkend="sql-altertable">ALTER TABLE ... FORCE ROW LEVEL SECURITY</link>.

source: Enabling and disabling row security, as well as adding policies to a table, is always the privilege of the table owner only.
ru: Неотъемлемое право включать или отключать защиту строк, а также определять политики для таблицы, имеет только её владелец.

source: Policies are created using the <xref linkend="sql-createpolicy"/> command, altered using the <xref linkend="sql-alterpolicy"/> command, and dropped using the <xref linkend="sql-droppolicy"/> command. To enable and disable row security for a given table, use the <xref linkend="sql-altertable"/> command.
ru: Для создания политик предназначена команда <xref linkend="sql-createpolicy"/>, для изменения — <xref linkend="sql-alterpolicy"/>, а для удаления — <xref linkend="sql-droppolicy"/>. Чтобы включить или отключить защиту строк для определённой таблицы, воспользуйтесь командой <xref linkend="sql-altertable"/>.

source: Each policy has a name and multiple policies can be defined for a table. As policies are table-specific, each policy for a table must have a unique name. Different tables may have policies with the same name.
ru: Каждой политике назначается имя, при этом для одной таблицы можно определить несколько политик. Так как политики привязаны к таблицам, каждая политика для таблицы должна иметь уникальное имя. В разных таблицах политики могут иметь одинаковые имена.

source: When multiple policies apply to a given query, they are combined using <literal>OR</literal>, so that a row is accessible if any policy allows it. This is similar to the rule that a given role has the privileges of all roles that they are a member of.
ru: Когда к определённому запросу применяются несколько политик, они объединяются логическим сложением, так что строка будет доступна, если это разрешит какая-либо политика. Это подобно тому, как некоторая роль получает права всех ролей, в которые она включена.

source: As a simple example, here is how to create a policy on the <literal>account</literal> relation to allow only members of the <literal>managers</literal> role to access rows, and only rows of their accounts:
ru: В качестве простого примера, создать политику для отношения <literal>account</literal>, позволяющую только членам роли <literal>managers</literal> обращаться к строкам отношения и при этом только к своим, можно так:

source: If no role is specified, or the special user name <literal>PUBLIC</literal> is used, then the policy applies to all users on the system. To allow all users to access their own row in a <literal>users</literal> table, a simple policy can be used:
ru: Если роль не задана, либо задано специальное имя пользователя <literal>PUBLIC</literal>, политика применяется ко всем пользователям в данной системе. Чтобы все пользователи могли обратиться к собственной строке в таблице <literal>users</literal>, можно применить простую политику:

source: To use a different policy for rows that are being added to the table compared to those rows that are visible, the <literal>WITH CHECK</literal> clause can be used. This policy would allow all users to view all rows in the <literal>users</literal> table, but only modify their own:
ru: Чтобы определить для строк, добавляемых в таблицу, отдельную политику, отличную от политики, ограничивающей видимые строки, можно применить предложение <literal>WITH CHECK</literal>. Следующая политика позволит всем пользователям видеть все строки в таблице <literal>users</literal>, но изменять только свою собственную:

source: Row security can also be disabled with the <command>ALTER TABLE</command> command. Disabling row security does not remove any policies that are defined on the table; they are simply ignored. Then all rows in the table are visible and modifiable, subject to the standard SQL privileges system.
ru: Защиту строк можно отключить так же командой <command>ALTER TABLE</command>. При отключении защиты, политики, определённые для таблицы, не удаляются, а просто игнорируются. В результате в таблице будут видны и могут модифицироваться все строки, с учётом ограничений стандартной системы прав SQL.

source: Below is a larger example of how this feature can be used in production environments. The table <literal>passwd</literal> emulates a Unix password file:
ru: Ниже показан развёрнутый пример того, как этот механизм защиты можно применять в производственной среде. Таблица <literal>passwd</literal> имитирует файл паролей в Unix:

source: -- Simple passwd-file based example CREATE TABLE passwd ( username text UNIQUE NOT NULL, pwhash text, uid int PRIMARY KEY, gid int NOT NULL, real_name text NOT NULL, home_phone text, extra_info text, home_dir text NOT NULL, shell text NOT NULL ); CREATE ROLE admin; -- Administrator CREATE ROLE bob; -- Normal user CREATE ROLE alice; -- Normal user -- Populate the table INSERT INTO passwd VALUES ('admin','xxx',0,0,'Admin','111-222-3333',null,'/root','/bin/dash'); INSERT INTO passwd VALUES ('bob','xxx',1,1,'Bob','123-456-7890',null,'/home/bob','/bin/zsh'); INSERT INTO passwd VALUES ('alice','xxx',2,1,'Alice','098-765-4321',null,'/home/alice','/bin/zsh'); -- Be sure to enable row level security on the table ALTER TABLE passwd ENABLE ROW LEVEL SECURITY; -- Create policies -- Administrator can see all rows and add any rows CREATE POLICY admin_all ON passwd TO admin USING (true) WITH CHECK (true); -- Normal users can view all rows CREATE POLICY all_view ON passwd FOR SELECT USING (true); -- Normal users can update their own records, but -- limit which shells a normal user is allowed to set CREATE POLICY user_mod ON passwd FOR UPDATE USING (current_user = username) WITH CHECK ( current_user = username AND shell IN ('/bin/bash','/bin/sh','/bin/dash','/bin/zsh','/bin/tcsh') ); -- Allow admin all normal rights GRANT SELECT, INSERT, UPDATE, DELETE ON passwd TO admin; -- Users only get select access on public columns GRANT SELECT (username, uid, gid, real_name, home_phone, extra_info, home_dir, shell) ON passwd TO public; -- Allow users to update certain columns GRANT UPDATE (pwhash, real_name, home_phone, extra_info, shell) ON passwd TO public;
ru: -- Простой пример на базе файла passwd CREATE TABLE passwd ( username text UNIQUE NOT NULL, pwhash text, uid int PRIMARY KEY, gid int NOT NULL, real_name text NOT NULL, home_phone text, extra_info text, home_dir text NOT NULL, shell text NOT NULL ); CREATE ROLE admin; -- Администратор CREATE ROLE bob; -- Обычный пользователь CREATE ROLE alice; -- Обычный пользователь -- Наполнение таблицы INSERT INTO passwd VALUES ('admin','xxx',0,0,'Admin','111-222-3333',null,'/root','/bin/dash'); INSERT INTO passwd VALUES ('bob','xxx',1,1,'Bob','123-456-7890',null,'/home/bob','/bin/zsh'); INSERT INTO passwd VALUES ('alice','xxx',2,1,'Alice','098-765-4321',null,'/home/alice','/bin/zsh'); -- Необходимо включить для этой таблицы защиту на уровне строк ALTER TABLE passwd ENABLE ROW LEVEL SECURITY; -- Создание политик -- Администратор может видеть и добавлять любые строки CREATE POLICY admin_all ON passwd TO admin USING (true) WITH CHECK (true); -- Обычные пользователи могут видеть все строки CREATE POLICY all_view ON passwd FOR SELECT USING (true); -- Обычные пользователи могут изменять собственные данные, но -- не могут задать произвольную оболочку входа CREATE POLICY user_mod ON passwd FOR UPDATE USING (current_user = username) WITH CHECK ( current_user = username AND shell IN ('/bin/bash','/bin/sh','/bin/dash','/bin/zsh','/bin/tcsh') ); -- Администраторы получают все обычные права GRANT SELECT, INSERT, UPDATE, DELETE ON passwd TO admin; -- Пользователям разрешается чтение только общедоступных столбцов GRANT SELECT (username, uid, gid, real_name, home_phone, extra_info, home_dir, shell) ON passwd TO public; -- Пользователям разрешается изменение определённых столбцов GRANT UPDATE (pwhash, real_name, home_phone, extra_info, shell) ON passwd TO public;

source: As with any security settings, it's important to test and ensure that the system is behaving as expected. Using the example above, this demonstrates that the permission system is working properly.
ru: Как и любые средства защиты, важно проверить политики, и убедиться в том, что они работают ожидаемым образом. Применительно к предыдущему примеру, эти команды показывают, что система разрешений работает корректно.

source: -- admin can view all rows and fields postgres=&gt; set role admin; SET postgres=&gt; table passwd; username | pwhash | uid | gid | real_name | home_phone | extra_info | home_dir | shell ----------+--------+-----+-----+-----------+--------------+------------+-------------+----------- admin | xxx | 0 | 0 | Admin | 111-222-3333 | | /root | /bin/dash bob | xxx | 1 | 1 | Bob | 123-456-7890 | | /home/bob | /bin/zsh alice | xxx | 2 | 1 | Alice | 098-765-4321 | | /home/alice | /bin/zsh (3 rows) -- Test what Alice is able to do postgres=&gt; set role alice; SET postgres=&gt; table passwd; ERROR: permission denied for relation passwd postgres=&gt; select username,real_name,home_phone,extra_info,home_dir,shell from passwd; username | real_name | home_phone | extra_info | home_dir | shell ----------+-----------+--------------+------------+-------------+----------- admin | Admin | 111-222-3333 | | /root | /bin/dash bob | Bob | 123-456-7890 | | /home/bob | /bin/zsh alice | Alice | 098-765-4321 | | /home/alice | /bin/zsh (3 rows) postgres=&gt; update passwd set username = 'joe'; ERROR: permission denied for relation passwd -- Alice is allowed to change her own real_name, but no others postgres=&gt; update passwd set real_name = 'Alice Doe'; UPDATE 1 postgres=&gt; update passwd set real_name = 'John Doe' where username = 'admin'; UPDATE 0 postgres=&gt; update passwd set shell = '/bin/xx'; ERROR: new row violates WITH CHECK OPTION for "passwd" postgres=&gt; delete from passwd; ERROR: permission denied for relation passwd postgres=&gt; insert into passwd (username) values ('xxx'); ERROR: permission denied for relation passwd -- Alice can change her own password; RLS silently prevents updating other rows postgres=&gt; update passwd set pwhash = 'abc'; UPDATE 1
ru: -- Администратор может видеть все строки и поля postgres=&gt; set role admin; SET postgres=&gt; table passwd; username | pwhash | uid | gid | real_name | home_phone | extra_info | home_dir | shell ----------+--------+-----+-----+-----------+--------------+------------+-------------+----------- admin | xxx | 0 | 0 | Admin | 111-222-3333 | | /root | /bin/dash bob | xxx | 1 | 1 | Bob | 123-456-7890 | | /home/bob | /bin/zsh alice | xxx | 2 | 1 | Alice | 098-765-4321 | | /home/alice | /bin/zsh (3 rows) -- Проверим, что может делать Алиса postgres=&gt; set role alice; SET postgres=&gt; table passwd; ERROR: permission denied for relation passwd postgres=&gt; select username,real_name,home_phone,extra_info,home_dir,shell from passwd; username | real_name | home_phone | extra_info | home_dir | shell ----------+-----------+--------------+------------+-------------+----------- admin | Admin | 111-222-3333 | | /root | /bin/dash bob | Bob | 123-456-7890 | | /home/bob | /bin/zsh alice | Alice | 098-765-4321 | | /home/alice | /bin/zsh (3 rows) postgres=&gt; update passwd set username = 'joe'; ERROR: permission denied for relation passwd -- Алиса может изменить своё имя (поле real_name), но не имя кого-либо другого postgres=&gt; update passwd set real_name = 'Alice Doe'; UPDATE 1 postgres=&gt; update passwd set real_name = 'John Doe' where username = 'admin'; UPDATE 0 postgres=&gt; update passwd set shell = '/bin/xx'; ERROR: new row violates WITH CHECK OPTION for "passwd" postgres=&gt; delete from passwd; ERROR: permission denied for relation passwd postgres=&gt; insert into passwd (username) values ('xxx'); ERROR: permission denied for relation passwd -- Алиса может изменить собственный пароль; попытки поменять другие пароли RLS просто игнорирует postgres=&gt; update passwd set pwhash = 'abc'; UPDATE 1

source: Referential integrity checks, such as unique or primary key constraints and foreign key references, always bypass row security to ensure that data integrity is maintained. Care must be taken when developing schemas and row level policies to avoid <quote>covert channel</quote> leaks of information through such referential integrity checks.
ru: На проверки ссылочной целостности, например, на ограничения уникальности и внешние ключи, защита строк никогда не распространяется, чтобы не нарушалась целостность данных. Поэтому организацию и политики защиты на уровне строк необходимо тщательно прорабатывать, чтобы не возникли <quote>скрытые каналы</quote> утечки информации через эти проверки.

source: In some contexts it is important to be sure that row security is not being applied. For example, when taking a backup, it could be disastrous if row security silently caused some rows to be omitted from the backup. In such a situation, you can set the <xref linkend="guc-row-security"/> configuration parameter to <literal>off</literal>. This does not in itself bypass row security; what it does is throw an error if any query's results would get filtered by a policy. The reason for the error can then be investigated and fixed.
ru: В некоторых случаях важно, чтобы защита на уровне строк, наоборот, не действовала. Например, резервное копирование может оказаться провальным, если механизм защиты на уровне строк молча не даст скопировать какие-либо строки. В таком случае вы можете установить для параметра конфигурации <xref linkend="guc-row-security"/> значение <literal>off</literal>. Это само по себе не отключит защиту строк; при этом просто будет выдана ошибка, если результаты запроса отфильтруются политикой, с тем чтобы можно было изучить причину ошибки и устранить её.
