Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: To access foreign data, you need to create a <firstterm>foreign server</firstterm> object, which defines how to connect to a particular external data source according to the set of options used by its supporting foreign data wrapper. Then you need to create one or more <firstterm>foreign tables</firstterm>, which define the structure of the remote data. A foreign table can be used in queries just like a normal table, but a foreign table has no storage in the PostgreSQL server. Whenever it is used, <productname>PostgreSQL</productname> asks the foreign data wrapper to fetch data from the external source, or transmit data to the external source in the case of update commands.
ru: Чтобы обратиться к сторонним данным, вы должны создать объект <firstterm>сторонний сервер</firstterm>, в котором настраивается подключение к внешнему источнику данных, определяются параметры соответствующей обёртки сторонних данных. Затем вы должны создать одну или несколько <firstterm>сторонних таблиц</firstterm>, определив тем самым структуру внешних данных. Сторонние таблицы можно использовать в запросах так же, как и обычные, но их данные не хранятся на сервере PostgreSQL. При каждом запросе <productname>PostgreSQL</productname> обращается к обёртке сторонних данных, которая, в свою очередь, получает данные из внешнего источника или передаёт их ему (в случае команд INSERT или UPDATE).

source: Accessing remote data may require authenticating to the external data source. This information can be provided by a <firstterm>user mapping</firstterm>, which can provide additional data such as user names and passwords based on the current <productname>PostgreSQL</productname> role.
ru: При обращении к внешним данным удалённый источник может потребовать аутентификации клиента. Соответствующие учётные данные можно предоставить с помощью <firstterm>сопоставлений пользователей</firstterm>, позволяющих определить в частности имена и пароли, в зависимости от текущей роли пользователя <productname>PostgreSQL</productname>.

source: For additional information, see <xref linkend="sql-createforeigndatawrapper"/>, <xref linkend="sql-createserver"/>, <xref linkend="sql-createusermapping"/>, <xref linkend="sql-createforeigntable"/>, and <xref linkend="sql-importforeignschema"/>.
ru: Дополнительную информацию вы найдёте в <xref remap="6" linkend="sql-createforeigndatawrapper"/>, <xref remap="6" linkend="sql-createserver"/>, <xref remap="6" linkend="sql-createusermapping"/>, <xref remap="6" linkend="sql-createforeigntable"/> и <xref remap="6" linkend="sql-importforeignschema"/>.

source: Other Database Objects
ru: Другие объекты баз данных

source: Tables are the central objects in a relational database structure, because they hold your data. But they are not the only objects that exist in a database. Many other kinds of objects can be created to make the use and management of the data more efficient or convenient. They are not discussed in this chapter, but we give you a list here so that you are aware of what is possible:
ru: Таблицы &mdash; центральные объекты в структуре реляционной базы данных, так как они содержат ваши данные. Но это не единственные объекты, которые могут в ней существовать. Помимо них вы можете создавать и использовать объекты и других типов, призванные сделать управление данными эффективнее и удобнее. Они не обсуждаются в этой главе, но мы просто перечислим некоторые из них, чтобы вы знали об их существовании:

source: Views
ru: Представления

source: Functions and operators
ru: Функции и операторы

source: Data types and domains
ru: Типы данных и домены

source: Triggers and rewrite rules
ru: Триггеры и правила перезаписи

source: Detailed information on these topics appears in <xref linkend="server-programming"/>.
ru: Подробнее соответствующие темы освещаются в <xref remap="6" linkend="server-programming"/>.

source: Dependency Tracking
ru: Отслеживание зависимостей

source: <primary>CASCADE</primary><secondary sortas="DROP">with DROP</secondary>
ru: <primary>CASCADE</primary><secondary sortas="DROP">с DROP</secondary>

source: <primary>RESTRICT</primary><secondary sortas="DROP">with DROP</secondary>
ru: <primary>RESTRICT</primary><secondary sortas="DROP">с DROP</secondary>

source: When you create complex database structures involving many tables with foreign key constraints, views, triggers, functions, etc. you implicitly create a net of dependencies between the objects. For instance, a table with a foreign key constraint depends on the table it references.
ru: Когда вы создаёте сложные структуры баз данных, включающие множество таблиц с внешними ключами, представлениями, триггерами, функциями и т. п., вы неявно создаёте сеть зависимостей между объектами. Например, таблица с ограничением внешнего ключа зависит от таблицы, на которую она ссылается.

source: To ensure the integrity of the entire database structure, <productname>PostgreSQL</productname> makes sure that you cannot drop objects that other objects still depend on. For example, attempting to drop the products table we considered in <xref linkend="ddl-constraints-fk"/>, with the orders table depending on it, would result in an error message like this: <screen>DROP TABLE products; ERROR: cannot drop table products because other objects depend on it DETAIL: constraint orders_product_no_fkey on table orders depends on table products HINT: Use DROP ... CASCADE to drop the dependent objects too.</screen> The error message contains a useful hint: if you do not want to bother deleting all the dependent objects individually, you can run: <screen>DROP TABLE products CASCADE;</screen> and all the dependent objects will be removed. In this case, it doesn't remove the orders table, it only removes the foreign key constraint. (If you want to check what <command>DROP ... CASCADE</command> will do, run <command>DROP</command> without <literal>CASCADE</literal> and read the <literal>DETAIL</literal> output.)
ru: Для сохранения целостности структуры всей базы данных <productname>PostgreSQL</productname> не позволяет удалять объекты, от которых зависят другие. Например, попытка удалить таблицу products (мы рассматривали её в <xref remap="6" linkend="ddl-constraints-fk"/>), от которой зависит таблица orders, приведёт к ошибке примерно такого содержания: <screen>DROP TABLE products; ОШИБКА: удалить объект "таблица products" нельзя, так как от него зависят другие ПОДРОБНОСТИ: ограничение orders_product_no_fkey в отношении "таблица orders" зависит от объекта "таблица products" ПОДСКАЗКА: Для удаления зависимых объектов используйте DROP ... CASCADE.</screen> Сообщение об ошибке даёт полезную подсказку: если вы не хотите заниматься ликвидацией зависимостей по отдельности, можно выполнить: <screen>DROP TABLE products CASCADE;</screen> и все зависимые объекты будут удалены. В этом случае таблица orders останется, а удалено будет только её ограничение внешнего ключа. (Если вы хотите проверить, что произойдёт при выполнении <command>DROP ... CASCADE</command>, запустите <command>DROP</command> без <literal>CASCADE</literal> и прочитайте <literal>ПОДРОБНОСТИ</literal> (DETAIL).)

source: All <command>DROP</command> commands in <productname>PostgreSQL</productname> support specifying <literal>CASCADE</literal>. Of course, the nature of the possible dependencies varies with the type of the object. You can also write <literal>RESTRICT</literal> instead of <literal>CASCADE</literal> to get the default behavior, which is to prevent the dropping of objects that other objects depend on.
ru: Все команды <command>DROP</command> в <productname>PostgreSQL</productname> поддерживают указание <literal>CASCADE</literal>. Конечно, вид возможных зависимостей зависит от типа объекта. Вы также можете написать <literal>RESTRICT</literal> вместо <literal>CASCADE</literal>, чтобы включить поведение по умолчанию, когда объект можно удалить, только если от него не зависят никакие другие.

source: According to the SQL standard, specifying either <literal>RESTRICT</literal> or <literal>CASCADE</literal> is required in a <command>DROP</command> command. No database system actually enforces that rule, but whether the default behavior is <literal>RESTRICT</literal> or <literal>CASCADE</literal> varies across systems.
ru: Стандарт SQL требует явного указания <literal>RESTRICT</literal> или <literal>CASCADE</literal> в команде <command>DROP</command>. Но это требование на самом деле не выполняется ни в одной СУБД, при этом одни системы по умолчанию подразумевают <literal>RESTRICT</literal>, а другие — <literal>CASCADE</literal>.

source: For user-defined functions, <productname>PostgreSQL</productname> tracks dependencies associated with a function's externally-visible properties, such as its argument and result types, but <emphasis>not</emphasis> dependencies that could only be known by examining the function body. As an example, consider this situation: <placeholder-1/> (See <xref linkend="xfunc-sql"/> for an explanation of SQL-language functions.) <productname>PostgreSQL</productname> will be aware that the <function>get_color_note</function> function depends on the <type>rainbow</type> type: dropping the type would force dropping the function, because its argument type would no longer be defined. But <productname>PostgreSQL</productname> will not consider <function>get_color_note</function> to depend on the <structname>my_colors</structname> table, and so will not drop the function if the table is dropped. While there are disadvantages to this approach, there are also benefits. The function is still valid in some sense if the table is missing, though executing it would cause an error; creating a new table of the same name would allow the function to work again.
ru: Для пользовательских функций <productname>PostgreSQL</productname> отслеживает зависимости, связанные с внешне видимыми свойствами функции, такими как типы аргументов и результата, но <emphasis>не</emphasis> зависимости, которые могут быть выявлены только при анализе тела функции. В качестве примера рассмотрите следующий сценарий: <placeholder-1/> (Описание функций языка SQL можно найти в <xref remap="6" linkend="xfunc-sql"/>.) <productname>PostgreSQL</productname> будет понимать, что функция <function>get_color_note</function> зависит от типа <type>rainbow</type>: при удалении типа будет принудительно удалена функция, так как тип её аргумента оказывается неопределённым. Но <productname>PostgreSQL</productname> не будет учитывать зависимость <function>get_color_note</function> от таблицы <structname>my_colors</structname> и не удалит функцию при удалении таблицы. Но у этого подхода есть не только минус, но и плюс. В случае отсутствия таблицы эта функция останется рабочей в некотором смысле: хотя при попытке выполнить её возникнет ошибка, но при создании новой таблицы с тем же именем функция снова будет работать.
