Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: Table inheritance is typically established when the child table is created, using the <literal>INHERITS</literal> clause of the <xref linkend="sql-createtable"/> statement. Alternatively, a table which is already defined in a compatible way can have a new parent relationship added, using the <literal>INHERIT</literal> variant of <xref linkend="sql-altertable"/>. To do this the new child table must already include columns with the same names and types as the columns of the parent. It must also include check constraints with the same names and check expressions as those of the parent. Similarly an inheritance link can be removed from a child using the <literal>NO INHERIT</literal> variant of <command>ALTER TABLE</command>. Dynamically adding and removing inheritance links like this can be useful when the inheritance relationship is being used for table partitioning (see <xref linkend="ddl-partitioning"/>).
ru: Отношение наследования между таблицами обычно устанавливается при создании дочерней таблицы с использованием предложения <literal>INHERITS</literal> оператора <xref linkend="sql-createtable"/>. Другой способ добавить такое отношение для таблицы, определённой подходящим образом &mdash; использовать <literal>INHERIT</literal> с оператором <xref linkend="sql-altertable"/>. Для этого будущая дочерняя таблица должна уже включать те же столбцы (с совпадающими именами и типами), что и родительская таблица. Также она должна включать аналогичные ограничения-проверки (с теми же именами и выражениями). Удалить отношение наследования можно с помощью указания <literal>NO INHERIT</literal> оператора <command>ALTER TABLE</command>. Динамическое добавление и удаление отношений наследования может быть полезно при реализации секционирования таблиц (см. <xref remap="4" linkend="ddl-partitioning"/>).

source: One convenient way to create a compatible table that will later be made a new child is to use the <literal>LIKE</literal> clause in <command>CREATE TABLE</command>. This creates a new table with the same columns as the source table. If there are any <literal>CHECK</literal> constraints defined on the source table, the <literal>INCLUDING CONSTRAINTS</literal> option to <literal>LIKE</literal> should be specified, as the new child must have constraints matching the parent to be considered compatible.
ru: Для создания таблицы, которая затем может стать наследником другой, удобно воспользоваться предложением <literal>LIKE</literal> оператора <command>CREATE TABLE</command>. Такая команда создаст новую таблицу с теми же столбцами, что имеются в исходной. Если в исходной таблицы определены ограничения <literal>CHECK</literal>, для создания полностью совместимой таблицы их тоже нужно скопировать, и это можно сделать, добавив к предложению <literal>LIKE</literal> параметр <literal>INCLUDING CONSTRAINTS</literal>.

source: A parent table cannot be dropped while any of its children remain. Neither can columns or check constraints of child tables be dropped or altered if they are inherited from any parent tables. If you wish to remove a table and all of its descendants, one easy way is to drop the parent table with the <literal>CASCADE</literal> option.
ru: Родительскую таблицу нельзя удалить, пока существуют унаследованные от неё. Так же как в дочерних таблицах нельзя удалять или модифицировать столбцы или ограничения-проверки, унаследованные от родительских таблиц. Если вы хотите удалить таблицу вместе со всеми её потомками, это легко сделать, добавив в команду удаления родительской таблицы параметр <literal>CASCADE</literal>.

source: <xref linkend="sql-altertable"/> will propagate any changes in column data definitions and check constraints down the inheritance hierarchy. Again, dropping columns that are depended on by other tables is only possible when using the <literal>CASCADE</literal> option. <command>ALTER TABLE</command> follows the same rules for duplicate column merging and rejection that apply during <command>CREATE TABLE</command>.
ru: При изменениях определений и ограничений столбцов команда <xref linkend="sql-altertable"/> распространяет эти изменения вниз в иерархии наследования. Однако удалить столбцы, унаследованные дочерними таблицами, можно только с помощью параметра <literal>CASCADE</literal>. При создании отношений наследования команда <command>ALTER TABLE</command> следует тем же правилам объединения дублирующихся столбцов, что и <command>CREATE TABLE</command>.

source: Note how table access permissions are handled. Querying a parent table can automatically access data in child tables without further access privilege checking. This preserves the appearance that the data is (also) in the parent table. Accessing the child tables directly is, however, not automatically allowed and would require further privileges to be granted.
ru: Обратите внимание на ситуацию с правами доступа. При запросе к родительской таблице данные всех дочерних таблиц будут возвращены без дополнительной проверки прав. Так создаётся представление, что эти данные (тоже) находятся в родительской таблице. Однако права не распространяются автоматически на все дочерние таблицы, и поэтому для обращения к ним права доступа должны назначаться отдельно.

source: Foreign tables (see <xref linkend="ddl-foreign-data"/>) can also be part of inheritance hierarchies, either as parent or child tables, just as regular tables can be. If a foreign table is part of an inheritance hierarchy then any operations not supported by the foreign table are not supported on the whole hierarchy either.
ru: Сторонние таблицы (см. <xref remap="4" linkend="ddl-foreign-data"/>) могут также входить в иерархию наследования как родительские или дочерние таблицы, так же, как и обычные. Если в иерархию наследования входит сторонняя таблица, все операции, не поддерживаемые ей, не будут поддерживаться иерархией в целом.

source: Caveats
ru: Ограничения

source: Note that not all SQL commands are able to work on inheritance hierarchies. Commands that are used for data querying, data modification, or schema modification (e.g., <literal>SELECT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, most variants of <literal>ALTER TABLE</literal>, but not <literal>INSERT</literal> or <literal>ALTER TABLE ... RENAME</literal>) typically default to including child tables and support the <literal>ONLY</literal> notation to exclude them. Commands that do database maintenance and tuning (e.g., <literal>REINDEX</literal>, <literal>VACUUM</literal>) typically only work on individual, physical tables and do not support recursing over inheritance hierarchies. The respective behavior of each individual command is documented in its reference page (<xref linkend="sql-commands"/>).
ru: Заметьте, что не все SQL-команды могут работать с иерархиями наследования. Команды, выполняющие выборку данных, изменение данных или модификацию схемы (например <literal>SELECT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, большинство вариантов <literal>ALTER TABLE</literal>, но не <literal>INSERT</literal> и <literal>ALTER TABLE ... RENAME</literal>), обычно по умолчанию обрабатывают данные дочерних таблиц и могут исключать их, если поддерживают указание <literal>ONLY</literal>. Команды для обслуживания и настройки базы данных (например <literal>REINDEX</literal> и <literal>VACUUM</literal>) обычно работают только с отдельными физическими таблицами и не поддерживают рекурсивную обработку отношений наследования. Соответствующее поведение каждой команды описано в её справке (<xref linkend="sql-commands"/>).

source: If we declared <structname>cities</structname>.<structfield>name</structfield> to be <literal>UNIQUE</literal> or a <literal>PRIMARY KEY</literal>, this would not stop the <structname>capitals</structname> table from having rows with names duplicating rows in <structname>cities</structname>. And those duplicate rows would by default show up in queries from <structname>cities</structname>. In fact, by default <structname>capitals</structname> would have no unique constraint at all, and so could contain multiple rows with the same name. You could add a unique constraint to <structname>capitals</structname>, but this would not prevent duplication compared to <structname>cities</structname>.
ru: Если мы объявим <structname>cities</structname>.<structfield>name</structfield> с ограничением <literal>UNIQUE</literal> или <literal>PRIMARY KEY</literal>, это не помешает добавить в таблицу <structname>capitals</structname> строки с названиями городов, уже существующими в таблице <structname>cities</structname>. И эти дублирующиеся строки по умолчанию будут выводиться в результате запросов к <structname>cities</structname>. На деле таблица <structname>capitals</structname> по умолчанию вообще не будет содержать ограничение уникальности, так что в ней могут оказаться несколько строк с одним названием. Хотя вы можете добавить в <structname>capitals</structname> соответствующее ограничение, но это не предотвратит дублирование при объединении с <structname>cities</structname>.

source: Similarly, if we were to specify that <structname>cities</structname>.<structfield>name</structfield> <literal>REFERENCES</literal> some other table, this constraint would not automatically propagate to <structname>capitals</structname>. In this case you could work around it by manually adding the same <literal>REFERENCES</literal> constraint to <structname>capitals</structname>.
ru: Подобным образом, если мы укажем, что <structname>cities</structname>.<structfield>name</structfield> ссылается (<literal>REFERENCES</literal>) на какую-то другую таблицу, это ограничение не будет автоматически распространено на <structname>capitals</structname>. В этом случае решением может стать явное добавление такого же ограничения <literal>REFERENCES</literal> в таблицу <structname>capitals</structname>.

source: Specifying that another table's column <literal>REFERENCES cities(name)</literal> would allow the other table to contain city names, but not capital names. There is no good workaround for this case.
ru: Если вы сделаете, чтобы столбец другой таблицы ссылался на <literal>cities(name)</literal>, в этом столбце можно будет указывать только названия городов, но не столиц. В этом случае хорошего решения нет.

source: A serious limitation of the inheritance feature is that indexes (including unique constraints) and foreign key constraints only apply to single tables, not to their inheritance children. This is true on both the referencing and referenced sides of a foreign key constraint. Thus, in the terms of the above example: <placeholder-1/> These deficiencies will probably be fixed in some future release, but in the meantime considerable care is needed in deciding whether inheritance is useful for your application.
ru: Возможности наследования серьёзно ограничены тем, что индексы (включая ограничения уникальности) и ограничения внешних ключей относятся только к отдельным таблицам, но не к их потомкам. Это касается обеих сторон ограничений внешних ключей. Таким образом, применительно к нашему примеру: <placeholder-1/> Возможно, в будущем эти недостатки будут исправлены, но в настоящее время вам следует тщательно взвесить все за и против, прежде чем использовать наследование в своих приложениях.

source: Partitioning
ru: Секционирование

source: <primary>partitioning</primary>
ru: <primary>секционирование</primary>

source: <primary>table</primary><secondary>partitioning</secondary>
ru: <primary>таблица</primary><secondary>секционирование</secondary>

source: <productname>PostgreSQL</productname> supports basic table partitioning. This section describes why and how to implement partitioning as part of your database design.
ru: <productname>PostgreSQL</productname> поддерживает простое секционирование таблиц. В этом разделе описывается, как и почему бывает полезно применять секционирование при проектировании баз данных.

source: Overview
ru: Обзор

source: Query performance can be improved dramatically in certain situations, particularly when most of the heavily accessed rows of the table are in a single partition or a small number of partitions. The partitioning substitutes for leading columns of indexes, reducing index size and making it more likely that the heavily-used parts of the indexes fit in memory.
ru: В определённых ситуациях оно кардинально увеличивает быстродействие, особенно когда большой процент часто запрашиваемых строк таблицы относится к одному или небольшому числу секций. Секционирование может сыграть роль ведущих столбцов в индексах, что позволит уменьшить размер индекса и увеличит вероятность нахождения наиболее востребованных частей индексов в памяти.

source: When queries or updates access a large percentage of a single partition, performance can be improved by taking advantage of sequential scan of that partition instead of using an index and random access reads scattered across the whole table.
ru: Когда в выборке или изменении данных задействована большая часть одной секции, последовательное сканирование этой секции может выполняться гораздо быстрее, чем случайный доступ по индексу к данным, разбросанным по всей таблице.

source: Bulk loads and deletes can be accomplished by adding or removing partitions, if that requirement is planned into the partitioning design. <command>ALTER TABLE NO INHERIT</command> and <command>DROP TABLE</command> are both far faster than a bulk operation. These commands also entirely avoid the <command>VACUUM</command> overhead caused by a bulk <command>DELETE</command>.
ru: Массовую загрузку и удаление данных можно осуществлять, добавляя и удаляя секции, если это было предусмотрено при проектировании секций. Команды <command>ALTER TABLE NO INHERIT</command> и <command>DROP TABLE</command> работают гораздо быстрее, чем массовая загрузка. Эти команды также полностью исключают накладные расходы, связанные с выполнением операции <command>VACUUM</command> после команды <command>DELETE</command>.

source: Seldom-used data can be migrated to cheaper and slower storage media.
ru: Редко используемые данные можно перенести на более дешёвые и медленные носители.

source: Partitioning refers to splitting what is logically one large table into smaller physical pieces. Partitioning can provide several benefits: <placeholder-1/> The benefits will normally be worthwhile only when a table would otherwise be very large. The exact point at which a table will benefit from partitioning depends on the application, although a rule of thumb is that the size of the table should exceed the physical memory of the database server.
ru: Секционированием данных называется разбиение одной большой логической таблицы на несколько небольших физических секций. Секционирование может принести следующую пользу: <placeholder-1/> Всё это обычно полезно только для очень больших таблиц. Какие именно таблицы выиграют от секционирования, зависит от конкретного приложения, хотя, как правило, это следует применять для таблиц, размер которых превышает объём ОЗУ сервера.

source: Currently, <productname>PostgreSQL</productname> supports partitioning via table inheritance. Each partition must be created as a child table of a single parent table. The parent table itself is normally empty; it exists just to represent the entire data set. You should be familiar with inheritance (see <xref linkend="ddl-inherit"/>) before attempting to set up partitioning.
ru: В настоящее время <productname>PostgreSQL</productname> реализует секционирование таблиц через механизм наследования. Каждая секция одной таблицы должна создаваться как её дочерняя таблица. Сама же родительская таблица обычно остаётся пустой; она существует только для того, чтобы представлять единый набор данных. Прежде чем приступить к изучению секционирования, вам следует познакомиться с наследованием (см. <xref remap="4" linkend="ddl-inherit"/>).

source: Range Partitioning
ru: Секционирование по диапазонам

source: The table is partitioned into <quote>ranges</quote> defined by a key column or set of columns, with no overlap between the ranges of values assigned to different partitions. For example one might partition by date ranges, or by ranges of identifiers for particular business objects.
ru: Таблица секционируется по <quote>диапазонам</quote>, определённым по ключевому столбцу или набору столбцов, и не пересекающимся друг с другом. Например, можно секционировать данные по диапазонам дат или по диапазонам идентификаторов определённых бизнес-объектов.

source: List Partitioning
ru: Секционирование по списку

source: The table is partitioned by explicitly listing which key values appear in each partition.
ru: Таблица секционируется с помощью списка, явно указывающего, какие значения ключа должны относиться к каждой секции.

source: The following forms of partitioning can be implemented in <productname>PostgreSQL</productname>: <placeholder-1/>
ru: В <productname>PostgreSQL</productname> можно реализовать следующие типы секционирования: <placeholder-1/>

source: Implementing Partitioning
ru: Реализация секционирования

source: Create the <quote>master</quote> table, from which all of the partitions will inherit.
ru: Создайте <quote>главную</quote> таблицу, от которой будут унаследованы все секции.

source: This table will contain no data. Do not define any check constraints on this table, unless you intend them to be applied equally to all partitions. There is no point in defining any indexes or unique constraints on it, either.
ru: Эта таблица не будет содержать данных. Не определяйте для неё никаких ограничений, если только вы не намерены затем явно продублировать их во всех секциях. Также не имеет смысла определять для неё какие-либо индексы или ограничения уникальности.

source: Create several <quote>child</quote> tables that each inherit from the master table. Normally, these tables will not add any columns to the set inherited from the master.
ru: Создайте несколько <quote>дочерних</quote> таблиц, унаследовав их все от главной. Обычно в таких таблицах не будет никаких дополнительных столбцов, кроме унаследованных.

source: We will refer to the child tables as partitions, though they are in every way normal <productname>PostgreSQL</productname> tables (or, possibly, foreign tables).
ru: Далее мы будем называть эти дочерние таблицы секциями, хотя по сути они ничем не отличаются от обычных таблиц <productname>PostgreSQL</productname> (и, возможно, сторонних таблиц).

source: Add table constraints to the partition tables to define the allowed key values in each partition.
ru: Добавьте в таблицы-секции ограничения, определяющие допустимые значения ключей для каждой секции.

source: Typical examples would be: <placeholder-1/> Ensure that the constraints guarantee that there is no overlap between the key values permitted in different partitions. A common mistake is to set up range constraints like: <placeholder-2/> This is wrong since it is not clear which partition the key value 200 belongs in.
ru: Типичные примеры таких ограничений: <placeholder-1/> Убедитесь в том, что ограничения не пересекаются, то есть никакие значения ключа не относятся сразу к нескольким секциям. Например, часто допускают такую ошибку в определении диапазонов: <placeholder-2/> Это не будет работать, так как неясно, к какой секции должно относиться значение 200.

source: Note that there is no difference in syntax between range and list partitioning; those terms are descriptive only.
ru: Заметьте, что никаких синтаксических отличий между секционированием по диапазонам и по списку значений нет; эти типы выделены только для понимания.

source: For each partition, create an index on the key column(s), as well as any other indexes you might want. (The key index is not strictly necessary, but in most scenarios it is helpful. If you intend the key values to be unique then you should always create a unique or primary-key constraint for each partition.)
ru: Для каждой секции создайте индекс по ключевому столбцу(ам), а также любые другие индексы по своему усмотрению. (Индекс по ключу, строго говоря, не необходим, но в большинстве случаев он будет полезен. Если вы хотите, чтобы значения ключа были уникальны, вам следует также создать ограничения уникальности или первичного ключа для каждой секции.)

source: Optionally, define a trigger or rule to redirect data inserted into the master table to the appropriate partition.
ru: Дополнительно вы можете определить триггер или правило для перенаправления данных, добавляемых в главную таблицу, в соответствующую секцию.

source: Ensure that the <xref linkend="guc-constraint-exclusion"/> configuration parameter is not disabled in <filename>postgresql.conf</filename>. If it is, queries will not be optimized as desired.
ru: Убедитесь в том, что параметр конфигурации <xref linkend="guc-constraint-exclusion"/> не выключен в <filename>postgresql.conf</filename>. Иначе запросы не будут оптимизироваться должным образом.

source: To set up a partitioned table, do the following: <placeholder-1/>
ru: Чтобы создать секционированную таблицу, выполните следующее: <placeholder-1/>

source: For example, suppose we are constructing a database for a large ice cream company. The company measures peak temperatures every day as well as ice cream sales in each region. Conceptually, we want a table like: <placeholder-1/> We know that most queries will access just the last week's, month's or quarter's data, since the main use of this table will be to prepare online reports for management. To reduce the amount of old data that needs to be stored, we decide to only keep the most recent 3 years worth of data. At the beginning of each month we will remove the oldest month's data.
ru: Например, предположим, что мы создаём базу данных для большой компании, торгующей мороженым. Компания учитывает максимальную температуру и продажи мороженого каждый день в разрезе регионов. По сути нам нужна следующая таблица: <placeholder-1/> Мы знаем, что большинство запросов будут работать только с данными за последнюю неделю, месяц или квартал, так как в основном эта таблица нужна для формирования текущих отчётов для руководства. Чтобы сократить объём хранящихся старых данных, мы решили оставлять данные только за 3 последних года. Ненужные данные мы будем удалять в начале каждого месяца.

source: In this situation we can use partitioning to help us meet all of our different requirements for the measurements table. Following the steps outlined above, partitioning can be set up as follows:
ru: При таких условиях мы можем применить секционирование для удовлетворения всех наших потребностей. Настроить секционирование согласно приведённой выше последовательности действий можно следующим образом:

source: The master table is the <structname>measurement</structname> table, declared exactly as above.
ru: Главная таблица, названная <structname>measurement</structname>, будет объявлена в точности как показано выше.

source: Next we create one partition for each active month: <placeholder-1/> Each of the partitions are complete tables in their own right, but they inherit their definitions from the <structname>measurement</structname> table.
ru: Затем мы создаём отдельные секции для каждого нужного нам месяца: <placeholder-1/> Все эти секции являются полностью самостоятельными таблицами, но они наследуют свои определения от таблицы <structname>measurement</structname>.

source: This solves one of our problems: deleting old data. Each month, all we will need to do is perform a <command>DROP TABLE</command> on the oldest child table and create a new child table for the new month's data.
ru: Это решает одну из наших проблем: удаление старых данных. Каждый месяц нам нужно будет просто выполнять <command>DROP TABLE</command> для самой старой дочерней таблицы и создавать новую дочернюю таблицу для данных нового месяца.
