Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: The search path works in the same way for data type names, function names, and operator names as it does for table names. Data type and function names can be qualified in exactly the same way as table names. If you need to write a qualified operator name in an expression, there is a special provision: you must write <synopsis><literal>OPERATOR(</literal><replaceable>schema</replaceable><literal>.</literal><replaceable>operator</replaceable><literal>)</literal></synopsis> This is needed to avoid syntactic ambiguity. An example is: <placeholder-1/> In practice one usually relies on the search path for operators, so as not to have to write anything so ugly as that.
ru: Как и для имён таблиц, путь поиска аналогично работает для имён типов данных, имён функций и имён операторов. Имена типов данных и функций можно записать в полном виде так же, как и имена таблиц. Если же вам нужно использовать в выражении полное имя оператора, для этого есть специальный способ &mdash; вы должны написать: <synopsis><literal>OPERATOR(</literal><replaceable>схема</replaceable><literal>.</literal><replaceable>оператор</replaceable><literal>)</literal></synopsis> Такая запись необходима для избежания синтаксической неоднозначности. Пример такого выражения: <placeholder-1/> На практике пользователи часто полагаются на путь поиска, чтобы не приходилось писать такие замысловатые конструкции.

source: Schemas and Privileges
ru: Схемы и права

source: <primary>privilege</primary><secondary sortas="schemas">for schemas</secondary>
ru: <primary>права</primary><secondary sortas="схемы">для схем</secondary>

source: By default, users cannot access any objects in schemas they do not own. To allow that, the owner of the schema must grant the <literal>USAGE</literal> privilege on the schema. To allow users to make use of the objects in the schema, additional privileges might need to be granted, as appropriate for the object.
ru: По умолчанию пользователь не может обращаться к объектам в чужих схемах. Чтобы изменить это, владелец схемы должен дать пользователю право <literal>USAGE</literal> для данной схемы. Чтобы пользователи могли использовать объекты схемы, может понадобиться назначить дополнительные права на уровне объектов.

source: A user can also be allowed to create objects in someone else's schema. To allow that, the <literal>CREATE</literal> privilege on the schema needs to be granted. Note that by default, everyone has <literal>CREATE</literal> and <literal>USAGE</literal> privileges on the schema <literal>public</literal>. This allows all users that are able to connect to a given database to create objects in its <literal>public</literal> schema. If you do not want to allow that, you can revoke that privilege: <placeholder-1/> (The first <quote>public</quote> is the schema, the second <quote>public</quote> means <quote>every user</quote>. In the first sense it is an identifier, in the second sense it is a key word, hence the different capitalization; recall the guidelines from <xref linkend="sql-syntax-identifiers"/>.)
ru: Пользователю также можно разрешить создавать объекты в не принадлежащей ему схеме. Для этого ему нужно дать право <literal>CREATE</literal> в требуемой схеме. Заметьте, что по умолчанию все имеют права <literal>CREATE</literal> и <literal>USAGE</literal> в схеме <literal>public</literal>. Благодаря этому все пользователи могут подключаться к заданной базе данных и создавать объекты в её схеме <literal>public</literal>. Если вас это не устраивает, вы можете отозвать это право: <placeholder-1/> (Первое слово <quote>public</quote> обозначает схему, а второе <quote>public</quote> подразумевает <quote>все пользователи</quote>. В первом случае это идентификатор, а во втором &mdash; ключевое слово, поэтому оно написано в разном регистре; вспомните рекомендации из <xref remap="2" linkend="sql-syntax-identifiers"/>.)

source: The System Catalog Schema
ru: Схема системного каталога

source: <primary>system catalog</primary><secondary>schema</secondary>
ru: <primary>системный каталог</primary><secondary>схема</secondary>

source: In addition to <literal>public</literal> and user-created schemas, each database contains a <literal>pg_catalog</literal> schema, which contains the system tables and all the built-in data types, functions, and operators. <literal>pg_catalog</literal> is always effectively part of the search path. If it is not named explicitly in the path then it is implicitly searched <emphasis>before</emphasis> searching the path's schemas. This ensures that built-in names will always be findable. However, you can explicitly place <literal>pg_catalog</literal> at the end of your search path if you prefer to have user-defined names override built-in names.
ru: В дополнение к схеме <literal>public</literal> и схемам, создаваемым пользователями, любая база данных содержит схему <literal>pg_catalog</literal>, в которой находятся системные таблицы и все встроенные типы данных, функции и операторы. <literal>pg_catalog</literal> фактически всегда является частью пути поиска. Если даже эта схема не добавлена в путь явно, она неявно просматривается <emphasis>до</emphasis> всех схем, указанных в пути. Так обеспечивается доступность встроенных имён при любых условиях. Однако вы можете явным образом поместить <literal>pg_catalog</literal> в конец пути поиска, если вам нужно, чтобы пользовательские имена переопределяли встроенные.

source: Since system table names begin with <literal>pg_</literal>, it is best to avoid such names to ensure that you won't suffer a conflict if some future version defines a system table named the same as your table. (With the default search path, an unqualified reference to your table name would then be resolved as the system table instead.) System tables will continue to follow the convention of having names beginning with <literal>pg_</literal>, so that they will not conflict with unqualified user-table names so long as users avoid the <literal>pg_</literal> prefix.
ru: Так как имена системных таблиц начинаются с <literal>pg_</literal>, такие имена лучше не использовать во избежание конфликта имён, возможного при появлении в будущем системной таблицы с тем же именем, что и ваша. (С путём поиска по умолчанию неполная ссылка будет воспринята как обращение к системной таблице.) Системные таблицы будут и дальше содержать в имени приставку <literal>pg_</literal>, так что они не будут конфликтовать с неполными именами пользовательских таблиц, если пользователи со своей стороны не будут использовать приставку <literal>pg_</literal>.

source: Usage Patterns
ru: Шаблоны использования

source: If you do not create any schemas then all users access the public schema implicitly. This simulates the situation where schemas are not available at all. This setup is mainly recommended when there is only a single user or a few cooperating users in a database. This setup also allows smooth transition from the non-schema-aware world.
ru: Если вы явно не создаёте какие-либо схемы, все пользователи будут неявно обращаться к схеме public. Таким образом система ведёт себя так, как если бы схем не было вообще. Эта конфигурация в основном рекомендуется, когда в базе данных есть всего один или несколько сотрудничающих пользователей. Она также позволяет легко мигрировать из среды, где схемы не поддерживаются.

source: You can create a schema for each user with the same name as that user. Recall that the default search path starts with <literal>$user</literal>, which resolves to the user name. Therefore, if each user has a separate schema, they access their own schemas by default.
ru: Вы можете создать отдельные схемы для каждого пользователя, назвав их именами пользователей. Вспомните, путь поиска по умолчанию начинается с <literal>$user</literal>, что интерпретируется как имя пользователя. Таким образом, если у пользователя будет своя схема, по умолчанию он будет обращаться к ней.

source: If you use this setup then you might also want to revoke access to the public schema (or drop it altogether), so users are truly constrained to their own schemas.
ru: Если вы реализуете этот подход, вы, возможно, также захотите запретить доступ к схеме public (или даже удалить её), чтобы пользователи не выходили за рамки своих схем.

source: To install shared applications (tables to be used by everyone, additional functions provided by third parties, etc.), put them into separate schemas. Remember to grant appropriate privileges to allow the other users to access them. Users can then refer to these additional objects by qualifying the names with a schema name, or they can put the additional schemas into their search path, as they choose.
ru: В отдельные схемы также можно устанавливать совместно используемые приложения (таблицы, которые нужны всем, дополнительные функции и т. д.). Не забудьте дать другим пользователям права для доступа к этим схемам. Тогда пользователи смогут обращаться к этим дополнительным объектам по полному имени или при желании добавят эти схемы в свои пути поиска.

source: Schemas can be used to organize your data in many ways. There are a few usage patterns that are recommended and are easily supported by the default configuration: <placeholder-1/>
ru: Схемам можно найти множество применений. Вот лишь некоторые шаблоны их использования, рекомендуемые и легко реализуемые в конфигурации по умолчанию: <placeholder-1/>

source: Portability
ru: Переносимость

source: In the SQL standard, the notion of objects in the same schema being owned by different users does not exist. Moreover, some implementations do not allow you to create schemas that have a different name than their owner. In fact, the concepts of schema and user are nearly equivalent in a database system that implements only the basic schema support specified in the standard. Therefore, many users consider qualified names to really consist of <literal><replaceable>username</replaceable>.<replaceable>tablename</replaceable></literal>. This is how <productname>PostgreSQL</productname> will effectively behave if you create a per-user schema for every user.
ru: Стандарт SQL не поддерживает обращение в одной схеме к разным объектам, принадлежащим разным пользователям. Более того, в ряде реализаций СУБД нельзя создавать схемы с именем, отличным от имени владельца. На практике, в СУБД, реализующих только базовую поддержку схем согласно стандарту, концепции пользователя и схемы очень близки. Таким образом, многие пользователи полагают, что полное имя на самом деле образуется как <literal><replaceable>имя_пользователя</replaceable>.<replaceable>таблица</replaceable></literal>. И именно так будет вести себя <productname>PostgreSQL</productname>, если вы создадите схемы для каждого пользователя.

source: Also, there is no concept of a <literal>public</literal> schema in the SQL standard. For maximum conformance to the standard, you should not use (perhaps even remove) the <literal>public</literal> schema.
ru: В стандарте SQL нет и понятия схемы <literal>public</literal>. Для максимального соответствия стандарту использовать схему <literal>public</literal> не следует (и возможно, лучше даже удалить её).

source: Of course, some SQL database systems might not implement schemas at all, or provide namespace support by allowing (possibly limited) cross-database access. If you need to work with those systems, then maximum portability would be achieved by not using schemas at all.
ru: Конечно, есть СУБД, в которых вообще не реализованы схемы или пространства имён поддерживают (возможно, с ограничениями) обращения к другим базам данных. Если вам потребуется работать с этими системами, максимальной переносимости вы достигнете, вообще не используя схемы.

source: Inheritance
ru: Наследование

source: <primary>inheritance</primary>
ru: <primary>наследование</primary>

source: <primary>table</primary><secondary>inheritance</secondary>
ru: <primary>таблица</primary><secondary>наследование</secondary>

source: <productname>PostgreSQL</productname> implements table inheritance, which can be a useful tool for database designers. (SQL:1999 and later define a type inheritance feature, which differs in many respects from the features described here.)
ru: <productname>PostgreSQL</productname> реализует наследование таблиц, что может быть полезно для проектировщиков баз данных. (Стандарт SQL:1999 и более поздние версии определяют возможность наследования типов, но это во многом отличается от того, что описано здесь.)

source: CREATE TABLE cities ( name text, population float, altitude int -- in feet ); CREATE TABLE capitals ( state char(2) ) INHERITS (cities);
ru: CREATE TABLE cities ( name text, population float, altitude int -- в футах ); CREATE TABLE capitals ( state char(2) ) INHERITS (cities);

source: Let's start with an example: suppose we are trying to build a data model for cities. Each state has many cities, but only one capital. We want to be able to quickly retrieve the capital city for any particular state. This can be done by creating two tables, one for state capitals and one for cities that are not capitals. However, what happens when we want to ask for data about a city, regardless of whether it is a capital or not? The inheritance feature can help to resolve this problem. We define the <structname>capitals</structname> table so that it inherits from <structname>cities</structname>: <placeholder-1/> In this case, the <structname>capitals</structname> table <firstterm>inherits</firstterm> all the columns of its parent table, <structname>cities</structname>. State capitals also have an extra column, <structfield>state</structfield>, that shows their state.
ru: Давайте начнём со следующего примера: предположим, что мы создаём модель данных для городов. В каждом штате есть множество городов, но лишь одна столица. Мы хотим иметь возможность быстро получать город-столицу для любого штата. Это можно сделать, создав две таблицы: одну для столиц штатов, а другую для городов, не являющихся столицами. Однако, что делать, если нам нужно получить информацию о любом городе, будь то столица штата или нет? В решении этой проблемы может помочь наследование. Мы определим таблицу <structname>capitals</structname> как наследника <structname>cities</structname>: <placeholder-1/> В этом случае таблица <structname>capitals</structname> <firstterm>наследует</firstterm> все столбцы своей родительской таблицы, <structname>cities</structname>. Столицы штатов также имеют дополнительный столбец <structfield>state</structfield>, в котором будет указан штат.

source: In <productname>PostgreSQL</productname>, a table can inherit from zero or more other tables, and a query can reference either all rows of a table or all rows of a table plus all of its descendant tables. The latter behavior is the default. For example, the following query finds the names of all cities, including state capitals, that are located at an altitude over 500 feet: <placeholder-1/> Given the sample data from the <productname>PostgreSQL</productname> tutorial (see <xref linkend="tutorial-sql-intro"/>), this returns: <placeholder-2/>
ru: В <productname>PostgreSQL</productname> таблица может наследоваться от нуля или нескольких других таблиц, а запросы могут выбирать все строки родительской таблицы или все строки родительской и всех дочерних таблиц. По умолчанию принят последний вариант. Например, следующий запрос найдёт названия всех городов, включая столицы штатов, расположенных выше 500 футов: <placeholder-1/> Для данных из введения (см. <xref remap="4" linkend="tutorial-sql-intro"/>) он выдаст: <placeholder-2/>

source: On the other hand, the following query finds all the cities that are not state capitals and are situated at an altitude over 500 feet: <placeholder-1/>
ru: А следующий запрос находит все города, которые не являются столицами штатов, но также находятся на высоте выше 500 футов: <placeholder-1/>

source: Here the <literal>ONLY</literal> keyword indicates that the query should apply only to <structname>cities</structname>, and not any tables below <structname>cities</structname> in the inheritance hierarchy. Many of the commands that we have already discussed &mdash; <command>SELECT</command>, <command>UPDATE</command> and <command>DELETE</command> &mdash; support the <literal>ONLY</literal> keyword.
ru: Здесь ключевое слово <literal>ONLY</literal> указывает, что запрос должен применяться только к таблице <structname>cities</structname>, но не к таблицам, расположенным ниже <structname>cities</structname> в иерархии наследования. Многие операторы, которые мы уже обсудили, &mdash; <command>SELECT</command>, <command>UPDATE</command> и <command>DELETE</command> &mdash; поддерживают ключевое слово <literal>ONLY</literal>.

source: You can also write the table name with a trailing <literal>*</literal> to explicitly specify that descendant tables are included: <placeholder-1/> Writing <literal>*</literal> is not necessary, since this behavior is the default (unless you have changed the setting of the <xref linkend="guc-sql-inheritance"/> configuration option). However writing <literal>*</literal> might be useful to emphasize that additional tables will be searched.
ru: Вы также можете добавить после имени таблицы <literal>*</literal>, чтобы обрабатывались и все дочерние таблицы: <placeholder-1/> Указывать <literal>*</literal> не обязательно, так как теперь это поведение подразумевается по умолчанию (если только вы не измените параметр конфигурации <xref linkend="guc-sql-inheritance"/>). Однако такая запись может быть полезна тем, что подчеркнёт использование дополнительных таблиц.

source: In some cases you might wish to know which table a particular row originated from. There is a system column called <structfield>tableoid</structfield> in each table which can tell you the originating table: <placeholder-1/> which returns: <placeholder-2/> (If you try to reproduce this example, you will probably get different numeric OIDs.) By doing a join with <structname>pg_class</structname> you can see the actual table names: <placeholder-3/> which returns: <placeholder-4/>
ru: В некоторых ситуациях бывает необходимо узнать, из какой таблицы выбрана конкретная строка. Для этого вы можете воспользоваться системным столбцом <structfield>tableoid</structfield>, присутствующим в каждой таблице: <placeholder-1/> этот запрос выдаст: <placeholder-2/> (Если вы попытаетесь выполнить его у себя, скорее всего вы получите другие значения OID.) Собственно имена таблиц вы можете получить, обратившись к <structname>pg_class</structname>: <placeholder-3/> в результате вы получите: <placeholder-4/>

source: Another way to get the same effect is to use the <type>regclass</type> pseudo-type, which will print the table OID symbolically: <placeholder-1/>
ru: Тот же эффект можно получить другим способом, используя псевдотип <type>regclass</type>; при этом OID таблицы выводится в символьном виде: <placeholder-1/>

source: Inheritance does not automatically propagate data from <command>INSERT</command> or <command>COPY</command> commands to other tables in the inheritance hierarchy. In our example, the following <command>INSERT</command> statement will fail: <placeholder-1/> We might hope that the data would somehow be routed to the <structname>capitals</structname> table, but this does not happen: <command>INSERT</command> always inserts into exactly the table specified. In some cases it is possible to redirect the insertion using a rule (see <xref linkend="rules"/>). However that does not help for the above case because the <structname>cities</structname> table does not contain the column <structfield>state</structfield>, and so the command will be rejected before the rule can be applied.
ru: Механизм наследования не способен автоматически распределять данные команд <command>INSERT</command> или <command>COPY</command> по таблицам в иерархии наследования. Поэтому в нашем примере этот оператор <command>INSERT</command> не выполнится: <placeholder-1/> Мы могли надеяться на то, что данные каким-то образом попадут в таблицу <structname>capitals</structname>, но этого не происходит: <command>INSERT</command> всегда вставляет данные непосредственно в указанную таблицу. В некоторых случаях добавляемые данные можно перенаправлять, используя правила (см. <xref remap="4" linkend="rules"/>). Однако в нашем случае это не поможет, так как таблица <structname>cities</structname> не содержит столбца <structfield>state</structfield> и команда будет отвергнута до применения правила.

source: All check constraints and not-null constraints on a parent table are automatically inherited by its children. Other types of constraints (unique, primary key, and foreign key constraints) are not inherited.
ru: Дочерние таблицы автоматически наследуют от родительской таблицы ограничения-проверки и ограничения NOT NULL. Все остальные ограничения (уникальности, первичный ключ и внешние ключи) не наследуются.

source: A table can inherit from more than one parent table, in which case it has the union of the columns defined by the parent tables. Any columns declared in the child table's definition are added to these. If the same column name appears in multiple parent tables, or in both a parent table and the child's definition, then these columns are <quote>merged</quote> so that there is only one such column in the child table. To be merged, columns must have the same data types, else an error is raised. The merged column will have copies of all the check constraints coming from any one of the column definitions it came from, and will be marked not-null if any of them are.
ru: Таблица может наследоваться от нескольких родительских таблиц, в этом случае она будет объединять в себе все столбцы этих таблиц, а также столбцы, описанные непосредственно в её определении. Если в определениях родительских и дочерней таблиц встретятся столбцы с одним именем, эти столбцы будут <quote>объединены</quote>, так что в дочерней таблице окажется только один столбец. Чтобы такое объединение было возможно, столбцы должны иметь одинаковый тип данных, в противном случае произойдёт ошибка. В определении объединённого столбца будут собраны все ограничения-проверки объединяемых столбцов, а также ограничение NOT NULL, если оно было задано для них.
