Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: Data Definition
ru: Определение данных

source: This chapter covers how one creates the database structures that will hold one's data. In a relational database, the raw data is stored in tables, so the majority of this chapter is devoted to explaining how tables are created and modified and what features are available to control what data is stored in the tables. Subsequently, we discuss how tables can be organized into schemas, and how privileges can be assigned to tables. Finally, we will briefly look at other features that affect the data storage, such as inheritance, views, functions, and triggers.
ru: Эта глава рассказывает, как создавать структуры базы данных, в которых будут храниться данные. В реляционной базе данных данные хранятся в таблицах, так что большая часть этой главы будет посвящена созданию и изменению таблиц, а также средствам управления данными в них. Затем мы обсудим, как таблицы можно объединять в схемы и как ограничивать доступ к ним. Наконец, мы кратко рассмотрим другие возможности, связанные с хранением данных, в частности наследование, представления, функции и триггеры.

source: Table Basics
ru: Основы таблиц

source: <primary>table</primary>
ru: <primary>таблица</primary>

source: <primary>row</primary>
ru: <primary>строка</primary>

source: <primary>column</primary>
ru: <primary>столбец</primary>

source: A table in a relational database is much like a table on paper: It consists of rows and columns. The number and order of the columns is fixed, and each column has a name. The number of rows is variable &mdash; it reflects how much data is stored at a given moment. SQL does not make any guarantees about the order of the rows in a table. When a table is read, the rows will appear in an unspecified order, unless sorting is explicitly requested. This is covered in <xref linkend="queries"/>. Furthermore, SQL does not assign unique identifiers to rows, so it is possible to have several completely identical rows in a table. This is a consequence of the mathematical model that underlies SQL but is usually not desirable. Later in this chapter we will see how to deal with this issue.
ru: Таблица в реляционной базе данных похожа на таблицу на бумаге: она так же состоит из строк и столбцов. Число и порядок столбцов фиксированы, а каждый столбец имеет имя. Число строк переменно &mdash; оно отражает текущее количество находящихся в ней данных. SQL не даёт никаких гарантий относительно порядка строк таблицы. При чтении таблицы строки выводятся в произвольном порядке, если только явно не требуется сортировка. Подробнее это рассматривается в <xref remap="6" linkend="queries"/>. Более того, SQL не назначает строкам уникальные идентификаторы, так что можно иметь в таблице несколько полностью идентичных строк. Это вытекает из математической модели, которую реализует SQL, но обычно такое дублирование нежелательно. Позже в этой главе мы увидим, как его избежать.

source: Each column has a data type. The data type constrains the set of possible values that can be assigned to a column and assigns semantics to the data stored in the column so that it can be used for computations. For instance, a column declared to be of a numerical type will not accept arbitrary text strings, and the data stored in such a column can be used for mathematical computations. By contrast, a column declared to be of a character string type will accept almost any kind of data but it does not lend itself to mathematical calculations, although other operations such as string concatenation are available.
ru: Каждому столбцу сопоставлен тип данных. Тип данных ограничивает набор допустимых значений, которые можно присвоить столбцу, и определяет смысловое значение данных для вычислений. Например, в столбец числового типа нельзя записать обычные текстовые строки, но зато его данные можно использовать в математических вычислениях. И наоборот, если столбец имеет тип текстовой строки, для него допустимы практически любые данные, но он непригоден для математических действий (хотя другие операции, например конкатенация строк, возможны).

source: <productname>PostgreSQL</productname> includes a sizable set of built-in data types that fit many applications. Users can also define their own data types. Most built-in data types have obvious names and semantics, so we defer a detailed explanation to <xref linkend="datatype"/>. Some of the frequently used data types are <type>integer</type> for whole numbers, <type>numeric</type> for possibly fractional numbers, <type>text</type> for character strings, <type>date</type> for dates, <type>time</type> for time-of-day values, and <type>timestamp</type> for values containing both date and time.
ru: В <productname>PostgreSQL</productname> есть внушительный набор встроенных типов данных, удовлетворяющий большинство приложений. Пользователи также могут определять собственные типы данных. Большинство встроенных типов данных имеют понятные имена и семантику, так что мы отложим их подробное рассмотрение до <xref remap="2" linkend="datatype"/>. Наиболее часто применяются следующие типы данных: <type>integer</type> для целых чисел, <type>numeric</type> для чисел, которые могут быть дробными, <type>text</type> для текстовых строк, <type>date</type> для дат, <type>time</type> для времени и <type>timestamp</type> для значений, включающих дату и время.

source: <primary>table</primary><secondary>creating</secondary>
ru: <primary>таблица</primary><secondary>создание</secondary>

source: To create a table, you use the aptly named <xref linkend="sql-createtable"/> command. In this command you specify at least a name for the new table, the names of the columns and the data type of each column. For example: <placeholder-1/> This creates a table named <literal>my_first_table</literal> with two columns. The first column is named <literal>first_column</literal> and has a data type of <type>text</type>; the second column has the name <literal>second_column</literal> and the type <type>integer</type>. The table and column names follow the identifier syntax explained in <xref linkend="sql-syntax-identifiers"/>. The type names are usually also identifiers, but there are some exceptions. Note that the column list is comma-separated and surrounded by parentheses.
ru: Для создания таблицы используется команда <xref linkend="sql-createtable"/>. В этой команде вы должны указать как минимум имя новой таблицы и имена и типы данных каждого столбца. Например: <placeholder-1/> Так вы создадите таблицу <literal>my_first_table</literal> с двумя столбцами. Первый столбец называется <literal>first_column</literal> и имеет тип данных <type>text</type>; второй столбец называется <literal>second_column</literal> и имеет тип <type>integer</type>. Имена таблицы и столбцов соответствуют синтаксису идентификаторов, описанному в <xref remap="6" linkend="sql-syntax-identifiers"/>. Имена типов также являются идентификаторами, хотя есть некоторые исключения. Заметьте, что список столбцов заключается в скобки, а его элементы разделяются запятыми.

source: Of course, the previous example was heavily contrived. Normally, you would give names to your tables and columns that convey what kind of data they store. So let's look at a more realistic example: <placeholder-1/> (The <type>numeric</type> type can store fractional components, as would be typical of monetary amounts.)
ru: Конечно, предыдущий пример ненатурален. Обычно в именах таблиц и столбцов отражается, какие данные они будут содержать. Поэтому давайте взглянем на более реалистичный пример: <placeholder-1/> (Тип <type>numeric</type> может хранить дробные числа, в которых обычно выражаются денежные суммы.)

source: When you create many interrelated tables it is wise to choose a consistent naming pattern for the tables and columns. For instance, there is a choice of using singular or plural nouns for table names, both of which are favored by some theorist or other.
ru: Когда вы создаёте много взаимосвязанных таблиц, имеет смысл заранее выбрать единый шаблон именования таблиц и столбцов. Например, решить, будут ли в именах таблиц использоваться существительные во множественном или в единственном числе (есть соображения в пользу каждого варианта).

source: There is a limit on how many columns a table can contain. Depending on the column types, it is between 250 and 1600. However, defining a table with anywhere near this many columns is highly unusual and often a questionable design.
ru: Число столбцов в таблице не может быть бесконечным. Это число ограничивается максимумом в пределах от 250 до 1600, в зависимости от типов столбцов. Однако создавать таблицы с таким большим числом столбцов обычно не требуется, а если такая потребность возникает, это скорее признак сомнительного дизайна.

source: <primary>table</primary><secondary>removing</secondary>
ru: <primary>таблица</primary><secondary>удаление</secondary>

source: If you no longer need a table, you can remove it using the <xref linkend="sql-droptable"/> command. For example: <placeholder-1/> Attempting to drop a table that does not exist is an error. Nevertheless, it is common in SQL script files to unconditionally try to drop each table before creating it, ignoring any error messages, so that the script works whether or not the table exists. (If you like, you can use the <literal>DROP TABLE IF EXISTS</literal> variant to avoid the error messages, but this is not standard SQL.)
ru: Если таблица вам больше не нужна, вы можете удалить её, выполнив команду <xref linkend="sql-droptable"/>. Например: <placeholder-1/> Попытка удаления несуществующей таблицы считается ошибкой. Тем не менее в SQL-скриптах часто применяют безусловное удаление таблиц перед созданием, игнорируя все сообщения об ошибках, так что они выполняют свою задачу независимо от того, существовали таблицы или нет. (Если вы хотите избежать таких ошибок, можно использовать вариант <literal>DROP TABLE IF EXISTS</literal>, но это не будет соответствовать стандарту SQL.)

source: If you need to modify a table that already exists, see <xref linkend="ddl-alter"/> later in this chapter.
ru: Как изменить существующую таблицу, будет рассмотрено в этой главе позже, в <xref remap="6" linkend="ddl-alter"/>.

source: With the tools discussed so far you can create fully functional tables. The remainder of this chapter is concerned with adding features to the table definition to ensure data integrity, security, or convenience. If you are eager to fill your tables with data now you can skip ahead to <xref linkend="dml"/> and read the rest of this chapter later.
ru: Имея средства, которые мы обсудили, вы уже можете создавать полностью функциональные таблицы. В продолжении этой главы рассматриваются дополнительные возможности, призванные обеспечить целостность данных, безопасность и удобство. Если вам не терпится наполнить свои таблицы данными, вы можете вернуться к этой главе позже, а сейчас перейти к <xref remap="3" linkend="dml"/>.

source: Default Values
ru: Значения по умолчанию

source: <primary>default value</primary>
ru: <primary>значение по умолчанию</primary>

source: A column can be assigned a default value. When a new row is created and no values are specified for some of the columns, those columns will be filled with their respective default values. A data manipulation command can also request explicitly that a column be set to its default value, without having to know what that value is. (Details about data manipulation commands are in <xref linkend="dml"/>.)
ru: Столбцу можно назначить значение по умолчанию. Когда добавляется новая строка и каким-то её столбцам не присваиваются значения, эти столбцы принимают значения по умолчанию. Также команда управления данными может явно указать, что столбцу должно быть присвоено значение по умолчанию, не зная его. (Подробнее команды управления данными описаны в <xref remap="6" linkend="dml"/>.)

source: <primary>null value</primary><secondary>default value</secondary>
ru: <primary>значение NULL</primary><secondary>значение по умолчанию</secondary>

source: <placeholder-1/> If no default value is declared explicitly, the default value is the null value. This usually makes sense because a null value can be considered to represent unknown data.
ru: <placeholder-1/> Если значение по умолчанию не объявлено явно, им считается значение NULL. Обычно это имеет смысл, так как можно считать, что NULL представляет неизвестные данные.

source: In a table definition, default values are listed after the column data type. For example: <placeholder-1/>
ru: В определении таблицы значения по умолчанию указываются после типа данных столбца. Например: <placeholder-1/>

source: The default value can be an expression, which will be evaluated whenever the default value is inserted (<emphasis>not</emphasis> when the table is created). A common example is for a <type>timestamp</type> column to have a default of <literal>CURRENT_TIMESTAMP</literal>, so that it gets set to the time of row insertion. Another common example is generating a <quote>serial number</quote> for each row. In <productname>PostgreSQL</productname> this is typically done by something like: <placeholder-1/> where the <literal>nextval()</literal> function supplies successive values from a <firstterm>sequence object</firstterm> (see <xref linkend="functions-sequence"/>). This arrangement is sufficiently common that there's a special shorthand for it: <placeholder-2/> The <literal>SERIAL</literal> shorthand is discussed further in <xref linkend="datatype-serial"/>.
ru: Значение по умолчанию может быть выражением, которое в этом случае вычисляется в момент присваивания значения по умолчанию (а <emphasis>не</emphasis> когда создаётся таблица). Например, столбцу <type>timestamp</type> в качестве значения по умолчания часто присваивается <literal>CURRENT_TIMESTAMP</literal>, чтобы в момент добавления строки в нём оказалось текущее время. Ещё один распространённый пример &mdash; генерация <quote>последовательных номеров</quote> для всех строк. В <productname>PostgreSQL</productname> это обычно делается примерно так: <placeholder-1/> здесь функция <literal>nextval()</literal> выбирает очередное значение из <firstterm>последовательности</firstterm> (см. <xref remap="4" linkend="functions-sequence"/>). Это употребление настолько распространено, что для него есть специальная короткая запись: <placeholder-2/> <literal>SERIAL</literal> обсуждается позже в <xref remap="6" linkend="datatype-serial"/>.

source: Constraints
ru: Ограничения

source: <primary>constraint</primary>
ru: <primary>ограничение</primary>

source: Data types are a way to limit the kind of data that can be stored in a table. For many applications, however, the constraint they provide is too coarse. For example, a column containing a product price should probably only accept positive values. But there is no standard data type that accepts only positive numbers. Another issue is that you might want to constrain column data with respect to other columns or rows. For example, in a table containing product information, there should be only one row for each product number.
ru: Типы данных сами по себе ограничивают множество данных, которые можно сохранить в таблице. Однако для многих приложений такие ограничения слишком грубые. Например, столбец, содержащий цену продукта, должен, вероятно, принимать только положительные значения. Но такого стандартного типа данных нет. Возможно, вы также захотите ограничить данные столбца по отношению к другим столбцам или строкам. Например, в таблице с информацией о товаре должна быть только одна строка с определённым кодом товара.

source: To that end, SQL allows you to define constraints on columns and tables. Constraints give you as much control over the data in your tables as you wish. If a user attempts to store data in a column that would violate a constraint, an error is raised. This applies even if the value came from the default value definition.
ru: Для решения подобных задач SQL позволяет вам определять ограничения для столбцов и таблиц. Ограничения дают вам возможность управлять данными в таблицах так, как вы захотите. Если пользователь попытается сохранить в столбце значение, нарушающее ограничения, возникнет ошибка. Ограничения будут действовать, даже если это значение по умолчанию.

source: Check Constraints
ru: Ограничения-проверки

source: <primary>check constraint</primary>
ru: <primary>ограничение-проверка</primary>

source: <primary>constraint</primary><secondary>check</secondary>
ru: <primary>ограничение</primary><secondary>проверка</secondary>

source: A check constraint is the most generic constraint type. It allows you to specify that the value in a certain column must satisfy a Boolean (truth-value) expression. For instance, to require positive product prices, you could use: <placeholder-1/>
ru: Ограничение-проверка &mdash; наиболее общий тип ограничений. В его определении вы можете указать, что значение данного столбца должно удовлетворять логическому выражению (проверке истинности). Например, цену товара можно ограничить положительными значениями так: <placeholder-1/>

source: As you see, the constraint definition comes after the data type, just like default value definitions. Default values and constraints can be listed in any order. A check constraint consists of the key word <literal>CHECK</literal> followed by an expression in parentheses. The check constraint expression should involve the column thus constrained, otherwise the constraint would not make too much sense.
ru: Как вы видите, ограничение определяется после типа данных, как и значение по умолчанию. Значения по умолчанию и ограничения могут указываться в любом порядке. Ограничение-проверка состоит из ключевого слова <literal>CHECK</literal>, за которым идёт выражение в скобках. Это выражение должно включать столбец, для которого задаётся ограничение, иначе оно не имеет большого смысла.

source: <primary>constraint</primary><secondary>name</secondary>
ru: <primary>ограничение</primary><secondary>имя</secondary>

source: You can also give the constraint a separate name. This clarifies error messages and allows you to refer to the constraint when you need to change it. The syntax is: <placeholder-1/> So, to specify a named constraint, use the key word <literal>CONSTRAINT</literal> followed by an identifier followed by the constraint definition. (If you don't specify a constraint name in this way, the system chooses a name for you.)
ru: Вы можете также присвоить ограничению отдельное имя. Это улучшит сообщения об ошибках и позволит вам ссылаться на это ограничение, когда вам понадобится изменить его. Сделать это можно так: <placeholder-1/> То есть, чтобы создать именованное ограничение, напишите ключевое слово <literal>CONSTRAINT</literal>, а за ним идентификатор и собственно определение ограничения. (Если вы не определите имя ограничения таким образом, система выберет для него имя за вас.)

source: A check constraint can also refer to several columns. Say you store a regular price and a discounted price, and you want to ensure that the discounted price is lower than the regular price: <placeholder-1/>
ru: Ограничение-проверка может также ссылаться на несколько столбцов. Например, если вы храните обычную цену и цену со скидкой, так вы можете гарантировать, что цена со скидкой будет всегда меньше обычной: <placeholder-1/>

source: The first two constraints should look familiar. The third one uses a new syntax. It is not attached to a particular column, instead it appears as a separate item in the comma-separated column list. Column definitions and these constraint definitions can be listed in mixed order.
ru: Первые два ограничения определяются похожим образом, но для третьего используется новый синтаксис. Оно не связано с определённым столбцом, а представлено отдельным элементом в списке. Определения столбцов и такие определения ограничений можно переставлять в произвольном порядке.

source: We say that the first two constraints are column constraints, whereas the third one is a table constraint because it is written separately from any one column definition. Column constraints can also be written as table constraints, while the reverse is not necessarily possible, since a column constraint is supposed to refer to only the column it is attached to. (<productname>PostgreSQL</productname> doesn't enforce that rule, but you should follow it if you want your table definitions to work with other database systems.) The above example could also be written as: <placeholder-1/> or even: <placeholder-2/> It's a matter of taste.
ru: Про первые два ограничения можно сказать, что это ограничения столбцов, тогда как третье является ограничением таблицы, так как оно написано отдельно от определений столбцов. Ограничения столбцов также можно записать в виде ограничений таблицы, тогда как обратное не всегда возможно, так как подразумевается, что ограничение столбца ссылается только на связанный столбец. (Хотя <productname>PostgreSQL</productname> этого не требует, но для совместимости с другими СУБД лучше следовать это правилу.) Ранее приведённый пример можно переписать и так: <placeholder-1/> Или даже так: <placeholder-2/> Это дело вкуса.

source: Names can be assigned to table constraints in the same way as column constraints: <placeholder-1/>
ru: Ограничениям таблицы можно присваивать имена так же, как и ограничениям столбцов: <placeholder-1/>

source: <primary>null value</primary><secondary sortas="check constraints">with check constraints</secondary>
ru: <primary>значение NULL</primary><secondary sortas="ограничение-проверка">с ограничениями-проверками</secondary>

source: It should be noted that a check constraint is satisfied if the check expression evaluates to true or the null value. Since most expressions will evaluate to the null value if any operand is null, they will not prevent null values in the constrained columns. To ensure that a column does not contain null values, the not-null constraint described in the next section can be used.
ru: Следует заметить, что ограничение-проверка удовлетворяется, если выражение принимает значение true или NULL. Так как результатом многих выражений с операндами NULL будет значение NULL, такие ограничения не будут препятствовать записи NULL в связанные столбцы. Чтобы гарантировать, что столбец не содержит значения NULL, можно использовать ограничение NOT NULL, описанное в следующем разделе.

source: Not-Null Constraints
ru: Ограничения NOT NULL

source: <primary>not-null constraint</primary>
ru: <primary>ограничение NOT NULL</primary>

source: <primary>constraint</primary><secondary>NOT NULL</secondary>
ru: <primary>ограничение</primary><secondary>NOT NULL</secondary>

source: A not-null constraint simply specifies that a column must not assume the null value. A syntax example: <placeholder-1/>
ru: Ограничение NOT NULL просто указывает, что столбцу нельзя присваивать значение NULL. Пример синтаксиса: <placeholder-1/>

source: A not-null constraint is always written as a column constraint. A not-null constraint is functionally equivalent to creating a check constraint <literal>CHECK (<replaceable>column_name</replaceable> IS NOT NULL)</literal>, but in <productname>PostgreSQL</productname> creating an explicit not-null constraint is more efficient. The drawback is that you cannot give explicit names to not-null constraints created this way.
ru: Ограничение NOT NULL всегда записывается как ограничение столбца и функционально эквивалентно ограничению <literal>CHECK (<replaceable>имя_столбца</replaceable> IS NOT NULL)</literal>, но в <productname>PostgreSQL</productname> явное ограничение NOT NULL работает более эффективно. Хотя у такой записи есть недостаток &mdash; назначить имя таким ограничениям нельзя.
