Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: We must provide non-overlapping table constraints. Rather than just creating the partition tables as above, the table creation script should really be: <placeholder-1/>
ru: Мы должны определить непересекающиеся ограничения таблиц. Таким образом, скрипт создания таблиц должен не просто создавать секции, но ещё и задавать ограничения: <placeholder-1/>

source: We probably need indexes on the key columns too: <placeholder-1/> We choose not to add further indexes at this time.
ru: Мы, вероятно, также захотим добавить индексы по столбцам ключа: <placeholder-1/> На этом с индексами мы пока остановимся.

source: We want our application to be able to say <literal>INSERT INTO measurement ...</literal> and have the data be redirected into the appropriate partition table. We can arrange that by attaching a suitable trigger function to the master table. If data will be added only to the latest partition, we can use a very simple trigger function: <placeholder-1/> After creating the function, we create a trigger which calls the trigger function: <placeholder-2/> We must redefine the trigger function each month so that it always points to the current partition. The trigger definition does not need to be updated, however.
ru: Мы хотим, чтобы наше приложение могло сказать <literal>INSERT INTO measurement ...</literal> и данные оказались в соответствующей секции. Мы можем добиться этого, добавив подходящую триггерную функцию в главную таблицу. Если данные всегда будут добавляться только в последнюю секцию, нам будет достаточно очень простой функции: <placeholder-1/> Теперь мы создаём триггер, вызывающий эту функцию: <placeholder-2/> Затем мы должны будем каждый месяц переопределять триггерную функцию, чтобы она всегда указывала на текущую секцию. Однако определение триггера обновлять не потребуется.

source: We might want to insert data and have the server automatically locate the partition into which the row should be added. We could do this with a more complex trigger function, for example: <placeholder-1/> The trigger definition is the same as before. Note that each <literal>IF</literal> test must exactly match the <literal>CHECK</literal> constraint for its partition.
ru: Но мы можем также сделать, чтобы сервер автоматически находил секцию, в которую нужно направить добавляемую строку. Для этого нам потребуется более сложная триггерная функция: <placeholder-1/> Определение триггера остаётся прежним. Заметьте, что все условия <literal>IF</literal> должны в точности отражать ограничения <literal>CHECK</literal> соответствующих секций.

source: While this function is more complex than the single-month case, it doesn't need to be updated as often, since branches can be added in advance of being needed.
ru: Хотя эта функция сложнее, чем вариант с одним текущим месяцем, её не придётся так часто модифицировать, так как ветви условий можно добавить заранее.

source: In practice it might be best to check the newest partition first, if most inserts go into that partition. For simplicity we have shown the trigger's tests in the same order as in other parts of this example.
ru: На практике будет лучше сначала проверять условие для последней секции, если строки чаще добавляются в эту секцию. Для простоты же мы расположили проверки триггера в том же порядке, как и в других фрагментах кода для этого примера.

source: As we can see, a complex partitioning scheme could require a substantial amount of DDL. In the above example we would be creating a new partition each month, so it might be wise to write a script that generates the required DDL automatically.
ru: Как уже можно понять, для реализации сложной схемы разбиения может потребоваться DDL-код значительного объёма. В данном примере нам потребуется создавать секцию каждый месяц, так что было бы разумно написать скрипт, который бы формировал требуемый код DDL автоматически.

source: Managing Partitions
ru: Управление секциями

source: Normally the set of partitions established when initially defining the table are not intended to remain static. It is common to want to remove old partitions of data and periodically add new partitions for new data. One of the most important advantages of partitioning is precisely that it allows this otherwise painful task to be executed nearly instantaneously by manipulating the partition structure, rather than physically moving large amounts of data around.
ru: Обычно набор секций, образованный изначально при создании таблиц, не предполагается сохранять неизменным. Чаще наоборот, планируется удалять старые секции данных и периодически добавлять новые. Одно из наиболее важных преимуществ секционирования состоит именно в том, что оно позволяет практически моментально выполнять трудоёмкие операции, изменяя структуру секций, а не физически перемещая большие объёмы данных.

source: The simplest option for removing old data is simply to drop the partition that is no longer necessary: <placeholder-1/> This can very quickly delete millions of records because it doesn't have to individually delete every record.
ru: Самый лёгкий способ удалить старые данные &mdash; это просто удалить секцию, ставшую ненужной: <placeholder-1/> Так можно удалить миллионы записей гораздо быстрее, чем сервер будет удалять их по одной.

source: Another option that is often preferable is to remove the partition from the partitioned table but retain access to it as a table in its own right: <placeholder-1/> This allows further operations to be performed on the data before it is dropped. For example, this is often a useful time to back up the data using <command>COPY</command>, <application>pg_dump</application>, or similar tools. It might also be a useful time to aggregate data into smaller formats, perform other data manipulations, or run reports.
ru: Ещё один часто более предпочтительный вариант &mdash; убрать секцию из главной таблицы, но сохранить возможность обращаться к ней как к самостоятельной таблице: <placeholder-1/> При этом можно будет продолжать работать с данными, пока таблица не будет удалена. Например, в этом состоянии очень кстати будет сделать резервную копию данных, используя <command>COPY</command>, <application>pg_dump</application> или подобные средства. Возможно, эти данные также можно будет агрегировать, перевести в компактный формат, выполнить другую обработку или построить отчёты.

source: CREATE TABLE measurement_y2008m02 (LIKE measurement INCLUDING DEFAULTS INCLUDING CONSTRAINTS); ALTER TABLE measurement_y2008m02 ADD CONSTRAINT y2008m02 CHECK ( logdate &gt;= DATE '2008-02-01' AND logdate &lt; DATE '2008-03-01' ); \copy measurement_y2008m02 from 'measurement_y2008m02' -- possibly some other data preparation work ALTER TABLE measurement_y2008m02 INHERIT measurement;
ru: CREATE TABLE measurement_y2008m02 (LIKE measurement INCLUDING DEFAULTS INCLUDING CONSTRAINTS); ALTER TABLE measurement_y2008m02 ADD CONSTRAINT y2008m02 CHECK ( logdate &gt;= DATE '2008-02-01' AND logdate &lt; DATE '2008-03-01' ); \copy measurement_y2008m02 from 'measurement_y2008m02' -- возможно, дополнительная подготовка данных ALTER TABLE measurement_y2008m02 INHERIT measurement;

source: Similarly we can add a new partition to handle new data. We can create an empty partition in the partitioned table just as the original partitions were created above: <placeholder-1/> As an alternative, it is sometimes more convenient to create the new table outside the partition structure, and make it a proper partition later. This allows the data to be loaded, checked, and transformed prior to it appearing in the partitioned table: <placeholder-2/>
ru: Аналогичным образом можно добавлять новую секцию с данными. Мы можем создать пустую секцию в главной таблице так же, как мы создавали секции в исходном состоянии до этого: <placeholder-1/> А иногда удобнее создать новую таблицу вне структуры секций и сделать её полноценной секцией позже. При таком подходе данные можно будет загрузить, проверить и преобразовать до того, как они появятся в секционированной таблице: <placeholder-2/>

source: Partitioning and Constraint Exclusion
ru: Секционирование и исключение по ограничению

source: <primary>constraint exclusion</primary>
ru: <primary>исключение по ограничению</primary>

source: <firstterm>Constraint exclusion</firstterm> is a query optimization technique that improves performance for partitioned tables defined in the fashion described above. As an example: <placeholder-1/> Without constraint exclusion, the above query would scan each of the partitions of the <structname>measurement</structname> table. With constraint exclusion enabled, the planner will examine the constraints of each partition and try to prove that the partition need not be scanned because it could not contain any rows meeting the query's <literal>WHERE</literal> clause. When the planner can prove this, it excludes the partition from the query plan.
ru: <firstterm>Исключение по ограничению</firstterm> &mdash; это приём оптимизации запросов, который ускоряет работу с секционированными таблицами, определёнными по вышеописанной схеме. Например: <placeholder-1/> Без исключения по ограничению для данного запроса пришлось бы просканировать все секции таблицы <structname>measurement</structname>. Если же исключение по ограничению включено, планировщик рассмотрит ограничение каждой секции с целью определить, что данная секция не может содержать строки, удовлетворяющие условию запроса <literal>WHERE</literal>. Если планировщик придёт к такому выводу, он исключит эту секцию из плана запроса.

source: You can use the <command>EXPLAIN</command> command to show the difference between a plan with <varname>constraint_exclusion</varname> on and a plan with it off. A typical unoptimized plan for this type of table setup is: <placeholder-1/> Some or all of the partitions might use index scans instead of full-table sequential scans, but the point here is that there is no need to scan the older partitions at all to answer this query. When we enable constraint exclusion, we get a significantly cheaper plan that will deliver the same answer: <placeholder-2/>
ru: Чтобы увидеть, как меняется план при изменении параметра <varname>constraint_exclusion</varname>, вы можете воспользоваться командой <command>EXPLAIN</command>. Типичный неоптимизированный план для такой конфигурации таблицы будет выглядеть так: <placeholder-1/> В некоторых или всех секциях может применяться не полное последовательное сканирование, а сканирование по индексу, но основная идея примера в том, что для удовлетворения запроса не нужно сканировать старые секции. И когда мы включаем исключение по ограничению, мы получаем значительно более эффективный план, дающий тот же результат: <placeholder-2/>

source: Note that constraint exclusion is driven only by <literal>CHECK</literal> constraints, not by the presence of indexes. Therefore it isn't necessary to define indexes on the key columns. Whether an index needs to be created for a given partition depends on whether you expect that queries that scan the partition will generally scan a large part of the partition or just a small part. An index will be helpful in the latter case but not the former.
ru: Заметьте, что механизм ограничения по исключению учитывает только ограничения <literal>CHECK</literal>, но не наличие индексов. Поэтому определять индексы для столбцов ключа не обязательно. Нужно ли создавать индекс для данной секции, зависит от того, какая часть секции будет обрабатываться при выполнении большинства запросов. Если это небольшая часть, индекс может быть полезен, в противном случае он не нужен.

source: The default (and recommended) setting of <xref linkend="guc-constraint-exclusion"/> is actually neither <literal>on</literal> nor <literal>off</literal>, but an intermediate setting called <literal>partition</literal>, which causes the technique to be applied only to queries that are likely to be working on partitioned tables. The <literal>on</literal> setting causes the planner to examine <literal>CHECK</literal> constraints in all queries, even simple ones that are unlikely to benefit.
ru: По умолчанию параметр <xref linkend="guc-constraint-exclusion"/> имеет значение не <literal>on</literal> и не <literal>off</literal>, а промежуточное (и рекомендуемое) значение <literal>partition</literal>, при котором этот приём будет применяться только к запросам, где предположительно будут задействованы секционированные таблицы. Значение <literal>on</literal> обязывает планировщик просматривать ограничения <literal>CHECK</literal> во всех запросах, даже в самых простых, где исключение по ограничению не будет иметь смысла.

source: Alternative Partitioning Methods
ru: Альтернативные варианты секционирования

source: A different approach to redirecting inserts into the appropriate partition table is to set up rules, instead of a trigger, on the master table. For example: <placeholder-1/> A rule has significantly more overhead than a trigger, but the overhead is paid once per query rather than once per row, so this method might be advantageous for bulk-insert situations. In most cases, however, the trigger method will offer better performance.
ru: Другой способ перенаправления добавляемых строк в соответствующую секцию можно реализовать, определив для главной таблицы не триггер, а правила. Например: <placeholder-1/> С правилами связано гораздо больше накладных расходов, чем с триггером, но они относятся к запросу в целом, а не к каждой строке. Поэтому этот способ может быть более выигрышным при массовом добавлении данных. Однако в большинстве случаев триггеры будут работать быстрее.

source: Be aware that <command>COPY</command> ignores rules. If you want to use <command>COPY</command> to insert data, you'll need to copy into the correct partition table rather than into the master. <command>COPY</command> does fire triggers, so you can use it normally if you use the trigger approach.
ru: Учтите, что команда <command>COPY</command> игнорирует правила. Если вы хотите вставить данные с помощью <command>COPY</command>, вам придётся копировать их сразу в нужную секцию, а не в главную таблицу. С другой стороны, <command>COPY</command> не отменяет триггеры, так что с триггерами вы сможете использовать её обычным образом.

source: Another disadvantage of the rule approach is that there is no simple way to force an error if the set of rules doesn't cover the insertion date; the data will silently go into the master table instead.
ru: Ещё один недостаток подхода с правилами связан с невозможностью выдать ошибку, если добавляемая строка не подпадает ни под одно из правил; в этом случае данные просто попадут в главную таблицу.

source: Partitioning can also be arranged using a <literal>UNION ALL</literal> view, instead of table inheritance. For example, <placeholder-1/> However, the need to recreate the view adds an extra step to adding and dropping individual partitions of the data set. In practice this method has little to recommend it compared to using inheritance.
ru: Секционирование можно также реализовать с помощью представления с <literal>UNION ALL</literal> вместо наследования. Например:<placeholder-1/> Однако для изменения набора секций в этом случае придётся не только добавлять или удалять секции, но и пересоздавать представление. На практике этот метод не имеет значительных преимуществ по сравнению с наследованием.

source: There is no automatic way to verify that all of the <literal>CHECK</literal> constraints are mutually exclusive. It is safer to create code that generates partitions and creates and/or modifies associated objects than to write each by hand.
ru: Система не может проверить автоматически, являются ли все ограничения <literal>CHECK</literal> взаимно исключающими. Поэтому безопаснее будет написать и отладить код для формирования секций и создания и/или изменения связанных объектов, чем делать это вручную.

source: The schemes shown here assume that the partition key column(s) of a row never change, or at least do not change enough to require it to move to another partition. An <command>UPDATE</command> that attempts to do that will fail because of the <literal>CHECK</literal> constraints. If you need to handle such cases, you can put suitable update triggers on the partition tables, but it makes management of the structure much more complicated.
ru: Показанные здесь схемы подразумевают, что ключевой столбец(ы) секции в строке никогда не меняется, или меняется не настолько, чтобы строку потребовалось перенести в другую секцию. Если же попытаться выполнить такой оператор <command>UPDATE</command>, произойдёт ошибка из-за нарушения ограничения <literal>CHECK</literal>. Если вам нужно обработать и такие случаи, вы можете установить подходящие триггеры на обновление в таблицы-секции, но это ещё больше усложнит управление всей конструкцией.

source: If you are using manual <command>VACUUM</command> or <command>ANALYZE</command> commands, don't forget that you need to run them on each partition individually. A command like: <placeholder-1/> will only process the master table.
ru: Если вы выполняете команды <command>VACUUM</command> или <command>ANALYZE</command> вручную, не забывайте, что их нужно запускать для каждой секции в отдельности. Команда <placeholder-1/> обработает только главную таблицу.

source: <command>INSERT</command> statements with <literal>ON CONFLICT</literal> clauses are unlikely to work as expected, as the <literal>ON CONFLICT</literal> action is only taken in case of unique violations on the specified target relation, not its child relations.
ru: Операторы <command>INSERT</command> с предложениями <literal>ON CONFLICT</literal> скорее всего не будут работать ожидаемым образом, так как действие <literal>ON CONFLICT</literal> предпринимается только в случае нарушений уникальности в указанном целевом отношении, а не его дочерних отношениях.

source: The following caveats apply to partitioned tables: <placeholder-1/>
ru: С секционированными таблицами связаны следующие ограничения: <placeholder-1/>

source: Constraint exclusion only works when the query's <literal>WHERE</literal> clause contains constants (or externally supplied parameters). For example, a comparison against a non-immutable function such as <function>CURRENT_TIMESTAMP</function> cannot be optimized, since the planner cannot know which partition the function value might fall into at run time.
ru: Исключение по ограничению работает только когда предложение <literal>WHERE</literal> в запросе содержит константы (или получаемые извне параметры). Например, сравнение с функцией переменной природы, такой как <function>CURRENT_TIMESTAMP</function>, нельзя оптимизировать, так как планировщик не знает, в какую секцию попадёт значение функции во время выполнения.

source: Keep the partitioning constraints simple, else the planner may not be able to prove that partitions don't need to be visited. Use simple equality conditions for list partitioning, or simple range tests for range partitioning, as illustrated in the preceding examples. A good rule of thumb is that partitioning constraints should contain only comparisons of the partitioning column(s) to constants using B-tree-indexable operators.
ru: Ограничения секций должны быть простыми, иначе планировщик не сможет вычислить, какие секции не нужно обрабатывать. Для секционирования по списку используйте простые условия на равенства, а для секционирования по диапазонам — простые проверки диапазонов, подобные показанным в примерах. Рекомендуется создавать ограничения секций, содержащие только такие сравнения секционирующих столбцов с константами, в которых используются операторы, поддерживающие B-деревья.

source: All constraints on all partitions of the master table are examined during constraint exclusion, so large numbers of partitions are likely to increase query planning time considerably. Partitioning using these techniques will work well with up to perhaps a hundred partitions; don't try to use many thousands of partitions.
ru: При анализе для исключения по ограничению исследуются все ограничения всех секций главной таблицы, поэтому при большом количестве секций время планирования запросов может значительно увеличиться. Описанные выше подходы работают хорошо, пока количество секций не превышает примерно ста, но не пытайтесь применять их с тысячами секций.

source: The following caveats apply to constraint exclusion: <placeholder-1/>
ru: Применяя исключения по ограничению, необходимо учитывать следующее: <placeholder-1/>

source: Foreign Data
ru: Сторонние данные

source: <primary>foreign data</primary>
ru: <primary>сторонние данные</primary>

source: <primary>foreign table</primary>
ru: <primary>сторонняя таблица</primary>

source: <primary>user mapping</primary>
ru: <primary>сопоставление пользователей</primary>

source: <productname>PostgreSQL</productname> implements portions of the SQL/MED specification, allowing you to access data that resides outside PostgreSQL using regular SQL queries. Such data is referred to as <firstterm>foreign data</firstterm>. (Note that this usage is not to be confused with foreign keys, which are a type of constraint within the database.)
ru: <productname>PostgreSQL</productname> частично реализует спецификацию SQL/MED, позволяя вам обращаться к данным, находящимся снаружи, используя обычные SQL-запросы. Такие данные называются <firstterm>сторонними</firstterm>.

source: Foreign data is accessed with help from a <firstterm>foreign data wrapper</firstterm>. A foreign data wrapper is a library that can communicate with an external data source, hiding the details of connecting to the data source and obtaining data from it. There are some foreign data wrappers available as <filename>contrib</filename> modules; see <xref linkend="contrib"/>. Other kinds of foreign data wrappers might be found as third party products. If none of the existing foreign data wrappers suit your needs, you can write your own; see <xref linkend="fdwhandler"/>.
ru: Сторонние данные доступны в <productname>PostgreSQL</productname> через <firstterm>обёртку сторонних данных</firstterm>. Обёртка сторонних данных &mdash; это библиотека, взаимодействующая с внешним источником данных и скрывающая в себе внутренние особенности подключения и получения данных. Несколько готовых обёрток предоставляются в виде модулей <filename>contrib</filename> ; см. <xref remap="4" linkend="contrib"/>. Также вы можете найти другие обёртки, выпускаемые как дополнительные продукты. Если ни одна из существующих обёрток вас не устраивает, вы можете написать свою собственную (см. <xref remap="4" linkend="fdwhandler"/>).
