Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: Of course, a column can have more than one constraint. Just write the constraints one after another: <placeholder-1/> The order doesn't matter. It does not necessarily determine in which order the constraints are checked.
ru: Естественно, для столбца можно определить больше одного ограничения. Для этого их нужно просто указать одно за другим: <placeholder-1/> Порядок здесь не имеет значения, он не обязательно соответствует порядку проверки ограничений.

source: The <literal>NOT NULL</literal> constraint has an inverse: the <literal>NULL</literal> constraint. This does not mean that the column must be null, which would surely be useless. Instead, this simply selects the default behavior that the column might be null. The <literal>NULL</literal> constraint is not present in the SQL standard and should not be used in portable applications. (It was only added to <productname>PostgreSQL</productname> to be compatible with some other database systems.) Some users, however, like it because it makes it easy to toggle the constraint in a script file. For example, you could start with: <placeholder-1/> and then insert the <literal>NOT</literal> key word where desired.
ru: Для ограничения <literal>NOT NULL</literal> есть и обратное: ограничение <literal>NULL</literal>. Оно не означает, что столбец должен иметь только значение NULL, что конечно было бы бессмысленно. Суть же его в простом указании, что столбец может иметь значение NULL (это поведение по умолчанию). Ограничение <literal>NULL</literal> отсутствует в стандарте SQL и использовать его в переносимых приложениях не следует. (Оно было добавлено в <productname>PostgreSQL</productname> только для совместимости с некоторыми другими СУБД.) Однако некоторые пользователи любят его использовать, так как оно позволяет легко переключать ограничения в скрипте. Например, вы можете начать с: <placeholder-1/> и затем вставить ключевое слово <literal>NOT</literal>, где потребуется.

source: In most database designs the majority of columns should be marked not null.
ru: При проектировании баз данных чаще всего большинство столбцов должны быть помечены как NOT NULL.

source: Unique Constraints
ru: Ограничения уникальности

source: <primary>unique constraint</primary>
ru: <primary>ограничение уникальности</primary>

source: <primary>constraint</primary><secondary>unique</secondary>
ru: <primary>ограничение</primary><secondary>уникальности</secondary>

source: Unique constraints ensure that the data contained in a column, or a group of columns, is unique among all the rows in the table. The syntax is: <placeholder-1/> when written as a column constraint, and: <placeholder-2/> when written as a table constraint.
ru: Ограничения уникальности гарантируют, что данные в определённом столбце или группе столбцов уникальны среди всех строк таблицы. Ограничение записывается так: <placeholder-1/> в виде ограничения столбца и так: <placeholder-2/> в виде ограничения таблицы.

source: To define a unique constraint for a group of columns, write it as a table constraint with the column names separated by commas: <placeholder-1/> This specifies that the combination of values in the indicated columns is unique across the whole table, though any one of the columns need not be (and ordinarily isn't) unique.
ru: Чтобы определить ограничение уникальности для группы столбцов, запишите его в виде ограничения таблицы, перечислив имена столбцов через запятую: <placeholder-1/> Такое ограничение указывает, что сочетание значений перечисленных столбцов должно быть уникально во всей таблице, тогда как значения каждого столбца по отдельности не должны быть (и обычно не будут) уникальными.

source: You can assign your own name for a unique constraint, in the usual way: <placeholder-1/>
ru: Вы можете назначить уникальному ограничению имя обычным образом: <placeholder-1/>

source: Adding a unique constraint will automatically create a unique B-tree index on the column or group of columns listed in the constraint. A uniqueness restriction covering only some rows cannot be written as a unique constraint, but it is possible to enforce such a restriction by creating a unique <link linkend="indexes-partial">partial index</link>.
ru: При добавлении ограничения уникальности будет автоматически создан уникальный индекс-B-дерево для столбца или группы столбцов, перечисленных в ограничении. Условие уникальности, распространяющееся только на некоторые строки, нельзя записать в виде ограничения уникальности, однако такое условие можно установить, создав уникальный <link linkend="indexes-partial">частичный индекс</link>.

source: <primary>null value</primary><secondary sortas="unique constraints">with unique constraints</secondary>
ru: <primary>значение NULL</primary><secondary sortas="unique constraints">с ограничениями уникальности</secondary>

source: In general, a unique constraint is violated if there is more than one row in the table where the values of all of the columns included in the constraint are equal. However, two null values are never considered equal in this comparison. That means even in the presence of a unique constraint it is possible to store duplicate rows that contain a null value in at least one of the constrained columns. This behavior conforms to the SQL standard, but we have heard that other SQL databases might not follow this rule. So be careful when developing applications that are intended to be portable.
ru: Вообще говоря, ограничение уникальности нарушается, если в таблице оказывается несколько строк, у которых совпадают значения всех столбцов, включённых в ограничение. Однако два значения NULL при сравнении никогда не считаются равными. Это означает, что даже при наличии ограничения уникальности в таблице можно сохранить строки с дублирующимися значениями, если они содержат NULL в одном или нескольких столбцах ограничения. Это поведение соответствует стандарту SQL, но мы слышали о СУБД, которые ведут себя по-другому. Имейте в виду эту особенность, разрабатывая переносимые приложения.

source: Primary Keys
ru: Первичные ключи

source: <primary>primary key</primary>
ru: <primary>первичный ключ</primary>

source: <primary>constraint</primary><secondary>primary key</secondary>
ru: <primary>ограничение</primary><secondary>первичный ключ</secondary>

source: A primary key constraint indicates that a column, or group of columns, can be used as a unique identifier for rows in the table. This requires that the values be both unique and not null. So, the following two table definitions accept the same data: <placeholder-1/> <placeholder-2/>
ru: Ограничение первичного ключа означает, что образующий его столбец или группа столбцов может быть уникальным идентификатором строк в таблице. Для этого требуется, чтобы значения были одновременно уникальными и отличными от NULL. Таким образом, таблицы со следующими двумя определениями будут принимать одинаковые данные: <placeholder-1/> <placeholder-2/>

source: Primary keys can span more than one column; the syntax is similar to unique constraints: <placeholder-1/>
ru: Первичные ключи могут включать несколько столбцов; синтаксис похож на запись ограничений уникальности: <placeholder-1/>

source: Adding a primary key will automatically create a unique B-tree index on the column or group of columns listed in the primary key, and will force the column(s) to be marked <literal>NOT NULL</literal>.
ru: При добавлении первичного ключа автоматически создаётся уникальный индекс-B-дерево для столбца или группы столбцов, перечисленных в первичном ключе, и данные столбцы помечаются как <literal>NOT NULL</literal>.

source: A table can have at most one primary key. (There can be any number of unique and not-null constraints, which are functionally almost the same thing, but only one can be identified as the primary key.) Relational database theory dictates that every table must have a primary key. This rule is not enforced by <productname>PostgreSQL</productname>, but it is usually best to follow it.
ru: Таблица может иметь максимум один первичный ключ. (Ограничений уникальности и ограничений NOT NULL, которые функционально почти равнозначны первичным ключам, может быть сколько угодно, но назначить ограничением первичного ключа можно только одно.) Теория реляционных баз данных говорит, что первичный ключ должен быть в каждой таблице. В <productname>PostgreSQL</productname> такого жёсткого требования нет, но обычно лучше ему следовать.

source: Primary keys are useful both for documentation purposes and for client applications. For example, a GUI application that allows modifying row values probably needs to know the primary key of a table to be able to identify rows uniquely. There are also various ways in which the database system makes use of a primary key if one has been declared; for example, the primary key defines the default target column(s) for foreign keys referencing its table.
ru: Первичные ключи полезны и для документирования, и для клиентских приложений. Например, графическому приложению с возможностями редактирования содержимого таблицы, вероятно, потребуется знать первичный ключ таблицы, чтобы однозначно идентифицировать её строки. Первичные ключи находят и другое применение в СУБД; в частности, первичный ключ в таблице определяет целевые столбцы по умолчанию для сторонних ключей, ссылающихся на эту таблицу.

source: Foreign Keys
ru: Внешние ключи

source: <primary>foreign key</primary>
ru: <primary>внешний ключ</primary>

source: <primary>constraint</primary><secondary>foreign key</secondary>
ru: <primary>ограничение</primary><secondary>внешний ключ</secondary>

source: <primary>referential integrity</primary>
ru: <primary>ссылочная целостность</primary>

source: A foreign key constraint specifies that the values in a column (or a group of columns) must match the values appearing in some row of another table. We say this maintains the <firstterm>referential integrity</firstterm> between two related tables.
ru: Ограничение внешнего ключа указывает, что значения столбца (или группы столбцов) должны соответствовать значениям в некоторой строке другой таблицы. Это называется <firstterm>ссылочной целостностью</firstterm> двух связанных таблиц.

source: Say you have the product table that we have used several times already: <placeholder-1/> Let's also assume you have a table storing orders of those products. We want to ensure that the orders table only contains orders of products that actually exist. So we define a foreign key constraint in the orders table that references the products table: <placeholder-2/> Now it is impossible to create orders with non-NULL <structfield>product_no</structfield> entries that do not appear in the products table.
ru: Пусть у вас уже есть таблица продуктов, которую мы неоднократно использовали ранее: <placeholder-1/> Давайте предположим, что у вас есть таблица с заказами этих продуктов. Мы хотим, чтобы в таблице заказов содержались только заказы действительно существующих продуктов. Поэтому мы определим в ней ограничение внешнего ключа, ссылающееся на таблицу продуктов: <placeholder-2/> С таким ограничением создать заказ со значением <structfield>product_no</structfield>, отсутствующим в таблице products (и не равным NULL), будет невозможно.

source: We say that in this situation the orders table is the <firstterm>referencing</firstterm> table and the products table is the <firstterm>referenced</firstterm> table. Similarly, there are referencing and referenced columns.
ru: В такой схеме таблицу orders называют <firstterm>подчинённой</firstterm> таблицей, а products &mdash; <firstterm>главной</firstterm>. Соответственно, столбцы называют так же подчинённым и главным (или ссылающимся и целевым).

source: You can also shorten the above command to: <placeholder-1/> because in absence of a column list the primary key of the referenced table is used as the referenced column(s).
ru: Предыдущую команду можно сократить так: <placeholder-1/> то есть, если опустить список столбцов, внешний ключ будет неявно связан с первичным ключом главной таблицы.

source: A foreign key can also constrain and reference a group of columns. As usual, it then needs to be written in table constraint form. Here is a contrived syntax example: <placeholder-1/> Of course, the number and type of the constrained columns need to match the number and type of the referenced columns.
ru: Внешний ключ также может ссылаться на группу столбцов. В этом случае его нужно записать в виде обычного ограничения таблицы. Например: <placeholder-1/> Естественно, число и типы столбцов в ограничении должны соответствовать числу и типам целевых столбцов.

source: You can assign your own name for a foreign key constraint, in the usual way.
ru: Ограничению внешнего ключа можно назначить имя стандартным способом.

source: A table can have more than one foreign key constraint. This is used to implement many-to-many relationships between tables. Say you have tables about products and orders, but now you want to allow one order to contain possibly many products (which the structure above did not allow). You could use this table structure: <placeholder-1/> Notice that the primary key overlaps with the foreign keys in the last table.
ru: Таблица может содержать несколько ограничений внешнего ключа. Это полезно для связи таблиц в отношении многие-ко-многим. Скажем, у вас есть таблицы продуктов и заказов, но вы хотите, чтобы один заказ мог содержать несколько продуктов (что невозможно в предыдущей схеме). Для этого вы можете использовать такую схему: <placeholder-1/> Заметьте, что в последней таблице первичный ключ покрывает внешние ключи.

source: <primary>CASCADE</primary><secondary>foreign key action</secondary>
ru: <primary>CASCADE</primary><secondary>действие внешнего ключа</secondary>

source: <primary>RESTRICT</primary><secondary>foreign key action</secondary>
ru: <primary>RESTRICT</primary><secondary>действие внешнего ключа</secondary>

source: Disallow deleting a referenced product
ru: Запретить удаление продукта

source: Delete the orders as well
ru: Удалить также связанные заказы

source: Something else?
ru: Что-то ещё?

source: We know that the foreign keys disallow creation of orders that do not relate to any products. But what if a product is removed after an order is created that references it? SQL allows you to handle that as well. Intuitively, we have a few options: <placeholder-1/>
ru: Мы знаем, что внешние ключи запрещают создание заказов, не относящихся ни к одному продукту. Но что делать, если после создания заказов с определённым продуктом мы захотим удалить его? SQL справится с этой ситуацией. Интуиция подсказывает следующие варианты поведения: <placeholder-1/>

source: To illustrate this, let's implement the following policy on the many-to-many relationship example above: when someone wants to remove a product that is still referenced by an order (via <literal>order_items</literal>), we disallow it. If someone removes an order, the order items are removed as well: <placeholder-1/>
ru: Для иллюстрации давайте реализуем следующее поведение в вышеприведённом примере: при попытке удаления продукта, на который ссылаются заказы (через таблицу <literal>order_items</literal>), мы запрещаем эту операцию. Если же кто-то попытается удалить заказ, то удалится и его содержимое: <placeholder-1/>

source: Restricting and cascading deletes are the two most common options. <literal>RESTRICT</literal> prevents deletion of a referenced row. <literal>NO ACTION</literal> means that if any referencing rows still exist when the constraint is checked, an error is raised; this is the default behavior if you do not specify anything. (The essential difference between these two choices is that <literal>NO ACTION</literal> allows the check to be deferred until later in the transaction, whereas <literal>RESTRICT</literal> does not.) <literal>CASCADE</literal> specifies that when a referenced row is deleted, row(s) referencing it should be automatically deleted as well. There are two other options: <literal>SET NULL</literal> and <literal>SET DEFAULT</literal>. These cause the referencing column(s) in the referencing row(s) to be set to nulls or their default values, respectively, when the referenced row is deleted. Note that these do not excuse you from observing any constraints. For example, if an action specifies <literal>SET DEFAULT</literal> but the default value would not satisfy the foreign key constraint, the operation will fail.
ru: Ограничивающие и каскадные удаления &mdash; два наиболее распространённых варианта. <literal>RESTRICT</literal> предотвращает удаление связанной строки. <literal>NO ACTION</literal> означает, что если зависимые строки продолжают существовать при проверке ограничения, возникает ошибка (это поведение по умолчанию). (Главным отличием этих двух вариантов является то, что <literal>NO ACTION</literal> позволяет отложить проверку в процессе транзакции, а <literal>RESTRICT</literal> &mdash; нет.) <literal>CASCADE</literal> указывает, что при удалении связанных строк зависимые от них будут так же автоматически удалены. Есть ещё два варианта: <literal>SET NULL</literal> и <literal>SET DEFAULT</literal>. При удалении связанных строк они назначают зависимым столбцам в подчинённой таблице значения NULL или значения по умолчанию, соответственно. Заметьте, что это не будет основанием для нарушения ограничений. Например, если в качестве действия задано <literal>SET DEFAULT</literal>, но значение по умолчанию не удовлетворяет ограничению внешнего ключа, операция закончится ошибкой.

source: Analogous to <literal>ON DELETE</literal> there is also <literal>ON UPDATE</literal> which is invoked when a referenced column is changed (updated). The possible actions are the same. In this case, <literal>CASCADE</literal> means that the updated values of the referenced column(s) should be copied into the referencing row(s).
ru: Аналогично указанию <literal>ON DELETE</literal> существует <literal>ON UPDATE</literal>, которое срабатывает при изменении заданного столбца. При этом возможные действия те же, а <literal>CASCADE</literal> в данном случае означает, что изменённые значения связанных столбцов будут скопированы в зависимые строки.

source: Normally, a referencing row need not satisfy the foreign key constraint if any of its referencing columns are null. If <literal>MATCH FULL</literal> is added to the foreign key declaration, a referencing row escapes satisfying the constraint only if all its referencing columns are null (so a mix of null and non-null values is guaranteed to fail a <literal>MATCH FULL</literal> constraint). If you don't want referencing rows to be able to avoid satisfying the foreign key constraint, declare the referencing column(s) as <literal>NOT NULL</literal>.
ru: Обычно зависимая строка не должна удовлетворять ограничению внешнего ключа, если один из связанных столбцов содержит NULL. Если в объявление внешнего ключа добавлено <literal>MATCH FULL</literal>, строка будет удовлетворять ограничению, только если все связанные столбцы равны NULL (то есть при разных значениях (NULL и не NULL) гарантируется невыполнение ограничения <literal>MATCH FULL</literal>). Если вы хотите, чтобы зависимые строки не могли избежать и этого ограничения, объявите связанные столбцы как <literal>NOT NULL</literal>.

source: A foreign key must reference columns that either are a primary key or form a unique constraint. This means that the referenced columns always have an index (the one underlying the primary key or unique constraint); so checks on whether a referencing row has a match will be efficient. Since a <command>DELETE</command> of a row from the referenced table or an <command>UPDATE</command> of a referenced column will require a scan of the referencing table for rows matching the old value, it is often a good idea to index the referencing columns too. Because this is not always needed, and there are many choices available on how to index, declaration of a foreign key constraint does not automatically create an index on the referencing columns.
ru: Внешний ключ должен ссылаться на столбцы, образующие первичный ключ или ограничение уникальности. Таким образом, для связанных столбцов всегда будет существовать индекс (определённый соответствующим первичным ключом или ограничением), а значит проверки соответствия связанной строки будут выполняться эффективно. Так как команды <command>DELETE</command> для строк главной таблицы или <command>UPDATE</command> для зависимых столбцов потребуют просканировать подчинённую таблицу и найти строки, ссылающиеся на старые значения, полезно будет иметь индекс и для подчинённых столбцов. Но это нужно не всегда, и создать соответствующий индекс можно по-разному, поэтому объявление внешнего ключа не создаёт автоматически индекс по связанным столбцам.

source: More information about updating and deleting data is in <xref linkend="dml"/>. Also see the description of foreign key constraint syntax in the reference documentation for <xref linkend="sql-createtable"/>.
ru: Подробнее об изменении и удалении данных рассказывается в <xref remap="6" linkend="dml"/>. Вы также можете подробнее узнать о синтаксисе ограничений внешнего ключа в справке <xref linkend="sql-createtable"/>.

source: Exclusion Constraints
ru: Ограничения-исключения

source: <primary>exclusion constraint</primary>
ru: <primary>ограничение-исключение</primary>

source: <primary>constraint</primary><secondary>exclusion</secondary>
ru: <primary>ограничение</primary><secondary>исключение</secondary>

source: Exclusion constraints ensure that if any two rows are compared on the specified columns or expressions using the specified operators, at least one of these operator comparisons will return false or null. The syntax is: <placeholder-1/>
ru: Ограничения-исключения гарантируют, что при сравнении любых двух строк по указанным столбцам или выражениям с помощью заданных операторов, минимум одно из этих сравнений возвратит false или NULL. Записывается это так: <placeholder-1/>

source: See also <link linkend="sql-createtable-exclude"><command>CREATE TABLE ... CONSTRAINT ... EXCLUDE</command></link> for details.
ru: Подробнее об этом см. <link linkend="sql-createtable-exclude"><command>CREATE TABLE ... CONSTRAINT ... EXCLUDE</command></link>.

source: Adding an exclusion constraint will automatically create an index of the type specified in the constraint declaration.
ru: При добавлении ограничения-исключения будет автоматически создан индекс того типа, который указан в объявлении ограничения.

source: System Columns
ru: Системные столбцы

source: Every table has several <firstterm>system columns</firstterm> that are implicitly defined by the system. Therefore, these names cannot be used as names of user-defined columns. (Note that these restrictions are separate from whether the name is a key word or not; quoting a name will not allow you to escape these restrictions.) You do not really need to be concerned about these columns; just know they exist.
ru: В каждой таблице есть несколько <firstterm>системных столбцов</firstterm>, неявно определённых системой. Как следствие, их имена нельзя использовать в качестве имён пользовательских столбцов. (Заметьте, что это не зависит от того, является ли имя ключевым словом или нет; заключение имени в кавычки не поможет избежать этого ограничения.) Эти столбцы не должны вас беспокоить, вам лишь достаточно знать об их существовании.

source: <primary>column</primary><secondary>system column</secondary>
ru: <primary>столбец</primary><secondary>системный столбец</secondary>

source: <primary>OID</primary><secondary>column</secondary>
ru: <primary>OID</primary><secondary>столбец</secondary>
