Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: In the examples above, the policy expressions consider only the current values in the row to be accessed or updated. This is the simplest and best-performing case; when possible, it's best to design row security applications to work this way. If it is necessary to consult other rows or other tables to make a policy decision, that can be accomplished using sub-<command>SELECT</command>s, or functions that contain <command>SELECT</command>s, in the policy expressions. Be aware however that such accesses can create race conditions that could allow information leakage if care is not taken. As an example, consider the following table design:
ru: В приведённых выше примерах выражения политики учитывали только текущие значения в запрашиваемой или изменяемой строке. Это самый простой и наиболее эффективный по скорости вариант; по возможности реализацию защиты строк следует проектировать именно так. Если же для принятия решения о доступе необходимо обращаться к другим строкам или другим таблицам, это можно осуществить, применяя в выражениях политик вложенные <command>SELECT</command> или функции, содержащие <command>SELECT</command>. Однако учтите, что при такой реализации возможны условия гонки, что чревато утечкой информации, если не принять меры предосторожности. Например, рассмотрим следующую конструкцию таблиц:

source: -- definition of privilege groups CREATE TABLE groups (group_id int PRIMARY KEY, group_name text NOT NULL); INSERT INTO groups VALUES (1, 'low'), (2, 'medium'), (5, 'high'); GRANT ALL ON groups TO alice; -- alice is the administrator GRANT SELECT ON groups TO public; -- definition of users' privilege levels CREATE TABLE users (user_name text PRIMARY KEY, group_id int NOT NULL REFERENCES groups); INSERT INTO users VALUES ('alice', 5), ('bob', 2), ('mallory', 2); GRANT ALL ON users TO alice; GRANT SELECT ON users TO public; -- table holding the information to be protected CREATE TABLE information (info text, group_id int NOT NULL REFERENCES groups); INSERT INTO information VALUES ('barely secret', 1), ('slightly secret', 2), ('very secret', 5); ALTER TABLE information ENABLE ROW LEVEL SECURITY; -- a row should be visible to/updatable by users whose security group_id is -- greater than or equal to the row's group_id CREATE POLICY fp_s ON information FOR SELECT USING (group_id &lt;= (SELECT group_id FROM users WHERE user_name = current_user)); CREATE POLICY fp_u ON information FOR UPDATE USING (group_id &lt;= (SELECT group_id FROM users WHERE user_name = current_user)); -- we rely only on RLS to protect the information table GRANT ALL ON information TO public;
ru: -- определение групп привилегий CREATE TABLE groups (group_id int PRIMARY KEY, group_name text NOT NULL); INSERT INTO groups VALUES (1, 'low'), (2, 'medium'), (5, 'high'); GRANT ALL ON groups TO alice; -- alice является администратором GRANT SELECT ON groups TO public; -- определение уровней привилегий для пользователей CREATE TABLE users (user_name text PRIMARY KEY, group_id int NOT NULL REFERENCES groups); INSERT INTO users VALUES ('alice', 5), ('bob', 2), ('mallory', 2); GRANT ALL ON users TO alice; GRANT SELECT ON users TO public; -- таблица, содержащая защищаемую информацию CREATE TABLE information (info text, group_id int NOT NULL REFERENCES groups); INSERT INTO information VALUES ('barely secret', 1), ('slightly secret', 2), ('very secret', 5); ALTER TABLE information ENABLE ROW LEVEL SECURITY; -- строка должна быть доступна для чтения/изменения пользователям с group_id, -- большим или равным group_id данной строки CREATE POLICY fp_s ON information FOR SELECT USING (group_id &lt;= (SELECT group_id FROM users WHERE user_name = current_user)); CREATE POLICY fp_u ON information FOR UPDATE USING (group_id &lt;= (SELECT group_id FROM users WHERE user_name = current_user)); -- мы защищаем таблицу с информацией, полагаясь только на RLS GRANT ALL ON information TO public;

source: Now suppose that <literal>alice</literal> wishes to change the <quote>slightly secret</quote> information, but decides that <literal>mallory</literal> should not be trusted with the new content of that row, so she does:
ru: Теперь предположим, что Алиса (роль <literal>alice</literal>) желает записать <quote>слегка секретную</quote> информацию, но при этом не хочет давать <literal>mallory</literal> доступ к ней. Она делает следующее:

source: That looks safe; there is no window wherein <literal>mallory</literal> should be able to see the <quote>secret from mallory</quote> string. However, there is a race condition here. If <literal>mallory</literal> is concurrently doing, say, <placeholder-1/> and her transaction is in <literal>READ COMMITTED</literal> mode, it is possible for her to see <quote>secret from mallory</quote>. That happens if her transaction reaches the <structname>information</structname> row just after <literal>alice</literal>'s does. It blocks waiting for <literal>alice</literal>'s transaction to commit, then fetches the updated row contents thanks to the <literal>FOR UPDATE</literal> clause. However, it does <emphasis>not</emphasis> fetch an updated row for the implicit <command>SELECT</command> from <structname>users</structname>, because that sub-<command>SELECT</command> did not have <literal>FOR UPDATE</literal>; instead the <structname>users</structname> row is read with the snapshot taken at the start of the query. Therefore, the policy expression tests the old value of <literal>mallory</literal>'s privilege level and allows her to see the updated row.
ru: На первый взгляд всё нормально; <literal>mallory</literal> ни при каких условиях не должна увидеть строку <quote>secret from mallory</quote>. Однако здесь возможно условие гонки. Если Мэллори (роль <literal>mallory</literal>) параллельно выполняет, скажем: <placeholder-1/> и её транзакция в режиме <literal>READ COMMITTED</literal>, она сможет увидеть <quote>secret from mallory</quote>. Это произойдёт, если её транзакция дойдёт до строки <structname>information</structname> сразу после того, как эту строку изменит Алиса (роль <literal>alice</literal>). Она заблокируется, ожидая фиксирования транзакции Алисы, а затем прочитает изменённое содержимое строки благодаря предложению <literal>FOR UPDATE</literal>. Однако при этом изменённое содержимое <structname>users</structname> <emphasis>не</emphasis> будет прочитано неявным запросом <command>SELECT</command>, так как этот вложенный <command>SELECT</command> выполняется без указания <literal>FOR UPDATE</literal>; вместо этого строка <structname>users</structname> читается из снимка, полученного в начале запроса. Таким образом, выражение политики проверяет старое значение уровня привилегий пользователя <literal>mallory</literal> и позволяет ей видеть изменённую строку.

source: There are several ways around this problem. One simple answer is to use <literal>SELECT ... FOR SHARE</literal> in sub-<command>SELECT</command>s in row security policies. However, that requires granting <literal>UPDATE</literal> privilege on the referenced table (here <structname>users</structname>) to the affected users, which might be undesirable. (But another row security policy could be applied to prevent them from actually exercising that privilege; or the sub-<command>SELECT</command> could be embedded into a security definer function.) Also, heavy concurrent use of row share locks on the referenced table could pose a performance problem, especially if updates of it are frequent. Another solution, practical if updates of the referenced table are infrequent, is to take an exclusive lock on the referenced table when updating it, so that no concurrent transactions could be examining old row values. Or one could just wait for all concurrent transactions to end after committing an update of the referenced table and before making changes that rely on the new security situation.
ru: Обойти эту проблему можно несколькими способами. Первое простое решение заключается в использовании <literal>SELECT ... FOR SHARE</literal> во вложенных запросах <command>SELECT</command> в политиках защиты строк. Однако для этого потребуется давать затронутым пользователям право <literal>UPDATE</literal> в целевой таблице (здесь <structname>users</structname>), что может быть нежелательно. (Хотя можно применить ещё одну политику защиты строк, чтобы они не могли практически воспользоваться этим правилом; либо поместить вложенный <command>SELECT</command> в функцию, определяющую контекст безопасности.) Кроме этого, активное использование блокировок строк в целевой таблице может повлечь проблемы с производительностью, особенно при частых изменениях. Другое решение, практичное, если целевая таблица изменяется нечасто, заключается в исключительной блокировке целевой таблицы при изменении, чтобы никакие параллельные транзакции не видели старые значения строк. Либо можно просто дождаться завершения всех параллельных транзакций после изменения в целевой таблице, прежде чем вносить изменения, рассчитанные на новые условия безопасности.

source: For additional details see <xref linkend="sql-createpolicy"/> and <xref linkend="sql-altertable"/>.
ru: За дополнительными подробностями обратитесь к <xref remap="3" linkend="sql-createpolicy"/> и <xref remap="3" linkend="sql-altertable"/>.

source: Schemas
ru: Схемы

source: <primary>schema</primary>
ru: <primary>схема</primary>

source: A <productname>PostgreSQL</productname> database cluster contains one or more named databases. Users and groups of users are shared across the entire cluster, but no other data is shared across databases. Any given client connection to the server can access only the data in a single database, the one specified in the connection request.
ru: Кластер баз данных <productname>PostgreSQL</productname> содержит один или несколько именованных экземпляров баз. На уровне кластера создаются пользователи и группы, но данные могут относиться только к базам данных. При этом в рамках одного подключения к серверу можно обращаться к данным только одной базы данных, указанной при установлении соединения.

source: Users of a cluster do not necessarily have the privilege to access every database in the cluster. Sharing of user names means that there cannot be different users named, say, <literal>joe</literal> in two databases in the same cluster; but the system can be configured to allow <literal>joe</literal> access to only some of the databases.
ru: Пользователи кластера не обязательно будут иметь доступ ко всем базам данным этого кластера. То, что пользователи создаются на уровне кластера, означает только, что в нём не может быть двух пользователей <literal>joe</literal> в разных базах данных, хотя система позволяет ограничить доступ <literal>joe</literal> только некоторыми базами данных.

source: A database contains one or more named <firstterm>schemas</firstterm>, which in turn contain tables. Schemas also contain other kinds of named objects, including data types, functions, and operators. The same object name can be used in different schemas without conflict; for example, both <literal>schema1</literal> and <literal>myschema</literal> can contain tables named <literal>mytable</literal>. Unlike databases, schemas are not rigidly separated: a user can access objects in any of the schemas in the database they are connected to, if they have privileges to do so.
ru: База данных содержит одну или несколько именованных <firstterm>схем</firstterm>, которые в свою очередь содержат таблицы. Схемы также содержат именованные объекты других видов, включая типы данных, функции и операторы. Одно и то же имя объекта можно свободно использовать в разных схемах, например и <literal>schema1</literal>, и <literal>myschema</literal> могут содержать таблицы с именем <literal>mytable</literal>. В отличие от баз данных, схемы не ограничивают доступ к данным: пользователи могут обращаться к объектам в любой схеме текущей базы данных, если им назначены соответствующие права.

source: To allow many users to use one database without interfering with each other.
ru: Чтобы одну базу данных могли использовать несколько пользователей, независимо друг от друга.

source: To organize database objects into logical groups to make them more manageable.
ru: Чтобы объединить объекты базы данных в логические группы для облегчения управления ими.

source: Third-party applications can be put into separate schemas so they do not collide with the names of other objects.
ru: Чтобы в одной базе сосуществовали разные приложения, и при этом не возникало конфликтов имён.

source: There are several reasons why one might want to use schemas: <placeholder-1/> Schemas are analogous to directories at the operating system level, except that schemas cannot be nested.
ru: Есть несколько возможных объяснений, для чего стоит применять схемы: <placeholder-1/> Схемы в некоторым смысле подобны каталогам в операционной системе, но они не могут быть вложенными.

source: Creating a Schema
ru: Создание схемы

source: <primary>schema</primary><secondary>creating</secondary>
ru: <primary>схема</primary><secondary>создание</secondary>

source: To create a schema, use the <xref linkend="sql-createschema"/> command. Give the schema a name of your choice. For example: <placeholder-1/>
ru: Для создания схемы используется команда <xref linkend="sql-createschema"/>. При этом вы определяете имя схемы по своему выбору, например так: <placeholder-1/>

source: <primary>qualified name</primary>
ru: <primary>полное имя</primary>

source: <primary>name</primary><secondary>qualified</secondary>
ru: <primary>имя</primary><secondary>полное</secondary>

source: To create or access objects in a schema, write a <firstterm>qualified name</firstterm> consisting of the schema name and table name separated by a dot: <synopsis><replaceable>schema</replaceable><literal>.</literal><replaceable>table</replaceable></synopsis> This works anywhere a table name is expected, including the table modification commands and the data access commands discussed in the following chapters. (For brevity we will speak of tables only, but the same ideas apply to other kinds of named objects, such as types and functions.)
ru: Чтобы создать объекты в схеме или обратиться к ним, указывайте <firstterm>полное имя</firstterm>, состоящее из имён схемы и объекта, разделённых точкой: <synopsis><replaceable>схема</replaceable><literal>.</literal><replaceable>таблица</replaceable></synopsis> Этот синтаксис работает везде, где ожидается имя таблицы, включая команды модификации таблицы и команды обработки данных, обсуждаемые в следующих главах. (Для краткости мы будем говорить только о таблицах, но всё это распространяется и на другие типы именованных объектов, например, типы и функции.)

source: Actually, the even more general syntax <synopsis><replaceable>database</replaceable><literal>.</literal><replaceable>schema</replaceable><literal>.</literal><replaceable>table</replaceable></synopsis> can be used too, but at present this is just for <foreignphrase>pro forma</foreignphrase> compliance with the SQL standard. If you write a database name, it must be the same as the database you are connected to.
ru: Есть ещё более общий синтаксис <synopsis><replaceable>база_данных</replaceable><literal>.</literal><replaceable>схема</replaceable><literal>.</literal><replaceable>таблица</replaceable></synopsis>но в настоящее время он поддерживается только для формального соответствия стандарту SQL. Если вы указываете базу данных, это может быть только база данных, к которой вы подключены.

source: So to create a table in the new schema, use: <placeholder-1/>
ru: Таким образом, создать таблицу в новой схеме можно так: <placeholder-1/>

source: <primary>schema</primary><secondary>removing</secondary>
ru: <primary>схема</primary><secondary>удаление</secondary>

source: To drop a schema if it's empty (all objects in it have been dropped), use: <placeholder-1/> To drop a schema including all contained objects, use: <placeholder-2/> See <xref linkend="ddl-depend"/> for a description of the general mechanism behind this.
ru: Чтобы удалить пустую схему (не содержащую объектов), выполните: <placeholder-1/> Удалить схему со всеми содержащимися в ней объектами можно так: <placeholder-2/> Стоящий за этим общий механизм описан в <xref remap="6" linkend="ddl-depend"/>.

source: CREATE SCHEMA <replaceable>schemaname</replaceable> AUTHORIZATION <replaceable>username</replaceable>;
ru: CREATE SCHEMA <replaceable>имя_схемы</replaceable> AUTHORIZATION <replaceable>имя_пользователя</replaceable>;

source: Often you will want to create a schema owned by someone else (since this is one of the ways to restrict the activities of your users to well-defined namespaces). The syntax for that is: <placeholder-1/> You can even omit the schema name, in which case the schema name will be the same as the user name. See <xref linkend="ddl-schemas-patterns"/> for how this can be useful.
ru: Часто бывает нужно создать схему, владельцем которой будет другой пользователь (это один из способов ограничения пользователей пространствами имён). Сделать это можно так: <placeholder-1/> Вы даже можете опустить имя схемы, в этом случае именем схемы станет имя пользователя. Как это можно применять, описано в <xref remap="6" linkend="ddl-schemas-patterns"/>.

source: Schema names beginning with <literal>pg_</literal> are reserved for system purposes and cannot be created by users.
ru: Схемы с именами, начинающимися с <literal>pg_</literal>, являются системными; пользователям не разрешено использовать такие имена.

source: The Public Schema
ru: Схема public

source: <primary>schema</primary><secondary>public</secondary>
ru: <primary>схема</primary><secondary>public</secondary>

source: In the previous sections we created tables without specifying any schema names. By default such tables (and other objects) are automatically put into a schema named <quote>public</quote>. Every new database contains such a schema. Thus, the following are equivalent: <placeholder-1/> and: <placeholder-2/>
ru: До этого мы создавали таблицы, не указывая никакие имена схем. По умолчанию такие таблицы (и другие объекты) автоматически помещаются в схему <quote>public</quote>. Она содержится во всех создаваемых базах данных. Таким образом, команда: <placeholder-1/> эквивалентна: <placeholder-2/>

source: The Schema Search Path
ru: Путь поиска схемы

source: <primary>search path</primary>
ru: <primary>путь поиска</primary>

source: <primary>unqualified name</primary>
ru: <primary>неполное имя</primary>

source: <primary>name</primary><secondary>unqualified</secondary>
ru: <primary>имя</primary><secondary>неполное</secondary>

source: Qualified names are tedious to write, and it's often best not to wire a particular schema name into applications anyway. Therefore tables are often referred to by <firstterm>unqualified names</firstterm>, which consist of just the table name. The system determines which table is meant by following a <firstterm>search path</firstterm>, which is a list of schemas to look in. The first matching table in the search path is taken to be the one wanted. If there is no match in the search path, an error is reported, even if matching table names exist in other schemas in the database.
ru: Везде писать полные имена утомительно, и часто всё равно лучше не привязывать приложения к конкретной схеме. Поэтому к таблицам обычно обращаются по <firstterm>неполному имени</firstterm>, состоящему просто из имени таблицы. Система определяет, какая именно таблица подразумевается, используя <firstterm>путь поиска</firstterm>, который представляет собой список просматриваемых схем. Подразумеваемой таблицей считается первая подходящая таблица, найденная в схемах пути. Если подходящая таблица не найдена, возникает ошибка, даже если таблица с таким именем есть в других схемах базы данных.

source: <primary>schema</primary><secondary>current</secondary>
ru: <primary>схема</primary><secondary>текущая</secondary>

source: The first schema named in the search path is called the current schema. Aside from being the first schema searched, it is also the schema in which new tables will be created if the <command>CREATE TABLE</command> command does not specify a schema name.
ru: Первая схема в пути поиска называется текущей. Эта схема будет использоваться не только при поиске, но и при создании объектов &mdash; она будет включать таблицы, созданные командой <command>CREATE TABLE</command> без указания схемы.

source: <primary><varname>search_path</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>search_path</varname></primary>

source: To show the current search path, use the following command: <placeholder-1/> In the default setup this returns: <screen> search_path -------------- "$user", public</screen> The first element specifies that a schema with the same name as the current user is to be searched. If no such schema exists, the entry is ignored. The second element refers to the public schema that we have seen already.
ru: Чтобы узнать текущий тип поиска, выполните следующую команду: <placeholder-1/> В конфигурации по умолчанию она возвращает: <screen> search_path -------------- "$user", public</screen> Первый элемент ссылается на схему с именем текущего пользователя. Если такой схемы не существует, ссылка на неё игнорируется. Второй элемент ссылается на схему public, которую мы уже видели.

source: The first schema in the search path that exists is the default location for creating new objects. That is the reason that by default objects are created in the public schema. When objects are referenced in any other context without schema qualification (table modification, data modification, or query commands) the search path is traversed until a matching object is found. Therefore, in the default configuration, any unqualified access again can only refer to the public schema.
ru: Первая существующая схема в пути поиска также считается схемой по умолчанию для новых объектов. Именно поэтому по умолчанию объекты создаются в схеме public. При указании неполной ссылки на объект в любом контексте (при модификации таблиц, изменении данных или в запросах) система просматривает путь поиска, пока не найдёт соответствующий объект. Таким образом, в конфигурации по умолчанию неполные имена могут относиться только к объектам в схеме public.

source: To put our new schema in the path, we use: <placeholder-1/> (We omit the <literal>$user</literal> here because we have no immediate need for it.) And then we can access the table without schema qualification: <placeholder-2/> Also, since <literal>myschema</literal> is the first element in the path, new objects would by default be created in it.
ru: Чтобы добавить в путь нашу новую схему, мы выполняем: <placeholder-1/> (Мы опускаем компонент <literal>$user</literal>, так как здесь в нём нет необходимости.) Теперь мы можем обращаться к таблице без указания схемы: <placeholder-2/> И так как <literal>myschema</literal> &mdash; первый элемент в пути, новые объекты будут по умолчанию создаваться в этой схеме.

source: We could also have written: <placeholder-1/> Then we no longer have access to the public schema without explicit qualification. There is nothing special about the public schema except that it exists by default. It can be dropped, too.
ru: Мы можем также написать: <placeholder-1/> Тогда мы больше не сможем обращаться к схеме public, не написав полное имя объекта. Единственное, что отличает схему public от других, это то, что она существует по умолчанию, хотя её так же можно удалить.

source: See also <xref linkend="functions-info"/> for other ways to manipulate the schema search path.
ru: В <xref remap="6" linkend="functions-info"/> вы узнаете, как ещё можно манипулировать путём поиска схем.
