Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ddl.po
Languages: ru

source: <placeholder-1/> The object identifier (object ID) of a row. This column is only present if the table was created using <literal>WITH OIDS</literal>, or if the <xref linkend="guc-default-with-oids"/> configuration variable was set at the time. This column is of type <type>oid</type> (same name as the column); see <xref linkend="datatype-oid"/> for more information about the type.
ru: <placeholder-1/> Идентификатор объекта (object ID) для строки. Этот столбец присутствует, только если таблица была создана с указанием <literal>WITH OIDS</literal>, или если в момент её создания была установлена переменная конфигурации <xref linkend="guc-default-with-oids"/>. Этот столбец имеет тип <type>oid</type> (с тем же именем, что и сам столбец); подробнее об этом типе см. <xref remap="4" linkend="datatype-oid"/>.

source: The OID of the table containing this row. This column is particularly handy for queries that select from inheritance hierarchies (see <xref linkend="ddl-inherit"/>), since without it, it's difficult to tell which individual table a row came from. The <structfield>tableoid</structfield> can be joined against the <structfield>oid</structfield> column of <structname>pg_class</structname> to obtain the table name.
ru: Идентификатор объекта для таблицы, содержащей строку. Этот столбец особенно полезен для запросов, имеющих дело с иерархией наследования (см. <xref remap="4" linkend="ddl-inherit"/>), так как без него сложно определить, из какой таблицы выбрана строка. Связав <structfield>tableoid</structfield> со столбцом <structfield>oid</structfield> в таблице <structname>pg_class</structname>, можно будет получить имя таблицы.

source: The identity (transaction ID) of the inserting transaction for this row version. (A row version is an individual state of a row; each update of a row creates a new row version for the same logical row.)
ru: Идентификатор (код) транзакции, добавившей строку этой версии. (Версия строки &mdash; это её индивидуальное состояние; при каждом изменении создаётся новая версия одной и той же логической строки.)

source: The command identifier (starting at zero) within the inserting transaction.
ru: Номер команды (начиная с нуля) внутри транзакции, добавившей строку.

source: The identity (transaction ID) of the deleting transaction, or zero for an undeleted row version. It is possible for this column to be nonzero in a visible row version. That usually indicates that the deleting transaction hasn't committed yet, or that an attempted deletion was rolled back.
ru: Идентификатор транзакции, удалившей строку, или 0 для неудалённой версии строки. Значение этого столбца может быть ненулевым и для видимой версии строки. Это обычно означает, что удаляющая транзакция ещё не была зафиксирована, или удаление было отменено.

source: The command identifier within the deleting transaction, or zero.
ru: Номер команды в удаляющей транзакции или ноль.

source: The physical location of the row version within its table. Note that although the <structfield>ctid</structfield> can be used to locate the row version very quickly, a row's <structfield>ctid</structfield> will change if it is updated or moved by <command>VACUUM FULL</command>. Therefore <structfield>ctid</structfield> is useless as a long-term row identifier. The OID, or even better a user-defined serial number, should be used to identify logical rows.
ru: Физическое расположение данной версии строки в таблице. Заметьте, что хотя по <structfield>ctid</structfield> можно очень быстро найти версию строки, значение <structfield>ctid</structfield> изменится при выполнении <command>VACUUM FULL</command>. Таким образом, <structfield>ctid</structfield> нельзя применять в качестве долгосрочного идентификатора строки. Для идентификации логических строк лучше использовать OID или даже дополнительный последовательный номер.

source: A unique constraint should be created on the OID column of each table for which the OID will be used to identify rows. When such a unique constraint (or unique index) exists, the system takes care not to generate an OID matching an already-existing row. (Of course, this is only possible if the table contains fewer than 2<superscript>32</superscript> (4 billion) rows, and in practice the table size had better be much less than that, or performance might suffer.)
ru: Когда для идентификации строк таблиц применяется OID, в каждой такой таблице должно создаваться ограничение уникальности для столбца OID. Когда такое ограничение уникальности (или уникальный индекс) существует, система позаботится о том, чтобы OID новой строки не совпал с уже существующими. (Конечно, это возможно, только если в таблице меньше 2<superscript>32</superscript> (4 миллиардов) строк, а на практике таблицы должны быть гораздо меньше, иначе может пострадать производительность системы.)

source: OIDs should never be assumed to be unique across tables; use the combination of <structfield>tableoid</structfield> and row OID if you need a database-wide identifier.
ru: Никогда не следует рассчитывать, что OID будут уникальны среди всех таблиц; в качестве глобального идентификатора в рамках базы данных используйте комбинацию <structfield>tableoid</structfield> и OID строки.

source: Of course, the tables in question must be created <literal>WITH OIDS</literal>. As of <productname>PostgreSQL</productname> 8.1, <literal>WITHOUT OIDS</literal> is the default.
ru: Конечно, все эти таблицы должны быть созданы с указанием <literal>WITH OIDS</literal>. В <productname>PostgreSQL</productname> 8.1 и новее по умолчанию подразумевается <literal>WITHOUT OIDS</literal>.

source: OIDs are 32-bit quantities and are assigned from a single cluster-wide counter. In a large or long-lived database, it is possible for the counter to wrap around. Hence, it is bad practice to assume that OIDs are unique, unless you take steps to ensure that this is the case. If you need to identify the rows in a table, using a sequence generator is strongly recommended. However, OIDs can be used as well, provided that a few additional precautions are taken: <placeholder-1/>
ru: Коды OID представляют собой 32-битные значения и выбираются из единого для всей СУБД счётчика. В больших или долгоживущих базах данных этот счётчик может пойти по кругу. Таким образом, не рекомендуется рассчитывать на уникальность OID, если только вы не обеспечите её дополнительно. Если вам нужно идентифицировать строки таблицы, настоятельно рекомендуется использовать последовательности. Однако можно использовать и коды OID, при выполнении следующих условий: <placeholder-1/>

source: Transaction identifiers are also 32-bit quantities. In a long-lived database it is possible for transaction IDs to wrap around. This is not a fatal problem given appropriate maintenance procedures; see <xref linkend="maintenance"/> for details. It is unwise, however, to depend on the uniqueness of transaction IDs over the long term (more than one billion transactions).
ru: Идентификаторы транзакций также являются 32-битными. В долгоживущей базе данных они могут пойти по кругу. Это не критично при правильном обслуживании БД; подробнее об этом см. <xref remap="4" linkend="maintenance"/>. Однако полагаться на уникальность кодов транзакций в течение длительного времени (при более чем миллиарде транзакций) не следует.

source: Command identifiers are also 32-bit quantities. This creates a hard limit of 2<superscript>32</superscript> (4 billion) <acronym>SQL</acronym> commands within a single transaction. In practice this limit is not a problem &mdash; note that the limit is on the number of <acronym>SQL</acronym> commands, not the number of rows processed. Also, only commands that actually modify the database contents will consume a command identifier.
ru: Идентификаторы команд также 32-битные. Это создаёт жёсткий лимит на 2<superscript>32</superscript> (4 миллиарда) команд <acronym>SQL</acronym> в одной транзакции. На практике это не проблема &mdash; заметьте, что это лимит числа команд <acronym>SQL</acronym>, а не количества обрабатываемых строк. Кроме того, идентификатор получают только те команды, которые фактически изменяют содержимое базы данных.

source: Modifying Tables
ru: Изменение таблиц

source: <primary>table</primary><secondary>modifying</secondary>
ru: <primary>таблица</primary><secondary>изменение</secondary>

source: When you create a table and you realize that you made a mistake, or the requirements of the application change, you can drop the table and create it again. But this is not a convenient option if the table is already filled with data, or if the table is referenced by other database objects (for instance a foreign key constraint). Therefore <productname>PostgreSQL</productname> provides a family of commands to make modifications to existing tables. Note that this is conceptually distinct from altering the data contained in the table: here we are interested in altering the definition, or structure, of the table.
ru: Если вы создали таблицы, а затем поняли, что допустили ошибку, или изменились требования вашего приложения, вы можете удалить её и создать заново. Но это будет неудобно, если таблица уже заполнена данными, или если на неё ссылаются другие объекты базы данных (например, по внешнему ключу). Поэтому <productname>PostgreSQL</productname> предоставляет набор команд для модификации таблиц. Заметьте, что это по сути отличается от изменения данных, содержащихся в таблице: здесь мы обсуждаем модификацию определения, или структуры, таблицы.

source: Add columns
ru: Добавлять столбцы

source: Remove columns
ru: Удалять столбцы

source: Add constraints
ru: Добавлять ограничения

source: Remove constraints
ru: Удалять ограничения

source: Change default values
ru: Изменять значения по умолчанию

source: Change column data types
ru: Изменять типы столбцов

source: Rename columns
ru: Переименовывать столбцы

source: Rename tables
ru: Переименовывать таблицы

source: You can: <placeholder-1/> All these actions are performed using the <xref linkend="sql-altertable"/> command, whose reference page contains details beyond those given here.
ru: Вы можете: <placeholder-1/> Все эти действия выполняются с помощью команды <xref linkend="sql-altertable"/>; подробнее о ней вы можете узнать в её справке.

source: Adding a Column
ru: Добавление столбца

source: <primary>column</primary><secondary>adding</secondary>
ru: <primary>столбец</primary><secondary>добавление</secondary>

source: To add a column, use a command like: <placeholder-1/> The new column is initially filled with whatever default value is given (null if you don't specify a <literal>DEFAULT</literal> clause).
ru: Добавить столбец вы можете так: <placeholder-1/> Новый столбец заполняется заданным для него значением по умолчанию (или значением NULL, если вы не добавите указание <literal>DEFAULT</literal>).

source: You can also define constraints on the column at the same time, using the usual syntax: <placeholder-1/> In fact all the options that can be applied to a column description in <command>CREATE TABLE</command> can be used here. Keep in mind however that the default value must satisfy the given constraints, or the <literal>ADD</literal> will fail. Alternatively, you can add constraints later (see below) after you've filled in the new column correctly.
ru: При этом вы можете сразу определить ограничения столбца, используя обычный синтаксис: <placeholder-1/> На самом деле здесь можно использовать все конструкции, допустимые в определении столбца в команде <command>CREATE TABLE</command>. Помните однако, что значение по умолчанию должно удовлетворять данным ограничениям, чтобы операция <literal>ADD</literal> выполнилась успешно. Вы также можете сначала заполнить столбец правильно, а затем добавить ограничения (см. ниже).

source: Adding a column with a default requires updating each row of the table (to store the new column value). However, if no default is specified, <productname>PostgreSQL</productname> is able to avoid the physical update. So if you intend to fill the column with mostly nondefault values, it's best to add the column with no default, insert the correct values using <command>UPDATE</command>, and then add any desired default as described below.
ru: Добавление столбца со значением по умолчанию приводит к изменению всех строк таблицы (в них будет сохранено новое значение). Однако, если значение по умолчанию не указано, <productname>PostgreSQL</productname> может обойтись без физического изменения. Поэтому, если вы планируете заполнить столбец в основном не значениями по умолчанию, лучше будет добавить столбец без значения по умолчанию, затем вставить требуемые значения с помощью <command>UPDATE</command>, а потом определить значение по умолчанию, как описано ниже.

source: Removing a Column
ru: Удаление столбца

source: <primary>column</primary><secondary>removing</secondary>
ru: <primary>столбец</primary><secondary>удаление</secondary>

source: To remove a column, use a command like: <placeholder-1/> Whatever data was in the column disappears. Table constraints involving the column are dropped, too. However, if the column is referenced by a foreign key constraint of another table, <productname>PostgreSQL</productname> will not silently drop that constraint. You can authorize dropping everything that depends on the column by adding <literal>CASCADE</literal>: <placeholder-2/> See <xref linkend="ddl-depend"/> for a description of the general mechanism behind this.
ru: Удалить столбец можно так: <placeholder-1/> Данные, которые были в этом столбце, исчезают. Вместе со столбцом удаляются и включающие его ограничения таблицы. Однако, если на столбец ссылается ограничение внешнего ключа другой таблицы, <productname>PostgreSQL</productname> не удалит это ограничение неявно. Разрешить удаление всех зависящих от этого столбца объектов можно, добавив указание <literal>CASCADE</literal>: <placeholder-2/> Общий механизм, стоящий за этим, описывается в <xref remap="6" linkend="ddl-depend"/>.

source: Adding a Constraint
ru: Добавление ограничения

source: <primary>constraint</primary><secondary>adding</secondary>
ru: <primary>ограничение</primary><secondary>добавление</secondary>

source: To add a constraint, the table constraint syntax is used. For example: <placeholder-1/> To add a not-null constraint, which cannot be written as a table constraint, use this syntax: <placeholder-2/>
ru: Для добавления ограничения используется синтаксис ограничения таблицы. Например: <placeholder-1/> Чтобы добавить ограничение NOT NULL, которое нельзя записать в виде ограничения таблицы, используйте такой синтаксис: <placeholder-2/>

source: The constraint will be checked immediately, so the table data must satisfy the constraint before it can be added.
ru: Ограничение проходит проверку автоматически и будет добавлено, только если ему удовлетворяют данные таблицы.

source: Removing a Constraint
ru: Удаление ограничения

source: <primary>constraint</primary><secondary>removing</secondary>
ru: <primary>ограничение</primary><secondary>удаление</secondary>

source: To remove a constraint you need to know its name. If you gave it a name then that's easy. Otherwise the system assigned a generated name, which you need to find out. The <application>psql</application> command <literal>\d <replaceable>tablename</replaceable></literal> can be helpful here; other interfaces might also provide a way to inspect table details. Then the command is: <placeholder-1/> (If you are dealing with a generated constraint name like <literal>$2</literal>, don't forget that you'll need to double-quote it to make it a valid identifier.)
ru: Для удаления ограничения вы должны знать его имя. Если вы не присваивали ему имя, это неявно сделала система, и вы должны выяснить его. Здесь может быть полезна команда <application>psql</application> <literal>\d <replaceable>имя_таблицы</replaceable></literal> (или другие программы, показывающие подробную информацию о таблицах). Зная имя, вы можете использовать команду: <placeholder-1/> (Если вы имеете дело с именем ограничения вида <literal>$2</literal>, не забудьте заключить его в кавычки, чтобы это был допустимый идентификатор.)

source: As with dropping a column, you need to add <literal>CASCADE</literal> if you want to drop a constraint that something else depends on. An example is that a foreign key constraint depends on a unique or primary key constraint on the referenced column(s).
ru: Как и при удалении столбца, если вы хотите удалить ограничение с зависимыми объектами, добавьте указание <literal>CASCADE</literal>. Примером такой зависимости может быть ограничение внешнего ключа, связанное со столбцами ограничения первичного ключа.

source: This works the same for all constraint types except not-null constraints. To drop a not null constraint use: <placeholder-1/> (Recall that not-null constraints do not have names.)
ru: Так можно удалить ограничения любых типов, кроме NOT NULL. Чтобы удалить ограничение NOT NULL, используйте команду: <placeholder-1/> (Вспомните, что у ограничений NOT NULL нет имён.)

source: Changing a Column's Default Value
ru: Изменение значения по умолчанию

source: <primary>default value</primary><secondary>changing</secondary>
ru: <primary>значение по умолчанию</primary><secondary>изменение</secondary>

source: To set a new default for a column, use a command like: <placeholder-1/> Note that this doesn't affect any existing rows in the table, it just changes the default for future <command>INSERT</command> commands.
ru: Назначить столбцу новое значение по умолчанию можно так: <placeholder-1/> Заметьте, что это никак не влияет на существующие строки таблицы, а просто задаёт значение по умолчанию для последующих команд <command>INSERT</command>.

source: To remove any default value, use: <placeholder-1/> This is effectively the same as setting the default to null. As a consequence, it is not an error to drop a default where one hadn't been defined, because the default is implicitly the null value.
ru: Чтобы удалить значение по умолчанию, выполните: <placeholder-1/> При этом по сути значению по умолчанию просто присваивается NULL. Как следствие, ошибки не будет, если вы попытаетесь удалить значение по умолчанию, не определённое явно, так как неявно оно существует и равно NULL.

source: Changing a Column's Data Type
ru: Изменение типа данных столбца

source: <primary>column data type</primary><secondary>changing</secondary>
ru: <primary>тип данных столбца</primary><secondary>изменение</secondary>

source: To convert a column to a different data type, use a command like: <placeholder-1/> This will succeed only if each existing entry in the column can be converted to the new type by an implicit cast. If a more complex conversion is needed, you can add a <literal>USING</literal> clause that specifies how to compute the new values from the old.
ru: Чтобы преобразовать столбец в другой тип данных, используйте команду: <placeholder-1/> Она будет успешна, только если все существующие значения в столбце могут быть неявно приведены к новому типу. Если требуется более сложное преобразование, вы можете добавить указание <literal>USING</literal>, определяющее, как получить новые значения из старых.

source: <productname>PostgreSQL</productname> will attempt to convert the column's default value (if any) to the new type, as well as any constraints that involve the column. But these conversions might fail, or might produce surprising results. It's often best to drop any constraints on the column before altering its type, and then add back suitably modified constraints afterwards.
ru: <productname>PostgreSQL</productname> попытается также преобразовать к новому типу значение столбца по умолчанию (если оно определено) и все связанные с этим столбцом ограничения. Но преобразование может оказаться неправильным, и тогда вы получите неожиданные результаты. Поэтому обычно лучше удалить все ограничения столбца, перед тем как менять его тип, а затем воссоздать модифицированные должным образом ограничения.

source: Renaming a Column
ru: Переименование столбца

source: <primary>column</primary><secondary>renaming</secondary>
ru: <primary>столбец</primary><secondary>переименование</secondary>

source: To rename a column: <placeholder-1/>
ru: Чтобы переименовать столбец, выполните: <placeholder-1/>

source: Renaming a Table
ru: Переименование таблицы

source: <primary>table</primary><secondary>renaming</secondary>
ru: <primary>таблица</primary><secondary>переименование</secondary>

source: To rename a table: <placeholder-1/>
ru: Таблицу можно переименовать так: <placeholder-1/>

source: Privileges
ru: Права

source: <primary>privilege</primary>
ru: <primary>право</primary>

source: <primary>permission</primary><see>privilege</see>
ru: <primary>разрешение</primary><see>право</see>

source: <primary>owner</primary>
ru: <primary>владелец</primary>

source: When an object is created, it is assigned an owner. The owner is normally the role that executed the creation statement. For most kinds of objects, the initial state is that only the owner (or a superuser) can do anything with the object. To allow other roles to use it, <firstterm>privileges</firstterm> must be granted.
ru: Когда в базе данных создаётся объект, ему назначается владелец. Владельцем обычно становится роль, с которой был выполнен оператор создания. Для большинства типов объектов в исходном состоянии только владелец (или суперпользователь) может делать с объектом всё, что угодно. Чтобы разрешить использовать его другим ролям, нужно дать им <firstterm>права</firstterm>.

source: There are different kinds of privileges: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, <literal>TRUNCATE</literal>, <literal>REFERENCES</literal>, <literal>TRIGGER</literal>, <literal>CREATE</literal>, <literal>CONNECT</literal>, <literal>TEMPORARY</literal>, <literal>EXECUTE</literal>, and <literal>USAGE</literal>. The privileges applicable to a particular object vary depending on the object's type (table, function, etc). For complete information on the different types of privileges supported by <productname>PostgreSQL</productname>, refer to the <xref linkend="sql-grant"/> reference page. The following sections and chapters will also show you how those privileges are used.
ru: Существует несколько типов прав: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, <literal>TRUNCATE</literal>, <literal>REFERENCES</literal>, <literal>TRIGGER</literal>, <literal>CREATE</literal>, <literal>CONNECT</literal>, <literal>TEMPORARY</literal>, <literal>EXECUTE</literal> и <literal>USAGE</literal>. Набор прав, применимых к определённому объекту, зависит от типа объекта (таблица, функция и т. д.) Полную информацию о различных типах прав, поддерживаемых <productname>PostgreSQL</productname>, вы найдете на странице справки <xref linkend="sql-grant"/>. Вы также увидите, как применяются эти права, в следующих разделах и главах.

source: The right to modify or destroy an object is always the privilege of the owner only.
ru: Неотъемлемое право изменять или удалять объект имеет только владелец объекта.

source: An object can be assigned to a new owner with an <command>ALTER</command> command of the appropriate kind for the object, e.g. <xref linkend="sql-altertable"/>. Superusers can always do this; ordinary roles can only do it if they are both the current owner of the object (or a member of the owning role) and a member of the new owning role.
ru: Объекту можно назначить нового владельца с помощью команды <command>ALTER</command> для соответствующего типа объекта, например <xref linkend="sql-altertable"/>. Суперпользователь может делать это без ограничений, а обычный пользователь, только если он является одновременно текущим владельцем объекта (или членом роли владельца) и членом новой роли.
