Repository: pluzanov/pg-doc-ru
Catalog: 9.6/dict-xsyn.po
Languages: ru

source: <filename>dict_xsyn</filename> (Extended Synonym Dictionary) is an example of an add-on dictionary template for full-text search. This dictionary type replaces words with groups of their synonyms, and so makes it possible to search for a word using any of its synonyms.
ru: Модуль <filename>dict_xsyn</filename> (Extended Synonym Dictionary, расширенный словарь синонимов) представляет собой пример дополнительного шаблона словаря для полнотекстового поиска. Этот словарь заменяет слова группами их синонимов, что позволяет находить слово по одному из его синонимов.

source: Configuration
ru: Конфигурирование

source: A <literal>dict_xsyn</literal> dictionary accepts the following options:
ru: Словарь <literal>dict_xsyn</literal> принимает следующие параметры:

source: <literal>matchorig</literal> controls whether the original word is accepted by the dictionary. Default is <literal>true</literal>.
ru: Параметр <literal>matchorig</literal> определяет, будет ли словарь принимать изначальное слово. По умолчанию он включён (имеет значение <literal>true</literal>).

source: <literal>matchsynonyms</literal> controls whether the synonyms are accepted by the dictionary. Default is <literal>false</literal>.
ru: Параметр <literal>matchsynonyms</literal> определяет, будет ли словарь принимать синонимы. По умолчанию он отключён (имеет значение <literal>false</literal>).

source: <literal>keeporig</literal> controls whether the original word is included in the dictionary's output. Default is <literal>true</literal>.
ru: Параметр <literal>keeporig</literal> определяет, будет ли исходное слово включаться в вывод словаря. По умолчанию он включён (имеет значение <literal>true</literal>).

source: <literal>keepsynonyms</literal> controls whether the synonyms are included in the dictionary's output. Default is <literal>true</literal>.
ru: Параметр <literal>keepsynonyms</literal> определяет, будут ли в вывод словаря включаться синонимы. По умолчанию он включён (имеет значение <literal>true</literal>).

source: <literal>rules</literal> is the base name of the file containing the list of synonyms. This file must be stored in <filename>$SHAREDIR/tsearch_data/</filename> (where <literal>$SHAREDIR</literal> means the <productname>PostgreSQL</productname> installation's shared-data directory). Its name must end in <literal>.rules</literal> (which is not to be included in the <literal>rules</literal> parameter).
ru: Параметр <literal>rules</literal> задаёт базовое имя файла со списком синонимов. Этот файл должен находиться в каталоге <filename>$SHAREDIR/tsearch_data/</filename> (где под <literal>$SHAREDIR</literal> понимается каталог с общими данными инсталляции <productname>PostgreSQL</productname>). Имя файла должно заканчиваться расширением <literal>.rules</literal> (которое не нужно указывать в параметре <literal>rules</literal>).

source: The rules file has the following format:
ru: Файл правил имеет следующий формат:

source: Each line represents a group of synonyms for a single word, which is given first on the line. Synonyms are separated by whitespace, thus: <placeholder-1/>
ru: Каждая строка представляет группу синонимов для одного слова, которое задаётся первым в этой строке. Символы разделяются пробельными символами, так что строка выглядит так: <placeholder-1/>

source: The sharp (<literal>#</literal>) sign is a comment delimiter. It may appear at any position in a line. The rest of the line will be skipped.
ru: Символ решётки (<literal>#</literal>) обозначает начало комментария. Он может находиться в любом месте строки. Следующая за ним часть строки игнорируется.

source: Look at <filename>xsyn_sample.rules</filename>, which is installed in <filename>$SHAREDIR/tsearch_data/</filename>, for an example.
ru: Пример словаря можно найти в файле <filename>xsyn_sample.rules</filename>, устанавливаемом в <filename>$SHAREDIR/tsearch_data/</filename>.

source: Usage
ru: Использование

source: Installing the <literal>dict_xsyn</literal> extension creates a text search template <literal>xsyn_template</literal> and a dictionary <literal>xsyn</literal> based on it, with default parameters. You can alter the parameters, for example <placeholder-1/> or create new dictionaries based on the template.
ru: При установке расширения <literal>dict_xsyn</literal> в базе создаётся шаблон текстового поиска <literal>xsyn_template</literal> и словарь <literal>xsyn</literal> на его базе, с параметрами по умолчанию. Вы можете изменить параметры словаря, например так: <placeholder-1/> или создать новые словари на базе этого шаблона.

source: To test the dictionary, you can try <placeholder-1/> Real-world usage will involve including it in a text search configuration as described in <xref linkend="textsearch"/>. That might look like this: <placeholder-2/>
ru: Протестировать этот словарь можно так: <placeholder-1/> Но для практического применения его нужно включить в конфигурацию текстового поиска, как описано в <xref remap="6" linkend="textsearch"/>. Это может выглядеть примерно так: <placeholder-2/>
