Repository: pluzanov/pg-doc-ru
Catalog: 9.6/diskusage.po
Languages: ru

source: Monitoring Disk Usage
ru: Мониторинг использования диска

source: This chapter discusses how to monitor the disk usage of a <productname>PostgreSQL</productname> database system.
ru: В данной главе обсуждается как отслеживать использование дискового пространства в СУБД <productname>PostgreSQL</productname>.

source: Determining Disk Usage
ru: Определение использования диска

source: <primary>disk usage</primary>
ru: <primary>использование диска</primary>

source: Each table has a primary heap disk file where most of the data is stored. If the table has any columns with potentially-wide values, there also might be a <acronym>TOAST</acronym> file associated with the table, which is used to store values too wide to fit comfortably in the main table (see <xref linkend="storage-toast"/>). There will be one valid index on the <acronym>TOAST</acronym> table, if present. There also might be indexes associated with the base table. Each table and index is stored in a separate disk file &mdash; possibly more than one file, if the file would exceed one gigabyte. Naming conventions for these files are described in <xref linkend="storage-file-layout"/>.
ru: Для каждой таблицы создаётся первичный дисковый файл кучи (heap), в котором хранится большая часть данных. Если в таблице есть столбцы с потенциально большими значениями, то также может быть и ассоциированный с этой таблицей файл <acronym>TOAST</acronym>, который используется для хранения слишком больших значений, не умещающихся в главной таблице (см. <xref remap="4" linkend="storage-toast"/>). На каждую таблицу <acronym>TOAST</acronym>, если она существует, будет существовать один индекс. Также там могут быть и индексы, ассоциированные с базовой таблицей. Каждая таблица и индекс хранятся в отдельном дисковом файле &mdash; возможно более чем в одном файле, если размер этого файла превышает один гигабайт. Преобразования имён для этих файлов описываются в <xref remap="6" linkend="storage-file-layout"/>.

source: You can monitor disk space in three ways: using the SQL functions listed in <xref linkend="functions-admin-dbsize"/>, using the <xref linkend="oid2name"/> module, or using manual inspection of the system catalogs. The SQL functions are the easiest to use and are generally recommended. The remainder of this section shows how to do it by inspection of the system catalogs.
ru: Вы можете осуществлять мониторинг дискового пространства тремя способами: используя SQL-функции, перечисленные в <xref remap="6" linkend="functions-admin-dbsize"/>, используя модуль <xref linkend="oid2name"/> или просматривая системные каталоги вручную. Вышеупомянутые SQL функции являются наиболее простыми и рекомендуются для использования. В продолжении этого раздела рассказывается, как просматривать системные каталоги.

source: Using <application>psql</application> on a recently vacuumed or analyzed database, you can issue queries to see the disk usage of any table: <placeholder-1/> Each page is typically 8 kilobytes. (Remember, <structfield>relpages</structfield> is only updated by <command>VACUUM</command>, <command>ANALYZE</command>, and a few DDL commands such as <command>CREATE INDEX</command>.) The file path name is of interest if you want to examine the table's disk file directly.
ru: Используя <application>psql</application> после недавнего применения команд VACUUM или ANALYZE, вы можете выполнить такой запрос, чтобы увидеть сколько дискового пространства использует какая-либо таблица: <placeholder-1/> Каждая страница обычно равна 8kb. (Помните, что <structfield>relpages</structfield> обновляется только командами <command>VACUUM</command>, <command>ANALYZE</command>, и несколькими командами DDL, такими как <command>CREATE INDEX</command>). Путь к файлу представляет интерес, если вы хотите проанализировать непосредственно файл на диске.

source: To show the space used by <acronym>TOAST</acronym> tables, use a query like the following: <placeholder-1/>
ru: Чтобы посмотреть пространство, используемое таблицами <acronym>TOAST</acronym>, используйте следующий запрос: <placeholder-1/>

source: You can easily display index sizes, too: <placeholder-1/>
ru: Вы можете легко посмотреть размеры индексов: <placeholder-1/>

source: It is easy to find your largest tables and indexes using this information: <placeholder-1/>
ru: Также легко найти самые большие таблицы и индексы, используя эту информацию: <placeholder-1/>

source: Disk Full Failure
ru: Ошибка переполнения диска

source: The most important disk monitoring task of a database administrator is to make sure the disk doesn't become full. A filled data disk will not result in data corruption, but it might prevent useful activity from occurring. If the disk holding the WAL files grows full, database server panic and consequent shutdown might occur.
ru: Наиболее важной задачей мониторинга диска для администратора баз данных состоит в том, чтобы иметь уверенность в наличии свободного места на диске. Если диск полон, это не приведёт к повреждению данных, но может не давать выполняться некоторым полезным действиям. Если переполнится диск, который содержит файлы WAL, то сервер СУБД может аварийно завершить свою работу.

source: If you cannot free up additional space on the disk by deleting other things, you can move some of the database files to other file systems by making use of tablespaces. See <xref linkend="manage-ag-tablespaces"/> for more information about that.
ru: Если вы не можете освободить дополнительное пространство на диске, удалив какие-либо другие файлы, то можно перенести часть файлов базы данных на другие файловые системы, с помощью создания табличных пространств. Подробности об этом смотрите в <xref linkend="manage-ag-tablespaces"/>.

source: Some file systems perform badly when they are almost full, so do not wait until the disk is completely full to take action.
ru: Некоторые файловые системы плохо работают, когда они почти или совсем заполнены, так что не ждите пока диск заполнится полностью, чтобы выполнить необходимые действия.

source: If your system supports per-user disk quotas, then the database will naturally be subject to whatever quota is placed on the user the server runs as. Exceeding the quota will have the same bad effects as running out of disk space entirely.
ru: Если ваша система поддерживает дисковые квоты для пользователей, вы должны позаботиться о квоте, выделенной для пользователя, от имени которого запускается сервер СУБД. Если эта квота будет исчерпана, последствия будут столь же негативными, как если просто закончится свободное место на диске.
