Repository: pluzanov/pg-doc-ru
Catalog: 9.6/extend.po
Languages: ru

source: The extension script may set privileges on objects which are part of the extension via <command>GRANT</command> and <command>REVOKE</command> statements. The final set of privileges for each object (if any are set) will be stored in the <link linkend="catalog-pg-init-privs"><structname>pg_init_privs</structname></link> system catalog. When <application>pg_dump</application> is used, the <command>CREATE EXTENSION</command> command will be included in the dump, followed by the set of <command>GRANT</command> and <command>REVOKE</command> statements necessary to set the privileges on the objects to what they were at the time the dump was taken.
ru: Скрипт расширения может устанавливать права доступа для объектов, являющихся частью расширения, выполняя команды <command>GRANT</command> и <command>REVOKE</command>. Окончательный набор прав для каждого объекта (если они заданы) будет сохранён в системном каталоге <link linkend="catalog-pg-init-privs"><structname>pg_init_privs</structname></link>. При использовании <application>pg_dump</application> в выгружаемый скрипт будет выведена команда <command>CREATE EXTENSION</command> с последующими операторами <command>GRANT</command> и <command>REVOKE</command>, которые установят права, имевшие место в момент выгрузки.

source: <productname>PostgreSQL</productname> does not currently support extension scripts issuing <command>CREATE POLICY</command> or <command>SECURITY LABEL</command> statements. These are expected to be set after the extension has been created. All RLS policies and security labels on extension objects will be included in dumps created by <application>pg_dump</application>.
ru: <productname>PostgreSQL</productname> в настоящее время не поддерживает скрипты расширений, выполняющие операторы <command>CREATE POLICY</command> или <command>SECURITY LABEL</command>. Ожидается, что такие команды будут выполняться после того, как расширение будет создано. Выгружая данные, <application>pg_dump</application> будет также включать в вывод все политики RLS и метки безопасности.

source: The extension mechanism also has provisions for packaging modification scripts that adjust the definitions of the SQL objects contained in an extension. For example, if version 1.1 of an extension adds one function and changes the body of another function compared to 1.0, the extension author can provide an <firstterm>update script</firstterm> that makes just those two changes. The <command>ALTER EXTENSION UPDATE</command> command can then be used to apply these changes and track which version of the extension is actually installed in a given database.
ru: Механизм расширений также предоставляет средства для поддержки дополнительных скриптов, призванных изменять определение объектов SQL, содержащихся в расширении. Например, если версия расширения 1.1, по сравнению с версией 1.0, добавляет одну функцию и изменяет тело другой функции, автор расширения может предоставить <firstterm>скрипт обновления</firstterm>, который произведёт именно эти два изменения. Затем, воспользовавшись командой <command>ALTER EXTENSION UPDATE</command>, можно будет применить эти изменения и отследить, какая версия расширения фактически установлена в заданной базе данных.

source: The kinds of SQL objects that can be members of an extension are shown in the description of <xref linkend="sql-alterextension"/>. Notably, objects that are database-cluster-wide, such as databases, roles, and tablespaces, cannot be extension members since an extension is only known within one database. (Although an extension script is not prohibited from creating such objects, if it does so they will not be tracked as part of the extension.) Also notice that while a table can be a member of an extension, its subsidiary objects such as indexes are not directly considered members of the extension. Another important point is that schemas can belong to extensions, but not vice versa: an extension as such has an unqualified name and does not exist <quote>within</quote> any schema. The extension's member objects, however, will belong to schemas whenever appropriate for their object types. It may or may not be appropriate for an extension to own the schema(s) its member objects are within.
ru: Типы SQL-объектов, которые могут быть членами расширения, перечислены в описании <xref linkend="sql-alterextension"/>. Не могут быть его членами, в частности, объекты уровня кластера, такие как базы данных, роли и табличные пространства, так как расширение существует только в рамках одной базы данных. (Скрипту расширения не запрещается создавать такие объекты, но если он сделает это, они не будут считаться частью расширения.) Также заметьте, что несмотря на то, что таблица может быть членом расширения, её подчинённые объекты, такие как индексы, непосредственными членами расширения считаться не будут. Ещё один важный момент — схемы могут принадлежать расширениям, но не наоборот; поэтому расширение имеет неполное имя и не существует <quote>внутри</quote> какой-либо схемы. Однако объекты-члены расширения, будут относиться к схемам, если это уместно для их типов. Сами расширения могут иметь, а могут не иметь основания владеть схемами, к которым относятся объекты-члены расширения.

source: Extension Files
ru: Файлы расширений

source: <primary>control file</primary>
ru: <primary>управляющий файл</primary>

source: The <xref linkend="sql-createextension"/> command relies on a control file for each extension, which must be named the same as the extension with a suffix of <literal>.control</literal>, and must be placed in the installation's <literal>SHAREDIR/extension</literal> directory. There must also be at least one <acronym>SQL</acronym> script file, which follows the naming pattern <literal><replaceable>extension</replaceable>--<replaceable>version</replaceable>.sql</literal> (for example, <literal>foo--1.0.sql</literal> for version <literal>1.0</literal> of extension <literal>foo</literal>). By default, the script file(s) are also placed in the <literal>SHAREDIR/extension</literal> directory; but the control file can specify a different directory for the script file(s).
ru: Команда <xref linkend="sql-createextension"/> задействует управляющий файл расширения, который должен называться по имени расширения, с суффиксом <literal>.control</literal>, и должен быть помещён в каталог сервера <literal>SHAREDIR/extension</literal>. Должен быть также ещё минимум один <acronym>SQL</acronym>-скрипт, с именем, соответствующим шаблону <literal><replaceable>расширение</replaceable>--<replaceable>версия</replaceable>.sql</literal> (например, <literal>foo--1.0.sql</literal> для версии <literal>1.0</literal> расширения <literal>foo</literal>). По умолчанию скрипт(ы) также помещается в каталог <literal>SHAREDIR/extension</literal>; но в управляющем файле можно задать и другой каталог.

source: The file format for an extension control file is the same as for the <filename>postgresql.conf</filename> file, namely a list of <replaceable>parameter_name</replaceable> <literal>=</literal> <replaceable>value</replaceable> assignments, one per line. Blank lines and comments introduced by <literal>#</literal> are allowed. Be sure to quote any value that is not a single word or number.
ru: Формат управляющего файла расширения не отличается от формата <filename>postgresql.conf</filename>, а именно представляет собой список присвоений <replaceable>имя_параметра</replaceable> <literal>=</literal> <replaceable>значение</replaceable>, по одному в строке. В нём также допускаются пустые строки и комментарии, начинающиеся с <literal>#</literal>. Все значения, отличные от единственного слова или числа, в нём должны заключаться в кавычки.

source: A control file can set the following parameters:
ru: В управляющем файле могут устанавливаться следующие параметры:

source: The directory containing the extension's <acronym>SQL</acronym> script file(s). Unless an absolute path is given, the name is relative to the installation's <literal>SHAREDIR</literal> directory. The default behavior is equivalent to specifying <literal>directory = 'extension'</literal>.
ru: Каталог, содержащий <acronym>SQL</acronym>-скрипт(ы) расширения. Если только не задан абсолютный путь, это имя рассматривается относительно каталога сервера <literal>SHAREDIR</literal>. По умолчанию подразумевается указание <literal>directory = 'extension'</literal>.

source: The default version of the extension (the one that will be installed if no version is specified in <command>CREATE EXTENSION</command>). Although this can be omitted, that will result in <command>CREATE EXTENSION</command> failing if no <literal>VERSION</literal> option appears, so you generally don't want to do that.
ru: Версия расширения по умолчанию (та, которая будет установлена, если в <command>CREATE EXTENSION</command> не будет указана никакая версия). Хотя этот параметр можно опустить, это приведёт к ошибке в <command>CREATE EXTENSION</command> без явного указания <literal>VERSION</literal>, что вряд ли будет желаемым поведением.

source: A comment (any string) about the extension. Alternatively, the comment can be set by means of the <xref linkend="sql-comment"/> command in the script file.
ru: Комментарий (произвольная строка) к расширению. Комментарий также можно задать посредством команды <xref linkend="sql-comment"/> в файле скрипта.

source: The character set encoding used by the script file(s). This should be specified if the script files contain any non-ASCII characters. Otherwise the files will be assumed to be in the database encoding.
ru: Кодировка символов, используемая в файлах скриптов. Её следует указать, если эти файлы содержат символы не из набора ASCII. По умолчанию предполагается, что эти файлы содержат текст в кодировке базы данных.

source: The value of this parameter will be substituted for each occurrence of <literal>MODULE_PATHNAME</literal> in the script file(s). If it is not set, no substitution is made. Typically, this is set to <literal>$libdir/<replaceable>shared_library_name</replaceable></literal> and then <literal>MODULE_PATHNAME</literal> is used in <command>CREATE FUNCTION</command> commands for C-language functions, so that the script files do not need to hard-wire the name of the shared library.
ru: Значение этого параметра будет подставляться вместо каждого вхождения <literal>MODULE_PATHNAME</literal> в скриптах. Если этот параметр не задан, подстановка не производится. Обычно для этого параметра устанавливается значение <literal>$libdir/<replaceable>имя_разделяемой_библиотеки</replaceable></literal>, а затем в командах <command>CREATE FUNCTION</command> для функций на языке C указывается <literal>MODULE_PATHNAME</literal>, чтобы в скриптах не приходилось жёстко задавать имя разделяемой библиотеки.

source: A list of names of extensions that this extension depends on, for example <literal>requires = 'foo, bar'</literal>. Those extensions must be installed before this one can be installed.
ru: Список имён расширений, от которых зависит данное, например, <literal>requires = 'foo, bar'</literal>. Эти расширения должны быть уже установлены, прежде чем можно будет установить данное.

source: If this parameter is <literal>true</literal> (which is the default), only superusers can create the extension or update it to a new version. If it is set to <literal>false</literal>, just the privileges required to execute the commands in the installation or update script are required.
ru: Если этот параметр имеет значение <literal>true</literal> (по умолчанию), только суперпользователи смогут создать это расширение или обновить его до новой версии. Если он равен <literal>false</literal>, для этого будет достаточно прав, необходимых для выполнения команд в установочном скрипте или скрипте обновления.

source: An extension is <firstterm>relocatable</firstterm> if it is possible to move its contained objects into a different schema after initial creation of the extension. The default is <literal>false</literal>, i.e. the extension is not relocatable. See below for more information.
ru: Расширение является <firstterm>перемещаемым</firstterm>, если относящиеся к нему объекты после создания расширения можно переместить в другую схему. По умолчанию подразумевается <literal>false</literal>, то есть расширение не считается перемещаемым. Подробнее об этом рассказывается ниже.

source: This parameter can only be set for non-relocatable extensions. It forces the extension to be loaded into exactly the named schema and not any other. See below for more information.
ru: Этот параметр может задаваться только для неперемещаемых расширений. Если он задан, расширение можно будет загрузить только в указанную схему и не в какую другую. Подробнее об этом рассказывается ниже.

source: In addition to the primary control file <literal><replaceable>extension</replaceable>.control</literal>, an extension can have secondary control files named in the style <literal><replaceable>extension</replaceable>--<replaceable>version</replaceable>.control</literal>. If supplied, these must be located in the script file directory. Secondary control files follow the same format as the primary control file. Any parameters set in a secondary control file override the primary control file when installing or updating to that version of the extension. However, the parameters <varname>directory</varname> and <varname>default_version</varname> cannot be set in a secondary control file.
ru: Помимо главного управляющего файла <literal><replaceable>расширение</replaceable>.control</literal>, расширение может включать дополнительные управляющие файлы с именами вида <literal><replaceable>расширение</replaceable>--<replaceable>версия</replaceable>.control</literal>. Если они присутствуют, они должны находиться в том же каталоге, что и основной скрипт. Дополнительные управляющие файлы имеют тот же формат, что и основной. Любые параметры, заданные в дополнительном управляющем файле, переопределяют параметры основного файла, когда выполняется установка этой версии расширения или обновление до неё. Однако параметры <varname>directory</varname> и <varname>default_version</varname> в дополнительных управляющих файлах задать нельзя.

source: An extension's <acronym>SQL</acronym> script files can contain any SQL commands, except for transaction control commands (<command>BEGIN</command>, <command>COMMIT</command>, etc) and commands that cannot be executed inside a transaction block (such as <command>VACUUM</command>). This is because the script files are implicitly executed within a transaction block.
ru: <acronym>SQL</acronym>-скрипты расширений могут содержать любые команды SQL, за исключением команд управления транзакциями (<command>BEGIN</command>, <command>COMMIT</command> и т. д.) и команд, которые не могут выполняться внутри блока транзакции (например, <command>VACUUM</command>). Это объясняется тем, что эти скрипты неявно выполняются в блоке транзакции.

source: An extension's <acronym>SQL</acronym> script files can also contain lines beginning with <literal>\echo</literal>, which will be ignored (treated as comments) by the extension mechanism. This provision is commonly used to throw an error if the script file is fed to <application>psql</application> rather than being loaded via <command>CREATE EXTENSION</command> (see example script below). Without that, users might accidentally load the extension's contents as <quote>loose</quote> objects rather than as an extension, a state of affairs that's a bit tedious to recover from.
ru: <acronym>SQL</acronym>-скрипты расширений также могут содержать строки, начинающиеся с <literal>\echo</literal>, и они будут игнорироваться (восприниматься как комментарии) механизмом расширений. Это часто используется для вывода ошибки в случае, если этот скрипт выполняется в <application>psql</application>, а не загружается командой <command>CREATE EXTENSION</command> (см. пример скрипта ниже). Если такое выполнение не предотвратить, пользователи могут случайно загрузить содержимое расширения как <quote>разрозненные</quote> объекты, а не как собственно расширение, и получить состояние, которое довольно сложно исправить.

source: While the script files can contain any characters allowed by the specified encoding, control files should contain only plain ASCII, because there is no way for <productname>PostgreSQL</productname> to know what encoding a control file is in. In practice this is only an issue if you want to use non-ASCII characters in the extension's comment. Recommended practice in that case is to not use the control file <varname>comment</varname> parameter, but instead use <command>COMMENT ON EXTENSION</command> within a script file to set the comment.
ru: Тогда как файлы скриптов могут содержать любые символы, допустимые в указанной кодировке, управляющие файлы могут содержать только ASCII-символы, так как указать кодировку этих файлов в <productname>PostgreSQL</productname> нет никакой возможности. На практике это представляет проблему, только если вы хотите использовать символы не из набора ASCII в комментарии расширения. В таких случаях рекомендуется не использовать параметр <varname>comment</varname> в управляющем файле, а вместо этого задать комментарий командой <command>COMMENT ON EXTENSION</command> в файле скрипта.

source: Extension Relocatability
ru: Перемещаемость расширений

source: Users often wish to load the objects contained in an extension into a different schema than the extension's author had in mind. There are three supported levels of relocatability:
ru: У пользователей часто возникает желание загрузить объекты, содержащиеся в расширении, в схему, отличную от той, что выбрал автор расширения. Насколько это поддерживает расширение, описывается одним из трёх уровней:

source: A fully relocatable extension can be moved into another schema at any time, even after it's been loaded into a database. This is done with the <command>ALTER EXTENSION SET SCHEMA</command> command, which automatically renames all the member objects into the new schema. Normally, this is only possible if the extension contains no internal assumptions about what schema any of its objects are in. Also, the extension's objects must all be in one schema to begin with (ignoring objects that do not belong to any schema, such as procedural languages). Mark a fully relocatable extension by setting <literal>relocatable = true</literal> in its control file.
ru: Полностью перемещаемое расширение может быть перемещено в другую схему в любое время, даже после того, как оно загружено в базу данных. Это осуществляется командой <command>ALTER EXTENSION SET SCHEMA</command>, которая автоматически переименовывает все объекты-члены расширения, перенося их в новую схему. Обычно это возможно, только если в расширении нет никаких внутренних предположений о том, в какой схеме находятся все его объекты. Кроме того, все объекты расширения должны находиться в одной исходной схеме (за исключением объектов, не принадлежащих схемам, как например, процедурные языки). Чтобы пометить расширение как полностью перемещаемое, установите <literal>relocatable = true</literal> в его управляющем файле.

source: An extension might be relocatable during installation but not afterwards. This is typically the case if the extension's script file needs to reference the target schema explicitly, for example in setting <literal>search_path</literal> properties for SQL functions. For such an extension, set <literal>relocatable = false</literal> in its control file, and use <literal>@extschema@</literal> to refer to the target schema in the script file. All occurrences of this string will be replaced by the actual target schema's name before the script is executed. The user can set the target schema using the <literal>SCHEMA</literal> option of <command>CREATE EXTENSION</command>.
ru: Расширение может быть перемещаемым в момент установки, но не после. Обычно это имеет место, когда скрипту расширения необходимо явно ссылаться на целевую схему, например, устанавливая свойства <literal>search_path</literal> для функций SQL. Для такого расширения нужно задать <literal>relocatable = false</literal> в его управляющем файле и обращаться к целевой схеме в скрипте по псевдоимени <literal>@extschema@</literal>. Все вхождения этого псевдоимени будут заменены именем выбранной целевой схемы перед выполнением скрипта. Пользователь может выбрать целевую схему в указании <literal>SCHEMA</literal> команды <command>CREATE EXTENSION</command>.

source: If the extension does not support relocation at all, set <literal>relocatable = false</literal> in its control file, and also set <literal>schema</literal> to the name of the intended target schema. This will prevent use of the <literal>SCHEMA</literal> option of <command>CREATE EXTENSION</command>, unless it specifies the same schema named in the control file. This choice is typically necessary if the extension contains internal assumptions about schema names that can't be replaced by uses of <literal>@extschema@</literal>. The <literal>@extschema@</literal> substitution mechanism is available in this case too, although it is of limited use since the schema name is determined by the control file.
ru: Если расширение вовсе не поддерживает перемещение, установите в его управляющем файле <literal>relocatable = false</literal>, и также задайте в параметре <literal>schema</literal> имя предполагаемой целевой схемы. Это предотвратит использование указания <literal>SCHEMA</literal> команды <command>CREATE EXTENSION</command>, если только оно задаёт не то же имя, что определёно в управляющем файле. Этот выбор обычно необходим, если в расширении делаются внутренние предположения об именах схемы, которые нельзя свести к использованию псевдоимени <literal>@extschema@</literal>. Механизм подстановки <literal>@extschema@</literal> будет работать и в этом случае, хотя польза от него будет ограниченной, так как имя схемы определяется управляющим файлом.

source: In all cases, the script file will be executed with <xref linkend="guc-search-path"/> initially set to point to the target schema; that is, <command>CREATE EXTENSION</command> does the equivalent of this: <placeholder-1/> This allows the objects created by the script file to go into the target schema. The script file can change <varname>search_path</varname> if it wishes, but that is generally undesirable. <varname>search_path</varname> is restored to its previous setting upon completion of <command>CREATE EXTENSION</command>.
ru: В любом случае, при выполнении файла скрипта параметр <xref linkend="guc-search-path"/> изначально будет указывать на целевую схему; то есть, <command>CREATE EXTENSION</command> делает то же, что и: <placeholder-1/> Это позволяет направить объекты, создаваемые скриптом, в целевую схему. Скрипт может изменить <varname>search_path</varname>, если пожелает, но обычно это нежелательно. Параметр <varname>search_path</varname> восстанавливает предыдущее значение по завершении <command>CREATE EXTENSION</command>.
