Repository: pluzanov/pg-doc-ru
Catalog: 9.6/extend.po
Languages: ru

source: Extending <acronym>SQL</acronym>
ru: Расширение <acronym>SQL</acronym>

source: <primary>extending SQL</primary>
ru: <primary>расширение SQL</primary>

source: functions (starting in <xref linkend="xfunc"/>)
ru: функции (начиная с <xref remap="2" linkend="xfunc"/>)

source: aggregates (starting in <xref linkend="xaggr"/>)
ru: агрегатные функции (начиная с <xref remap="2" linkend="xaggr"/>)

source: data types (starting in <xref linkend="xtypes"/>)
ru: типы данных (начиная с <xref remap="2" linkend="xtypes"/>)

source: operators (starting in <xref linkend="xoper"/>)
ru: операторы (начиная с <xref remap="2" linkend="xoper"/>)

source: operator classes for indexes (starting in <xref linkend="xindex"/>)
ru: классы операторов для индексов (начиная с <xref remap="2" linkend="xindex"/>)

source: packages of related objects (starting in <xref linkend="extend-extensions"/>)
ru: пакеты связанных объектов (начиная с <xref remap="2" linkend="extend-extensions"/>)

source: In the sections that follow, we will discuss how you can extend the <productname>PostgreSQL</productname> <acronym>SQL</acronym> query language by adding: <placeholder-1/>
ru: В следующих разделах мы обсудим, как в <productname>PostgreSQL</productname> можно расширять язык запросов SQL, добавляя собственные: <placeholder-1/>

source: How Extensibility Works
ru: Как реализована расширяемость

source: <productname>PostgreSQL</productname> is extensible because its operation is catalog-driven. If you are familiar with standard relational database systems, you know that they store information about databases, tables, columns, etc., in what are commonly known as system catalogs. (Some systems call this the data dictionary.) The catalogs appear to the user as tables like any other, but the <acronym>DBMS</acronym> stores its internal bookkeeping in them. One key difference between <productname>PostgreSQL</productname> and standard relational database systems is that <productname>PostgreSQL</productname> stores much more information in its catalogs: not only information about tables and columns, but also information about data types, functions, access methods, and so on. These tables can be modified by the user, and since <productname>PostgreSQL</productname> bases its operation on these tables, this means that <productname>PostgreSQL</productname> can be extended by users. By comparison, conventional database systems can only be extended by changing hardcoded procedures in the source code or by loading modules specially written by the <acronym>DBMS</acronym> vendor.
ru: <productname>PostgreSQL</productname> является расширяемым благодаря тому, что его работа управляется каталогами. Если вы знакомы с традиционными реляционными системами баз данных, вы знаете, что они хранят информацию о базах, таблицах, столбцах и т. д., в структурах, которые обычно называются системными каталогами. (В некоторых системах они называются словарями данных.) Эти каталоги представляются пользователю в виде таблиц, подобных любым другим, но <acronym>СУБД</acronym> ведёт в них свои внутренние записи. Ключевое отличие <productname>PostgreSQL</productname> от обычных реляционных СУБД состоит в том, что <productname>PostgreSQL</productname> хранит в этих каталогах намного больше информации: информацию не только о таблицах и столбцах, но также о типах данных, функциях, методах доступа и т. д. Эти таблицы могут быть изменены пользователями, а так как <productname>PostgreSQL</productname> в своих действиях руководствуется этими таблицами, это означает, что пользователи могут расширять <productname>PostgreSQL</productname>. Обычные же СУБД можно расширять, только модифицируя жёстко запрограммированные процедуры в исходном коде или загружая модули, специально разработанные производителем <acronym>СУБД</acronym>.

source: The <productname>PostgreSQL</productname> server can moreover incorporate user-written code into itself through dynamic loading. That is, the user can specify an object code file (e.g., a shared library) that implements a new type or function, and <productname>PostgreSQL</productname> will load it as required. Code written in <acronym>SQL</acronym> is even more trivial to add to the server. This ability to modify its operation <quote>on the fly</quote> makes <productname>PostgreSQL</productname> uniquely suited for rapid prototyping of new applications and storage structures.
ru: Кроме того, сервер <productname>PostgreSQL</productname> может динамически загружать в свой процесс код, написанный пользователем. То есть, пользователь может подключить файл с объектным кодом (например, разделяемую библиотеку), который реализует новый тип или функцию, а <productname>PostgreSQL</productname> загрузит его по мере надобности. Код, написанный на <acronym>SQL</acronym>, добавляется на сервер ещё проще. Эта способность менять своё поведение <quote>на лету</quote> делает <productname>PostgreSQL</productname> исключительно подходящим для быстрого прототипирования новых приложений и структур хранения.

source: The <productname>PostgreSQL</productname> Type System
ru: Система типов <productname>PostgreSQL</productname>

source: <primary>base type</primary>
ru: <primary>базовый тип</primary>

source: <primary>data type</primary><secondary>base</secondary>
ru: <primary>тип данных</primary><secondary>базовый</secondary>

source: <primary>composite type</primary>
ru: <primary>составной тип</primary>

source: <primary>data type</primary><secondary>composite</secondary>
ru: <primary>тип данных</primary><secondary>составной</secondary>

source: <productname>PostgreSQL</productname> data types are divided into base types, composite types, domains, and pseudo-types.
ru: Типы данных <productname>PostgreSQL</productname> делятся на базовые, составные, доменные и псевдотипы.

source: Base Types
ru: Базовые типы

source: Base types are those, like <type>int4</type>, that are implemented below the level of the <acronym>SQL</acronym> language (typically in a low-level language such as C). They generally correspond to what are often known as abstract data types. <productname>PostgreSQL</productname> can only operate on such types through functions provided by the user and only understands the behavior of such types to the extent that the user describes them. Base types are further subdivided into scalar and array types. For each scalar type, a corresponding array type is automatically created that can hold variable-size arrays of that scalar type.
ru: Базовые типы — это типы вроде <type>int4</type>, которые реализуются ниже уровня языка <acronym>SQL</acronym> (обычно на низкоуровневом языке, например, C). В общих чертах они соответствуют так называемым абстрактным типам данных. <productname>PostgreSQL</productname> может работать с такими типами только через функции, предоставленные пользователем, и понимать их поведение только в той степени, в какой его опишет пользователь. Базовые типы подразделяются на скалярные типы и массивы. Для каждого скалярного типа автоматически создаётся тип массива, который может содержать множество значений этого скалярного типа переменного размера.

source: Composite Types
ru: Составные типы

source: Composite types, or row types, are created whenever the user creates a table. It is also possible to use <xref linkend="sql-createtype"/> to define a <quote>stand-alone</quote> composite type with no associated table. A composite type is simply a list of types with associated field names. A value of a composite type is a row or record of field values. The user can access the component fields from <acronym>SQL</acronym> queries. Refer to <xref linkend="rowtypes"/> for more information on composite types.
ru: Составные типы, или типы строк, образуются при создании любой таблицы. С помощью команды <xref linkend="sql-createtype"/> также можно определить <quote>независимый</quote> составной тип, не связанный с таблицей. Составной тип представляет собой просто список типов с определёнными именами полей. Значением составного типа является строка таблицы или запись из значений полей. Пользователь может обращаться к этим полям из запросов <acronym>SQL</acronym>. За дополнительными сведениями о составных типах обратитесь к <xref remap="3" linkend="rowtypes"/>.

source: Domains
ru: Домены

source: A domain is based on a particular base type and for many purposes is interchangeable with its base type. However, a domain can have constraints that restrict its valid values to a subset of what the underlying base type would allow.
ru: Домен основывается на определённом базовом типе и во многих аспектах взаимозаменяем с ним. Однако домен может иметь дополнительные ограничения, уменьшающие множество допустимых значений относительно нижележащего базового типа.

source: Domains can be created using the <acronym>SQL</acronym> command <xref linkend="sql-createdomain"/>. Their creation and use is not discussed in this chapter.
ru: Доменные типы можно создавать, используя <acronym>SQL</acronym>-команду <xref linkend="sql-createdomain"/>. Их создание и применение в этой главе не рассматривается.

source: Pseudo-Types
ru: Псевдотипы

source: There are a few <quote>pseudo-types</quote> for special purposes. Pseudo-types cannot appear as columns of tables or attributes of composite types, but they can be used to declare the argument and result types of functions. This provides a mechanism within the type system to identify special classes of functions. <xref linkend="datatype-pseudotypes-table"/> lists the existing pseudo-types.
ru: Для специальных целей существует также несколько <quote>псевдотипов</quote>. Псевдотипы не могут применяться в столбцах таблицы или атрибутах составных типов, но их можно использовать в объявлениях аргументов и результатов функций. Это даёт возможность выделить в системе типов специальные классы функций. Все существующие псевдотипы перечислены в <xref remap="6" linkend="datatype-pseudotypes-table"/>.

source: Polymorphic Types
ru: Полиморфные типы

source: <primary>polymorphic type</primary>
ru: <primary>полиморфный тип</primary>

source: <primary>polymorphic function</primary>
ru: <primary>полиморфная функция</primary>

source: <primary>type</primary><secondary>polymorphic</secondary>
ru: <primary>тип</primary><secondary>полиморфный</secondary>

source: <primary>function</primary><secondary>polymorphic</secondary>
ru: <primary>функция</primary><secondary>полиморфная</secondary>

source: Five pseudo-types of special interest are <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type>, and <type>anyrange</type>, which are collectively called <firstterm>polymorphic types</firstterm>. Any function declared using these types is said to be a <firstterm>polymorphic function</firstterm>. A polymorphic function can operate on many different data types, with the specific data type(s) being determined by the data types actually passed to it in a particular call.
ru: Особый интерес представляют пять псевдотипов: <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type> и <type>anyrange</type>, которые называются <firstterm>полиморфными типами</firstterm>. Функция, в объявлении которой используются эти типы, называется <firstterm>полиморфной</firstterm>. Полиморфная функция может работать со множеством различных типов данных; конкретный тип определяется в зависимости от значения, переданного при вызове.

source: Polymorphic arguments and results are tied to each other and are resolved to a specific data type when a query calling a polymorphic function is parsed. Each position (either argument or return value) declared as <type>anyelement</type> is allowed to have any specific actual data type, but in any given call they must all be the <emphasis>same</emphasis> actual type. Each position declared as <type>anyarray</type> can have any array data type, but similarly they must all be the same type. And similarly, positions declared as <type>anyrange</type> must all be the same range type. Furthermore, if there are positions declared <type>anyarray</type> and others declared <type>anyelement</type>, the actual array type in the <type>anyarray</type> positions must be an array whose elements are the same type appearing in the <type>anyelement</type> positions. Similarly, if there are positions declared <type>anyrange</type> and others declared <type>anyelement</type>, the actual range type in the <type>anyrange</type> positions must be a range whose subtype is the same type appearing in the <type>anyelement</type> positions. <type>anynonarray</type> is treated exactly the same as <type>anyelement</type>, but adds the additional constraint that the actual type must not be an array type. <type>anyenum</type> is treated exactly the same as <type>anyelement</type>, but adds the additional constraint that the actual type must be an enum type.
ru: Полиморфные аргументы и результаты связываются друг с другом и сводятся к определённому типу данных при разборе запроса, вызывающего полиморфную функцию. В каждой позиции (в аргументах или возвращаемом значении), объявленной как <type>anyelement</type>, может передаваться любой фактический тип данных, но в каждом конкретном вызове все эти фактические типы должны быть <emphasis>одинаковыми</emphasis>. Аналогичным образом, в каждой позиции, объявленной как <type>anyarray</type>, может передаваться любой тип данных массива, но все фактические типы массивов должны совпадать. Так же и во всех позициях, объявленных как <type>anyrange</type>, должен передаваться одинаковый тип-диапазон. Более того, если некоторые позиции объявлены как <type>anyarray</type>, а другие как <type>anyelement</type>, то фактическим типом в позициях <type>anyarray</type> должен быть массив, элементы которого имеют тот же тип, что и значения в позициях <type>anyelement</type>. Подобным образом, если одни позиции объявлены как <type>anyrange</type>, а другие как <type>anyelement</type>, фактическим типом в позициях <type>anyrange</type> должен быть диапазон, подтип которого совпадает с типом, передаваемым в позициях <type>anyelement</type>. Псевдотип <type>anynonarray</type> обрабатывается так же, как <type>anyelement</type>, но с дополнительным ограничением — фактический тип не должен быть типом массива. Псевдотип <type>anyenum</type> тоже обрабатывается как <type>anyelement</type>, но его фактические типы ограничиваются перечислениями.

source: Thus, when more than one argument position is declared with a polymorphic type, the net effect is that only certain combinations of actual argument types are allowed. For example, a function declared as <literal>equal(anyelement, anyelement)</literal> will take any two input values, so long as they are of the same data type.
ru: Таким образом, когда с полиморфным типом объявлено несколько аргументов, в итоге допускаются только определённые комбинации фактических типов. Например, функция, объявленная как <literal>equal(anyelement, anyelement)</literal>, примет в аргументах любые два значения, но только если их типы данных совпадают.

source: When the return value of a function is declared as a polymorphic type, there must be at least one argument position that is also polymorphic, and the actual data type supplied as the argument determines the actual result type for that call. For example, if there were not already an array subscripting mechanism, one could define a function that implements subscripting as <literal>subscript(anyarray, integer) returns anyelement</literal>. This declaration constrains the actual first argument to be an array type, and allows the parser to infer the correct result type from the actual first argument's type. Another example is that a function declared as <literal>f(anyarray) returns anyenum</literal> will only accept arrays of enum types.
ru: Когда с полиморфным типом объявлено возвращаемое значение функции, так же полиморфным должен быть минимум один аргумент, и фактический тип результата при конкретном вызове определится по типу фактически переданного аргумента. Например, если бы отсутствовал механизм обращения к элементам массива, его можно было бы реализовать, создав функцию <literal>subscript(anyarray, integer) returns anyelement</literal>. С таким объявлением первым фактическим аргументом должен быть массив, и из него будет выведен правильный тип результата при разборе запроса. В качестве другого примера можно привести функцию <literal>f(anyarray) returns anyenum</literal>, которая будет принимать только массивы перечислений.

source: Note that <type>anynonarray</type> and <type>anyenum</type> do not represent separate type variables; they are the same type as <type>anyelement</type>, just with an additional constraint. For example, declaring a function as <literal>f(anyelement, anyenum)</literal> is equivalent to declaring it as <literal>f(anyenum, anyenum)</literal>: both actual arguments have to be the same enum type.
ru: Заметьте, что <type>anynonarray</type> и <type>anyenum</type> представляют не отдельные типы переменных; это те же типы, что и <type>anyelement</type>, но с дополнительными ограничениями. Например, объявление функции <literal>f(anyelement, anyenum)</literal> равнозначно объявлению <literal>f(anyenum, anyenum)</literal>: оба фактических аргумента должны быть одинаковыми типами-перечислениями.

source: A variadic function (one taking a variable number of arguments, as in <xref linkend="xfunc-sql-variadic-functions"/>) can be polymorphic: this is accomplished by declaring its last parameter as <literal>VARIADIC</literal> <type>anyarray</type>. For purposes of argument matching and determining the actual result type, such a function behaves the same as if you had written the appropriate number of <type>anynonarray</type> parameters.
ru: Функции с переменным числом аргументом (описанные в <xref remap="6" linkend="xfunc-sql-variadic-functions"/>) тоже могут полиморфными: для этого их последний параметр описывается как <literal>VARIADIC</literal> <type>anyarray</type>. Для целей сопоставления аргументов и определения фактического типа результата такая функция представляется так же, как если бы в ней явно объявлялось нужное число параметров <type>anynonarray</type>.

source: Packaging Related Objects into an Extension
ru: Упаковывание связанных объектов в расширение

source: <primary>extension</primary>
ru: <primary>расширение</primary>

source: A useful extension to <productname>PostgreSQL</productname> typically includes multiple SQL objects; for example, a new data type will require new functions, new operators, and probably new index operator classes. It is helpful to collect all these objects into a single package to simplify database management. <productname>PostgreSQL</productname> calls such a package an <firstterm>extension</firstterm>. To define an extension, you need at least a <firstterm>script file</firstterm> that contains the <acronym>SQL</acronym> commands to create the extension's objects, and a <firstterm>control file</firstterm> that specifies a few basic properties of the extension itself. If the extension includes C code, there will typically also be a shared library file into which the C code has been built. Once you have these files, a simple <xref linkend="sql-createextension"/> command loads the objects into your database.
ru: Полезное расширение <productname>PostgreSQL</productname> обычно включает несколько объектов SQL; например, с появлением нового типа данных могут потребоваться новые функции, новые операторы и новые классы операторов. Все эти объекты удобно собрать в один пакет, с тем чтобы упростить управление базой данных. В <productname>PostgreSQL</productname> такие пакеты называются <firstterm>расширениями</firstterm>. Чтобы определить расширение, вам понадобится как минимум <firstterm>файл скрипта</firstterm> с командами <acronym>SQL</acronym>, создающими объекты расширения, и <firstterm>управляющий файл</firstterm>, в котором определяются несколько базовых свойств самого расширения. Если расширение написано на C, в него обычно также включается файл разделяемой библиотеки, содержащий скомпилированный код. Обеспечив наличие этих файлов, загрузить их в базу данных можно простой командой <xref linkend="sql-createextension"/>.

source: The main advantage of using an extension, rather than just running the <acronym>SQL</acronym> script to load a bunch of <quote>loose</quote> objects into your database, is that <productname>PostgreSQL</productname> will then understand that the objects of the extension go together. You can drop all the objects with a single <xref linkend="sql-dropextension"/> command (no need to maintain a separate <quote>uninstall</quote> script). Even more useful, <application>pg_dump</application> knows that it should not dump the individual member objects of the extension &mdash; it will just include a <command>CREATE EXTENSION</command> command in dumps, instead. This vastly simplifies migration to a new version of the extension that might contain more or different objects than the old version. Note however that you must have the extension's control, script, and other files available when loading such a dump into a new database.
ru: Основное преимущество расширений по сравнению с обычным <acronym>SQL</acronym>-скриптом, загружающим множество <quote>разрозненных</quote> объектов в базу данных, состоит в том, что <productname>PostgreSQL</productname> будет понимать, что объекты расширения связаны вместе. Вы можете удалить все объекты одной командой <xref linkend="sql-dropextension"/> (разрабатывать отдельный скрипт <quote>uninstall</quote> не требуется). Ещё полезнее то, что утилита <application>pg_dump</application> знает, что не нужно выгружать отдельные объекты, составляющие расширение &mdash; вместо этого она просто включит в архивный файл команду <command>CREATE EXTENSION</command>. Это кардинально упрощает миграцию на новую версию расширения, которая может содержать новые или другие объекты по сравнению с предыдущей версией. Заметьте, однако, что при загрузке такого архива в базу данных обязательно наличие скрипта, управляющего файла и других файлов расширения.

source: <productname>PostgreSQL</productname> will not let you drop an individual object contained in an extension, except by dropping the whole extension. Also, while you can change the definition of an extension member object (for example, via <command>CREATE OR REPLACE FUNCTION</command> for a function), bear in mind that the modified definition will not be dumped by <application>pg_dump</application>. Such a change is usually only sensible if you concurrently make the same change in the extension's script file. (But there are special provisions for tables containing configuration data; see below.)
ru: <productname>PostgreSQL</productname> не позволит удалить отдельный объект, содержащийся в расширении, кроме как при удалении всего расширения. Также имейте в виду, что вы можете изменить определение объекта, относящегося к расширению (например, командой <command>CREATE OR REPLACE FUNCTION</command> для функции), но изменённое определение не будет выгружено утилитой <application>pg_dump</application>. Такие изменения обычно разумны, только если они параллельно отражаются в файле скрипта расширения. (Для таблиц, содержащих конфигурационные данные, предусмотрены специальные средства; см. ниже.)
