Repository: pluzanov/pg-doc-ru
Catalog: 9.6/extend.po
Languages: ru

source: The target schema is determined by the <varname>schema</varname> parameter in the control file if that is given, otherwise by the <literal>SCHEMA</literal> option of <command>CREATE EXTENSION</command> if that is given, otherwise the current default object creation schema (the first one in the caller's <varname>search_path</varname>). When the control file <varname>schema</varname> parameter is used, the target schema will be created if it doesn't already exist, but in the other two cases it must already exist.
ru: Целевая схема определяется параметром <varname>schema</varname> (если он задан) в управляющем файле, либо указанием <literal>SCHEMA</literal> команды <command>CREATE EXTENSION</command> (если оно присутствует), а в противном случае выбирается текущая схема для создания объектов по умолчанию (первая указанная в параметре <varname>search_path</varname> вызывающего). Когда используется параметр управляющего файла <varname>schema</varname>, целевая схема будет создана, если она ещё не существует, но в двух других случаях она должна уже существовать.

source: If any prerequisite extensions are listed in <varname>requires</varname> in the control file, their target schemas are appended to the initial setting of <varname>search_path</varname>. This allows their objects to be visible to the new extension's script file.
ru: Если в параметре <varname>requires</varname> в файле управления указаны какие-либо расширения, необходимые для данного, их целевые схемы добавляются к начальному значению <varname>search_path</varname>. Благодаря этому, их объекты видны для скрипта нового расширения.

source: Although a non-relocatable extension can contain objects spread across multiple schemas, it is usually desirable to place all the objects meant for external use into a single schema, which is considered the extension's target schema. Such an arrangement works conveniently with the default setting of <varname>search_path</varname> during creation of dependent extensions.
ru: Хотя неперемещаемое расширение может содержать объекты, распределяемые по нескольким схемам, обычно желательно поместить все объекты, предназначенные для внешнего использования, в одну схему, назначенную целевой схемой расширения. Такой порядок будет хорошо согласовываться со значением <varname>search_path</varname> по умолчанию в процессе создания зависимых расширений.

source: Extension Configuration Tables
ru: Конфигурационные таблицы расширений

source: Some extensions include configuration tables, which contain data that might be added or changed by the user after installation of the extension. Ordinarily, if a table is part of an extension, neither the table's definition nor its content will be dumped by <application>pg_dump</application>. But that behavior is undesirable for a configuration table; any data changes made by the user need to be included in dumps, or the extension will behave differently after a dump and reload.
ru: Некоторые расширения включают конфигурационные таблицы, содержащие данные, которые могут быть добавлены или изменены пользователем после установки расширения. Обычно, если таблица является частью расширения, ни определение таблицы, ни её содержимое не будет выгружаться утилитой <application>pg_dump</application>. Но это поведение нежелательно для конфигурационных таблиц — изменения, внесённые в них пользователем, должны выгружаться; в противном случае расширение будет вести себя по-другому, когда будет загружено вновь.

source: To solve this problem, an extension's script file can mark a table or a sequence it has created as a configuration relation, which will cause <application>pg_dump</application> to include the table's or the sequence's contents (not its definition) in dumps. To do that, call the function <function>pg_extension_config_dump(regclass, text)</function> after creating the table or the sequence, for example <placeholder-1/> Any number of tables or sequences can be marked this way. Sequences associated with <type>serial</type> or <type>bigserial</type> columns can be marked as well.
ru: Чтобы решить эту проблему, скрипт расширения может пометить созданную им таблицу или последовательность как конфигурационное отношение, в результате чего <application>pg_dump</application> включит в выгружаемые данные содержимое (но не определение) этой таблицы или последовательности. Для этого нужно вызвать функцию <function>pg_extension_config_dump(regclass, text)</function> после создания таблицы или последовательности, например так: <placeholder-1/> Так можно пометить любое число таблиц или последовательностей, в том числе последовательности, связанные со столбцами <type>serial</type> или <type>bigserial</type>.

source: When the second argument of <function>pg_extension_config_dump</function> is an empty string, the entire contents of the table are dumped by <application>pg_dump</application>. This is usually only correct if the table is initially empty as created by the extension script. If there is a mixture of initial data and user-provided data in the table, the second argument of <function>pg_extension_config_dump</function> provides a <literal>WHERE</literal> condition that selects the data to be dumped. For example, you might do <placeholder-1/> and then make sure that <structfield>standard_entry</structfield> is true only in the rows created by the extension's script.
ru: Когда второй аргумент <function>pg_extension_config_dump</function> — пустая строка, <application>pg_dump</application> выгружает всё содержимое таблицы. Обычно это правильно, только если после создания скриптом расширения эта таблица изначально пуста. Если же в таблице оказывается смесь начальных данных и данных, добавленных пользователем, во втором аргументе <function>pg_extension_config_dump</function> передаётся условие <literal>WHERE</literal>, которое отфильтровывает данные, подлежащие выгрузке. Например, имея таблицу, созданную таким образом: <placeholder-1/> можно сделать так, чтобы поле <structfield>standard_entry</structfield> содержало true только для строк, создаваемых скриптом расширения.

source: For sequences, the second argument of <function>pg_extension_config_dump</function> has no effect.
ru: Для последовательностей второй аргумент функции <function>pg_extension_config_dump</function> не имеет значения.

source: More complicated situations, such as initially-provided rows that might be modified by users, can be handled by creating triggers on the configuration table to ensure that modified rows are marked correctly.
ru: В более сложных ситуациях, когда пользователи могут модифицировать и изначально существовавшие строки, можно создать триггеры для конфигурационной таблицы, которые корректно пометят изменённые строки.

source: You can alter the filter condition associated with a configuration table by calling <function>pg_extension_config_dump</function> again. (This would typically be useful in an extension update script.) The only way to mark a table as no longer a configuration table is to dissociate it from the extension with <command>ALTER EXTENSION ... DROP TABLE</command>.
ru: Условие фильтра, связанное с конфигурационной таблицей, можно изменить, повторно вызвав <function>pg_extension_config_dump</function>. (Обычно это находит применение в скрипте обновления расширения.) Единственный способ обозначить, что некоторая таблица более не является конфигурационной — разорвать её связь с расширением командой <command>ALTER EXTENSION ... DROP TABLE</command>.

source: Note that foreign key relationships between these tables will dictate the order in which the tables are dumped out by pg_dump. Specifically, pg_dump will attempt to dump the referenced-by table before the referencing table. As the foreign key relationships are set up at CREATE EXTENSION time (prior to data being loaded into the tables) circular dependencies are not supported. When circular dependencies exist, the data will still be dumped out but the dump will not be able to be restored directly and user intervention will be required.
ru: Заметьте, что отношения внешних ключей между таблицами определяют порядок, в котором эти таблицы будет выгружать pg_dump. В частности, pg_dump попытается выгрузить сначала основную таблицу, а затем подчинённую. Так как отношения внешних ключей устанавливаются во время выполнения CREATE EXTENSION (до загрузки данных в таблицы), циклические зависимости не поддерживаются. Когда образуются циклические зависимости, данные, тем не менее, будут выгружены, но полученный архив нельзя будет восстановить обычным образом, потребуется вмешательство пользователя.

source: Sequences associated with <type>serial</type> or <type>bigserial</type> columns need to be directly marked to dump their state. Marking their parent relation is not enough for this purpose.
ru: Последовательности, связанные со столбцами <type>serial</type> или <type>bigserial</type>, не обязательно помечать непосредственно, чтобы их состояние было сохранено. Для этой цели достаточно пометить только их родительское отношение.

source: Extension Updates
ru: Обновление расширений

source: One advantage of the extension mechanism is that it provides convenient ways to manage updates to the SQL commands that define an extension's objects. This is done by associating a version name or number with each released version of the extension's installation script. In addition, if you want users to be able to update their databases dynamically from one version to the next, you should provide <firstterm>update scripts</firstterm> that make the necessary changes to go from one version to the next. Update scripts have names following the pattern <literal><replaceable>extension</replaceable>--<replaceable>oldversion</replaceable>--<replaceable>newversion</replaceable>.sql</literal> (for example, <literal>foo--1.0--1.1.sql</literal> contains the commands to modify version <literal>1.0</literal> of extension <literal>foo</literal> into version <literal>1.1</literal>).
ru: Один из плюсов механизма расширений заключается в том, что он предоставляет удобные способы управления обновлениями SQL-команд, определяющих объекты расширения. В частности, каждой выпускаемой версии установочного скрипта расширения назначается имя или номер версии. Кроме того, если вы хотите, чтобы пользователи могли динамически обновлять одну версию расширения до другой, вы должны предоставить <firstterm>скрипты обновления</firstterm>, которые внесут необходимые изменения для перехода от старой версии к новой. Скриптам обновлений назначаются имена, соответствующие шаблону <literal><replaceable>расширение</replaceable>--<replaceable>старая_версия</replaceable>--<replaceable>новая_версия</replaceable>.sql</literal> (например, <literal>foo--1.0--1.1.sql</literal> будет содержать команды, меняющие версию <literal>1.0</literal> расширения <literal>foo</literal> на версию <literal>1.1</literal>).

source: Given that a suitable update script is available, the command <command>ALTER EXTENSION UPDATE</command> will update an installed extension to the specified new version. The update script is run in the same environment that <command>CREATE EXTENSION</command> provides for installation scripts: in particular, <varname>search_path</varname> is set up in the same way, and any new objects created by the script are automatically added to the extension.
ru: С условием, что имеется подходящий скрипт расширения, команда <command>ALTER EXTENSION UPDATE</command> обновит установленное расширение до указанной новой версии. Скрипт обновления запускается в том же окружении, которое организует команда <command>CREATE EXTENSION</command> для установочных скриптов: в частности, <varname>search_path</varname> устанавливается таким же образом, а любые новые объекты, созданные скриптом, автоматически добавляются в расширение.

source: If an extension has secondary control files, the control parameters that are used for an update script are those associated with the script's target (new) version.
ru: Если у расширения есть дополнительные управляющие файлы, для скрипта обновления применяются те параметры, которые связаны с целевой (новой) версией скрипта.

source: The update mechanism can be used to solve an important special case: converting a <quote>loose</quote> collection of objects into an extension. Before the extension mechanism was added to <productname>PostgreSQL</productname> (in 9.1), many people wrote extension modules that simply created assorted unpackaged objects. Given an existing database containing such objects, how can we convert the objects into a properly packaged extension? Dropping them and then doing a plain <command>CREATE EXTENSION</command> is one way, but it's not desirable if the objects have dependencies (for example, if there are table columns of a data type created by the extension). The way to fix this situation is to create an empty extension, then use <command>ALTER EXTENSION ADD</command> to attach each pre-existing object to the extension, then finally create any new objects that are in the current extension version but were not in the unpackaged release. <command>CREATE EXTENSION</command> supports this case with its <literal>FROM</literal> <replaceable class="parameter">old_version</replaceable> option, which causes it to not run the normal installation script for the target version, but instead the update script named <literal><replaceable>extension</replaceable>--<replaceable>old_version</replaceable>--<replaceable>target_version</replaceable>.sql</literal>. The choice of the dummy version name to use as <replaceable class="parameter">old_version</replaceable> is up to the extension author, though <literal>unpackaged</literal> is a common convention. If you have multiple prior versions you need to be able to update into extension style, use multiple dummy version names to identify them.
ru: Механизм обновления может использоваться для решения важной особой задачи: преобразование <quote>разрозненной</quote> коллекции объектов в расширение. До того как механизм расширений появился в <productname>PostgreSQL</productname> (в версии 9.1), многие писали модули разрешений, которые просто создавали множество неупакованных объектов. Но если у нас уже есть база данных с такими объектами, как их можно преобразовать в правильно упакованное расширение? Один из вариантов — удалить их и затем выполнить простую команду <command>CREATE EXTENSION</command>, но это нежелательно, если у объектов есть зависимости (например, если в таблицах есть столбцы типа данных, созданного расширением). Чтобы исправить эту ситуацию, можно создать пустое расширение, затем с помощью команды <command>ALTER EXTENSION ADD</command> добавить в него каждый существующий объект, и наконец, создать все новые объекты, которые есть в текущей версии расширения, но отсутствуют в неупакованном варианте. <command>CREATE EXTENSION</command> поддерживает этот сценарий предложением <literal>FROM</literal> <replaceable class="parameter">старая_версия</replaceable>, с которым она не будет запускать обычный установочный скрипт для целевой версии, а запустит вместо этого скрипт обновления с именем <literal><replaceable>расширение</replaceable>--<replaceable>старая_версия</replaceable>--<replaceable>новая_версия</replaceable>.sql</literal>. В качестве имени <replaceable class="parameter">старая_версия</replaceable> автор расширения может выбрать любое фиктивное имя, но обычно задаётся <literal>unpackaged</literal>. Если у вас несколько предыдущих версий, которые нужно привести к стилю расширения, выберите разные фиктивные имена версий, чтобы различить их.

source: <command>ALTER EXTENSION</command> is able to execute sequences of update script files to achieve a requested update. For example, if only <literal>foo--1.0--1.1.sql</literal> and <literal>foo--1.1--2.0.sql</literal> are available, <command>ALTER EXTENSION</command> will apply them in sequence if an update to version <literal>2.0</literal> is requested when <literal>1.0</literal> is currently installed.
ru: <command>ALTER EXTENSION</command> также может выполнять последовательности скриптов обновления для получения запрошенной версии. Например, если имеются только скрипты <literal>foo--1.0--1.1.sql</literal> и <literal>foo--1.1--2.0.sql</literal>, <command>ALTER EXTENSION</command> будет применять их по порядку, если при установленной версии <literal>1.0</literal> запрошено обновлении до версии <literal>2.0</literal>.

source: <productname>PostgreSQL</productname> doesn't assume anything about the properties of version names: for example, it does not know whether <literal>1.1</literal> follows <literal>1.0</literal>. It just matches up the available version names and follows the path that requires applying the fewest update scripts. (A version name can actually be any string that doesn't contain <literal>--</literal> or leading or trailing <literal>-</literal>.)
ru: <productname>PostgreSQL</productname> не делает никаких предположений о свойствах имён версий: например, он не знает, следует ли версия <literal>1.1</literal> за <literal>1.0</literal>. Он просто сопоставляет имена имеющихся версий и следует пути, который требует применить как можно меньше скриптов обновлений. (Именем версии на самом деле может быть любая строка, которая не содержит <literal>--</literal> и при этом не начинается и не заканчивается символом <literal>-</literal>.)

source: Sometimes it is useful to provide <quote>downgrade</quote> scripts, for example <literal>foo--1.1--1.0.sql</literal> to allow reverting the changes associated with version <literal>1.1</literal>. If you do that, be careful of the possibility that a downgrade script might unexpectedly get applied because it yields a shorter path. The risky case is where there is a <quote>fast path</quote> update script that jumps ahead several versions as well as a downgrade script to the fast path's start point. It might take fewer steps to apply the downgrade and then the fast path than to move ahead one version at a time. If the downgrade script drops any irreplaceable objects, this will yield undesirable results.
ru: Иногда бывают полезны скрипты <quote>понижения версии</quote>, например, <literal>foo--1.1--1.0.sql</literal>, которые позволяют откатить изменения, связанные с версией <literal>1.1</literal>. Если вы применяете их, учтите, что есть вероятность неожиданного выполнения такого скрипта, если он окажется в кратчайшем пути. Рискованная ситуация возникает при наличии скрипта обновления по <quote>короткому пути</quote>, который перепрыгивает через несколько версий, и скрипта понижения версии до начальной точки первого скрипта. В результате может получиться так, что понижение версии с последующим обновлением по короткому пути окажется на несколько шагов короче, чем последовательное повышение версии. Если скрипт понижения версии удаляет какие-либо незаменимые объекты, это может привести к нежелательным результатам.

source: SELECT * FROM pg_extension_update_paths('<replaceable>extension_name</replaceable>');
ru: SELECT * FROM pg_extension_update_paths('<replaceable>имя_расширения</replaceable>');

source: To check for unexpected update paths, use this command: <placeholder-1/> This shows each pair of distinct known version names for the specified extension, together with the update path sequence that would be taken to get from the source version to the target version, or <literal>NULL</literal> if there is no available update path. The path is shown in textual form with <literal>--</literal> separators. You can use <literal>regexp_split_to_array(path,'--')</literal> if you prefer an array format.
ru: Чтобы убедиться, что при обновлении не будет выбран нежелательный путь, воспользуйтесь этой командой: <placeholder-1/> Она показывает каждую пару различных известных имён версий для указанного расширения, вместе с последовательностью обновления, которая будет выбрана для перехода от одной версии к другой, либо <literal>NULL</literal>, если путь обновления не находится. Путь выводится в текстовом виде с разделителями <literal>--</literal>. Если вы предпочитаете формат массива, вы можете применить <literal>regexp_split_to_array(path,'--')</literal>.

source: Extension Example
ru: Пример расширения

source: Here is a complete example of an <acronym>SQL</acronym>-only extension, a two-element composite type that can store any type of value in its slots, which are named <quote>k</quote> and <quote>v</quote>. Non-text values are automatically coerced to text for storage.
ru: Здесь представлен полный пример расширения, в котором средствами исключительно <acronym>SQL</acronym> реализуется составной тип с двумя элементами, который может сохранить в своих слотах значения любого типа, названные <quote>k</quote> и <quote>v</quote>. Для хранения все значения переводятся в текстовый формат (если они имеют другой формат).

source: The script file <filename>pair--1.0.sql</filename> looks like this: <placeholder-1/>
ru: Файл скрипта <filename>pair--1.0.sql</filename> выглядит так: <placeholder-1/>

source: The control file <filename>pair.control</filename> looks like this: <placeholder-1/>
ru: Управляющий файл <filename>pair.control</filename> выглядит так: <placeholder-1/>

source: While you hardly need a makefile to install these two files into the correct directory, you could use a <filename>Makefile</filename> containing this: <placeholder-1/> This makefile relies on <acronym>PGXS</acronym>, which is described in <xref linkend="extend-pgxs"/>. The command <literal>make install</literal> will install the control and script files into the correct directory as reported by <application>pg_config</application>.
ru: Хотя вам вряд ли понадобится сборочный файл, только для того, чтобы установить эти два файла в нужный каталог, вы можете использовать <filename>Makefile</filename> следующего содержания: <placeholder-1/> Этот Makefile опирается на инфраструктуру <acronym>PGXS</acronym>, которая описывается в <xref remap="6" linkend="extend-pgxs"/>. С ним команда <literal>make install</literal> установит управляющий файл и скрипт в правильный каталог, который определит <application>pg_config</application>.

source: Once the files are installed, use the <xref linkend="sql-createextension"/> command to load the objects into any particular database.
ru: Когда эти файлы будут установлены, выполните команду <xref linkend="sql-createextension"/>, чтобы загрузить объекты в определённую базу данных.

source: Extension Building Infrastructure
ru: Инфраструктура сборки расширений
