Repository: pluzanov/pg-doc-ru
Catalog: 9.6/extend.po
Languages: ru

source: If you are thinking about distributing your <productname>PostgreSQL</productname> extension modules, setting up a portable build system for them can be fairly difficult. Therefore the <productname>PostgreSQL</productname> installation provides a build infrastructure for extensions, called <acronym>PGXS</acronym>, so that simple extension modules can be built simply against an already installed server. <acronym>PGXS</acronym> is mainly intended for extensions that include C code, although it can be used for pure-SQL extensions too. Note that <acronym>PGXS</acronym> is not intended to be a universal build system framework that can be used to build any software interfacing to <productname>PostgreSQL</productname>; it simply automates common build rules for simple server extension modules. For more complicated packages, you might need to write your own build system.
ru: Если вы задумываетесь о распространении ваших модулей расширения <productname>PostgreSQL</productname>, знайте, что организовать для них портируемую систему сборки может быть довольно сложно. Поэтому инсталляция <productname>PostgreSQL</productname> включает инфраструктуру сборки расширений, названную <acronym>PGXS</acronym>, так что несложные модули расширений можно собрать просто в среде установленного сервера. <acronym>PGXS</acronym> предназначена в первую очередь для расширений, написанных на C, хотя её можно применять и для расширения на чистом SQL. Заметьте, что <acronym>PGXS</acronym> не претендует на роль универсальной инфраструктуры сборки, способной собрать любой программный объект, взаимодействующий с <productname>PostgreSQL</productname>; она просто автоматизирует общие правила для сборки простых модулей расширения сервера. Для более сложных пакетов вам придётся разработать собственную систему сборки.

source: To use the <acronym>PGXS</acronym> infrastructure for your extension, you must write a simple makefile. In the makefile, you need to set some variables and include the global <acronym>PGXS</acronym> makefile. Here is an example that builds an extension module named <literal>isbn_issn</literal>, consisting of a shared library containing some C code, an extension control file, a SQL script, and a documentation text file: <placeholder-1/> The last three lines should always be the same. Earlier in the file, you assign variables or add custom <application>make</application> rules.
ru: Чтобы использовать инфраструктуру <acronym>PGXS</acronym> для вашего расширения, вы должны написать простой сборочный файл. В нём вы должны установить нужные переменные и подключить глобальный сборочный файл <acronym>PGXS</acronym>. Следующий пример собирает модуль расширения с именем <literal>isbn_issn</literal>, который включает разделяемую библиотеку, написанную на C, управляющий файл расширения, SQL-скрипт и текстовый файл документации: <placeholder-1/> Последние три строки всегда должны быть такими. Выше в файле вы определяете переменные или добавляете собственные правила для <application>make</application>.

source: list of shared-library objects to be built from source files with same stem (do not include library suffixes in this list)
ru: список объектов разделяемых библиотек, которые должны быть собраны из исходных файлов с одной основой (суффиксы библиотек в этом списке не указываются)

source: a shared library to build from multiple source files (list object files in <varname>OBJS</varname>)
ru: разделяемая библиотека, которая должна быть собрана из нескольких исходных файлов (объектные файлы перечисляются в <varname>OBJS</varname>)

source: an executable program to build (list object files in <varname>OBJS</varname>)
ru: исполняемая программа, которая должна быть собрана (объектные файлы перечисляются в <varname>OBJS</varname>)

source: extension name(s); for each name you must provide an <literal><replaceable>extension</replaceable>.control</literal> file, which will be installed into <literal><replaceable>prefix</replaceable>/share/extension</literal>
ru: имена расширений(я); для каждого имени вы должны предоставить файл <literal><replaceable>расширение</replaceable>.control</literal>, который будет установлен в <literal><replaceable>префикс</replaceable>/share/extension</literal>

source: subdirectory of <literal><replaceable>prefix</replaceable>/share</literal> into which DATA and DOCS files should be installed (if not set, default is <literal>extension</literal> if <varname>EXTENSION</varname> is set, or <literal>contrib</literal> if not)
ru: подкаталог в каталоге <literal><replaceable>префикс</replaceable>/share</literal>, в который должны устанавливаться файлы DATA и DOCS (если не задан, подразумевается <literal>extension</literal>, если установлена переменная <varname>EXTENSION</varname>, или <literal>contrib</literal> в противном случае)

source: random files to install into <literal><replaceable>prefix</replaceable>/share/$MODULEDIR</literal>
ru: произвольные файлы, которые должны быть установлены в <literal><replaceable>префикс</replaceable>/share/$MODULEDIR</literal>

source: random files to install into <literal><replaceable>prefix</replaceable>/share/$MODULEDIR</literal>, which need to be built first
ru: произвольные файлы, которые должны быть сначала собраны, а затем установлены в <literal><replaceable>префикс</replaceable>/share/$MODULEDIR</literal>

source: random files to install under <literal><replaceable>prefix</replaceable>/share/tsearch_data</literal>
ru: произвольные файлы, которые должны быть установлены в <literal><replaceable>префикс</replaceable>/share/tsearch_data</literal>

source: random files to install under <literal><replaceable>prefix</replaceable>/doc/$MODULEDIR</literal>
ru: произвольные файлы, которые должны быть установлены в <literal><replaceable>префикс</replaceable>/doc/$MODULEDIR</literal>

source: script files (not binaries) to install into <literal><replaceable>prefix</replaceable>/bin</literal>
ru: скрипты (не двоичные файлы), которые должны быть установлены в <literal><replaceable>префикс</replaceable>/bin</literal>

source: script files (not binaries) to install into <literal><replaceable>prefix</replaceable>/bin</literal>, which need to be built first
ru: скрипты (не двоичные файлы), которые должны быть сначала собраны, а затем установлены в <literal><replaceable>префикс</replaceable>/bin</literal>

source: list of regression test cases (without suffix), see below
ru: список тестов регрессий (без суффикса), см. ниже

source: additional switches to pass to <application>pg_regress</application>
ru: дополнительные параметры, передаваемые <application>pg_regress</application>

source: extra files to remove in <literal>make clean</literal>
ru: дополнительные файлы, которые должны быть удалены при <literal>make clean</literal>

source: will be added to <varname>CPPFLAGS</varname>
ru: флаги, добавляемые в <varname>CPPFLAGS</varname>

source: will be added to <varname>PROGRAM</varname> link line
ru: будет добавлено в строку компоновки <varname>PROGRAM</varname>

source: will be added to <varname>MODULE_big</varname> link line
ru: будет добавлено в строку компоновки <varname>MODULE_big</varname>

source: path to <application>pg_config</application> program for the <productname>PostgreSQL</productname> installation to build against (typically just <literal>pg_config</literal> to use the first one in your <varname>PATH</varname>)
ru: путь к программе <application>pg_config</application> в инсталляции <productname>PostgreSQL</productname>, с которой будет выполняться сборка (обычно указывается просто <literal>pg_config</literal>, и используется первый экземпляр, найденный по пути в <varname>PATH</varname>)

source: Set one of these three variables to specify what is built: <placeholder-1/> The following variables can also be set: <placeholder-2/>
ru: Установите одну из этих трёх переменных, чтобы указать, что будет собрано: <placeholder-1/> Также можно установить следующие переменные: <placeholder-2/>

source: Put this makefile as <literal>Makefile</literal> in the directory which holds your extension. Then you can do <literal>make</literal> to compile, and then <literal>make install</literal> to install your module. By default, the extension is compiled and installed for the <productname>PostgreSQL</productname> installation that corresponds to the first <command>pg_config</command> program found in your <varname>PATH</varname>. You can use a different installation by setting <varname>PG_CONFIG</varname> to point to its <command>pg_config</command> program, either within the makefile or on the <literal>make</literal> command line.
ru: Поместите этот сборочный файл под именем <literal>Makefile</literal> в каталог, где находится ваше расширение. После этого выполните <literal>make</literal>, чтобы скомпилировать, а затем <literal>make install</literal>, чтобы установить ваш модуль. По умолчанию расширение компилируется и устанавливается для той инсталляции <productname>PostgreSQL</productname>, которая соответствует экземпляру <command>pg_config</command>, найденному первым при поиске по пути в <varname>PATH</varname>. Чтобы использовать другую инсталляцию, вы можете задать в <varname>PG_CONFIG</varname> путь к её экземпляру <command>pg_config</command> либо внутри сборочного файла, либо в командном файле <literal>make</literal>.

source: You can also run <literal>make</literal> in a directory outside the source tree of your extension, if you want to keep the build directory separate. This procedure is also called a <placeholder-1/><firstterm>VPATH</firstterm> build. Here's how: <placeholder-2/>
ru: Вы также можете запустить <literal>make</literal> в каталоге вне каталога исходного дерева вашего расширения, если хотите отделить каталог сборки. Эта процедура называется сборкой с <placeholder-1/><firstterm>VPATH</firstterm> и выполняется так: <placeholder-2/>

source: Alternatively, you can set up a directory for a VPATH build in a similar way to how it is done for the core code. One way to do this is using the core script <filename>config/prep_buildtree</filename>. Once this has been done you can build by setting the <literal>make</literal> variable <varname>VPATH</varname> like this: <placeholder-1/> This procedure can work with a greater variety of directory layouts.
ru: Также вы можете подготовить каталог для сборки с VPATH таким же образом, как это делается в коде ядра сервера. Как один из вариантов, для этого можно воспользоваться скриптом ядра <filename>config/prep_buildtree</filename>. Затем вы сможете выполнить сборку, установив переменную <varname>VPATH</varname> для <literal>make</literal> таким образом: <placeholder-1/> Эта процедура поддерживает самые разные расположения каталогов.

source: The scripts listed in the <varname>REGRESS</varname> variable are used for regression testing of your module, which can be invoked by <literal>make installcheck</literal> after doing <literal>make install</literal>. For this to work you must have a running <productname>PostgreSQL</productname> server. The script files listed in <varname>REGRESS</varname> must appear in a subdirectory named <literal>sql/</literal> in your extension's directory. These files must have extension <literal>.sql</literal>, which must not be included in the <varname>REGRESS</varname> list in the makefile. For each test there should also be a file containing the expected output in a subdirectory named <literal>expected/</literal>, with the same stem and extension <literal>.out</literal>. <literal>make installcheck</literal> executes each test script with <application>psql</application>, and compares the resulting output to the matching expected file. Any differences will be written to the file <literal>regression.diffs</literal> in <command>diff -c</command> format. Note that trying to run a test that is missing its expected file will be reported as <quote>trouble</quote>, so make sure you have all expected files.
ru: Скрипты, перечисленные в переменной <varname>REGRESS</varname>, используются для тестирования регрессии в вашем модуле, и вызвать их можно командой <literal>make installcheck</literal> после <literal>make install</literal>. Для проведения тестов необходим работающий сервер <productname>PostgreSQL</productname>. Файлы скриптов, перечисленные в <varname>REGRESS</varname>, должны размещаться в подкаталоге <literal>sql/</literal> каталога расширения. Эти файлы должны иметь расширение <literal>.sql</literal>, но указывать его в списке <varname>REGRESS</varname> в сборочном файле не нужно. Для каждого теста также должен создаваться файл с ожидаемым выводом в подкаталоге <literal>expected/</literal>, с тем же базовым именем и расширением <literal>.out</literal>. Команда <literal>make installcheck</literal> выполнит каждый тест в <application>psql</application> и сравнит полученный вывод с ожидаемым. Все выявленные различия будут записаны в файл <literal>regression.diffs</literal> в формате команды <command>diff -c</command>. Заметьте, что при попытке запустить тест без файла ожидаемого вывода этот тест будет отмечен как <quote>проблемный</quote>, поэтому убедитесь, что все такие файлы присутствуют.

source: The easiest way to create the expected files is to create empty files, then do a test run (which will of course report differences). Inspect the actual result files found in the <literal>results/</literal> directory, then copy them to <literal>expected/</literal> if they match what you expect from the test.
ru: Проще всего для этого создать пустые файлы ожидаемого вывода, а затем выполнить тест (при этом конечно будут выявлены несоответствия). Изучите полученные файлы результатов, сохранённые в каталоге <literal>results/</literal>, и, если они соответствуют вашим ожиданиям от теста, скопируйте их в <literal>expected/</literal>.
