Repository: pluzanov/pg-doc-ru
Catalog: 9.6/features.po
Languages: ru

source: SQL Conformance
ru: Соответствие стандарту SQL

source: This section attempts to outline to what extent <productname>PostgreSQL</productname> conforms to the current SQL standard. The following information is not a full statement of conformance, but it presents the main topics in as much detail as is both reasonable and useful for users.
ru: В этом разделе в общих чертах отмечается, в какой степени <productname>PostgreSQL</productname> соответствует текущему стандарту SQL. Следующая информация не является официальным утверждением о соответствии, а представляет только основные аспекты на уровне детализации, достаточно полезном и целесообразном для пользователей.

source: The formal name of the SQL standard is ISO/IEC 9075 <quote>Database Language SQL</quote>. A revised version of the standard is released from time to time; the most recent update appearing in 2011. The 2011 version is referred to as ISO/IEC 9075:2011, or simply as SQL:2011. The versions prior to that were SQL:2008, SQL:2003, SQL:1999, and SQL-92. Each version replaces the previous one, so claims of conformance to earlier versions have no official merit. <productname>PostgreSQL</productname> development aims for conformance with the latest official version of the standard where such conformance does not contradict traditional features or common sense. Many of the features required by the SQL standard are supported, though sometimes with slightly differing syntax or function. Further moves towards conformance can be expected over time.
ru: Формально стандарт SQL называется ISO/IEC 9075 <quote>Язык баз данных SQL</quote>. Время от времени выпускается обновлённая версия стандарта; последняя версия стандарта вышла в 2011 г. Эта версия получила обозначение ISO/IEC 9075:2011, или просто SQL:2011. До этого были выпущены версии SQL:2008, SQL:2003, SQL:1999 и SQL-92. Каждая следующая версия заменяет предыдущую, так что утверждение о совместимости с предыдущими версиями не имеет большой ценности. Разработчики <productname>PostgreSQL</productname> стремятся обеспечить совместимость с последней официальной версией стандарта, оставаясь при этом в рамках традиционной функциональности и здравого смысла. <productname>PostgreSQL</productname> реализует большую часть требуемой стандартом функциональности, хотя иногда с немного другими функциями или синтаксисом. Можно ожидать, что со временем степень совместимости будет увеличиваться.

source: <acronym>SQL-92</acronym> defined three feature sets for conformance: Entry, Intermediate, and Full. Most database management systems claiming <acronym>SQL</acronym> standard conformance were conforming at only the Entry level, since the entire set of features in the Intermediate and Full levels was either too voluminous or in conflict with legacy behaviors.
ru: <acronym>SQL-92</acronym> определяет три уровня функциональной совместимости: начальный (Entry), промежуточный (Intermediate) и полный (Full). Большинство СУБД заявляют о совместимости со стандартом <acronym>SQL</acronym> только на начальном уровне, так как полный набор возможностей на промежуточном и полном уровнях либо слишком велик, либо конфликтует с ранее принятым поведением.

source: Starting with <acronym>SQL:1999</acronym>, the SQL standard defines a large set of individual features rather than the ineffectively broad three levels found in <acronym>SQL-92</acronym>. A large subset of these features represents the <quote>Core</quote> features, which every conforming SQL implementation must supply. The rest of the features are purely optional. Some optional features are grouped together to form <quote>packages</quote>, which SQL implementations can claim conformance to, thus claiming conformance to particular groups of features.
ru: Начиная с <acronym>SQL:1999</acronym>, вместо трёх чрезмерно пространных уровней <acronym>SQL-92</acronym> в стандарте SQL определено множество отдельных функциональных возможностей. Большое его подмножество представляет <quote>Основную</quote> функциональность, которую должны обеспечивать все совместимые с SQL реализации. Поддержка остальных возможностей не является обязательной. Некоторые необязательные возможности группируются вместе, образуя <quote>пакеты</quote>, о поддержке которых могут заявлять реализации SQL, таким образом, декларируя совместимость с определённой группой возможностей.

source: ISO/IEC 9075-1 Framework (SQL/Framework)
ru: ISO/IEC 9075-1 Структура (SQL/Framework)

source: ISO/IEC 9075-2 Foundation (SQL/Foundation)
ru: ISO/IEC 9075-2 Основа (SQL/Foundation)

source: ISO/IEC 9075-3 Call Level Interface (SQL/CLI)
ru: ISO/IEC 9075-3 Интерфейс уровня вызовов (SQL/CLI)

source: ISO/IEC 9075-4 Persistent Stored Modules (SQL/PSM)
ru: ISO/IEC 9075-4 Модули постоянного хранения (SQL/PSM)

source: ISO/IEC 9075-9 Management of External Data (SQL/MED)
ru: ISO/IEC 9075-9 Управление внешними данными (SQL/MED)

source: ISO/IEC 9075-10 Object Language Bindings (SQL/OLB)
ru: ISO/IEC 9075-10 Привязки объектных языков (SQL/OLB)

source: ISO/IEC 9075-11 Information and Definition Schemas (SQL/Schemata)
ru: ISO/IEC 9075-11 Схемы информации и определений (SQL/Schemata)

source: ISO/IEC 9075-13 Routines and Types using the Java Language (SQL/JRT)
ru: ISO/IEC 9075-13 Программы и типы, использующие язык Java (SQL/JRT)

source: ISO/IEC 9075-14 XML-related specifications (SQL/XML)
ru: ISO/IEC 9075-14 Спецификации, связанные с XML (SQL/XML)

source: The standard versions beginning with <acronym>SQL:2003</acronym> are also split into a number of parts. Each is known by a shorthand name. Note that these parts are not consecutively numbered. <placeholder-1/>
ru: Описание стандарта, начиная с версии <acronym>SQL:2003</acronym>, также разделяется на несколько частей. Каждая такая часть имеет короткое имя и номер. Заметьте, что нумерация этих частей непоследовательная. <placeholder-1/>

source: The <productname>PostgreSQL</productname> core covers parts 1, 2, 9, 11, and 14. Part 3 is covered by the ODBC driver, and part 13 is covered by the PL/Java plug-in, but exact conformance is currently not being verified for these components. There are currently no implementations of parts 4 and 10 for <productname>PostgreSQL</productname>.
ru: Ядро <productname>PostgreSQL</productname> реализует части 1, 2, 9, 11 и 14. Часть 3 реализуется драйвером ODBC, а часть 13 — подключаемым расширением PL/Java, но точное соответствие этих компонентов стандарту на данный момент не проверено. Части 4 и 10 в <productname>PostgreSQL</productname> в настоящее время не реализованы.

source: PostgreSQL supports most of the major features of SQL:2011. Out of 179 mandatory features required for full Core conformance, PostgreSQL conforms to at least 160. In addition, there is a long list of supported optional features. It might be worth noting that at the time of writing, no current version of any database management system claims full conformance to Core SQL:2011.
ru: PostgreSQL поддерживает почти все основные возможности стандарта SQL:2011. Из 179 обязательных возможностей, которые требуются для полного соответствия <quote>Основной</quote> функциональности, PostgreSQL обеспечивает совместимость как минимум для 160. Кроме того, он реализует длинный список необязательных возможностей. Следует отметить, что на время написания этой документации ни одна существующая СУБД не заявила о полном соответствии <quote>Основной</quote> функциональности SQL:2011.

source: In the following two sections, we provide a list of those features that <productname>PostgreSQL</productname> supports, followed by a list of the features defined in <acronym>SQL:2011</acronym> which are not yet supported in <productname>PostgreSQL</productname>. Both of these lists are approximate: There might be minor details that are nonconforming for a feature that is listed as supported, and large parts of an unsupported feature might in fact be implemented. The main body of the documentation always contains the most accurate information about what does and does not work.
ru: В следующих двух разделах мы представляем список возможностей, которые поддерживает <productname>PostgreSQL</productname>, и список возможностей, определённых в <acronym>SQL:2011</acronym>, которые ещё не поддерживаются в <productname>PostgreSQL</productname>. Оба эти списка носят приблизительный характер: какая-то возможность, отмеченная как поддерживаемая, может отличаться от стандарта в деталях, и напротив, для какой-то неподдерживаемой возможности могут быть реализованы ключевые компоненты. Наиболее точная информация о том, что работает, а что нет, содержится в основной документации.

source: Feature codes containing a hyphen are subfeatures. Therefore, if a particular subfeature is not supported, the main feature is listed as unsupported even if some other subfeatures are supported.
ru: Коды возможностей, содержащие знак минус, обозначают подчинённые возможности. При этом, если какая-либо одна подчинённая возможность не поддерживается, основная возможность так же не будет поддерживаться, даже если реализованы все остальные на подуровне.

source: Supported Features
ru: Поддерживаемые возможности

source: Identifier
ru: Идентификатор

source: Package
ru: Пакет

source: Description
ru: Описание

source: Comment
ru: Комментарий

source: Unsupported Features
ru: Неподдерживаемые возможности

source: The following features defined in <acronym>SQL:2011</acronym> are not implemented in this release of <productname>PostgreSQL</productname>. In a few cases, equivalent functionality is available. <informaltable><tgroup cols="4"><placeholder-1/> &features-unsupported;</tgroup></informaltable>
ru: Следующие возможности, описанные в <acronym>SQL:2011</acronym>, не реализованы в этом выпуске <productname>PostgreSQL</productname>. В некоторых случая они заменяются равнозначной функциональностью <informaltable><tgroup cols="4"><placeholder-1/> &features-unsupported;</tgroup></informaltable>
