Repository: pluzanov/pg-doc-ru
Catalog: 9.6/history.po
Languages: ru

source: A Brief History of <productname>PostgreSQL</productname>
ru: Краткая история <productname>PostgreSQL</productname>

source: <primary>history</primary><secondary>of PostgreSQL</secondary>
ru: <primary>история</primary><secondary>PostgreSQL</secondary>

source: The object-relational database management system now known as <productname>PostgreSQL</productname> is derived from the <productname>POSTGRES</productname> package written at the University of California at Berkeley. With over two decades of development behind it, <productname>PostgreSQL</productname> is now the most advanced open-source database available anywhere.
ru: Объектно-реляционная система управления базами данных, именуемая сегодня <productname>PostgreSQL</productname>, произошла от пакета <productname>POSTGRES</productname>, написанного в Беркли, Калифорнийском университете. После двух десятилетий разработки <productname>PostgreSQL</productname> стал самой развитой СУБД с открытым исходным кодом.

source: The Berkeley <productname>POSTGRES</productname> Project
ru: Проект <productname>POSTGRES</productname> в Беркли

source: The <productname>POSTGRES</productname> project, led by Professor Michael Stonebraker, was sponsored by the Defense Advanced Research Projects Agency (<acronym>DARPA</acronym>), the Army Research Office (<acronym>ARO</acronym>), the National Science Foundation (<acronym>NSF</acronym>), and ESL, Inc. The implementation of <productname>POSTGRES</productname> began in 1986. The initial concepts for the system were presented in <xref linkend="ston86"/>, and the definition of the initial data model appeared in <xref linkend="rowe87"/>. The design of the rule system at that time was described in <xref linkend="ston87a"/>. The rationale and architecture of the storage manager were detailed in <xref linkend="ston87b"/>.
ru: Проект <productname>POSTGRES</productname>, возглавляемый профессором Майклом Стоунбрейкером, спонсировали агентство <acronym>DARPA</acronym> при Минобороны США, Управление военных исследований (<acronym>ARO</acronym>), Национальный Научный Фонд (<acronym>NSF</acronym>) и компания ESL, Inc. Реализация <productname>POSTGRES</productname> началась в 1986 г. Первоначальные концепции системы были представлены в документе <xref remap="6" linkend="ston86"/>, а описание первой модели данных появилось в <xref remap="6" linkend="rowe87"/>. Проект системы правил тогда был представлен в <xref remap="6" linkend="ston87a"/>. Суть и архитектура менеджера хранилища были расписаны в <xref remap="6" linkend="ston87b"/>.

source: <productname>POSTGRES</productname> has undergone several major releases since then. The first <quote>demoware</quote> system became operational in 1987 and was shown at the 1988 <acronym>ACM-SIGMOD</acronym> Conference. Version 1, described in <xref linkend="ston90a"/>, was released to a few external users in June 1989. In response to a critique of the first rule system (<xref linkend="ston89"/>), the rule system was redesigned (<xref linkend="ston90b"/>), and Version 2 was released in June 1990 with the new rule system. Version 3 appeared in 1991 and added support for multiple storage managers, an improved query executor, and a rewritten rule system. For the most part, subsequent releases until <productname>Postgres95</productname> (see below) focused on portability and reliability.
ru: С тех пор <productname>POSTGRES</productname> прошёл несколько этапов развития. Первая <quote>демоверсия</quote> заработала в 1987 и была показана в 1988 на конференции <acronym>ACM-SIGMOD</acronym>. Версия 1, описанная в <xref remap="6" linkend="ston90a"/>, была выпущена для нескольких внешних пользователей в июне 1989. В ответ на критику первой системы правил (<xref linkend="ston89"/>), она была переделана (<xref linkend="ston90b"/>), и в версии 2, выпущенной в июне 1990, была уже новая система правил. В 1991 вышла версия 3, в которой появилась поддержка различных менеджеров хранилища, улучшенный исполнитель запросов и переписанная система правил. Последующие выпуски до <productname>Postgres95</productname> (см. ниже) в основном были направлены на улучшение портируемости и надёжности.

source: <productname>POSTGRES</productname> has been used to implement many different research and production applications. These include: a financial data analysis system, a jet engine performance monitoring package, an asteroid tracking database, a medical information database, and several geographic information systems. <productname>POSTGRES</productname> has also been used as an educational tool at several universities. Finally, Illustra Information Technologies (later merged into <ulink url="http://www.informix.com/"><productname>Informix</productname></ulink>, which is now owned by <ulink url="http://www.ibm.com/">IBM</ulink>) picked up the code and commercialized it. In late 1992, <productname>POSTGRES</productname> became the primary data manager for the <ulink url="http://meteora.ucsd.edu/s2k/s2k_home.html"> Sequoia 2000 scientific computing project</ulink>.
ru: <productname>POSTGRES</productname> применялся для реализации множества исследовательских и производственных задач. В их числе: система анализа финансовых данных, пакет мониторинга работы реактивных двигателей, база данных наблюдений за астероидами, база данных медицинской информации, несколько географических информационных систем. <productname>POSTGRES</productname> также использовался для обучения в нескольких университетах. Наконец, компания Illustra Information Technologies (позже ставшая частью <ulink url="http://www.informix.com/"><productname>Informix</productname></ulink>, которая сейчас принадлежит <ulink url="http://www.ibm.com/">IBM</ulink>) воспользовалась кодом и нашла ему коммерческое применение. В конце 1992 <productname>POSTGRES</productname> стал основной СУБД научного вычислительного проекта <ulink url="http://meteora.ucsd.edu/s2k/s2k_home.html">Sequoia 2000</ulink>.

source: The size of the external user community nearly doubled during 1993. It became increasingly obvious that maintenance of the prototype code and support was taking up large amounts of time that should have been devoted to database research. In an effort to reduce this support burden, the Berkeley <productname>POSTGRES</productname> project officially ended with Version 4.2.
ru: В 1993 число внешних пользователей удвоилось. Стало очевидно, что обслуживание кода и поддержка занимает слишком много времени, и его не хватает на исследования. Для снижения этой нагрузки проект <productname>POSTGRES</productname> в Беркли был официально закрыт на версии 4.2.

source: In 1994, Andrew Yu and Jolly Chen added an SQL language interpreter to <productname>POSTGRES</productname>. Under a new name, <productname>Postgres95</productname> was subsequently released to the web to find its own way in the world as an open-source descendant of the original <productname>POSTGRES</productname> Berkeley code.
ru: В 1994 Эндри Ю и Джолли Чен добавили в <productname>POSTGRES</productname> интерпретатор языка SQL. Уже с новым именем <productname>Postgres95</productname> был опубликован в Интернете и начал свой путь как потомок разработанного в Беркли <productname>POSTGRES</productname>, с открытым исходным кодом.

source: The query language PostQUEL was replaced with <acronym>SQL</acronym> (implemented in the server). (Interface library <link linkend="libpq">libpq</link> was named after PostQUEL.) Subqueries were not supported until <productname>PostgreSQL</productname> (see below), but they could be imitated in <productname>Postgres95</productname> with user-defined <acronym>SQL</acronym> functions. Aggregate functions were re-implemented. Support for the <literal>GROUP BY</literal> query clause was also added.
ru: На смену языку запросов PostQUEL пришёл <acronym>SQL</acronym> (реализованный в сервере). (Интерфейсная библиотека <link linkend="libpq">libpq</link> унаследовала своё имя от PostQUEL.) Подзапросы не поддерживались до выхода <productname>PostgreSQL</productname> (см. ниже), хотя их можно было имитировать в <productname>Postgres95</productname> с помощью пользовательских функций <acronym>SQL</acronym>. Были заново реализованы агрегатные функции. Также появилась поддержка предложения <literal>GROUP BY</literal>.

source: A new program (<application>psql</application>) was provided for interactive SQL queries, which used <acronym>GNU</acronym> <application>Readline</application>. This largely superseded the old <application>monitor</application> program.
ru: Для интерактивных SQL-запросов была разработана новая программа (<application>psql</application>), которая использовала <acronym>GNU</acronym> <application>Readline</application>. Старая программа <application>monitor</application> стала не нужна.

source: A new front-end library, <filename>libpgtcl</filename>, supported <acronym>Tcl</acronym>-based clients. A sample shell, <command>pgtclsh</command>, provided new Tcl commands to interface <application>Tcl</application> programs with the <productname>Postgres95</productname> server.
ru: Появилась новая клиентская библиотека <filename>libpgtcl</filename> для поддержки <acronym>Tcl</acronym>-клиентов. Пример оболочки, <command>pgtclsh</command>, представлял новые команды Tcl для взаимодействия программ <application>Tcl</application> с сервером <productname>Postgres95</productname>.

source: The large-object interface was overhauled. The inversion large objects were the only mechanism for storing large objects. (The inversion file system was removed.)
ru: Был усовершенствован интерфейс для работы с большими объектами. Единственным механизмом хранения таких данных стали инверсионные объекты. (Инверсионная файловая система была удалена.)

source: The instance-level rule system was removed. Rules were still available as rewrite rules.
ru: Удалена система правил на уровне экземпляров; перезаписывающие правила сохранились.

source: A short tutorial introducing regular <acronym>SQL</acronym> features as well as those of <productname>Postgres95</productname> was distributed with the source code
ru: С исходным кодом стали распространяться краткие описания возможностей стандартного <acronym>SQL</acronym>, а также самого <productname>Postgres95</productname>.

source: <acronym>GNU</acronym> make (instead of <acronym>BSD</acronym> make) was used for the build. Also, <productname>Postgres95</productname> could be compiled with an unpatched <productname>GCC</productname> (data alignment of doubles was fixed).
ru: Для сборки использовался <acronym>GNU</acronym> make (вместо <acronym>BSD</acronym> make). Кроме того, стало возможно скомпилировать <productname>Postgres95</productname> с немодифицированной версией <productname>GCC</productname> (было исправлено выравнивание данных).

source: <productname>Postgres95</productname> code was completely ANSI C and trimmed in size by 25%. Many internal changes improved performance and maintainability. <productname>Postgres95</productname> release 1.0.x ran about 30-50% faster on the Wisconsin Benchmark compared to <productname>POSTGRES</productname>, Version 4.2. Apart from bug fixes, the following were the major enhancements: <placeholder-1/>
ru: Код <productname>Postgres95</productname> был приведён в полное соответствие с ANSI C и уменьшился на 25%. Благодаря множеству внутренних изменений он стал быстрее и удобнее. <productname>Postgres95</productname> версии 1.0.x работал примерно на 30-50% быстрее <productname>POSTGRES</productname> версии 4.2 (по тестам Wisconsin Benchmark). Помимо исправления ошибок, произошли следующие изменения: <placeholder-1/>

source: By 1996, it became clear that the name <quote>Postgres95</quote> would not stand the test of time. We chose a new name, <productname>PostgreSQL</productname>, to reflect the relationship between the original <productname>POSTGRES</productname> and the more recent versions with <acronym>SQL</acronym> capability. At the same time, we set the version numbering to start at 6.0, putting the numbers back into the sequence originally begun by the Berkeley <productname>POSTGRES</productname> project.
ru: В 1996 г. стало понятно, что имя <quote>Postgres95</quote> не выдержит испытание временем. Мы выбрали новое имя, <productname>PostgreSQL</productname>, отражающее связь между оригинальным <productname>POSTGRES</productname> и более поздними версиями с поддержкой <acronym>SQL</acronym>. В то же время, мы продолжили нумерацию версий с 6.0, вернувшись к последовательности, начатой в проекте Беркли <productname>POSTGRES</productname>.

source: Many people continue to refer to <productname>PostgreSQL</productname> as <quote>Postgres</quote> (now rarely in all capital letters) because of tradition or because it is easier to pronounce. This usage is widely accepted as a nickname or alias.
ru: Многие продолжают называть <productname>PostgreSQL</productname> именем <quote>Postgres</quote> (теперь уже редко заглавными буквами) по традиции или для простоты. Это название закрепилось как псевдоним или неформальное обозначение.

source: The emphasis during development of <productname>Postgres95</productname> was on identifying and understanding existing problems in the server code. With <productname>PostgreSQL</productname>, the emphasis has shifted to augmenting features and capabilities, although work continues in all areas.
ru: В процессе разработки <productname>Postgres95</productname> основными задачами были поиск и понимание существующих проблем в серверном коде. С переходом к <productname>PostgreSQL</productname> акценты сместились к реализации новых функций и возможностей, хотя работа продолжается во всех направлениях.

source: Details about what has happened in <productname>PostgreSQL</productname> since then can be found in <xref linkend="release"/>.
ru: Подробнее узнать о том, что происходило с <productname>PostgreSQL</productname> с тех пор, можно в <xref remap="6" linkend="release" />.
