Repository: pluzanov/pg-doc-ru
Catalog: 9.6/indexam.po
Languages: ru

source: The <function>amgetbitmap</function> function need only be provided if the access method supports <quote>bitmap</quote> index scans. If it doesn't, the <structfield>amgetbitmap</structfield> field in its <structname>IndexAmRoutine</structname> struct must be set to NULL.
ru: Функция <function>amgetbitmap</function> должна быть реализована, только если метод доступа поддерживает сканирование индекса <quote>по битовой карте</quote>. В противном случае поле <structfield>amgetbitmap</structfield> в структуре <structname>IndexAmRoutine</structname> должно содержать NULL.

source: <placeholder-1/> End a scan and release resources. The <literal>scan</literal> struct itself should not be freed, but any locks or pins taken internally by the access method must be released.
ru: <placeholder-1/> Завершает сканирование и освобождает ресурсы. Саму структуру <literal>scan</literal> освобождать не следует, но любые блокировки или закрепления объектов, установленные внутри метода доступа, должны быть сняты.

source: <placeholder-1/> Mark current scan position. The access method need only support one remembered scan position per scan.
ru: <placeholder-1/> Помечает текущую позицию сканирования. Метод доступа должен поддерживать сохранение только одной позиции в процессе сканирования.

source: The <function>ammarkpos</function> function need only be provided if the access method supports ordered scans. If it doesn't, the <structfield>ammarkpos</structfield> field in its <structname>IndexAmRoutine</structname> struct may be set to NULL.
ru: Функция <function>ammarkpos</function> должна быть реализована, только если метод доступа поддерживает сканирование по порядку. Если это не так, в поле <structfield>ammarkpos</structfield> в структуре <structname>IndexAmRoutine</structname> можно записать NULL.

source: <placeholder-1/> Restore the scan to the most recently marked position.
ru: <placeholder-1/> Восстанавливает позицию сканирования, отмеченную последней.

source: The <function>amrestrpos</function> function need only be provided if the access method supports ordered scans. If it doesn't, the <structfield>amrestrpos</structfield> field in its <structname>IndexAmRoutine</structname> struct may be set to NULL.
ru: Функция <function>amrestrpos</function> должна быть реализована, только если метод доступа поддерживает сканирование по порядку. Если это не так, в поле <structfield>amrestrpos</structfield> в структуре <structname>IndexAmRoutine</structname> можно записать NULL.

source: Index Scanning
ru: Сканирование индекса

source: In an index scan, the index access method is responsible for regurgitating the TIDs of all the tuples it has been told about that match the <firstterm>scan keys</firstterm>. The access method is <emphasis>not</emphasis> involved in actually fetching those tuples from the index's parent table, nor in determining whether they pass the scan's time qualification test or other conditions.
ru: В процессе сканирования метод доступа индекса отвечает только за выдачу идентификаторов всех кортежей, которые по его представлению соответствуют <firstterm>ключам сканирования</firstterm>. Метод доступа <emphasis>не</emphasis> участвует в самой процедуре выборки этих кортежей из основной таблицы и не определяет, удовлетворяют ли эти кортежи условиям видимости или другим ограничениям.

source: The access method can report that the index is <firstterm>lossy</firstterm>, or requires rechecks, for a particular query. This implies that the index scan will return all the entries that pass the scan key, plus possibly additional entries that do not. The core system's index-scan machinery will then apply the index conditions again to the heap tuple to verify whether or not it really should be selected. If the recheck option is not specified, the index scan must return exactly the set of matching entries.
ru: Метод доступа для конкретного запроса может сообщить, что индекс является <firstterm>неточным</firstterm> или, другими словами, требует перепроверки. Это подразумевает, что при сканировании индекса будут возвращены все записи, соответствующие ключу сканирования, плюс, возможно, дополнительные записи, которые ему не соответствуют. Внутренний механизм сканирования затем повторно применит условия индекса к кортежу данных, чтобы проверить, нужно ли его выбирать на самом деле. Если признак перепроверки не установлен, при сканировании индекса должны возвращаться только соответствующие ключам записи.

source: Note that it is entirely up to the access method to ensure that it correctly finds all and only the entries passing all the given scan keys. Also, the core system will simply hand off all the <literal>WHERE</literal> clauses that match the index keys and operator families, without any semantic analysis to determine whether they are redundant or contradictory. As an example, given <literal>WHERE x &gt; 4 AND x &gt; 14</literal> where <literal>x</literal> is a b-tree indexed column, it is left to the b-tree <function>amrescan</function> function to realize that the first scan key is redundant and can be discarded. The extent of preprocessing needed during <function>amrescan</function> will depend on the extent to which the index access method needs to reduce the scan keys to a <quote>normalized</quote> form.
ru: Заметьте, что именно метод доступа должен гарантировать, что корректно будут найдены все и только те записи, которые соответствуют всем переданным ключам сканирования. Также учтите, что ядро системы просто передаёт все предложения <literal>WHERE</literal> с подходящими ключами индекса и семействами операторов, не проводя семантический анализ на предмет их избыточности или противоречивости. Например, с условием <literal>WHERE x &gt; 4 AND x &gt; 14</literal>, где <literal>x</literal> — столбец с индексом-B-деревом, именно самой функции <function>amrescan</function> в методе B-дерева предоставляется возможность понять, что первый ключ сканирования избыточный и может быть отброшен. Объём предварительной обработки, которую нужно произвести для этого в <function>amrescan</function>, зависит от того, до какой степени метод доступа должен сводить ключи к <quote>нормализованной</quote> форме.

source: Access methods that always return entries in the natural ordering of their data (such as btree) should set <structfield>amcanorder</structfield> to true. Currently, such access methods must use btree-compatible strategy numbers for their equality and ordering operators.
ru: Для методов доступа, которые всегда возвращают записи в порядке их естественной сортировки (как например, в B-дереве), устанавливается признак <structfield>amcanorder</structfield>. В настоящее время операторам проверки равенства и упорядочивания при этом должны назначаться номера соответствующих стратегий B-дерева.

source: Some access methods return index entries in a well-defined order, others do not. There are actually two different ways that an access method can support sorted output: <placeholder-1/>
ru: Некоторые методы доступа возвращают записи индекса в чётко определённом порядке, в отличие от других. Фактически есть два различных варианта реализации упорядоченного вывода некоторым методом доступа: <placeholder-1/>

source: The <function>amgettuple</function> function has a <literal>direction</literal> argument, which can be either <literal>ForwardScanDirection</literal> (the normal case) or <literal>BackwardScanDirection</literal>. If the first call after <function>amrescan</function> specifies <literal>BackwardScanDirection</literal>, then the set of matching index entries is to be scanned back-to-front rather than in the normal front-to-back direction, so <function>amgettuple</function> must return the last matching tuple in the index, rather than the first one as it normally would. (This will only occur for access methods that set <structfield>amcanorder</structfield> to true.) After the first call, <function>amgettuple</function> must be prepared to advance the scan in either direction from the most recently returned entry. (But if <structfield>amcanbackward</structfield> is false, all subsequent calls will have the same direction as the first one.)
ru: У функции <function>amgettuple</function> есть аргумент <literal>direction</literal>, который может принимать значение <literal>ForwardScanDirection</literal> (обычный вариант, сканирование вперёд) или <literal>BackwardScanDirection</literal> (сканирование назад). Если в первом вызове после <function>amrescan</function> указывается <literal>BackwardScanDirection</literal>, то множество соответствующих записей индекса сканируется от конца к началу, а не в обычном направлении от начала к концу. В этом случае <function>amgettuple</function> должна вернуть последний соответствующий кортеж индекса, а не первый как обычно. (Это распространяется только на методы доступа с установленным признаком <structfield>amcanorder</structfield>.) После первого вызова <function>amgettuple</function> должна быть готова продолжать сканирование в любом направлении от записи, выданной последней до этого. (Но если признак <structfield>amcanbackward</structfield> не установлен, при всех последующих вызовах должно сохраняться то же направление, что было в первом.)

source: Access methods that support ordered scans must support <quote>marking</quote> a position in a scan and later returning to the marked position. The same position might be restored multiple times. However, only one position need be remembered per scan; a new <function>ammarkpos</function> call overrides the previously marked position. An access method that does not support ordered scans need not provide <function>ammarkpos</function> and <function>amrestrpos</function> functions in <structname>IndexAmRoutine</structname>; set those pointers to NULL instead.
ru: Методы доступа, которые поддерживают упорядоченное сканирование, должны уметь <quote>помечать</quote> позицию сканирования и затем возвращаться к помеченной позиции (возможно, несколько раз к одной и той же позиции). Но запоминаться должна только одна позиция в ходе сканирования; последующий вызов <function>ammarkpos</function> переопределяет ранее сохранённую позицию. Метод доступа, не поддерживающий упорядоченное сканирование, не должен определять функции <function>ammarkpos</function> и <function>amrestrpos</function> в <structname>IndexAmRoutine</structname>; достаточно записать в эти указатели NULL.

source: Both the scan position and the mark position (if any) must be maintained consistently in the face of concurrent insertions or deletions in the index. It is OK if a freshly-inserted entry is not returned by a scan that would have found the entry if it had existed when the scan started, or for the scan to return such an entry upon rescanning or backing up even though it had not been returned the first time through. Similarly, a concurrent delete might or might not be reflected in the results of a scan. What is important is that insertions or deletions not cause the scan to miss or multiply return entries that were not themselves being inserted or deleted.
ru: И позиция сканирования, и отмеченная позиция (при наличии) должны поддерживаться в согласованном состоянии с учётом одновременных добавлений или удалений записей в индексе. Не будет ошибкой, если только что вставленная запись не будет выдана при сканировании, которое могло бы найти эту запись, если бы она существовала до его начала, либо если сканирование выдаст такую запись после перезапуска или возврата, даже если она не была выдана в первый раз. Подобным образом, параллельное удаление может отражаться, а может и не отражаться в результатах сканирования. Важно только, чтобы при таких операциях добавления или удаления не происходило потерь или дублирования записей, которые в этих операциях не участвовали.

source: If the index stores the original indexed data values (and not some lossy representation of them), it is useful to support <link linkend="indexes-index-only-scans">index-only scans</link>, in which the index returns the actual data not just the TID of the heap tuple. This will only avoid I/O if the visibility map shows that the TID is on an all-visible page; else the heap tuple must be visited anyway to check MVCC visibility. But that is no concern of the access method's.
ru: Если индекс сохраняет исходные индексируемые значения данных (а не их искажённое представление), обычно полезно поддержать <link linkend="indexes-index-only-scans">сканирование только индекса</link>, при котором индекс возвращает фактические данные, а не только TID кортежа данных. Это позволит соптимизировать ввод/вывод, только если карта видимости показывает, что TID относится к полностью видимой странице; в противном случае всё равно придётся посетить кортеж, чтобы проверить его видимость для MVCC. Но это не является заботой метода доступа.

source: Instead of using <function>amgettuple</function>, an index scan can be done with <function>amgetbitmap</function> to fetch all tuples in one call. This can be noticeably more efficient than <function>amgettuple</function> because it allows avoiding lock/unlock cycles within the access method. In principle <function>amgetbitmap</function> should have the same effects as repeated <function>amgettuple</function> calls, but we impose several restrictions to simplify matters. First of all, <function>amgetbitmap</function> returns all tuples at once and marking or restoring scan positions isn't supported. Secondly, the tuples are returned in a bitmap which doesn't have any specific ordering, which is why <function>amgetbitmap</function> doesn't take a <literal>direction</literal> argument. (Ordering operators will never be supplied for such a scan, either.) Also, there is no provision for index-only scans with <function>amgetbitmap</function>, since there is no way to return the contents of index tuples. Finally, <function>amgetbitmap</function> does not guarantee any locking of the returned tuples, with implications spelled out in <xref linkend="index-locking"/>.
ru: Вместо <function>amgettuple</function>, сканирование индекса может осуществляться функцией <function>amgetbitmap</function>, которая выбирает все кортежи за один вызов. Это может быть значительно эффективнее <function>amgettuple</function>, так как позволяет избежать циклов блокировки/разблокировки в методе доступа. В принципе, <function>amgetbitmap</function> должна давать тот же эффект, что и многократные вызовы <function>amgettuple</function>, но простоты ради мы накладываем ряд дополнительных ограничений. Во-первых, <function>amgetbitmap</function> возвращает все кортежи сразу и не поддерживает пометку позиций и возвращение к ним. Во-вторых, кортежи, возвращаемые в битовой карте, не упорядочиваются каким-либо определённым образом, поэтому <function>amgetbitmap</function> не принимает аргумент <literal>direction</literal>. (И операторы упорядочивания никогда не будут передаваться для такого сканирования.) Кроме того, сканирование только индекса с <function>amgetbitmap</function> неосуществимо, так как нет никакой возможности возвратить содержимое кортежей индекса. Наконец, <function>amgetbitmap</function> не гарантирует, что будут установлены какие-либо блокировки для возвращаемых кортежей, и следствия этого описаны в <xref remap="6" linkend="index-locking"/>.

source: Note that it is permitted for an access method to implement only <function>amgetbitmap</function> and not <function>amgettuple</function>, or vice versa, if its internal implementation is unsuited to one API or the other.
ru: Заметьте, что метод доступа может реализовывать только функцию <function>amgetbitmap</function>, но не <function>amgettuple</function>, и наоборот, если его внутренняя реализация несовместима с одной из этих функций.

source: Index Locking Considerations
ru: Замечания о блокировке с индексами

source: Index access methods must handle concurrent updates of the index by multiple processes. The core <productname>PostgreSQL</productname> system obtains <literal>AccessShareLock</literal> on the index during an index scan, and <literal>RowExclusiveLock</literal> when updating the index (including plain <command>VACUUM</command>). Since these lock types do not conflict, the access method is responsible for handling any fine-grained locking it might need. An exclusive lock on the index as a whole will be taken only during index creation, destruction, or <command>REINDEX</command>.
ru: Методы доступа индекса должны справляться с параллельными операциями обновления индекса, производимыми несколькими процессами. Ядро системы <productname>PostgreSQL</productname> получает блокировку <literal>AccessShareLock</literal> для индекса в процессе сканирования и <literal>RowExclusiveLock</literal> при модификации индекса (включая и обычную очистку командой <command>VACUUM</command>). Так как эти типы блокировок не конфликтуют, метод доступа должен сам устанавливать более тонкие блокировки, которые ему могут потребоваться. Исключительная блокировка индекса в целом устанавливается только при создании и уничтожении индекса или операции <command>REINDEX</command>.

source: Building an index type that supports concurrent updates usually requires extensive and subtle analysis of the required behavior. For the b-tree and hash index types, you can read about the design decisions involved in <filename>src/backend/access/nbtree/README</filename> and <filename>src/backend/access/hash/README</filename>.
ru: Реализация типа индекса, поддерживающего параллельные изменения, обычно требует глубокого и всестороннего анализа требуемого поведения. Для общего представления вы можете узнать о конструктивных решениях, принятых при реализации B-дерева и индекса по хешу, обратившись к <filename>src/backend/access/nbtree/README</filename> и <filename>src/backend/access/hash/README</filename>.

source: A new heap entry is made before making its index entries. (Therefore a concurrent index scan is likely to fail to see the heap entry. This is okay because the index reader would be uninterested in an uncommitted row anyway. But see <xref linkend="index-unique-checks"/>.)
ru: Новая запись в области данных добавляется до того, как для неё будут созданы записи в индексах. (Таким образом, при параллельном сканировании индекса эта запись в данных скорее всего не будет замечена. Это не проблема, так как читателю индекса всё равно не нужны незафиксированные строки. Но учтите написанное в <xref remap="6" linkend="index-unique-checks"/>.)

source: When a heap entry is to be deleted (by <command>VACUUM</command>), all its index entries must be removed first.
ru: Когда запись данных удаляется (командой <command>VACUUM</command>), сначала должны удалиться все созданные для неё записи в индексах.

source: An index scan must maintain a pin on the index page holding the item last returned by <function>amgettuple</function>, and <function>ambulkdelete</function> cannot delete entries from pages that are pinned by other backends. The need for this rule is explained below.
ru: Сканирование индекса должно закрепить страницу индекса, на которой находится элемент, возвращённый последним вызовом <function>amgettuple</function>, а <function>ambulkdelete</function> не должна удалять записи со страниц, закреплённых другими процессами. Чем обосновано это правило, описывается ниже.

source: Aside from the index's own internal consistency requirements, concurrent updates create issues about consistency between the parent table (the <firstterm>heap</firstterm>) and the index. Because <productname>PostgreSQL</productname> separates accesses and updates of the heap from those of the index, there are windows in which the index might be inconsistent with the heap. We handle this problem with the following rules: <placeholder-1/> Without the third rule, it is possible for an index reader to see an index entry just before it is removed by <command>VACUUM</command>, and then to arrive at the corresponding heap entry after that was removed by <command>VACUUM</command>. This creates no serious problems if that item number is still unused when the reader reaches it, since an empty item slot will be ignored by <function>heap_fetch()</function>. But what if a third backend has already re-used the item slot for something else? When using an MVCC-compliant snapshot, there is no problem because the new occupant of the slot is certain to be too new to pass the snapshot test. However, with a non-MVCC-compliant snapshot (such as <literal>SnapshotAny</literal>), it would be possible to accept and return a row that does not in fact match the scan keys. We could defend against this scenario by requiring the scan keys to be rechecked against the heap row in all cases, but that is too expensive. Instead, we use a pin on an index page as a proxy to indicate that the reader might still be <quote>in flight</quote> from the index entry to the matching heap entry. Making <function>ambulkdelete</function> block on such a pin ensures that <command>VACUUM</command> cannot delete the heap entry before the reader is done with it. This solution costs little in run time, and adds blocking overhead only in the rare cases where there actually is a conflict.
ru: Помимо собственных внутренних требований индексов к целостности, при параллельном обновлении данных возникают вопросы согласованности родительской таблицы (<firstterm>основных данных</firstterm>) и индекса. Вследствие того, что <productname>PostgreSQL</productname> отделяет чтение и изменение основных данных от чтения и изменения индекса, образуются временные интервалы, в которых индекс может быть несогласованным с данными. Мы решаем эту проблему, применяя следующие правила: <placeholder-1/> Без третьего правила читатель индекса мог бы увидеть запись индекса за мгновение до того, как она была удалена процедурой <command>VACUUM</command>, а затем обратиться к соответствующей записи данных после того, как <command>VACUUM</command> удалит и её. Это не приведёт к серьёзным проблемам, если данный элемент остаётся незадействованным, когда к нему обращается читатель, так как пустой слот будет игнорироваться функцией <function>heap_fetch()</function>. Но как быть, если третий процесс уже занял этот слот какими-то своими данными? Когда применяется снимок, совместимый с MVCC, и это не проблема, так как эти данные определённо окажутся слишком новыми при проверке видимости для данного снимка. Однако, для снимка несовместимого с MVCC (например, снимка <literal>SnapshotAny</literal>), может так получиться, что будет возвращена строка, на самом деле не соответствующая ключам сканирования. Мы можем защититься от такого исхода, потребовав, чтобы ключи сканирования всегда перепроверялись для строки данных, но это слишком дорогостоящее решение. Вместо этого, мы закрепляем страницу индекса как промежуточный объект, показывающий, что читатель может всё ещё быть <quote>в пути</quote> от записи индекса к соответствующей строке данных. Благодаря тому, что <function>ambulkdelete</function> блокируется при обращении к этой закреплённой странице, процедура <command>VACUUM</command> не сможет удалить строку данных, пока её извлечение не закончит читатель. Это решение оказывается очень недорогим по времени выполнения, а издержки блокирования привносятся только в редких случаях, когда действительно возникает конфликт.
