Repository: pluzanov/pg-doc-ru
Catalog: 9.6/indexam.po
Languages: ru

source: This solution requires that index scans be <quote>synchronous</quote>: we have to fetch each heap tuple immediately after scanning the corresponding index entry. This is expensive for a number of reasons. An <quote>asynchronous</quote> scan in which we collect many TIDs from the index, and only visit the heap tuples sometime later, requires much less index locking overhead and can allow a more efficient heap access pattern. Per the above analysis, we must use the synchronous approach for non-MVCC-compliant snapshots, but an asynchronous scan is workable for a query using an MVCC snapshot.
ru: Такое решение требует, чтобы сканирования индексов выполнялись <quote>синхронно</quote>: мы должны выбирать каждый следующий кортеж данных сразу после того получили соответствущую запись индекса. Это оказывается невыгодно по ряду причин. <quote>Асинхронное</quote> сканирование, при котором мы собираем множество TID из индекса, и обращаемся за кортежами данных только после этого, влечёт гораздо меньше издержек с блокировками и позволяет обращаться к данным более эффективным образом. Согласно проведённому выше анализу, мы должны использовать синхронный подход для снимков, несовместимых с MVCC, но для запросов со снимками MVCC будет работать и асинхронное сканирование.

source: In an <function>amgetbitmap</function> index scan, the access method does not keep an index pin on any of the returned tuples. Therefore it is only safe to use such scans with MVCC-compliant snapshots.
ru: При сканировании индекса с <function>amgetbitmap</function>, метод доступа не закрепляет страницы индекса ни для каких из возвращаемых кортежей. Поэтому такое сканирование можно безопасно применять только со снимками MVCC.

source: When the <structfield>ampredlocks</structfield> flag is not set, any scan using that index access method within a serializable transaction will acquire a nonblocking predicate lock on the full index. This will generate a read-write conflict with the insert of any tuple into that index by a concurrent serializable transaction. If certain patterns of read-write conflicts are detected among a set of concurrent serializable transactions, one of those transactions may be canceled to protect data integrity. When the flag is set, it indicates that the index access method implements finer-grained predicate locking, which will tend to reduce the frequency of such transaction cancellations.
ru: Когда флаг <structfield>ampredlocks</structfield> не установлен, любое сканирование с данным методом доступа в сериализуемой транзакции будет получать неблокирующую предикатную блокировку для всего индекса. Это будет приводить к конфликту чтения-записи при добавлении любого кортежа в этот индекс параллельной сериализуемой транзакцией. Если среди набора параллельных сериализуемых транзакций выявляются определённые варианты конфликтов чтения-записи, одна из этих транзакций может быть отменена для сохранения целостности данных. Когда данный флаг установлен, это означает, что метод доступа реализует более точную предикатную блокировку, что способствует сокращению частоты отмены транзакций по этой причине.

source: Index Uniqueness Checks
ru: Проверки уникальности в индексе

source: <productname>PostgreSQL</productname> enforces SQL uniqueness constraints using <firstterm>unique indexes</firstterm>, which are indexes that disallow multiple entries with identical keys. An access method that supports this feature sets <structfield>amcanunique</structfield> true. (At present, only b-tree supports it.)
ru: <productname>PostgreSQL</productname> реализует ограничения уникальности SQL, применяя <firstterm>уникальные индексы</firstterm>, то есть такие индексы, которые не принимают несколько записей с одинаковыми ключами. Для метода доступа, поддерживающего это свойство, устанавливается признак <structfield>amcanunique</structfield>. (В настоящее время это поддерживают только B-деревья.)

source: If a conflicting valid row has been deleted by the current transaction, it's okay. (In particular, since an UPDATE always deletes the old row version before inserting the new version, this will allow an UPDATE on a row without changing the key.)
ru: Если конфликтующая строка была удалена текущей транзакцией, это не проблема. (В частности из-за того, что UPDATE всегда удаляет старую версию строки, прежде чем вставлять новую, операцию UPDATE можно выполнять со строкой, не меняя её ключ.)

source: If a conflicting row has been inserted by an as-yet-uncommitted transaction, the would-be inserter must wait to see if that transaction commits. If it rolls back then there is no conflict. If it commits without deleting the conflicting row again, there is a uniqueness violation. (In practice we just wait for the other transaction to end and then redo the visibility check in toto.)
ru: Если конфликтующая строка была добавлена ещё не зафиксированной транзакцией, запрос, претендующий на добавление новой строки, должен подождать, пока эта транзакция не будет зафиксирована. Если она откатывается, конфликт исчезает. Если она фиксируется и при этом оставляет конфликтующую строку, возникает нарушение уникальности. (На практике мы просто ждём завершения другой транзакции и затем пересматриваем проверку видимости.)

source: Similarly, if a conflicting valid row has been deleted by an as-yet-uncommitted transaction, the would-be inserter must wait for that transaction to commit or abort, and then repeat the test.
ru: Подобным образом, если конфликтующая строка была удалена ещё не зафиксированной транзакцией, запрос, претендующий на добавление новой строки, должен дождаться фиксации или отката этой транзакции, а затем повторить проверку.

source: Because of MVCC, it is always necessary to allow duplicate entries to exist physically in an index: the entries might refer to successive versions of a single logical row. The behavior we actually want to enforce is that no MVCC snapshot could include two rows with equal index keys. This breaks down into the following cases that must be checked when inserting a new row into a unique index: <placeholder-1/>
ru: Вследствие особенностей MVCC, всегда необходимо допускать физическое сосуществование в индексе дублирующихся записей: такие записи могут относиться к последовательным версиям одной логической строки. На самом деле мы хотим добиться только того, чтобы никакой снимок MVCC не мог содержать две строки с одинаковыми ключами индекса. Из этого вытекают следующие ситуации, которые необходимо отследить, добавляя новую строку в уникальный индекс: <placeholder-1/>

source: Furthermore, immediately before reporting a uniqueness violation according to the above rules, the access method must recheck the liveness of the row being inserted. If it is committed dead then no violation should be reported. (This case cannot occur during the ordinary scenario of inserting a row that's just been created by the current transaction. It can happen during <command>CREATE UNIQUE INDEX CONCURRENTLY</command>, however.)
ru: Более того, непосредственно перед тем как сообщать о нарушении уникальности согласно вышеприведённым правилам, метод доступа должен перепроверить, продолжает ли существовать добавляемая строка. Если она признана &laquo;мёртвой&raquo;, о предвиденном нарушении он сообщать не должен. (Такого не должно быть при обычном сценарии добавления строки текущей транзакцией, однако это может произойти в процессе <command>CREATE UNIQUE INDEX CONCURRENTLY</command>.)

source: We require the index access method to apply these tests itself, which means that it must reach into the heap to check the commit status of any row that is shown to have a duplicate key according to the index contents. This is without a doubt ugly and non-modular, but it saves redundant work: if we did a separate probe then the index lookup for a conflicting row would be essentially repeated while finding the place to insert the new row's index entry. What's more, there is no obvious way to avoid race conditions unless the conflict check is an integral part of insertion of the new index entry.
ru: Мы требуем, чтобы метод доступа выполнял эти проверки сам, и это означает, что он должен обратиться к основным данным и проверить состояние фиксации всех строк, которые согласно содержимого индекса содержат дублирующиеся ключи. Это без сомнения некрасивый и немодульный подход, но он избавляет от излишней работы: если бы мы делали отдельную пробу, то поиск конфликтующей строки по индексу пришлось бы по сути повторять, пытаясь найти место, куда вставить запись для новой строки. Более того, не представляется возможным избежать условий гонки, если проверка конфликта не будет неотъемлемой частью процедуры добавления новой записи индекса.

source: <literal>UNIQUE_CHECK_NO</literal> indicates that no uniqueness checking should be done (this is not a unique index).
ru: <literal>UNIQUE_CHECK_NO</literal> указывает, что проверка уникальности не должна выполняться (это не уникальный индекс).

source: <literal>UNIQUE_CHECK_YES</literal> indicates that this is a non-deferrable unique index, and the uniqueness check must be done immediately, as described above.
ru: <literal>UNIQUE_CHECK_YES</literal> указывает, что это неоткладываемый уникальный индекс и проверку уникальности нужно выполнить немедленно, как описано выше.

source: <literal>UNIQUE_CHECK_PARTIAL</literal> indicates that the unique constraint is deferrable. <productname>PostgreSQL</productname> will use this mode to insert each row's index entry. The access method must allow duplicate entries into the index, and report any potential duplicates by returning FALSE from <function>aminsert</function>. For each row for which FALSE is returned, a deferred recheck will be scheduled.
ru: <literal>UNIQUE_CHECK_PARTIAL</literal> указывает, что это откладываемое ограничение уникальности. <productname>PostgreSQL</productname> выбирает этот режим для добавления записи индекса для каждой строки. Метод доступа должен допускать добавление в индекс дублирующихся записей и сообщать о возможных конфликтах, возвращая FALSE из <function>aminsert</function>. Для каждой такой строки (для которой возвращается FALSE) будет запланирована отложенная перепроверка.

source: The access method must identify any rows which might violate the unique constraint, but it is not an error for it to report false positives. This allows the check to be done without waiting for other transactions to finish; conflicts reported here are not treated as errors and will be rechecked later, by which time they may no longer be conflicts.
ru: Метод доступа должен отметить все строки, которые могут нарушать ограничение уникальности, но не будет ошибкой, если он допустит ложное срабатывание. Это позволяет произвести проверку, не дожидаясь завершения других транзакций; конфликты, выявленные на этой стадии, не считаются ошибками и будут перепроверены позже, когда они могут быть уже исчерпаны.

source: <literal>UNIQUE_CHECK_EXISTING</literal> indicates that this is a deferred recheck of a row that was reported as a potential uniqueness violation. Although this is implemented by calling <function>aminsert</function>, the access method must <emphasis>not</emphasis> insert a new index entry in this case. The index entry is already present. Rather, the access method must check to see if there is another live index entry. If so, and if the target row is also still live, report error.
ru: <literal>UNIQUE_CHECK_EXISTING</literal> указывает, что это отложенная перепроверка строки, которая была отмечена как возможно нарушающая ограничение. Хотя для этой проверки вызывается <function>aminsert</function>, метод доступа <emphasis>не</emphasis> должен добавлять новую запись индекса в данном случае, так как эта запись уже существует. Вместо этого, метод доступа должен проверить, нет ли в индексе другой такой же записи. Если она находится и соответствующая ей строка продолжает существовать, должна выдаваться ошибка.

source: It is recommended that in a <literal>UNIQUE_CHECK_EXISTING</literal> call, the access method further verify that the target row actually does have an existing entry in the index, and report error if not. This is a good idea because the index tuple values passed to <function>aminsert</function> will have been recomputed. If the index definition involves functions that are not really immutable, we might be checking the wrong area of the index. Checking that the target row is found in the recheck verifies that we are scanning for the same tuple values as were used in the original insertion.
ru: Для варианта <literal>UNIQUE_CHECK_EXISTING</literal> в методе доступа рекомендуется дополнительно проверить, что для целевой строки действительно имеется запись в индексе и сообщить об ошибке, если это не так. Это хорошая идея, так как значения кортежа индекса, передаваемые в <function>aminsert</function>, будут рассчитаны заново. Если в определении индекса задействованы функции, которые на самом деле не постоянные, мы можем проверять неправильную область индекса. Дополнительно убедившись в существовании целевой строки при перепроверке, мы можем быть уверены, что сканируются те же значения кортежа, что передавались при изначальном добавлении строки.

source: If the unique constraint is deferrable, there is additional complexity: we need to be able to insert an index entry for a new row, but defer any uniqueness-violation error until end of statement or even later. To avoid unnecessary repeat searches of the index, the index access method should do a preliminary uniqueness check during the initial insertion. If this shows that there is definitely no conflicting live tuple, we are done. Otherwise, we schedule a recheck to occur when it is time to enforce the constraint. If, at the time of the recheck, both the inserted tuple and some other tuple with the same key are live, then the error must be reported. (Note that for this purpose, <quote>live</quote> actually means <quote>any tuple in the index entry's HOT chain is live</quote>.) To implement this, the <function>aminsert</function> function is passed a <literal>checkUnique</literal> parameter having one of the following values: <placeholder-1/>
ru: Если ограничение уникальности откладываемое, возникает дополнительная сложность: нам нужна возможность добавлять запись индекса для новой строки, но отложить выводы о нарушении уникальности до конца оператора или даже позже. Чтобы избежать ненужного повторного поиска по индексу, метод доступа должен произвести предварительную проверку уникальности во время изначального добавления строк. Если при этом окажется, что никакие кортежи не конфликтуют, на этом проверка заканчивается. В противном случае мы планируем перепроверку на время, когда это ограничение начинает действовать. Если во время перепроверки продолжают существовать и вставленный кортеж, и какой-либо другой с тем же ключом, должна выдаваться ошибка. (Заметьте, что в данном случае под <quote>существованием</quote> понимается <quote>существование любого кортежа в цепочке HOT записей индекса</quote>.) Для реализации этой схемы в <function>aminsert</function> передаётся параметр <literal>checkUnique</literal>, принимающий одно из следующих значений: <placeholder-1/>

source: Index Cost Estimation Functions
ru: Функции оценки стоимости индекса

source: The <function>amcostestimate</function> function is given information describing a possible index scan, including lists of WHERE and ORDER BY clauses that have been determined to be usable with the index. It must return estimates of the cost of accessing the index and the selectivity of the WHERE clauses (that is, the fraction of parent-table rows that will be retrieved during the index scan). For simple cases, nearly all the work of the cost estimator can be done by calling standard routines in the optimizer; the point of having an <function>amcostestimate</function> function is to allow index access methods to provide index-type-specific knowledge, in case it is possible to improve on the standard estimates.
ru: Функции <function>amcostestimate</function> даётся информация, описывающая возможное сканирование индекса, включая списки предложений WHERE и ORDER BY, которые были выбраны как применимые с данным индексом. Она должна вернуть оценки стоимости обращения к индексу и избирательность предложений WHERE (то есть, процент строк основной таблицы, который будет получен в ходе сканирования индекса). Для простых случаев почти всю работу оценщика стоимости можно произвести, вызывая стандартные процедуры оптимизатора; смысл существования функции <function>amcostestimate</function> в том, чтобы методы доступа индексов могли поделиться знаниями, специфичными для типа индекса, когда это может помочь улучшить стандартные оценки.

source: The planner's information about the query being processed.
ru: Информация планировщика о выполняемом запросе.

source: The index access path being considered. All fields except cost and selectivity values are valid.
ru: Рассматриваемый путь доступа к индексу. В нём действительны все поля, кроме значений стоимости и избирательности.

source: The number of repetitions of the index scan that should be factored into the cost estimates. This will typically be greater than one when considering a parameterized scan for use in the inside of a nestloop join. Note that the cost estimates should still be for just one scan; a larger <parameter>loop_count</parameter> means that it may be appropriate to allow for some caching effects across multiple scans.
ru: Число повторений сканирования индекса, которое должно приниматься во внимание при оценке стоимости. Обычно оно будет больше одного, когда при соединении со вложенным циклом планируется параметризованное сканирование. Заметьте, что оценки стоимости, тем не менее, должны рассчитываться для всего одного сканирования; большие значения <parameter>loop_count</parameter> лишь дают основания предположить, что при многократном сканировании положительное влияние может оказать кеширование.

source: Each <function>amcostestimate</function> function must have the signature: <placeholder-1/> The first three parameters are inputs: <placeholder-2/>
ru: Каждая функция <function>amcostestimate</function> должна иметь такую сигнатуру: <placeholder-1/> Первые три параметра передают входные значения: <placeholder-2/>

source: Set to cost of index start-up processing
ru: Стоимость выполнения запуска индекса

source: Set to total cost of index processing
ru: Общая стоимость использования индекса

source: Set to index selectivity
ru: Избирательность индекса

source: Set to correlation coefficient between index scan order and underlying table's order
ru: Коэффициент корреляции между порядком сканирования индекса и порядком записей в нижележащей таблице

source: The last four parameters are pass-by-reference outputs: <placeholder-1/>
ru: Последние четыре параметра — указатели на переменные для выходных значений: <placeholder-1/>

source: Note that cost estimate functions must be written in C, not in SQL or any available procedural language, because they must access internal data structures of the planner/optimizer.
ru: Заметьте, что функции оценки стоимости должны разрабатываться на C, а не на SQL или другом доступном процедурном языке, так как они должны обращаться к внутренним структурам данным планировщика/оптимизатора.

source: The index access costs should be computed using the parameters used by <filename>src/backend/optimizer/path/costsize.c</filename>: a sequential disk block fetch has cost <varname>seq_page_cost</varname>, a nonsequential fetch has cost <varname>random_page_cost</varname>, and the cost of processing one index row should usually be taken as <varname>cpu_index_tuple_cost</varname>. In addition, an appropriate multiple of <varname>cpu_operator_cost</varname> should be charged for any comparison operators invoked during index processing (especially evaluation of the indexquals themselves).
ru: Стоимости обращения к индексу следует вычислять с использованием параметров, объявленных в <filename>src/backend/optimizer/path/costsize.c</filename>: последовательная выборка дискового блока имеет стоимость <varname>seq_page_cost</varname>, непоследовательная выборка — <varname>random_page_cost</varname>, а стоимостью обработки одной строки индекса обычно принимается <varname>cpu_index_tuple_cost</varname>. Кроме того, за каждый оператор сравнения, вызываемый при обработке индекса, должна взиматься цена <varname>cpu_operator_cost</varname> (особенно за вычисление собственно условий индекса).

source: The access costs should include all disk and CPU costs associated with scanning the index itself, but <emphasis>not</emphasis> the costs of retrieving or processing the parent-table rows that are identified by the index.
ru: Стоимость доступа должна включать стоимости всех дисковых и процессорных ресурсов, требующихся для сканирования самого индекса, <emphasis>но</emphasis> не стоимости извлечения или обработки строк основной таблицы, с которой связан индекс.

source: The <quote>start-up cost</quote> is the part of the total scan cost that must be expended before we can begin to fetch the first row. For most indexes this can be taken as zero, but an index type with a high start-up cost might want to set it nonzero.
ru: <quote>Стоимость запуска</quote> составляет часть общей стоимости сканирования, которая должна быть потрачена, прежде чем можно будет начать чтение первой строки. Для большинства индексов она может считаться нулевой, но для типов индексов с высокими затратами на запуск она может быть больше нуля.

source: The <parameter>indexSelectivity</parameter> should be set to the estimated fraction of the parent table rows that will be retrieved during the index scan. In the case of a lossy query, this will typically be higher than the fraction of rows that actually pass the given qual conditions.
ru: Значение в <parameter>indexSelectivity</parameter> должно показывать, какой процент строк основной таблицы ожидается получить при сканировании таблицы. В случае неточного запроса это обычно будет больше процента строк, действительно удовлетворяющих заданным ограничивающим условиям.

source: The <parameter>indexCorrelation</parameter> should be set to the correlation (ranging between -1.0 and 1.0) between the index order and the table order. This is used to adjust the estimate for the cost of fetching rows from the parent table.
ru: В <parameter>indexCorrelation</parameter> записывается корреляция (в диапазоне от -1.0 до 1.0) между порядком записей в индексе и в таблице. Это значение будет корректировать оценку стоимости выборки строк из основной таблицы.

source: When <parameter>loop_count</parameter> is greater than one, the returned numbers should be averages expected for any one scan of the index.
ru: Когда <parameter>loop_count</parameter> больше нуля, возвращаться должны средние значения, ожидаемые для одного сканирования индекса.

source: Cost Estimation
ru: Оценка стоимости

source: A typical cost estimator will proceed as follows:
ru: Типичная процедура оценки выглядит следующим образом:

source: Estimate and return the fraction of parent-table rows that will be visited based on the given qual conditions. In the absence of any index-type-specific knowledge, use the standard optimizer function <function>clauselist_selectivity()</function>: <placeholder-1/>
ru: Рассчитать и вернуть процент строк родительской таблицы, которые будут посещены при заданных ограничивающих условиях. В отсутствие каких-либо знаний, специфичных для типа индекса, использовать стандартную функцию оптимизатора <function>clauselist_selectivity()</function>: <placeholder-1/>
