Repository: pluzanov/pg-doc-ru
Catalog: 9.6/indexam.po
Languages: ru

source: Estimate the number of index rows that will be visited during the scan. For many index types this is the same as <parameter>indexSelectivity</parameter> times the number of rows in the index, but it might be more. (Note that the index's size in pages and rows is available from the <literal>path-&gt;indexinfo</literal> struct.)
ru: Оценить число строк индекса, которые будут посещены при сканировании. Для многих типов индексов это будет произведение <parameter>indexSelectivity</parameter> и числа строк в индексе, но оно может быть и больше. (Заметьте, что размер индекса в страницах и строках можно узнать из структуры <literal>path-&gt;indexinfo</literal>.)

source: Estimate the number of index pages that will be retrieved during the scan. This might be just <parameter>indexSelectivity</parameter> times the index's size in pages.
ru: Рассчитать число страниц индекса, которые будут получены при сканировании. Это может быть просто произведение <parameter>indexSelectivity</parameter> и размера индекса в страницах.

source: /* * Our generic assumption is that the index pages will be read * sequentially, so they cost seq_page_cost each, not random_page_cost. * Also, we charge for evaluation of the indexquals at each index row. * All the costs are assumed to be paid incrementally during the scan. */ cost_qual_eval(&amp;index_qual_cost, path-&gt;indexquals, root); *indexStartupCost = index_qual_cost.startup; *indexTotalCost = seq_page_cost * numIndexPages + (cpu_index_tuple_cost + index_qual_cost.per_tuple) * numIndexTuples;
ru: /* * Вообще предполагается, что страницы индекса будут считываться последовательно, * так что стоимость их чтения cost seq_page_cost, а не random_page_cost. * Также мы добавляем стоимость за вычисление условия индекса для каждой строки. * Все стоимости считаются пропорционально возрастающими при сканировании. */ cost_qual_eval(&amp;index_qual_cost, path-&gt;indexquals, root); *indexStartupCost = index_qual_cost.startup; *indexTotalCost = seq_page_cost * numIndexPages + (cpu_index_tuple_cost + index_qual_cost.per_tuple) * numIndexTuples;

source: Compute the index access cost. A generic estimator might do this: <placeholder-1/> However, the above does not account for amortization of index reads across repeated index scans.
ru: Вычислить стоимость обращения к индексу. Универсальный оценщик может сделать следующее: <placeholder-1/> Однако при таком расчёте не учитывается амортизация чтения индекса при повторном сканировании.

source: Estimate the index correlation. For a simple ordered index on a single field, this can be retrieved from pg_statistic. If the correlation is not known, the conservative estimate is zero (no correlation).
ru: Оценить корреляцию индекса. Для простого упорядоченного индекса по одному полю её можно получить из pg_statistic. Если корреляция неизвестна, вернуть консервативную оценку — ноль (корреляция отсутствует).

source: Examples of cost estimator functions can be found in <filename>src/backend/utils/adt/selfuncs.c</filename>.
ru: Примеры функций оценки стоимости можно найти в <filename>src/backend/utils/adt/selfuncs.c</filename>.
