Repository: pluzanov/pg-doc-ru
Catalog: 9.6/indexam.po
Languages: ru

source: <placeholder-1/> Insert a new tuple into an existing index. The <literal>values</literal> and <literal>isnull</literal> arrays give the key values to be indexed, and <literal>heap_tid</literal> is the TID to be indexed. If the access method supports unique indexes (its <structfield>amcanunique</structfield> flag is true) then <literal>checkUnique</literal> indicates the type of uniqueness check to perform. This varies depending on whether the unique constraint is deferrable; see <xref linkend="index-unique-checks"/> for details. Normally the access method only needs the <literal>heapRelation</literal> parameter when performing uniqueness checking (since then it will have to look into the heap to verify tuple liveness).
ru: <placeholder-1/> Вставляет новый кортеж в существующий индекс. В массивах <literal>values</literal> и <literal>isnull</literal> передаются значения ключа, которые должны быть проиндексированы, а в <literal>heap_tid</literal> — идентификатор индексируемого кортежа (TID). Если метод доступа поддерживает уникальные индексы (флаг <structfield>amcanunique</structfield> установлен), параметр <literal>checkUnique</literal> указывает, какая проверка уникальности должна выполняться. Это зависит от того, является ли ограничение уникальности откладываемым; за подробностями обратитесь к <xref remap="3" linkend="index-unique-checks"/>. Обычно параметр <literal>heapRelation</literal> нужен методу доступа только для проверки уникальности (так как он должен обратиться к основным данным, чтобы убедиться в актуальности кортежа).

source: The function's Boolean result value is significant only when <literal>checkUnique</literal> is <literal>UNIQUE_CHECK_PARTIAL</literal>. In this case a TRUE result means the new entry is known unique, whereas FALSE means it might be non-unique (and a deferred uniqueness check must be scheduled). For other cases a constant FALSE result is recommended.
ru: Возвращаемый функцией булевский результат имеет значение, только когда параметр <literal>checkUnique</literal> равен <literal>UNIQUE_CHECK_PARTIAL</literal>. В этом случае результат TRUE означает, что новая запись признана уникальной, тогда как FALSE означает, что она может быть неуникальной (и требуется назначить отложенную проверку уникальности). В других случаях рекомендуется возвращать постоянный результат FALSE.

source: Some indexes might not index all tuples. If the tuple is not to be indexed, <function>aminsert</function> should just return without doing anything.
ru: Некоторые индексы могут индексировать не все кортежи. Если кортеж не будет индексирован, <function>aminsert</function> должна просто завершиться, не делая ничего.

source: <placeholder-1/> Delete tuple(s) from the index. This is a <quote>bulk delete</quote> operation that is intended to be implemented by scanning the whole index and checking each entry to see if it should be deleted. The passed-in <literal>callback</literal> function must be called, in the style <literal>callback(<replaceable>TID</replaceable>, callback_state) returns bool</literal>, to determine whether any particular index entry, as identified by its referenced TID, is to be deleted. Must return either NULL or a palloc'd struct containing statistics about the effects of the deletion operation. It is OK to return NULL if no information needs to be passed on to <function>amvacuumcleanup</function>.
ru: <placeholder-1/> Удаляет кортеж(и) из индекса. Это операция <quote>массового удаления</quote>, которая предположительно будет реализована путём сканирования всего индекса и проверки для каждой записи, должна ли она удаляться. Переданная функция <literal>callback</literal> должна вызываться в стиле <literal>callback(<replaceable>TID</replaceable>, callback_state)</literal> с результатом bool, который говорит, должна ли удаляться запись индекса, на которую указывает передаваемый TID. Возвращать эта функция должна NULL или структуру, выделенную вызовом palloc и содержащую статистику результата удаления. NULL можно вернуть, если никакая информация не должна передаваться в <function>amvacuumcleanup</function>.

source: Because of limited <varname>maintenance_work_mem</varname>, <function>ambulkdelete</function> might need to be called more than once when many tuples are to be deleted. The <literal>stats</literal> argument is the result of the previous call for this index (it is NULL for the first call within a <command>VACUUM</command> operation). This allows the AM to accumulate statistics across the whole operation. Typically, <function>ambulkdelete</function> will modify and return the same struct if the passed <literal>stats</literal> is not null.
ru: Из-за ограничения <varname>maintenance_work_mem</varname> процедура <function>ambulkdelete</function> может вызываться несколько раз, когда удалению подлежит большое количество кортежей. В аргументе <literal>stats</literal> передаётся результат предыдущего вызова для данного индекса (при первом вызове в ходе операции <command>VACUUM</command> он содержит NULL). Это позволяет методу доступа накапливать статистику в процессе всей операции. Обычно <function>ambulkdelete</function> модифицирует и возвращает одну и ту же структуру, если в <literal>stats</literal> передаётся не NULL.

source: <placeholder-1/> Clean up after a <command>VACUUM</command> operation (zero or more <function>ambulkdelete</function> calls). This does not have to do anything beyond returning index statistics, but it might perform bulk cleanup such as reclaiming empty index pages. <literal>stats</literal> is whatever the last <function>ambulkdelete</function> call returned, or NULL if <function>ambulkdelete</function> was not called because no tuples needed to be deleted. If the result is not NULL it must be a palloc'd struct. The statistics it contains will be used to update <structname>pg_class</structname>, and will be reported by <command>VACUUM</command> if <literal>VERBOSE</literal> is given. It is OK to return NULL if the index was not changed at all during the <command>VACUUM</command> operation, but otherwise correct stats should be returned.
ru: <placeholder-1/> Провести очистку после операции <command>VACUUM</command> (до этого <function>ambulkdelete</function> могла вызываться несколько или ноль раз). От этой функции не требуется ничего, кроме как выдать статистику по индексу, но она может произвести массовую очистку, например, высвободить пустые страницы индекса. В <literal>stats</literal> ей передаётся структура, возвращённая при последнем вызове <function>ambulkdelete</function>, либо NULL, если <function>ambulkdelete</function> не вызывалась, так как никакие кортежи удалять не требовалось. Эта функция должна возвращать NULL или структуру, выделенную вызовом palloc. Содержащаяся в этой структуре статистика будет отражена в записи в <structname>pg_class</structname> и попадёт в вывод команды <command>VACUUM</command>, если она выполнялась с указанием <literal>VERBOSE</literal>. NULL может возвращаться, если индекс вовсе не изменился в процессе операции <command>VACUUM</command>, но в противном случае должна возвращаться корректная статистика.

source: As of <productname>PostgreSQL</productname> 8.4, <function>amvacuumcleanup</function> will also be called at completion of an <command>ANALYZE</command> operation. In this case <literal>stats</literal> is always NULL and any return value will be ignored. This case can be distinguished by checking <literal>info-&gt;analyze_only</literal>. It is recommended that the access method do nothing except post-insert cleanup in such a call, and that only in an autovacuum worker process.
ru: Начиная с <productname>PostgreSQL</productname> версии 8.4, <function>amvacuumcleanup</function> также вызывается в конце операции <command>ANALYZE</command>. В этом случае <literal>stats</literal> всегда NULL и любое возвращаемое значение игнорируется. Этот вариант вызова можно распознать, проверив поле <literal>info-&gt;analyze_only</literal>. При таком вызове методу доступа рекомендуется ничего не делать, кроме как провести очистку после добавления данных, и только в рабочем процессе автоочистки.

source: <placeholder-1/> Check whether the index can support <link linkend="indexes-index-only-scans"><firstterm>index-only scans</firstterm></link> on the given column, by returning the indexed column values for an index entry in the form of an <structname>IndexTuple</structname>. The attribute number is 1-based, i.e. the first column's attno is 1. Returns TRUE if supported, else FALSE. If the access method does not support index-only scans at all, the <structfield>amcanreturn</structfield> field in its <structname>IndexAmRoutine</structname> struct can be set to NULL.
ru: <placeholder-1/> Проверяет, поддерживается ли <link linkend="indexes-index-only-scans"><firstterm>сканирование только индекса</firstterm></link> для заданного столбца, когда для записи индекса возвращаются значения индексируемых столбцов в виде <structname>IndexTuple</structname>. Атрибуты нумеруются с 1, то есть для первого столбца attno равен 1. Возвращает TRUE, если такое сканирование поддерживается, а иначе FALSE. Если метод доступа индекса в принципе не поддерживает сканирование только индекса, в поле <structfield>amcanreturn</structfield> его структуры <structname>IndexAmRoutine</structname> можно записать NULL.

source: <placeholder-1/> Estimate the costs of an index scan. This function is described fully in <xref linkend="index-cost-estimation"/>, below.
ru: <placeholder-1/> Рассчитывает примерную стоимость сканирования индекса. Эта функция полностью описывается ниже в <xref remap="6" linkend="index-cost-estimation"/>.

source: <placeholder-1/> Parse and validate the reloptions array for an index. This is called only when a non-null reloptions array exists for the index. <parameter>reloptions</parameter> is a <type>text</type> array containing entries of the form <replaceable>name</replaceable><literal>=</literal><replaceable>value</replaceable>. The function should construct a <type>bytea</type> value, which will be copied into the <structfield>rd_options</structfield> field of the index's relcache entry. The data contents of the <type>bytea</type> value are open for the access method to define; most of the standard access methods use struct <structname>StdRdOptions</structname>. When <parameter>validate</parameter> is true, the function should report a suitable error message if any of the options are unrecognized or have invalid values; when <parameter>validate</parameter> is false, invalid entries should be silently ignored. (<parameter>validate</parameter> is false when loading options already stored in <structname>pg_catalog</structname>; an invalid entry could only be found if the access method has changed its rules for options, and in that case ignoring obsolete entries is appropriate.) It is OK to return NULL if default behavior is wanted.
ru: <placeholder-1/> Разбирает и проверяет массив параметров для индекса. Эта функция вызывается, только когда для индекса задан отличный от NULL массив reloptions. Массив <parameter>reloptions</parameter> состоит из элементов типа <type>text</type>, содержащих записи вида <replaceable>имя</replaceable><literal>=</literal><replaceable>значение</replaceable>. Данная функция должна получить значение типа <type>bytea</type>, которое будет скопировано в поле <structfield>rd_options</structfield> записи индекса в relcache. Содержимое этого значения <type>bytea</type> определяется самим методом доступа; большинство стандартных методов доступа помещают в него структуру <structname>StdRdOptions</structname>. Когда параметр <parameter>validate</parameter> равен true, эта функция должна выдать подходящее сообщение об ошибке, если какие-либо параметры нераспознаны или имеют недопустимые значения; если же <parameter>validate</parameter> равен false, некорректные записи должны просто игнорироваться. (В <parameter>validate</parameter> передаётся false, когда параметры уже загружены в <structname>pg_catalog</structname>; при этом неверная запись может быть обнаружена, только если в методе доступа поменялись правила обработки параметров, и в этом случае стоит просто игнорировать такие записи.) NULL можно вернуть, когда нужно получить поведение по умолчанию.

source: <placeholder-1/> Validate the catalog entries for the specified operator class, so far as the access method can reasonably do that. For example, this might include testing that all required support functions are provided. The <function>amvalidate</function> function must return false if the opclass is invalid. Problems should be reported with <function>ereport</function> messages.
ru: <placeholder-1/> Проверяет записи в каталоге для заданного класса операторов, насколько это может сделать метод доступа. Например, это может включать проверку, все ли необходимые опорные функции реализованы. Функция <function>amvalidate</function> должна вернуть false, если класс операторов непригоден к использованию. Сообщения о проблеме следует выдать через <function>ereport</function>.

source: The purpose of an index, of course, is to support scans for tuples matching an indexable <literal>WHERE</literal> condition, often called a <firstterm>qualifier</firstterm> or <firstterm>scan key</firstterm>. The semantics of index scanning are described more fully in <xref linkend="index-scanning"/>, below. An index access method can support <quote>plain</quote> index scans, <quote>bitmap</quote> index scans, or both. The scan-related functions that an index access method must or may provide are:
ru: Цель индекса, конечно, в том, чтобы поддерживать поиск кортежей, соответствующих индексируемому условию <literal>WHERE</literal>, по <firstterm>ограничению</firstterm> или <firstterm>ключу поиска</firstterm>. Сканирование индекса описывается более полно ниже, в <xref remap="6" linkend="index-scanning"/>. Метод доступа индекса может поддерживать <quote>простое</quote> сканирование, сканирование по <quote>битовой карте</quote> или и то, и другое. Метод доступа должен или может реализовывать следующие функции, связанные со сканированием:

source: <placeholder-1/> Prepare for an index scan. The <literal>nkeys</literal> and <literal>norderbys</literal> parameters indicate the number of quals and ordering operators that will be used in the scan; these may be useful for space allocation purposes. Note that the actual values of the scan keys aren't provided yet. The result must be a palloc'd struct. For implementation reasons the index access method <emphasis>must</emphasis> create this struct by calling <function>RelationGetIndexScan()</function>. In most cases <function>ambeginscan</function> does little beyond making that call and perhaps acquiring locks; the interesting parts of index-scan startup are in <function>amrescan</function>.
ru: <placeholder-1/> Подготавливает метод к сканированию индекса. В параметрах <literal>nkeys</literal> и <literal>norderbys</literal> задаётся количество операторов условия и сортировки, которые будут задействованы при сканировании; это может быть полезно для выделения памяти. Заметьте, что фактические значения ключей сканирования в этот момент ещё не предоставляются. В результате функция должна выдать структуру, выделенную средствами palloc. В связи с особенностями реализации, метод доступа <emphasis>должен</emphasis> создать эту структуру, вызвав <function>RelationGetIndexScan()</function>. В большинстве случаев все действия <function>ambeginscan</function> сводятся только к выполнению этого вызова и, возможно, получению блокировок; всё самое интересное при запуске сканирования индекса происходит в <function>amrescan</function>.

source: <placeholder-1/> Start or restart an index scan, possibly with new scan keys. (To restart using previously-passed keys, NULL is passed for <literal>keys</literal> and/or <literal>orderbys</literal>.) Note that it is not allowed for the number of keys or order-by operators to be larger than what was passed to <function>ambeginscan</function>. In practice the restart feature is used when a new outer tuple is selected by a nested-loop join and so a new key comparison value is needed, but the scan key structure remains the same.
ru: <placeholder-1/> Запускает или перезапускает сканирование индекса, возможно, с новыми ключами сканирования. (Для перезапуска сканирования с ранее переданными ключами в <literal>keys</literal> и/или <literal>orderbys</literal> передаётся NULL.) Заметьте, что количество ключей или операторов сортировки не может превышать значения, поступившие в <function>ambeginscan</function>. На практике возможность перезапуска используется, когда в соединении со вложенным циклом выбирается новый внешний кортеж, так что требуется сравнение с новым ключом, но структура ключей сканирования не меняется.

source: <placeholder-1/> Fetch the next tuple in the given scan, moving in the given direction (forward or backward in the index). Returns TRUE if a tuple was obtained, FALSE if no matching tuples remain. In the TRUE case the tuple TID is stored into the <literal>scan</literal> structure. Note that <quote>success</quote> means only that the index contains an entry that matches the scan keys, not that the tuple necessarily still exists in the heap or will pass the caller's snapshot test. On success, <function>amgettuple</function> must also set <literal>scan-&gt;xs_recheck</literal> to TRUE or FALSE. FALSE means it is certain that the index entry matches the scan keys. TRUE means this is not certain, and the conditions represented by the scan keys must be rechecked against the heap tuple after fetching it. This provision supports <quote>lossy</quote> index operators. Note that rechecking will extend only to the scan conditions; a partial index predicate (if any) is never rechecked by <function>amgettuple</function> callers.
ru: <placeholder-1/> Выбирает следующий кортеж в ходе данного сканирования, с передвижением по индексу в заданном направлении (вперёд или назад). Возвращает TRUE, если кортеж был получен, или FALSE, если подходящих кортежей не осталось. В случае успеха в структуре <literal>scan</literal> сохраняется TID кортежа. Заметьте, что под <quote>успехом</quote> здесь подразумевается только, что индекс содержит запись, соответствующую ключам сканирования, а не то, что данный кортеж обязательно существует в данных или оказывается видимым в снимке вызывающего субъекта. При положительном результате <function>amgettuple</function> должна также установить для свойства <literal>scan-&gt;xs_recheck</literal> значение TRUE или FALSE. FALSE будет означать, что запись индекса точно соответствует ключам сканирования, а TRUE, что есть сомнение в этом, так что условия, представленные ключами сканирования, необходимо ещё раз перепроверить для фактического кортежа, когда он будет получен. Это свойство введено для поддержки <quote>неточных</quote> операторов индексов. Заметьте, что такая перепроверка касается только условий сканирования; предикат частичного индекса (если он имеется) никогда не перепроверяется кодом, вызывающим <function>amgettuple</function>.

source: If the index supports <link linkend="indexes-index-only-scans">index-only scans</link> (i.e., <function>amcanreturn</function> returns TRUE for it), then on success the AM must also check <literal>scan-&gt;xs_want_itup</literal>, and if that is true it must return the original indexed data for the index entry, in the form of an <structname>IndexTuple</structname> pointer stored at <literal>scan-&gt;xs_itup</literal>, with tuple descriptor <literal>scan-&gt;xs_itupdesc</literal>. (Management of the data referenced by the pointer is the access method's responsibility. The data must remain good at least until the next <function>amgettuple</function>, <function>amrescan</function>, or <function>amendscan</function> call for the scan.)
ru: Если индекс поддерживает <link linkend="indexes-index-only-scans">сканирование только индекса</link> (то есть, <function>amcanreturn</function> для него равен TRUE), то в случае успеха метод доступа должен также проверить флаг <literal>scan-&gt;xs_want_itup</literal>, и, если он установлен, должен вернуть исходные индексированные данные для этой записи индекса, в виде указателя на <structname>IndexTuple</structname>, сохранённого в <literal>scan-&gt;xs_itup</literal>, и дескриптор кортежа <literal>scan-&gt;xs_itupdesc</literal>. (Контролировать структуру данных, на которую указывает этот указатель, должен сам метод доступа. Она должна сохраняться в рабочем состоянии как минимум до следующего вызова <function>amgettuple</function>, <function>amrescan</function> или <function>amendscan</function> в текущем сканировании.)

source: The <function>amgettuple</function> function need only be provided if the access method supports <quote>plain</quote> index scans. If it doesn't, the <structfield>amgettuple</structfield> field in its <structname>IndexAmRoutine</structname> struct must be set to NULL.
ru: Функция <function>amgettuple</function> должна быть реализована, только если метод доступа поддерживает <quote>простое</quote> сканирование индекса. В противном случае поле <structfield>amgettuple</structfield> в структуре <structname>IndexAmRoutine</structname> должно содержать NULL.

source: <placeholder-1/> Fetch all tuples in the given scan and add them to the caller-supplied <type>TIDBitmap</type> (that is, OR the set of tuple IDs into whatever set is already in the bitmap). The number of tuples fetched is returned (this might be just an approximate count, for instance some AMs do not detect duplicates). While inserting tuple IDs into the bitmap, <function>amgetbitmap</function> can indicate that rechecking of the scan conditions is required for specific tuple IDs. This is analogous to the <literal>xs_recheck</literal> output parameter of <function>amgettuple</function>. Note: in the current implementation, support for this feature is conflated with support for lossy storage of the bitmap itself, and therefore callers recheck both the scan conditions and the partial index predicate (if any) for recheckable tuples. That might not always be true, however. <function>amgetbitmap</function> and <function>amgettuple</function> cannot be used in the same index scan; there are other restrictions too when using <function>amgetbitmap</function>, as explained in <xref linkend="index-scanning"/>.
ru: <placeholder-1/> Выбирает все кортежи для данного сканирования и добавляет их в передаваемую вызывающим кодом структуру <type>TIDBitmap</type> (то есть, получает логическое объединение множества TID выбранных кортежей с множеством, уже записанным в битовой карте). Возвращает эта функция число полученных кортежей (это может быть только приблизительная оценка; например, некоторые методы доступа не учитывают повторяющиеся значения). Добавляя идентификаторы кортежей в битовую карту, <function>amgetbitmap</function> может обозначить, что для этих кортежей нужно перепроверить условия сканирования. Для этого так же, как и в <function>amgettuple</function>, устанавливается выходной параметр <literal>xs_recheck</literal>. Замечание: в текущей реализации эта возможность увязывается с возможностью неточного хранения самих битовых карт, таким образом вызывающий код перепроверяет для отмеченных кортежей и условия сканирования, и предикат частичного индекса (если он имеется). Однако так может быть не всегда. Функции <function>amgetbitmap</function> и <function>amgettuple</function> не могут использоваться в одном сканировании индекса; есть и другие ограничения в применении <function>amgetbitmap</function>, описанные в <xref remap="6" linkend="index-scanning"/>.
