Repository: pluzanov/pg-doc-ru
Catalog: 9.6/indexam.po
Languages: ru

source: Index Access Method Interface Definition
ru: Определение интерфейса для методов доступа индекса

source: This chapter defines the interface between the core <productname>PostgreSQL</productname> system and <firstterm>index access methods</firstterm>, which manage individual index types. The core system knows nothing about indexes beyond what is specified here, so it is possible to develop entirely new index types by writing add-on code.
ru: В этой главе описывается интерфейс между ядром системы <productname>PostgreSQL</productname> и <firstterm>методами доступа индексов</firstterm>, которые управляют отдельными типами индексов. Ядро системы не знает об индексах ничего, кроме того, что описано здесь; благодаря этому можно реализовывать абсолютно новые типы индексов, разрабатывая код в виде расширения.

source: All indexes in <productname>PostgreSQL</productname> are what are known technically as <firstterm>secondary indexes</firstterm>; that is, the index is physically separate from the table file that it describes. Each index is stored as its own physical <firstterm>relation</firstterm> and so is described by an entry in the <structname>pg_class</structname> catalog. The contents of an index are entirely under the control of its index access method. In practice, all index access methods divide indexes into standard-size pages so that they can use the regular storage manager and buffer manager to access the index contents. (All the existing index access methods furthermore use the standard page layout described in <xref linkend="storage-page-layout"/>, and most use the same format for index tuple headers; but these decisions are not forced on an access method.)
ru: Все индексы <productname>PostgreSQL</productname> являются, говоря на техническом уровне, <firstterm>вторичными индексами</firstterm>; то есть, они физически отделены от файла таблицы, к которой относятся. Каждый индекс хранится в собственном отдельном физическом <firstterm>отношении</firstterm> и описывается в отдельной записи в каталоге <structname>pg_class</structname>. Содержимое индекса находится полностью под контролем соответствующего метода доступа. На практике все методы доступа индексов делят индексы на страницы стандартного размера, чтобы для обращения к содержимому индекса можно было задействовать обычный менеджер хранилища и менеджер буферов. (Более того, большинство существующих методов доступа используют одну структуру страницы, описанную в <xref remap="6" linkend="storage-page-layout"/>, и одинаковый формат заголовков кортежей индекса; но эти решения методам доступа не навязываются.)

source: An index is effectively a mapping from some data key values to <firstterm>tuple identifiers</firstterm>, or <acronym>TIDs</acronym>, of row versions (tuples) in the index's parent table. A TID consists of a block number and an item number within that block (see <xref linkend="storage-page-layout"/>). This is sufficient information to fetch a particular row version from the table. Indexes are not directly aware that under MVCC, there might be multiple extant versions of the same logical row; to an index, each tuple is an independent object that needs its own index entry. Thus, an update of a row always creates all-new index entries for the row, even if the key values did not change. (HOT tuples are an exception to this statement; but indexes do not deal with those, either.) Index entries for dead tuples are reclaimed (by vacuuming) when the dead tuples themselves are reclaimed.
ru: Индекс по сути представляет собой сопоставление некоторых значений ключей данных с <firstterm>идентификаторами кортежей</firstterm>, <acronym>TID</acronym> (Tuple Identifier), или версиями строк в основной таблице индекса. TID состоит из номера блока и номера записи в этом блоке (см. <xref remap="4" linkend="storage-page-layout"/>). Этой информации достаточно, чтобы выбрать определённую версию строки из таблицы. Индексы сами по себе не знают, что в модели MVCC у одной логической строки может быть несколько существующих версий; для индекса каждый кортеж — независимый объект, которому нужна своя запись в индексе. Таким образом, при изменении строки для неё всегда заново создаются новые записи индекса, даже если значения ключа не изменились. (Кортежи HOT представляют собой исключение из этого утверждения; но индексы всё равно не имеют с этим дела.) Записи индексов для мёртвых кортежей высвобождаются (при очистке), когда высвобождаются сами мёртвые кортежи.

source: Basic API Structure for Indexes
ru: Базовая структура API для индексов

source: Each index access method is described by a row in the <link linkend="catalog-pg-am"><structname>pg_am</structname></link> system catalog. The <structname>pg_am</structname> entry specifies a name and a <firstterm>handler function</firstterm> for the access method. There is not currently any special support for creating or deleting <structname>pg_am</structname> entries; anyone able to write a new access method is expected to be competent to insert an appropriate row for themselves.
ru: Каждый метод доступа индекса описывается строкой в системном каталоге <link linkend="catalog-pg-am"><structname>pg_am</structname></link>. В записи <structname>pg_am</structname> указывается имя и <firstterm>функция-обработчик</firstterm> для метода доступа. В настоящее время нет никаких специальных средств для создания или удаления записей из <structname>pg_am</structname>; предполагается, что те, кто способны реализовать новый метод доступа, смогут и вставить соответствующую строку.

source: Index access methods can be defined and dropped using <xref linkend="sql-create-access-method"/> and <xref linkend="sql-drop-access-method"/> SQL commands respectively.
ru: Методы доступа могут быть созданы и удалены SQL-командами <xref linkend="sql-create-access-method"/> и <xref linkend="sql-drop-access-method"/>, соответственно.

source: An index access method handler function must be declared to accept a single argument of type <type>internal</type> and to return the pseudo-type <type>index_am_handler</type>. The argument is a dummy value that simply serves to prevent handler functions from being called directly from SQL commands. The result of the function must be a palloc'd struct of type <structname>IndexAmRoutine</structname>, which contains everything that the core code needs to know to make use of the index access method. The <structname>IndexAmRoutine</structname> struct, also called the access method's <firstterm>API struct</firstterm>, includes fields specifying assorted fixed properties of the access method, such as whether it can support multicolumn indexes. More importantly, it contains pointers to support functions for the access method, which do all of the real work to access indexes. These support functions are plain C functions and are not visible or callable at the SQL level. The support functions are described in <xref linkend="index-functions"/>.
ru: Функция-обработчик метода доступа должна объявляться как принимающая один аргумент типа <type>internal</type> и возвращающая псевдотип <type>index_am_handler</type>. Аргумент в данном случае фиктивный, и нужен только для того, чтобы эту функцию нельзя было вызывать непосредственно из команд SQL. Возвращать эта функция должна структуру типа <structname>IndexAmRoutine</structname> (в памяти palloc), содержащую всё, что нужно знать коду ядра, чтобы использовать этот метод доступа. Структура <structname>IndexAmRoutine</structname>, также называемая <firstterm>структурой API</firstterm> метода доступа, содержит поля, задающие разнообразные предопределённые свойства метода доступа, например, поддерживает ли он составные индексы. Что более важно, она содержит указатели на опорные функции для метода доступа. Это обычные функции на C и они не видны и не могут быть вызваны на уровне SQL. Опорные функции описаны в <xref remap="6" linkend="index-functions"/>.

source: typedef struct IndexAmRoutine { NodeTag type; /* * Total number of strategies (operators) by which we can traverse/search * this AM. Zero if AM does not have a fixed set of strategy assignments. */ uint16 amstrategies; /* total number of support functions that this AM uses */ uint16 amsupport; /* does AM support ORDER BY indexed column's value? */ bool amcanorder; /* does AM support ORDER BY result of an operator on indexed column? */ bool amcanorderbyop; /* does AM support backward scanning? */ bool amcanbackward; /* does AM support UNIQUE indexes? */ bool amcanunique; /* does AM support multi-column indexes? */ bool amcanmulticol; /* does AM require scans to have a constraint on the first index column? */ bool amoptionalkey; /* does AM handle ScalarArrayOpExpr quals? */ bool amsearcharray; /* does AM handle IS NULL/IS NOT NULL quals? */ bool amsearchnulls; /* can index storage data type differ from column data type? */ bool amstorage; /* can an index of this type be clustered on? */ bool amclusterable; /* does AM handle predicate locks? */ bool ampredlocks; /* type of data stored in index, or InvalidOid if variable */ Oid amkeytype; /* interface functions */ ambuild_function ambuild; ambuildempty_function ambuildempty; aminsert_function aminsert; ambulkdelete_function ambulkdelete; amvacuumcleanup_function amvacuumcleanup; amcanreturn_function amcanreturn; /* can be NULL */ amcostestimate_function amcostestimate; amoptions_function amoptions; amvalidate_function amvalidate; ambeginscan_function ambeginscan; amrescan_function amrescan; amgettuple_function amgettuple; /* can be NULL */ amgetbitmap_function amgetbitmap; /* can be NULL */ amendscan_function amendscan; ammarkpos_function ammarkpos; /* can be NULL */ amrestrpos_function amrestrpos; /* can be NULL */ } IndexAmRoutine;
ru: typedef struct IndexAmRoutine { NodeTag type; /* * Общее число стратегий (операторов), с которыми возможен поиск/применение * этого метода доступа (МД). Ноль, если у этого МД нет фиксированного набора назначенных стратегий. */ uint16 amstrategies; /* общее число опорных функций, используемых этим МД */ uint16 amsupport; /* поддерживает ли МД упорядочивание (ORDER BY) значений индексированного столбца? */ bool amcanorder; /* поддерживает ли МД упорядочивание (ORDER BY) результата оператора с индексированным столбцом? */ bool amcanorderbyop; /* поддерживает ли МД сканирование в обратном направлении? */ bool amcanbackward; /* поддерживает ли МД уникальные индексы (UNIQUE)? */ bool amcanunique; /* поддерживает ли МД индексы с несколькими столбцами? */ bool amcanmulticol; /* требует ли МД наличия условия по первому столбцу индекса? */ bool amoptionalkey; /* воспринимает ли МД условия ScalarArrayOpExpr? */ bool amsearcharray; /* воспринимает ли МД условия IS NULL/IS NOT NULL? */ bool amsearchnulls; /* может ли тип, хранящийся в индексе, отличаться от типа столбца? */ bool amstorage; /* возможна ли кластеризация по индексу этого типа? */ bool amclusterable; /* МД обрабатывает предикатные блокировки? */ bool ampredlocks; /* типа данных, хранящихся в индексе, либо InvalidOid, если он переменный */ Oid amkeytype; /* интерфейсные функции */ ambuild_function ambuild; ambuildempty_function ambuildempty; aminsert_function aminsert; ambulkdelete_function ambulkdelete; amvacuumcleanup_function amvacuumcleanup; amcanreturn_function amcanreturn; /* может быть NULL */ amcostestimate_function amcostestimate; amoptions_function amoptions; amvalidate_function amvalidate; ambeginscan_function ambeginscan; amrescan_function amrescan; amgettuple_function amgettuple; /* может быть NULL */ amgetbitmap_function amgetbitmap; /* может быть NULL */ amendscan_function amendscan; ammarkpos_function ammarkpos; /* может быть NULL */ amrestrpos_function amrestrpos; /* может быть NULL */ } IndexAmRoutine;

source: The structure <structname>IndexAmRoutine</structname> is defined thus: <placeholder-1/>
ru: Структура <structname>IndexAmRoutine</structname> определяется так: <placeholder-1/>

source: To be useful, an index access method must also have one or more <firstterm>operator families</firstterm> and <firstterm>operator classes</firstterm> defined in <link linkend="catalog-pg-opfamily"><structname>pg_opfamily</structname></link>, <link linkend="catalog-pg-opclass"><structname>pg_opclass</structname></link>, <link linkend="catalog-pg-amop"><structname>pg_amop</structname></link>, and <link linkend="catalog-pg-amproc"><structname>pg_amproc</structname></link>. These entries allow the planner to determine what kinds of query qualifications can be used with indexes of this access method. Operator families and classes are described in <xref linkend="xindex"/>, which is prerequisite material for reading this chapter.
ru: Чтобы метод доступа индекса применялся, необходимо также определить <firstterm>семейства операторов</firstterm> и <firstterm>классы операторов</firstterm> в <link linkend="catalog-pg-opfamily"><structname>pg_opfamily</structname></link>, <link linkend="catalog-pg-opclass"><structname>pg_opclass</structname></link>, <link linkend="catalog-pg-amop"><structname>pg_amop</structname></link> и <link linkend="catalog-pg-amproc"><structname>pg_amproc</structname></link>. Эти записи позволяют планировщику понять, для каких видов условий запросов могут применяться индексы с данными методом доступа. Семейства и классы операторов описываются в <xref remap="6" linkend="xindex"/>; этот материал необходимо изучить, прежде чем читать данную главу.

source: An individual index is defined by a <link linkend="catalog-pg-class"><structname>pg_class</structname></link> entry that describes it as a physical relation, plus a <link linkend="catalog-pg-index"><structname>pg_index</structname></link> entry that shows the logical content of the index &mdash; that is, the set of index columns it has and the semantics of those columns, as captured by the associated operator classes. The index columns (key values) can be either simple columns of the underlying table or expressions over the table rows. The index access method normally has no interest in where the index key values come from (it is always handed precomputed key values) but it will be very interested in the operator class information in <structname>pg_index</structname>. Both of these catalog entries can be accessed as part of the <structname>Relation</structname> data structure that is passed to all operations on the index.
ru: Отдельный индекс определяется записью в <link linkend="catalog-pg-class"><structname>pg_class</structname></link>, описывающей его как физическое отношение, и записью в <link linkend="catalog-pg-index"><structname>pg_index</structname></link>, представляющей логическое содержание индекса &mdash; то есть, набор столбцов индекса и семантическое значение этих столбцов, установленное соответствующими классами операторов. Столбцами индекса (значениями ключа) могут быть либо простые столбцы нижележащей таблицы, либо выражения, вычисляемые по строкам таблицы. Для метода доступа индекса обычно не важно, откуда поступают значения ключа индекса (они всегда поступают в вычисленном виде), но очень важна информация о классе операторов в каталоге <structname>pg_index</structname>. Обе эти записи каталогов представлены в составе структуры данных <structname>Relation</structname>, которая передаётся всем функциям, реализующим операции с индексом.

source: Some of the flag fields of <structname>IndexAmRoutine</structname> have nonobvious implications. The requirements of <structfield>amcanunique</structfield> are discussed in <xref linkend="index-unique-checks"/>. The <structfield>amcanmulticol</structfield> flag asserts that the access method supports multicolumn indexes, while <structfield>amoptionalkey</structfield> asserts that it allows scans where no indexable restriction clause is given for the first index column. When <structfield>amcanmulticol</structfield> is false, <structfield>amoptionalkey</structfield> essentially says whether the access method supports full-index scans without any restriction clause. Access methods that support multiple index columns <emphasis>must</emphasis> support scans that omit restrictions on any or all of the columns after the first; however they are permitted to require some restriction to appear for the first index column, and this is signaled by setting <structfield>amoptionalkey</structfield> false. One reason that an index AM might set <structfield>amoptionalkey</structfield> false is if it doesn't index null values. Since most indexable operators are strict and hence cannot return true for null inputs, it is at first sight attractive to not store index entries for null values: they could never be returned by an index scan anyway. However, this argument fails when an index scan has no restriction clause for a given index column. In practice this means that indexes that have <structfield>amoptionalkey</structfield> true must index nulls, since the planner might decide to use such an index with no scan keys at all. A related restriction is that an index access method that supports multiple index columns <emphasis>must</emphasis> support indexing null values in columns after the first, because the planner will assume the index can be used for queries that do not restrict these columns. For example, consider an index on (a,b) and a query with <literal>WHERE a = 4</literal>. The system will assume the index can be used to scan for rows with <literal>a = 4</literal>, which is wrong if the index omits rows where <literal>b</literal> is null. It is, however, OK to omit rows where the first indexed column is null. An index access method that does index nulls may also set <structfield>amsearchnulls</structfield>, indicating that it supports <literal>IS NULL</literal> and <literal>IS NOT NULL</literal> clauses as search conditions.
ru: С некоторыми полями флагов в <structname>IndexAmRoutine</structname> связаны неочевидные следствия. Требования индексов с <structfield>amcanunique</structfield> описаны в <xref remap="6" linkend="index-unique-checks"/>. Флаг <structfield>amcanmulticol</structfield> показывает, что метод доступа поддерживает составные индексы, а <structfield>amoptionalkey</structfield> обозначает, что метод позволяет выполнить сканирование при отсутствии индексируемого ограничивающего условия для первого столбца индекса. Когда <structfield>amcanmulticol</structfield> равен false, <structfield>amoptionalkey</structfield> по сути говорит, поддерживает ли метод доступа полное сканирование по индексу без ограничивающего условия. Методы доступа, поддерживающие индексы по нескольким столбцам, <emphasis>должны</emphasis> поддерживать сканирования при отсутствии ограничений любых или всех столбцов после первого; однако они могут требовать присутствия какого-либо ограничения для первого столбца индекса, и это требование отмечается значением false флага <structfield>amoptionalkey</structfield>. В <structfield>amoptionalkey</structfield> для метода доступа может устанавливаться false, например, когда этот метод доступа не индексирует значения. Так как большинство индексируемых операторов — строгие, и поэтому не могут вернуть true для операндов NULL, на первый взгляд кажется заманчивой идея не хранить записи индекса для значений NULL: они всё равно никак не могут быть прочитаны при сканировании индекса. Однако этот аргумент отпадает, когда при сканировании индекса вовсе отсутствует ограничение данного столбца индекса. На практике это означает, что индексы с установленным флагом <structfield>amoptionalkey</structfield> должны индексировать значения NULL, так как планировщик может склониться к использованию этого индекса вообще без ключей. С этим связано ещё одно ограничение — метод доступа индекса, поддерживающий составные индексы, <emphasis>должен</emphasis> поддерживать индексирование значений NULL в столбцах после первого, так как планировщик будет полагать, что индекс можно применять для запросов, в которых эти столбцы не ограничиваются. Например, рассмотрим индекс по (a,b) и запрос с ограничением <literal>WHERE a = 4</literal>. Система будет полагать, что по этому индексу можно просканировать строки с <literal>a = 4</literal>, но это будет неверно, если индекс исключит строки, в которых <literal>b</literal> — NULL. Однако, этот индекс вполне может исключить строки, в которых первый столбец содержит NULL. Метод индекса, который индексирует значения NULL, может также установить флаг <structfield>amsearchnulls</structfield>, отметив тем самым, что он поддерживает в качестве условий поиска <literal>IS NULL</literal> и <literal>IS NOT NULL</literal>.

source: Index Access Method Functions
ru: Функции для метода доступа индекса

source: The index construction and maintenance functions that an index access method must provide in <structname>IndexAmRoutine</structname> are:
ru: Метод доступа индекса должен определить в <structname>IndexAmRoutine</structname> следующие функции построения и обслуживания индексов:

source: <placeholder-1/> Build a new index. The index relation has been physically created, but is empty. It must be filled in with whatever fixed data the access method requires, plus entries for all tuples already existing in the table. Ordinarily the <function>ambuild</function> function will call <function>IndexBuildHeapScan()</function> to scan the table for existing tuples and compute the keys that need to be inserted into the index. The function must return a palloc'd struct containing statistics about the new index.
ru: <placeholder-1/> Строит новый индекс. Отношение индекса уже физически создано, но пока пусто. Оно должно быть наполнено фиксированными данными, которые требуются методу доступа, и записями для всех кортежей, уже существующих в таблице. Обычно функция <function>ambuild</function> вызывает <function>IndexBuildHeapScan()</function> для поиска в таблице существующих кортежей и для вычисления ключей, которые должны вставляться в этот индекс. Эта функция должна возвращать структуру, выделенную вызовом palloc и содержащую статистику нового индекса.

source: <placeholder-1/> Build an empty index, and write it to the initialization fork (<symbol>INIT_FORKNUM</symbol>) of the given relation. This method is called only for unlogged indexes; the empty index written to the initialization fork will be copied over the main relation fork on each server restart.
ru: <placeholder-1/> Создаёт пустой индекс и записывает его в слой инициализации (<symbol>INIT_FORKNUM</symbol>) данного отношения. Этот метод вызывается только для нежурналируемых индексов; пустой индекс, записанный в слой инициализации, будет копироваться в основной слой отношения при каждом перезапуске сервера.
