Repository: pluzanov/pg-doc-ru
Catalog: 9.6/intro.po
Languages: ru

source: Preface
ru: Предисловие

source: This book is the official documentation of <productname>PostgreSQL</productname>. It has been written by the <productname>PostgreSQL</productname> developers and other volunteers in parallel to the development of the <productname>PostgreSQL</productname> software. It describes all the functionality that the current version of <productname>PostgreSQL</productname> officially supports.
ru: Эта книга является официальной документацией <productname>PostgreSQL</productname>. Она была написана разработчиками и добровольцами параллельно с разработкой программного продукта. В ней описывается вся функциональность, которую официально поддерживает текущая версия <productname>PostgreSQL</productname>.

source: <xref linkend="tutorial"/> is an informal introduction for new users.
ru: <xref linkend="tutorial"/> представляет собой неформальное введение для начинающих.

source: <xref linkend="sql"/> documents the <acronym>SQL</acronym> query language environment, including data types and functions, as well as user-level performance tuning. Every <productname>PostgreSQL</productname> user should read this.
ru: <xref linkend="sql"/> описывает язык <acronym>SQL</acronym> и его среду, включая типы данных и функции, а также оптимизацию производительности на уровне пользователей. Это будет полезно прочитать всем пользователям <productname>PostgreSQL</productname>.

source: <xref linkend="admin"/> describes the installation and administration of the server. Everyone who runs a <productname>PostgreSQL</productname> server, be it for private use or for others, should read this part.
ru: <xref linkend="admin"/> описывает установку и администрирование сервера. Эта часть будет полезна всем, кто использует сервер <productname>PostgreSQL</productname> для самых разных целей.

source: <xref linkend="client-interfaces"/> describes the programming interfaces for <productname>PostgreSQL</productname> client programs.
ru: <xref linkend="client-interfaces"/> описывает программные интерфейсы для клиентских приложений <productname>PostgreSQL</productname>.

source: <xref linkend="server-programming"/> contains information for advanced users about the extensibility capabilities of the server. Topics include user-defined data types and functions.
ru: <xref linkend="server-programming"/> предназначена для более опытных пользователей и содержит сведения о возможностях расширения сервера. Эта часть включает темы, посвящённые, в частности, пользовательским типам данных и функциям.

source: <xref linkend="reference"/> contains reference information about SQL commands, client and server programs. This part supports the other parts with structured information sorted by command or program.
ru: <xref linkend="reference"/> содержит справочную информацию о командах SQL, а также клиентских и серверных программах. Эта часть дополняет другие информацией, структурированной по командам и программам.

source: <xref linkend="internals"/> contains assorted information that might be of use to <productname>PostgreSQL</productname> developers.
ru: <xref linkend="internals"/> содержит разнообразную информацию, полезную для разработчиков <productname>PostgreSQL</productname>.

source: To make the large amount of information about <productname>PostgreSQL</productname> manageable, this book has been organized in several parts. Each part is targeted at a different class of users, or at users in different stages of their <productname>PostgreSQL</productname> experience: <placeholder-1/>
ru: Чтобы такой большой объём информации о <productname>PostgreSQL</productname> был удобоварим, эта книга разделена на части. Каждая часть предназначена определённой категории пользователей или пользователям на разных стадиях освоения <productname>PostgreSQL</productname>: <placeholder-1/>

source: What is <productname>PostgreSQL</productname>?
ru: Что такое <productname>PostgreSQL</productname>?

source: <productname>PostgreSQL</productname> is an object-relational database management system (<acronym>ORDBMS</acronym>) based on <ulink url="http://db.cs.berkeley.edu/postgres.html"><productname>POSTGRES, Version 4.2</productname></ulink>, developed at the University of California at Berkeley Computer Science Department. POSTGRES pioneered many concepts that only became available in some commercial database systems much later.
ru: <productname>PostgreSQL</productname> &mdash; это объектно-реляционная система управления базами данных (<acronym>ОРСУБД, ORDBMS</acronym>), основанная на <ulink url="http://db.cs.berkeley.edu/postgres.html"><productname>POSTGRES, Version 4.2</productname></ulink> &mdash; программе, разработанной на факультете компьютерных наук Калифорнийского университета в Беркли. В POSTGRES появилось множество новшеств, которые были реализованы в некоторых коммерческих СУБД гораздо позднее.

source: complex queries
ru: сложные запросы

source: foreign keys
ru: внешние ключи

source: triggers
ru: триггеры

source: updatable views
ru: изменяемые представления

source: transactional integrity
ru: транзакционная целостность

source: multiversion concurrency control
ru: многоверсионность

source: data types
ru: типы данных

source: functions
ru: функции

source: operators
ru: операторы

source: aggregate functions
ru: агрегатные функции

source: index methods
ru: методы индексирования

source: procedural languages
ru: процедурные языки

source: <productname>PostgreSQL</productname> is an open-source descendant of this original Berkeley code. It supports a large part of the SQL standard and offers many modern features: <placeholder-1/> Also, <productname>PostgreSQL</productname> can be extended by the user in many ways, for example by adding new <placeholder-2/>
ru: <productname>PostgreSQL</productname> &mdash; СУБД с открытым исходным кодом, основой которого был код, написанный в Беркли. Она поддерживает большую часть стандарта SQL и предлагает множество современных функций: <placeholder-1/> Кроме того, пользователи могут всячески расширять возможности <productname>PostgreSQL</productname>, например создавая свои <placeholder-2/>

source: And because of the liberal license, <productname>PostgreSQL</productname> can be used, modified, and distributed by anyone free of charge for any purpose, be it private, commercial, or academic.
ru: А благодаря свободной лицензии, <productname>PostgreSQL</productname> разрешается бесплатно использовать, изменять и распространять всем и для любых целей — личных, коммерческих или учебных.
