Repository: pluzanov/pg-doc-ru
Catalog: 9.6/json.po
Languages: ru

source: <acronym>JSON</acronym> Types
ru: Типы <acronym>JSON</acronym>

source: JSON data types are for storing JSON (JavaScript Object Notation) data, as specified in <ulink url="http://rfc7159.net/rfc7159">RFC 7159</ulink>. Such data can also be stored as <type>text</type>, but the JSON data types have the advantage of enforcing that each stored value is valid according to the JSON rules. There are also assorted JSON-specific functions and operators available for data stored in these data types; see <xref linkend="functions-json"/>.
ru: Типы JSON предназначены для хранения данных JSON (JavaScript Object Notation, Запись объекта JavaScript) согласно стандарту <ulink url="http://www.ietf.org/rfc/rfc4627.txt">RFC 4627</ulink>. Такие данные можно хранить и в типе <type>text</type>, но типы JSON лучше тем, что проверяют, соответствует ли вводимое значение формату JSON. Для работы с ним есть также несколько специальных функций и операторов; см. <xref remap="4" linkend="functions-json"/>.

source: There are two JSON data types: <type>json</type> and <type>jsonb</type>. They accept <emphasis>almost</emphasis> identical sets of values as input. The major practical difference is one of efficiency. The <type>json</type> data type stores an exact copy of the input text, which processing functions must reparse on each execution; while <type>jsonb</type> data is stored in a decomposed binary format that makes it slightly slower to input due to added conversion overhead, but significantly faster to process, since no reparsing is needed. <type>jsonb</type> also supports indexing, which can be a significant advantage.
ru: Существуют два типа данных JSON: <type>json</type> и <type>jsonb</type>. Они принимают на вход <emphasis>почти</emphasis> одинаковые наборы значений, но основное их отличие в эффективности. Тип <type>json</type> сохраняет точную копию введённого текста, которую функции обработки должны разбирать заново при каждом выполнении, тогда как данные <type>jsonb</type> сохраняются в разобранном двоичном формате, что несколько замедляет ввод из-за преобразования, но значительно ускоряет обработку, не требуя многократного разбора текста. Кроме того, <type>jsonb</type> поддерживает индексацию, что тоже может быть очень полезно.

source: Because the <type>json</type> type stores an exact copy of the input text, it will preserve semantically-insignificant white space between tokens, as well as the order of keys within JSON objects. Also, if a JSON object within the value contains the same key more than once, all the key/value pairs are kept. (The processing functions consider the last value as the operative one.) By contrast, <type>jsonb</type> does not preserve white space, does not preserve the order of object keys, and does not keep duplicate object keys. If duplicate keys are specified in the input, only the last value is kept.
ru: Так как тип <type>json</type> сохраняет точную копию введённого текста, он сохраняет семантически незначащие пробелы между элементами, а также порядок ключей в JSON-объектах. И если JSON-объект внутри содержит повторяющиеся ключи, этот тип сохранит все пары ключ/значение. (Функции обработки будут считать действительной последнюю пару.) Тип <type>jsonb</type>, напротив, не сохраняет пробелы, порядок ключей и значения с дублирующимися ключами. Если во входных данных оказываются дублирующиеся ключи, сохраняется только последнее значение.

source: In general, most applications should prefer to store JSON data as <type>jsonb</type>, unless there are quite specialized needs, such as legacy assumptions about ordering of object keys.
ru: Для большинства приложений предпочтительнее хранить данные JSON в типе <type>jsonb</type> (если нет особых противопоказаний, например важны прежние предположения о порядке ключей объектов).

source: <productname>PostgreSQL</productname> allows only one character set encoding per database. It is therefore not possible for the JSON types to conform rigidly to the JSON specification unless the database encoding is UTF8. Attempts to directly include characters that cannot be represented in the database encoding will fail; conversely, characters that can be represented in the database encoding but not in UTF8 will be allowed.
ru: <productname>PostgreSQL</productname> позволяет использовать только одну кодировку символов в базе данных, поэтому данные JSON не будут полностью соответствовать спецификации, если кодировка базы данных не UTF-8. При этом нельзя будет вставить символы, непредставимые в кодировке сервера, и наоборот, допустимыми будут символы, представимые в кодировке сервера, но не в UTF-8.

source: RFC 7159 permits JSON strings to contain Unicode escape sequences denoted by <literal>\u<replaceable>XXXX</replaceable></literal>. In the input function for the <type>json</type> type, Unicode escapes are allowed regardless of the database encoding, and are checked only for syntactic correctness (that is, that four hex digits follow <literal>\u</literal>). However, the input function for <type>jsonb</type> is stricter: it disallows Unicode escapes for non-ASCII characters (those above <literal>U+007F</literal>) unless the database encoding is UTF8. The <type>jsonb</type> type also rejects <literal>\u0000</literal> (because that cannot be represented in <productname>PostgreSQL</productname>'s <type>text</type> type), and it insists that any use of Unicode surrogate pairs to designate characters outside the Unicode Basic Multilingual Plane be correct. Valid Unicode escapes are converted to the equivalent ASCII or UTF8 character for storage; this includes folding surrogate pairs into a single character.
ru: RFC 7159 разрешает включать в строки JSON спецпоследовательности Unicode в виде <literal>\u<replaceable>XXXX</replaceable></literal>. В функцию ввода для типа <type>json</type> эти спецпоследовательности допускаются вне зависимости от кодировки базы данных, и проверяется только правильность их синтаксиса (за <literal>\u</literal> должны следовать четыре шестнадцатеричных цифры). Однако, функция ввода для типа <type>jsonb</type> более строгая: она не допускает спецпоследовательности Unicode для не-ASCII символов (символов после <literal>U+007F</literal>), если кодировка базы данных не UTF8. Тип <type>jsonb</type> также не принимает <literal>\u0000</literal> (так как это значение не может быть представлено в типе <type>text</type> <productname>PostgreSQL</productname>), и требует, чтобы суррогатные пары Unicode использовались для представления символов вне основной многоязыковой плоскости (BMP) правильно. Корректные спецпоследовательности Unicode преобразуются для хранения в соответствующий символ ASCII или UTF8 (это подразумевает сворачивание суррогатных пар в один символ).

source: Many of the JSON processing functions described in <xref linkend="functions-json"/> will convert Unicode escapes to regular characters, and will therefore throw the same types of errors just described even if their input is of type <type>json</type> not <type>jsonb</type>. The fact that the <type>json</type> input function does not make these checks may be considered a historical artifact, although it does allow for simple storage (without processing) of JSON Unicode escapes in a non-UTF8 database encoding. In general, it is best to avoid mixing Unicode escapes in JSON with a non-UTF8 database encoding, if possible.
ru: Многие из функций обработки JSON, описанные в <xref remap="6" linkend="functions-json"/>, преобразуют спецпоследовательности Unicode в обычные символы, поэтому могут выдавать подобные ошибки, даже если им на вход поступает тип <type>json</type>, а не <type>jsonb</type>. То, что функция ввода в тип <type>json</type> не производит этих проверок, можно считать историческим артефактом, хотя это и позволяет просто сохранять (но не обрабатывать) в JSON спецкоды Unicode в базе данных с кодировкой не UTF8. Вообще же, по возможности следует избегать смешения спецкодов Unicode в JSON с кодировкой базой данных не UTF8.

source: When converting textual JSON input into <type>jsonb</type>, the primitive types described by <acronym>RFC</acronym> 7159 are effectively mapped onto native <productname>PostgreSQL</productname> types, as shown in <xref linkend="json-type-mapping-table"/>. Therefore, there are some minor additional constraints on what constitutes valid <type>jsonb</type> data that do not apply to the <type>json</type> type, nor to JSON in the abstract, corresponding to limits on what can be represented by the underlying data type. Notably, <type>jsonb</type> will reject numbers that are outside the range of the <productname>PostgreSQL</productname> <type>numeric</type> data type, while <type>json</type> will not. Such implementation-defined restrictions are permitted by <acronym>RFC</acronym> 7159. However, in practice such problems are far more likely to occur in other implementations, as it is common to represent JSON's <type>number</type> primitive type as IEEE 754 double precision floating point (which <acronym>RFC</acronym> 7159 explicitly anticipates and allows for). When using JSON as an interchange format with such systems, the danger of losing numeric precision compared to data originally stored by <productname>PostgreSQL</productname> should be considered.
ru: При преобразовании вводимого текста JSON в тип <type>jsonb</type>, примитивные типы, описанные в <acronym>RFC</acronym> 7159, по сути отображаются в собственные типы <productname>PostgreSQL</productname> как показано в <xref remap="6" linkend="json-type-mapping-table"/>. Таким образом, к содержимому типа <type>jsonb</type> предъявляются некоторые дополнительные требования, продиктованные ограничениями представления нижележащего типа данных, которые не распространяются ни на тип <type>json</type>, ни на формат JSON вообще. В частности, тип <type>jsonb</type> не принимает числа, выходящие за диапазон типа данных <productname>PostgreSQL</productname> <type>numeric</type>, тогда как с <type>json</type> такого ограничения нет. Такие ограничения, накладываемые реализацией, допускаются согласно <acronym>RFC</acronym> 7159. Однако, на практике такие проблемы более вероятны в других реализациях, так как обычно примитивный тип JSON <type>number</type> представляется в виде числа с плавающей точкой двойной точности IEEE 754 (что <acronym>RFC</acronym> 7159 явно признаёт и допускает). При использовании JSON в качестве формата обмена данными с такими системами следует учитывать риски потери точности чисел, хранившихся в <productname>PostgreSQL</productname>.

source: Conversely, as noted in the table there are some minor restrictions on the input format of JSON primitive types that do not apply to the corresponding <productname>PostgreSQL</productname> types.
ru: И напротив, как показано в таблице, есть некоторые ограничения в формате ввода примитивных типов JSON, не актуальные для соответствующих типов <productname>PostgreSQL</productname>.

source: JSON primitive types and corresponding <productname>PostgreSQL</productname> types
ru: Примитивные типы JSON и соответствующие им типы <productname>PostgreSQL</productname>

source: JSON primitive type
ru: Примитивный тип JSON

source: <productname>PostgreSQL</productname> type
ru: Тип <productname>PostgreSQL</productname>

source: Notes
ru: Замечания

source: <literal>\u0000</literal> is disallowed, as are non-ASCII Unicode escapes if database encoding is not UTF8
ru: <literal>\u0000</literal> не допускается, как не ASCII символ, если кодировка базы данных не UTF8

source: <literal>NaN</literal> and <literal>infinity</literal> values are disallowed
ru: Значения <literal>NaN</literal> и <literal>infinity</literal> не допускаются

source: Only lowercase <literal>true</literal> and <literal>false</literal> spellings are accepted
ru: Допускаются только варианты <literal>true</literal> и <literal>false</literal> (в нижнем регистре)

source: (none)
ru: (нет)

source: SQL <literal>NULL</literal> is a different concept
ru: <literal>NULL</literal> в SQL имеет другой смысл

source: JSON Input and Output Syntax
ru: Синтаксис вводимых и выводимых значений JSON

source: The input/output syntax for the JSON data types is as specified in <acronym>RFC</acronym> 7159.
ru: Синтаксис ввода/вывода типов данных JSON соответствует стандарту <acronym>RFC</acronym> 7159.

source: -- Simple scalar/primitive value -- Primitive values can be numbers, quoted strings, true, false, or null SELECT '5'::json; -- Array of zero or more elements (elements need not be of same type) SELECT '[1, 2, "foo", null]'::json; -- Object containing pairs of keys and values -- Note that object keys must always be quoted strings SELECT '{"bar": "baz", "balance": 7.77, "active": false}'::json; -- Arrays and objects can be nested arbitrarily SELECT '{"foo": [true, "bar"], "tags": {"a": 1, "b": null}}'::json;
ru: -- Простое скалярное/примитивное значение -- Простыми значениями могут быть числа, строки в кавычках, true, false или null SELECT '5'::json; -- Массив из нуля и более элементов (элементы могут быть разных типов) SELECT '[1, 2, "foo", null]'::json; -- Объект, содержащий пары ключей и значений -- Заметьте, что ключи объектов &mdash; это всегда строки в кавычках SELECT '{"bar": "baz", "balance": 7.77, "active": false}'::json; -- Массивы и объекты могут вкладываться произвольным образом SELECT '{"foo": [true, "bar"], "tags": {"a": 1, "b": null}}'::json;

source: The following are all valid <type>json</type> (or <type>jsonb</type>) expressions: <placeholder-1/>
ru: Примеры допустимых выражений с типом <type>json</type> (или <type>jsonb</type>): <placeholder-1/>

source: As previously stated, when a JSON value is input and then printed without any additional processing, <type>json</type> outputs the same text that was input, while <type>jsonb</type> does not preserve semantically-insignificant details such as whitespace. For example, note the differences here: <placeholder-1/> One semantically-insignificant detail worth noting is that in <type>jsonb</type>, numbers will be printed according to the behavior of the underlying <type>numeric</type> type. In practice this means that numbers entered with <literal>E</literal> notation will be printed without it, for example: <placeholder-2/> However, <type>jsonb</type> will preserve trailing fractional zeroes, as seen in this example, even though those are semantically insignificant for purposes such as equality checks.
ru: Как было сказано ранее, когда значение JSON вводится и затем выводится без дополнительной обработки, тип <type>json</type> выводит тот же текст, что поступил на вход, а <type>jsonb</type> не сохраняет семантически незначащие детали, такие как пробелы. Например, посмотрите на эти различия: <placeholder-1/> Первая семантически незначимая деталь, заслуживающая внимания: с <type>jsonb</type> числа выводятся по правилам нижележащего типа <type>numeric</type>. На практике это означает, что числа, заданные в записи с <literal>E</literal>, будут выведены без неё, например: <placeholder-2/> Однако, как видно из этого примера, <type>jsonb</type> сохраняет конечные нули дробного числа, хотя они и не имеют семантической значимости, в частности для проверки на равенство.

source: Designing JSON documents effectively
ru: Эффективная организация документов JSON

source: Representing data as JSON can be considerably more flexible than the traditional relational data model, which is compelling in environments where requirements are fluid. It is quite possible for both approaches to co-exist and complement each other within the same application. However, even for applications where maximal flexibility is desired, it is still recommended that JSON documents have a somewhat fixed structure. The structure is typically unenforced (though enforcing some business rules declaratively is possible), but having a predictable structure makes it easier to write queries that usefully summarize a set of <quote>documents</quote> (datums) in a table.
ru: Представлять данные в JSON можно гораздо более гибко, чем в традиционной реляционной модели данных, что очень привлекательно там, где нет жёстких условий. И оба этих подхода вполне могут сосуществовать и дополнять друг друга в одном приложении. Однако, даже для приложений, которым нужна максимальная гибкость, рекомендуется, чтобы документы JSON имели некоторую фиксированную структуру. Эта структура обычно не навязывается жёстко (хотя можно декларативно диктовать некоторые бизнес-правила), но когда она предсказуема, становится гораздо проще писать запросы, которые извлекают полезные данные из набора <quote>документов</quote> (информации) в таблице.

source: JSON data is subject to the same concurrency-control considerations as any other data type when stored in a table. Although storing large documents is practicable, keep in mind that any update acquires a row-level lock on the whole row. Consider limiting JSON documents to a manageable size in order to decrease lock contention among updating transactions. Ideally, JSON documents should each represent an atomic datum that business rules dictate cannot reasonably be further subdivided into smaller datums that could be modified independently.
ru: Данные JSON, как и данные любых других типов, хранящиеся в таблицах, находятся под контролем механизма параллельного доступа. Хотя хранить большие документы вполне возможно, не забывайте, что при любом изменении устанавливается блокировка всей строки (на уровне строки). Поэтому для оптимизации блокировок транзакций, изменяющих данные, стоит ограничить размер документов JSON разумными пределами. В идеале каждый документ JSON должен собой представлять атомарный информационный блок, который, согласно бизнес-логике, нельзя разделить на меньшие, индивидуально изменяемые блоки.

source: <type>jsonb</type> Containment and Existence
ru: Проверки на вхождение и существование <type>jsonb</type>

source: <primary>jsonb</primary><secondary>containment</secondary>
ru: <primary>jsonb</primary><secondary>вхождение</secondary>

source: <primary>jsonb</primary><secondary>existence</secondary>
ru: <primary>jsonb</primary><secondary>существование</secondary>

source: Testing <firstterm>containment</firstterm> is an important capability of <type>jsonb</type>. There is no parallel set of facilities for the <type>json</type> type. Containment tests whether one <type>jsonb</type> document has contained within it another one. These examples return true except as noted:
ru: Проверка <firstterm>вхождения</firstterm> &mdash; важная особенность типа <type>jsonb</type>, не имеющая аналога для типа <type>json</type>. Эта проверка определяет, входит ли один документ <type>jsonb</type> в другой. В следующих примерах возвращается истинное значение (кроме упомянутых исключений):

source: -- Simple scalar/primitive values contain only the identical value: SELECT '"foo"'::jsonb @&gt; '"foo"'::jsonb; -- The array on the right side is contained within the one on the left: SELECT '[1, 2, 3]'::jsonb @&gt; '[1, 3]'::jsonb; -- Order of array elements is not significant, so this is also true: SELECT '[1, 2, 3]'::jsonb @&gt; '[3, 1]'::jsonb; -- Duplicate array elements don't matter either: SELECT '[1, 2, 3]'::jsonb @&gt; '[1, 2, 2]'::jsonb; -- The object with a single pair on the right side is contained -- within the object on the left side: SELECT '{"product": "PostgreSQL", "version": 9.4, "jsonb": true}'::jsonb @&gt; '{"version": 9.4}'::jsonb; -- The array on the right side is <emphasis>not</emphasis> considered contained within the -- array on the left, even though a similar array is nested within it: SELECT '[1, 2, [1, 3]]'::jsonb @&gt; '[1, 3]'::jsonb; -- yields false -- But with a layer of nesting, it is contained: SELECT '[1, 2, [1, 3]]'::jsonb @&gt; '[[1, 3]]'::jsonb; -- Similarly, containment is not reported here: SELECT '{"foo": {"bar": "baz"}}'::jsonb @&gt; '{"bar": "baz"}'::jsonb; -- yields false -- A top-level key and an empty object is contained: SELECT '{"foo": {"bar": "baz"}}'::jsonb @&gt; '{"foo": {}}'::jsonb;
ru: -- Простые скалярные/примитивные значения включают только одно идентичное значение: SELECT '"foo"'::jsonb @&gt; '"foo"'::jsonb; -- Массив с правой стороны входит в массив слева: SELECT '[1, 2, 3]'::jsonb @&gt; '[1, 3]'::jsonb; -- Порядок элементов в массиве не важен, поэтому это условие тоже выполняется: SELECT '[1, 2, 3]'::jsonb @&gt; '[3, 1]'::jsonb; -- А повторяющиеся элементы массива не имеют значения: SELECT '[1, 2, 3]'::jsonb @&gt; '[1, 2, 2]'::jsonb; -- Объект с одной парой справа входит в объект слева: SELECT '{"product": "PostgreSQL", "version": 9.4, "jsonb": true}'::jsonb @&gt; '{"version": 9.4}'::jsonb; -- Массив справа <emphasis>не</emphasis> считается входящим в -- массив слева, хотя в последний и вложен подобный массив: SELECT '[1, 2, [1, 3]]'::jsonb @&gt; '[1, 3]'::jsonb; -- выдаёт false -- Но если добавить уровень вложенности, проверка на вхождение выполняется: SELECT '[1, 2, [1, 3]]'::jsonb @&gt; '[[1, 3]]'::jsonb; -- Аналогично, это вхождением не считается: SELECT '{"foo": {"bar": "baz"}}'::jsonb @&gt; '{"bar": "baz"}'::jsonb; -- выдаёт false -- Ключ с пустым объектом на верхнем уровне входит в объект с таким ключом: SELECT '{"foo": {"bar": "baz"}}'::jsonb @&gt; '{"foo": {}}'::jsonb;

source: The general principle is that the contained object must match the containing object as to structure and data contents, possibly after discarding some non-matching array elements or object key/value pairs from the containing object. But remember that the order of array elements is not significant when doing a containment match, and duplicate array elements are effectively considered only once.
ru: Общий принцип этой проверки в том, что входящий объект должен соответствовать объекту, содержащему его, по структуре и данным, возможно, после исключения из содержащего объекта лишних элементов массива или пар ключ/значение. Но помните, что порядок элементов массива для проверки на вхождение не имеет значения, а повторяющиеся элементы массива считаются только один раз.

source: As a special exception to the general principle that the structures must match, an array may contain a primitive value:
ru: В качестве особого исключения для требования идентичности структур, массив может содержать примитивное значение:

source: -- This array contains the primitive string value: SELECT '["foo", "bar"]'::jsonb @&gt; '"bar"'::jsonb; -- This exception is not reciprocal -- non-containment is reported here: SELECT '"bar"'::jsonb @&gt; '["bar"]'::jsonb; -- yields false
ru: -- В этот массив входит примитивное строковое значение: SELECT '["foo", "bar"]'::jsonb @&gt; '"bar"'::jsonb; -- Это исключение действует только в одну сторону -- здесь вхождения нет: SELECT '"bar"'::jsonb @&gt; '["bar"]'::jsonb; -- выдаёт false

source: <type>jsonb</type> also has an <firstterm>existence</firstterm> operator, which is a variation on the theme of containment: it tests whether a string (given as a <type>text</type> value) appears as an object key or array element at the top level of the <type>jsonb</type> value. These examples return true except as noted:
ru: Для типа <type>jsonb</type> введён также оператор <firstterm>существования</firstterm>, который является вариацией на тему вхождения: он проверяет, является ли строка (заданная в виде значения <type>text</type>) ключом объекта или элементом массива на верхнем уровне значения <type>jsonb</type>. В следующих примерах возвращается истинное значение (кроме упомянутых исключений):
