Repository: pluzanov/pg-doc-ru
Catalog: 9.6/json.po
Languages: ru

source: -- String exists as array element: SELECT '["foo", "bar", "baz"]'::jsonb ? 'bar'; -- String exists as object key: SELECT '{"foo": "bar"}'::jsonb ? 'foo'; -- Object values are not considered: SELECT '{"foo": "bar"}'::jsonb ? 'bar'; -- yields false -- As with containment, existence must match at the top level: SELECT '{"foo": {"bar": "baz"}}'::jsonb ? 'bar'; -- yields false -- A string is considered to exist if it matches a primitive JSON string: SELECT '"foo"'::jsonb ? 'foo';
ru: -- Строка существует в качестве элемента массива: SELECT '["foo", "bar", "baz"]'::jsonb ? 'bar'; -- Строка существует в качестве ключа объекта: SELECT '{"foo": "bar"}'::jsonb ? 'foo'; -- Значения объектов не рассматриваются: SELECT '{"foo": "bar"}'::jsonb ? 'bar'; -- выдаёт false -- Как и вхождение, существование определяется на верхнем уровне: SELECT '{"foo": {"bar": "baz"}}'::jsonb ? 'bar'; -- выдаёт false -- Строка считается существующей, если она соответствует примитивной строке JSON: SELECT '"foo"'::jsonb ? 'foo';

source: JSON objects are better suited than arrays for testing containment or existence when there are many keys or elements involved, because unlike arrays they are internally optimized for searching, and do not need to be searched linearly.
ru: Объекты JSON для проверок на существование и вхождение со множеством ключей или элементов подходят больше, чем массивы, так как, в отличие от массивов, они внутри оптимизируются для поиска, и поиск элемента не будет линейным.

source: Because JSON containment is nested, an appropriate query can skip explicit selection of sub-objects. As an example, suppose that we have a <structfield>doc</structfield> column containing objects at the top level, with most objects containing <literal>tags</literal> fields that contain arrays of sub-objects. This query finds entries in which sub-objects containing both <literal>"term":"paris"</literal> and <literal>"term":"food"</literal> appear, while ignoring any such keys outside the <literal>tags</literal> array: <placeholder-1/> One could accomplish the same thing with, say, <placeholder-2/> but that approach is less flexible, and often less efficient as well.
ru: Так как вхождение в JSON проверяется с учётом вложенности, правильно написанный запрос может заменить явную выборку внутренних объектов. Например, предположим, что у нас есть столбец <structfield>doc</structfield>, содержащий объекты на верхнем уровне, и большинство этих объектов содержит поля <literal>tags</literal> с массивами вложенных объектов. Данный запрос найдёт записи, в которых вложенные объекты содержат ключи <literal>"term":"paris"</literal> и <literal>"term":"food"</literal>, и при этом пропустит такие ключи, находящиеся вне массива <literal>tags</literal>: <placeholder-1/> Этого же результата можно добиться, например, так: <placeholder-2/> Но данный подход менее гибкий и часто также менее эффективный.

source: On the other hand, the JSON existence operator is not nested: it will only look for the specified key or array element at top level of the JSON value.
ru: С другой стороны, оператор существования JSON не учитывает вложенность: он будет искать заданный ключ или элемент массива только на верхнем уровне значения JSON.

source: The various containment and existence operators, along with all other JSON operators and functions are documented in <xref linkend="functions-json"/>.
ru: Различные операторы вхождения и существования, а также все другие операторы и функции для работы с JSON документированы в <xref remap="6" linkend="functions-json"/>.

source: <type>jsonb</type> Indexing
ru: Индексация <type>jsonb</type>

source: <primary>jsonb</primary><secondary>indexes on</secondary>
ru: <primary>jsonb</primary><secondary>индексы по</secondary>

source: GIN indexes can be used to efficiently search for keys or key/value pairs occurring within a large number of <type>jsonb</type> documents (datums). Two GIN <quote>operator classes</quote> are provided, offering different performance and flexibility trade-offs.
ru: Для эффективного поиска ключей или пар ключ/значение в большом количестве документов <type>jsonb</type> можно успешно применять индексы GIN. Для этого предоставляются два <quote>класса операторов</quote> GIN, предлагающие выбор между производительностью и гибкостью.

source: The default GIN operator class for <type>jsonb</type> supports queries with top-level key-exists operators <literal>?</literal>, <literal>?&amp;</literal> and <literal>?|</literal> operators and path/value-exists operator <literal>@&gt;</literal>. (For details of the semantics that these operators implement, see <xref linkend="functions-jsonb-op-table"/>.) An example of creating an index with this operator class is: <placeholder-1/> The non-default GIN operator class <literal>jsonb_path_ops</literal> supports indexing the <literal>@&gt;</literal> operator only. An example of creating an index with this operator class is: <placeholder-2/>
ru: Класс операторов GIN по умолчанию для <type>jsonb</type> поддерживает запросы с операторами существования ключа на верхнем уровне (<literal>?</literal>, <literal>?&amp;</literal> и <literal>?|</literal>) и оператором существования пути/значения (<literal>@&gt;</literal>). (Подробнее семантика, реализуемая этими операторами, описана в <xref remap="6" linkend="functions-jsonb-op-table"/>.) Пример создания индекса с этим классом операторов: <placeholder-1/> Дополнительный класс операторов GIN <literal>jsonb_path_ops</literal> поддерживает индексацию только для оператора <literal>@&gt;</literal>. Пример создания индекса с этим классом операторов: <placeholder-2/>

source: -- Find documents in which the key "company" has value "Magnafone" SELECT jdoc-&gt;'guid', jdoc-&gt;'name' FROM api WHERE jdoc @&gt; '{"company": "Magnafone"}';
ru: -- Найти документы, в которых ключ "company" имеет значение "Magnafone" SELECT jdoc-&gt;'guid', jdoc-&gt;'name' FROM api WHERE jdoc @&gt; '{"company": "Magnafone"}';

source: -- Find documents in which the key "tags" contains key or array element "qui" SELECT jdoc-&gt;'guid', jdoc-&gt;'name' FROM api WHERE jdoc -&gt; 'tags' ? 'qui';
ru: -- Найти документы, в которых ключ "tags" содержит ключ или элемент массива "qui" SELECT jdoc-&gt;'guid', jdoc-&gt;'name' FROM api WHERE jdoc -&gt; 'tags' ? 'qui';

source: Consider the example of a table that stores JSON documents retrieved from a third-party web service, with a documented schema definition. A typical document is: <placeholder-1/> We store these documents in a table named <structname>api</structname>, in a <type>jsonb</type> column named <structfield>jdoc</structfield>. If a GIN index is created on this column, queries like the following can make use of the index: <placeholder-2/> However, the index could not be used for queries like the following, because though the operator <literal>?</literal> is indexable, it is not applied directly to the indexed column <structfield>jdoc</structfield>: <placeholder-3/> Still, with appropriate use of expression indexes, the above query can use an index. If querying for particular items within the <literal>"tags"</literal> key is common, defining an index like this may be worthwhile: <placeholder-4/> Now, the <literal>WHERE</literal> clause <literal>jdoc -&gt; 'tags' ? 'qui'</literal> will be recognized as an application of the indexable operator <literal>?</literal> to the indexed expression <literal>jdoc -&gt; 'tags'</literal>. (More information on expression indexes can be found in <xref linkend="indexes-expressional"/>.)
ru: Рассмотрим пример таблицы, в которой хранятся документы JSON, получаемые от сторонней веб-службы, с документированным определением схемы. Типичный документ:<placeholder-1/> Мы сохраняем эти документы в таблице <structname>api</structname>, в столбце <structfield>jdoc</structfield> типа <type>jsonb</type>. Если по этому столбцу создаётся GIN-индекс, он может применяться в подобных запросах: <placeholder-2/> Однако, в следующих запросах он не будет использоваться, потому что, несмотря на то, что оператор <literal>?</literal> &mdash; индексируемый, он применяется не к индексированному столбцу <structfield>jdoc</structfield> непосредственно: <placeholder-3/> И всё же, правильно применяя индексы выражений, в этом запросе можно задействовать индекс. Если запрос определённых элементов в ключе <literal>"tags"</literal> выполняется часто, вероятно стоит определить такой индекс: <placeholder-4/> Теперь предложение <literal>WHERE</literal> <literal>jdoc -&gt; 'tags' ? 'qui'</literal> будет выполняться как применение индексируемого оператора <literal>?</literal> к индексируемому выражению <literal>jdoc -&gt; 'tags'</literal>. (Подробнее об индексах выражений можно узнать в <xref remap="6" linkend="indexes-expressional"/>.)

source: -- Find documents in which the key "tags" contains array element "qui" SELECT jdoc-&gt;'guid', jdoc-&gt;'name' FROM api WHERE jdoc @&gt; '{"tags": ["qui"]}';
ru: -- Найти документы, в которых ключ "tags" содержит элемент массива "qui" SELECT jdoc-&gt;'guid', jdoc-&gt;'name' FROM api WHERE jdoc @&gt; '{"tags": ["qui"]}';

source: Another approach to querying is to exploit containment, for example: <placeholder-1/> A simple GIN index on the <structfield>jdoc</structfield> column can support this query. But note that such an index will store copies of every key and value in the <structfield>jdoc</structfield> column, whereas the expression index of the previous example stores only data found under the <literal>tags</literal> key. While the simple-index approach is far more flexible (since it supports queries about any key), targeted expression indexes are likely to be smaller and faster to search than a simple index.
ru: Ещё один подход к использованию проверок на существование: <placeholder-1/> Этот запрос может задействовать простой GIN-индекс по столбцу <structfield>jdoc</structfield>. Но заметьте, что такой индекс будет хранить копии всех ключей и значений в поле <structfield>jdoc</structfield>, тогда как индекс выражения из предыдущего примера хранит только данные внутри объекта с ключом <literal>tags</literal>. Хотя подход с простым индексом гораздо более гибкий (так как он поддерживает запросы по любому ключу), индексы конкретных выражений скорее всего будут меньше и быстрее, чем простые индексы.

source: Although the <literal>jsonb_path_ops</literal> operator class supports only queries with the <literal>@&gt;</literal> operator, it has notable performance advantages over the default operator class <literal>jsonb_ops</literal>. A <literal>jsonb_path_ops</literal> index is usually much smaller than a <literal>jsonb_ops</literal> index over the same data, and the specificity of searches is better, particularly when queries contain keys that appear frequently in the data. Therefore search operations typically perform better than with the default operator class.
ru: Класс операторов <literal>jsonb_path_ops</literal> поддерживает только запросы с оператором <literal>@&gt;</literal>, но зато он значительно производительнее класса по умолчанию <literal>jsonb_ops</literal>. Индекс <literal>jsonb_path_ops</literal> обычно гораздо меньше индекса <literal>jsonb_ops</literal> для тех же данных и более точен при поиске, особенно, если запросы обращаются к ключам, часто встречающимся в данных. Таким образом, с ним операции поиска выполняются гораздо лучше, чем с классом операторов по умолчанию.

source: For this purpose, the term <quote>value</quote> includes array elements, though JSON terminology sometimes considers array elements distinct from values within objects.
ru: Поэтому понятие <quote>значение</quote> включает и элементы массивов, хотя в терминологии JSON иногда элементы массивов считаются отличными от значений внутри объектов.

source: The technical difference between a <literal>jsonb_ops</literal> and a <literal>jsonb_path_ops</literal> GIN index is that the former creates independent index items for each key and value in the data, while the latter creates index items only for each value in the data. <placeholder-1/> Basically, each <literal>jsonb_path_ops</literal> index item is a hash of the value and the key(s) leading to it; for example to index <literal>{"foo": {"bar": "baz"}}</literal>, a single index item would be created incorporating all three of <literal>foo</literal>, <literal>bar</literal>, and <literal>baz</literal> into the hash value. Thus a containment query looking for this structure would result in an extremely specific index search; but there is no way at all to find out whether <literal>foo</literal> appears as a key. On the other hand, a <literal>jsonb_ops</literal> index would create three index items representing <literal>foo</literal>, <literal>bar</literal>, and <literal>baz</literal> separately; then to do the containment query, it would look for rows containing all three of these items. While GIN indexes can perform such an AND search fairly efficiently, it will still be less specific and slower than the equivalent <literal>jsonb_path_ops</literal> search, especially if there are a very large number of rows containing any single one of the three index items.
ru: Техническое различие между GIN-индексами <literal>jsonb_ops</literal> и <literal>jsonb_path_ops</literal> состоит в том, что для первых создаются независимые элементы индекса для каждого ключа/значения в данных, тогда как для вторых создаются элементы только для значений. <placeholder-1/> По сути, каждый элемент индекса <literal>jsonb_path_ops</literal> представляет собой хеш значения и ключа(ей), приводящего к нему; например, при индексации <literal>{"foo": {"bar": "baz"}}</literal> будет создан один элемент индекса с хешем, рассчитанным по всем трём значениям: <literal>foo</literal>, <literal>bar</literal> и <literal>baz</literal>. Таким образом, проверка на вхождение этой структуры будет использовать крайне точный поиск по индексу, но определить, является ли <literal>foo</literal> ключом, с помощью такого индекса нельзя. С другой стороны, индекс <literal>jsonb_ops</literal> создаст три отдельных элемента индекса, представляющих <literal>foo</literal>, <literal>bar</literal> и <literal>baz</literal> по отдельности; для выполнения проверки на вхождение будут проверены строки таблицы, содержащие все эти три значения. Хотя GIN-индексы позволяют вычислить AND довольно эффективно, такой поиск всё же будет менее точным и более медленным, чем равнозначный поиск с <literal>jsonb_path_ops</literal>, особенно если любое одно из этих трёх значений содержится в большом количестве строк.

source: A disadvantage of the <literal>jsonb_path_ops</literal> approach is that it produces no index entries for JSON structures not containing any values, such as <literal>{"a": {}}</literal>. If a search for documents containing such a structure is requested, it will require a full-index scan, which is quite slow. <literal>jsonb_path_ops</literal> is therefore ill-suited for applications that often perform such searches.
ru: Недостаток класса <literal>jsonb_path_ops</literal> заключается в том, что он не учитывает в индексе структуры JSON, не содержащие никаких значений <literal>{"a": {}}</literal>. Для поиска по документам, содержащих такие структуры, потребуется выполнить полное сканирование индекса, что довольно долго, поэтому <literal>jsonb_path_ops</literal> не очень подходит для приложений, часто выполняющих такие запросы.

source: <type>jsonb</type> also supports <literal>btree</literal> and <literal>hash</literal> indexes. These are usually useful only if it's important to check equality of complete JSON documents. The <literal>btree</literal> ordering for <type>jsonb</type> datums is seldom of great interest, but for completeness it is: <synopsis><replaceable>Object</replaceable> &gt; <replaceable>Array</replaceable> &gt; <replaceable>Boolean</replaceable> &gt; <replaceable>Number</replaceable> &gt; <replaceable>String</replaceable> &gt; <replaceable>Null</replaceable> <replaceable>Object with n pairs</replaceable> &gt; <replaceable>object with n - 1 pairs</replaceable> <replaceable>Array with n elements</replaceable> &gt; <replaceable>array with n - 1 elements</replaceable></synopsis> Objects with equal numbers of pairs are compared in the order: <synopsis><replaceable>key-1</replaceable>, <replaceable>value-1</replaceable>, <replaceable>key-2</replaceable> ...</synopsis> Note that object keys are compared in their storage order; in particular, since shorter keys are stored before longer keys, this can lead to results that might be unintuitive, such as: <placeholder-1/> Similarly, arrays with equal numbers of elements are compared in the order: <synopsis><replaceable>element-1</replaceable>, <replaceable>element-2</replaceable> ...</synopsis> Primitive JSON values are compared using the same comparison rules as for the underlying <productname>PostgreSQL</productname> data type. Strings are compared using the default database collation.
ru: Тип <type>jsonb</type> также поддерживает индексы <literal>btree</literal> и <literal>hash</literal>. Они полезны, только если требуется проверять равенство JSON-документов в целом. Порядок сортировки <literal>btree</literal> для типа <type>jsonb</type> редко имеет большое значение, но для полноты он приводится ниже: <synopsis><replaceable>Объект</replaceable> &gt; <replaceable>Массив</replaceable> &gt; <replaceable>Логическое значение</replaceable> &gt; <replaceable>Число</replaceable> &gt; <replaceable>Строка</replaceable> &gt; <replaceable>Null</replaceable> <replaceable>Объект с n парами</replaceable> &gt; <replaceable>Объект с n - 1 парами</replaceable> <replaceable>Массив с n элементами</replaceable> &gt; <replaceable>Массив с n - 1 элементами</replaceable></synopsis> Объекты с равным количеством пар сравниваются в таком порядке: <synopsis><replaceable>ключ-1</replaceable>, <replaceable>значение-1</replaceable>, <replaceable>ключ-2</replaceable> ...</synopsis> Заметьте, что ключи объектов сравниваются согласно порядку при хранении; в частности, из-за того, что короткие ключи хранятся перед длинными, результаты могут оказаться несколько не интуитивными: <placeholder-1/> Массивы с равным числом элементом упорядочиваются аналогично: <synopsis><replaceable>элемент-1</replaceable>, <replaceable>элемент-2</replaceable> ...</synopsis> Примитивные значения JSON сравниваются по тем же правилам сравнения, что и нижележащие типы данных <productname>PostgreSQL</productname>. Строки сравниваются с учётом порядка сортировки по умолчанию в текущей базе данных.
