Repository: pluzanov/pg-doc-ru
Catalog: 9.6/lobj.po
Languages: ru

source: Large Objects
ru: Большие объекты

source: <primary>large object</primary>
ru: <primary>большой объект</primary>

source: <primary>BLOB</primary><see>large object</see>
ru: <primary>BLOB</primary><see>большой объект</see>

source: <productname>PostgreSQL</productname> has a <firstterm>large object</firstterm> facility, which provides stream-style access to user data that is stored in a special large-object structure. Streaming access is useful when working with data values that are too large to manipulate conveniently as a whole.
ru: В <productname>PostgreSQL</productname> имеется механизм для работы с <firstterm>большими объектами</firstterm>, предоставляющий доступ в потоковом режиме к пользовательским данным, сохранённым в специальной структуре больших объектов. Потоковый доступ удобен, когда нужно обрабатывать данные, объём которых слишком велик, чтобы оперировать ими как единым целым.

source: This chapter describes the implementation and the programming and query language interfaces to <productname>PostgreSQL</productname> large object data. We use the <application>libpq</application> C library for the examples in this chapter, but most programming interfaces native to <productname>PostgreSQL</productname> support equivalent functionality. Other interfaces might use the large object interface internally to provide generic support for large values. This is not described here.
ru: В этой главе описывается реализация, а также программный интерфейс и функции языка запросов для работы с данными больших объектов <productname>PostgreSQL</productname>. В примерах в этой главе будет использоваться библиотека <application>libpq</application> для языка C, но та же функциональность поддерживается и другими программными интерфейсами <productname>PostgreSQL</productname>. Другие интерфейсы могут использовать внутри себя интерфейс больших объектов для реализации общего подхода к работе с большими значениями. Здесь это не описывается.

source: Introduction
ru: Введение

source: <primary>TOAST</primary><secondary>versus large objects</secondary>
ru: <primary>TOAST</primary><secondary>в сравнении с большими объектами</secondary>

source: All large objects are stored in a single system table named <link linkend="catalog-pg-largeobject"><structname>pg_largeobject</structname></link>. Each large object also has an entry in the system table <link linkend="catalog-pg-largeobject-metadata"><structname>pg_largeobject_metadata</structname></link>. Large objects can be created, modified, and deleted using a read/write API that is similar to standard operations on files.
ru: Все большие объекты хранятся в одной системной таблице с именем <link linkend="catalog-pg-largeobject"><structname>pg_largeobject</structname></link>. Для каждого большого объекта также имеется запись в системной таблице <link linkend="catalog-pg-largeobject-metadata"><structname>pg_largeobject_metadata</structname></link>. Большие объекты можно создавать, изменять и удалять, используя API чтения/записи, подобный стандартному API для работы с файлами.

source: <productname>PostgreSQL</productname> also supports a storage system called <link linkend="storage-toast"><quote><acronym>TOAST</acronym></quote></link>, which automatically stores values larger than a single database page into a secondary storage area per table. This makes the large object facility partially obsolete. One remaining advantage of the large object facility is that it allows values up to 4 TB in size, whereas <acronym>TOAST</acronym>ed fields can be at most 1 GB. Also, reading and updating portions of a large object can be done efficiently, while most operations on a <acronym>TOAST</acronym>ed field will read or write the whole value as a unit.
ru: <productname>PostgreSQL</productname> также поддерживает систему хранения, названную <link linkend="storage-toast"><quote><acronym>TOAST</acronym></quote></link>, которая автоматически переносит значения, не умещающиеся в одну страницу таблицы, в дополнительную область хранилища. Вследствие этого подсистема больших объектов отчасти оказывается устаревшей. Однако её преимуществом остаётся то, что она позволяет сохранять значения размером до 4 Тбайт, тогда как поля в <acronym>TOAST</acronym> ограничиваются 1 Гбайтом. Кроме того, чтение и изменение больших объектов можно выполнять эффективнее по сравнению с полями <acronym>TOAST</acronym>, которые при большинстве операций считываются и записываются как единое целое.

source: Implementation Features
ru: Особенности реализации

source: The large object implementation breaks large objects up into <quote>chunks</quote> and stores the chunks in rows in the database. A B-tree index guarantees fast searches for the correct chunk number when doing random access reads and writes.
ru: Механизм больших объектов разбивает большие объекты на <quote>фрагменты</quote> и сохраняет эти фрагменты в строках таблицы. При произвольном доступе на запись и чтение быстрый поиск нужного фрагмента обеспечивается индексом-B-деревом в этой таблице.

source: The chunks stored for a large object do not have to be contiguous. For example, if an application opens a new large object, seeks to offset 1000000, and writes a few bytes there, this does not result in allocation of 1000000 bytes worth of storage; only of chunks covering the range of data bytes actually written. A read operation will, however, read out zeroes for any unallocated locations preceding the last existing chunk. This corresponds to the common behavior of <quote>sparsely allocated</quote> files in <acronym>Unix</acronym> file systems.
ru: Фрагменты больших объектов не должны быть последовательными. Например, если приложение откроет новый большой объект, переместится к смещению 1000000 байт и запишет несколько байт, это не приведёт к выделению лишнего 1000000 байт в хранилище; записаны будут только фрагменты, покрывающие диапазон собственно записанных байт. Операция чтения, однако, прочитает нули для всех неразмещённых в хранилище байт, предшествующих последнему записанному фрагменту. Это соответствует принятому поведению <quote>разреженных</quote> файлов в файловых системах <acronym>Unix</acronym>.

source: As of <productname>PostgreSQL</productname> 9.0, large objects have an owner and a set of access permissions, which can be managed using <xref linkend="sql-grant"/> and <xref linkend="sql-revoke"/>. <literal>SELECT</literal> privileges are required to read a large object, and <literal>UPDATE</literal> privileges are required to write or truncate it. Only the large object's owner (or a database superuser) can delete, comment on, or change the owner of a large object. To adjust this behavior for compatibility with prior releases, see the <xref linkend="guc-lo-compat-privileges"/> run-time parameter.
ru: Начиная с <productname>PostgreSQL</productname> 9.0, для больших объектов назначается владелец и набор прав доступа, которыми можно управлять командами <xref linkend="sql-grant"/> и <xref linkend="sql-revoke"/>. Для чтения большого объекта требуются права <literal>SELECT</literal>, а для записи или усечения его — права <literal>UPDATE</literal>. Удалять большой объект, задавать комментарий для него, либо сменять его владельца разрешается только его владельцу (или суперпользователю базы данных). Для совместимости с предыдущими версиями можно скорректировать это поведение, изменив параметр времени выполнения <xref linkend="guc-lo-compat-privileges"/>.

source: Client Interfaces
ru: Клиентские интерфейсы

source: This section describes the facilities that <productname>PostgreSQL</productname>'s <application>libpq</application> client interface library provides for accessing large objects. The <productname>PostgreSQL</productname> large object interface is modeled after the <acronym>Unix</acronym> file-system interface, with analogues of <function>open</function>, <function>read</function>, <function>write</function>, <function>lseek</function>, etc.
ru: В этом разделе описываются средства, которые предоставляет клиентская библиотека <productname>PostgreSQL</productname> <application>libpq</application> для обращения к большим объектам. Интерфейс работы с большими объектами <productname>PostgreSQL</productname> создан по подобию интерфейса файловых систем <acronym>Unix</acronym>, так что он включает аналоги функций <function>open</function>, <function>read</function>, <function>write</function>, <function>lseek</function> и т. д.

source: All large object manipulation using these functions <emphasis>must</emphasis> take place within an SQL transaction block, since large object file descriptors are only valid for the duration of a transaction.
ru: Все операции с большими объектами с применением этих функций <emphasis>должны</emphasis> иметь место в блоке транзакции SQL, так как дескрипторы больших объектов актуальны только во время транзакции.

source: If an error occurs while executing any one of these functions, the function will return an otherwise-impossible value, typically 0 or -1. A message describing the error is stored in the connection object and can be retrieved with <function>PQerrorMessage</function>.
ru: Если при выполнении одной из этих функций происходит ошибка, эта функция возвращает значение, иначе невозможное, обычно 0 или -1. Сообщение, описывающее ошибку, сохраняется в объекте соединения; получить его можно с помощью <function>PQerrorMessage</function>.

source: Client applications that use these functions should include the header file <filename>libpq/libpq-fs.h</filename> and link with the <application>libpq</application> library.
ru: Клиентские приложения, которые используют эти функции, должны включать заголовочный файл <filename>libpq/libpq-fs.h</filename> и компоноваться с библиотекой <application>libpq</application>.

source: Creating a Large Object
ru: Создание большого объекта

source: <placeholder-1/> The function <synopsis>Oid lo_creat(PGconn *conn, int mode);</synopsis> creates a new large object. The return value is the OID that was assigned to the new large object, or <symbol>InvalidOid</symbol> (zero) on failure. <replaceable class="parameter">mode</replaceable> is unused and ignored as of <productname>PostgreSQL</productname> 8.1; however, for backward compatibility with earlier releases it is best to set it to <symbol>INV_READ</symbol>, <symbol>INV_WRITE</symbol>, or <symbol>INV_READ</symbol> <literal>|</literal> <symbol>INV_WRITE</symbol>. (These symbolic constants are defined in the header file <filename>libpq/libpq-fs.h</filename>.)
ru: <placeholder-1/> Функция <synopsis>Oid lo_creat(PGconn *conn, int mode);</synopsis> создаёт новый большой объект. Возвращаемым значением будет OID, назначенный новому объекту, либо <symbol>InvalidOid</symbol> (ноль) в случае ошибки. Параметр <replaceable class="parameter">mode</replaceable> не используется и игнорируется, начиная с <productname>PostgreSQL</productname> 8.1; однако для обратной совместимости с более ранними выпусками в нём лучше задать значение <symbol>INV_READ</symbol>, <symbol>INV_WRITE</symbol> или <symbol>INV_READ</symbol> <literal>|</literal> <symbol>INV_WRITE</symbol>. (Эти константы определены в заголовочном файле <filename>libpq/libpq-fs.h</filename>.)

source: An example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: <placeholder-1/> The function <synopsis>Oid lo_create(PGconn *conn, Oid lobjId);</synopsis> also creates a new large object. The OID to be assigned can be specified by <replaceable class="parameter">lobjId</replaceable>; if so, failure occurs if that OID is already in use for some large object. If <replaceable class="parameter">lobjId</replaceable> is <symbol>InvalidOid</symbol> (zero) then <function>lo_create</function> assigns an unused OID (this is the same behavior as <function>lo_creat</function>). The return value is the OID that was assigned to the new large object, or <symbol>InvalidOid</symbol> (zero) on failure.
ru: <placeholder-1/> Функция <synopsis>Oid lo_create(PGconn *conn, Oid lobjId);</synopsis> также создаёт новый большой объект. В <replaceable class="parameter">lobjId</replaceable> можно задать назначаемый ему OID; при этом произойдёт ошибка, если этот OID уже присвоен какому-либо большому объекту. Если в <replaceable class="parameter">lobjId</replaceable> передаётся <symbol>InvalidOid</symbol> (ноль), <function>lo_create</function> присваивает большому объекту свободный OID (так же, как и <function>lo_creat</function>). Возвращаемым значением будет OID, назначенный новому большому объекту, либо <symbol>InvalidOid</symbol> (ноль) в случае ошибки.

source: <function>lo_create</function> is new as of <productname>PostgreSQL</productname> 8.1; if this function is run against an older server version, it will fail and return <symbol>InvalidOid</symbol>.
ru: Функция <function>lo_create</function> появилась в <productname>PostgreSQL</productname> 8.1; если попытаться выполнить её с сервером более старой версии, произойдёт ошибка и будет возвращено <symbol>InvalidOid</symbol>.

source: Importing a Large Object
ru: Импорт большого объекта

source: <placeholder-1/> To import an operating system file as a large object, call <synopsis>Oid lo_import(PGconn *conn, const char *filename);</synopsis> <replaceable class="parameter">filename</replaceable> specifies the operating system name of the file to be imported as a large object. The return value is the OID that was assigned to the new large object, or <symbol>InvalidOid</symbol> (zero) on failure. Note that the file is read by the client interface library, not by the server; so it must exist in the client file system and be readable by the client application.
ru: <placeholder-1/> Чтобы импортировать в качестве большого объекта файл операционной системы, вызовите <synopsis>Oid lo_import(PGconn *conn, const char *filename);</synopsis> В <replaceable class="parameter">filename</replaceable> задаётся имя файла в операционной системе, который будет импортирован как большой объект. Возвращаемым значением будет OID, назначенный новому большому объекту, либо <symbol>InvalidOid</symbol> (ноль) в случае ошибки. Заметьте, что этот файл читает библиотека клиентского интерфейса, а не сервер; таким образом, он должен существовать в файловой системе на стороне клиента и быть доступным для чтения клиентскому приложению.

source: <placeholder-1/> The function <synopsis>Oid lo_import_with_oid(PGconn *conn, const char *filename, Oid lobjId);</synopsis> also imports a new large object. The OID to be assigned can be specified by <replaceable class="parameter">lobjId</replaceable>; if so, failure occurs if that OID is already in use for some large object. If <replaceable class="parameter">lobjId</replaceable> is <symbol>InvalidOid</symbol> (zero) then <function>lo_import_with_oid</function> assigns an unused OID (this is the same behavior as <function>lo_import</function>). The return value is the OID that was assigned to the new large object, or <symbol>InvalidOid</symbol> (zero) on failure.
ru: <placeholder-1/> Функция <synopsis>Oid lo_import_with_oid(PGconn *conn, const char *filename, Oid lobjId);</synopsis> также импортирует новый большой объект. В <replaceable class="parameter">lobjId</replaceable> можно задать назначаемый ему OID; при этом произойдёт ошибка, если этот OID уже присвоен какому-либо большому объекту. Если в <replaceable class="parameter">lobjId</replaceable> передаётся <symbol>InvalidOid</symbol> (ноль), <function>lo_import_with_oid</function> присваивает большому объекту свободный OID (так же, как и <function>lo_import</function>). Возвращаемым значением будет OID, назначенный новому большому объекту, либо <symbol>InvalidOid</symbol> (ноль) в случае ошибки.

source: <function>lo_import_with_oid</function> is new as of <productname>PostgreSQL</productname> 8.4 and uses <function>lo_create</function> internally which is new in 8.1; if this function is run against 8.0 or before, it will fail and return <symbol>InvalidOid</symbol>.
ru: Функция <function>lo_import_with_oid</function> появилась в <productname>PostgreSQL</productname> 8.4 и вызывает внутри <function>lo_create</function>, появившуюся в 8.1; если попытаться выполнить её с сервером версии 8.0 или ранней, она завершится ошибкой и возвратит <symbol>InvalidOid</symbol>.

source: Exporting a Large Object
ru: Экспорт большого объекта

source: <placeholder-1/> To export a large object into an operating system file, call <synopsis>int lo_export(PGconn *conn, Oid lobjId, const char *filename);</synopsis> The <parameter>lobjId</parameter> argument specifies the OID of the large object to export and the <parameter>filename</parameter> argument specifies the operating system name of the file. Note that the file is written by the client interface library, not by the server. Returns 1 on success, -1 on failure.
ru: <placeholder-1/> Чтобы экспортировать большой объект в файл операционной системы, вызовите <synopsis>int lo_export(PGconn *conn, Oid lobjId, const char *filename);</synopsis> В аргументе <parameter>lobjId</parameter> задаётся OID экспортируемого большого объекта, а в аргументе <parameter>filename</parameter> задаётся имя файла в операционной системе. Заметьте, что файл записывается библиотекой клиентского интерфейса, а не сервером. Возвращает 1 при успешном выполнении, -1 при ошибке.

source: Opening an Existing Large Object
ru: Открытие существующего большого объекта

source: <placeholder-1/> To open an existing large object for reading or writing, call <synopsis>int lo_open(PGconn *conn, Oid lobjId, int mode);</synopsis> The <parameter>lobjId</parameter> argument specifies the OID of the large object to open. The <parameter>mode</parameter> bits control whether the object is opened for reading (<symbol>INV_READ</symbol>), writing (<symbol>INV_WRITE</symbol>), or both. (These symbolic constants are defined in the header file <filename>libpq/libpq-fs.h</filename>.) <function>lo_open</function> returns a (non-negative) large object descriptor for later use in <function>lo_read</function>, <function>lo_write</function>, <function>lo_lseek</function>, <function>lo_lseek64</function>, <function>lo_tell</function>, <function>lo_tell64</function>, <function>lo_truncate</function>, <function>lo_truncate64</function>, and <function>lo_close</function>. The descriptor is only valid for the duration of the current transaction. On failure, -1 is returned.
ru: <placeholder-1/> Чтобы открыть существующий большой объект для чтения или записи, вызовите <synopsis>int lo_open(PGconn *conn, Oid lobjId, int mode);</synopsis> В аргументе <parameter>lobjId</parameter> задаётся OID открываемого большого объекта. Биты в аргументе <parameter>mode</parameter> определяют, открывается ли файл для чтения (<symbol>INV_READ</symbol>), для записи (<symbol>INV_WRITE</symbol>), либо для чтения/записи. (Эти константы определяются в заголовочном файле <filename>libpq/libpq-fs.h</filename>.) Функция <function>lo_open</function> возвращает дескриптор большого объекта (неотрицательный) для последующего использования в функциях <function>lo_read</function>, <function>lo_write</function>, <function>lo_lseek</function>, <function>lo_lseek64</function>, <function>lo_tell</function>, <function>lo_tell64</function>, <function>lo_truncate</function>, <function>lo_truncate64</function> и <function>lo_close</function>. Этот дескриптор актуален только до завершения текущей транзакции. В случае ошибки возвращается -1.

source: The server currently does not distinguish between modes <symbol>INV_WRITE</symbol> and <symbol>INV_READ</symbol> <literal>|</literal> <symbol>INV_WRITE</symbol>: you are allowed to read from the descriptor in either case. However there is a significant difference between these modes and <symbol>INV_READ</symbol> alone: with <symbol>INV_READ</symbol> you cannot write on the descriptor, and the data read from it will reflect the contents of the large object at the time of the transaction snapshot that was active when <function>lo_open</function> was executed, regardless of later writes by this or other transactions. Reading from a descriptor opened with <symbol>INV_WRITE</symbol> returns data that reflects all writes of other committed transactions as well as writes of the current transaction. This is similar to the behavior of <literal>REPEATABLE READ</literal> versus <literal>READ COMMITTED</literal> transaction modes for ordinary SQL <command>SELECT</command> commands.
ru: В настоящее время сервер не различает режимы <symbol>INV_WRITE</symbol> и <symbol>INV_READ</symbol> <literal>|</literal> <symbol>INV_WRITE</symbol>: с таким дескриптором можно читать данные в любом случае. Однако есть значительное отличие этих режимов от одиночного <symbol>INV_READ</symbol>: с дескриптором <symbol>INV_READ</symbol> записывать данные нельзя, а данные, считываемые через него, будут отражать содержимое большого объекта в снимке транзакции, который был активен при выполнении <function>lo_open</function>, то есть не будут включать изменения, произведённые позже этой или другими транзакциями. При чтении с дескриптором <symbol>INV_WRITE</symbol> возвращаются данные, отражающие все изменения, произведённые другими зафиксированными транзакциями, а также текущей транзакцией. Это подобно различиям режимов <literal>REPEATABLE READ</literal> и <literal>READ COMMITTED</literal> для обычных команд SQL <command>SELECT</command>.

source: Writing Data to a Large Object
ru: Запись данных в большой объект

source: <placeholder-1/> The function <synopsis>int lo_write(PGconn *conn, int fd, const char *buf, size_t len);</synopsis> writes <parameter>len</parameter> bytes from <parameter>buf</parameter> (which must be of size <parameter>len</parameter>) to large object descriptor <parameter>fd</parameter>. The <parameter>fd</parameter> argument must have been returned by a previous <function>lo_open</function>. The number of bytes actually written is returned (in the current implementation, this will always equal <parameter>len</parameter> unless there is an error). In the event of an error, the return value is -1.
ru: <placeholder-1/> Функция <synopsis>int lo_write(PGconn *conn, int fd, const char *buf, size_t len);</synopsis> записывает <parameter>len</parameter> байт из буфера <parameter>buf</parameter> (который должен иметь размер <parameter>len</parameter>) в дескриптор большого объекта <parameter>fd</parameter>. В <parameter>fd</parameter> должно передаваться значение, возвращённое предыдущим вызовом <function>lo_open</function>. Возвращает эта функция число фактически записанных байт (в текущей реализации это всегда <parameter>len</parameter>, если только не произошла ошибка). В случае ошибки возвращается значение -1.

source: Although the <parameter>len</parameter> parameter is declared as <type>size_t</type>, this function will reject length values larger than <literal>INT_MAX</literal>. In practice, it's best to transfer data in chunks of at most a few megabytes anyway.
ru: Хотя параметр <parameter>len</parameter> объявлен как <type>size_t</type>, эта функция не принимает значение длины, превышающее <literal>INT_MAX</literal>. На практике всё равно лучше передавать данные фрагментами не больше нескольких мегабайт.

source: Reading Data from a Large Object
ru: Чтение данных из большого объекта
