Repository: pluzanov/pg-doc-ru
Catalog: 9.6/lobj.po
Languages: ru

source: <placeholder-1/> The function <synopsis>int lo_read(PGconn *conn, int fd, char *buf, size_t len);</synopsis> reads up to <parameter>len</parameter> bytes from large object descriptor <parameter>fd</parameter> into <parameter>buf</parameter> (which must be of size <parameter>len</parameter>). The <parameter>fd</parameter> argument must have been returned by a previous <function>lo_open</function>. The number of bytes actually read is returned; this will be less than <parameter>len</parameter> if the end of the large object is reached first. In the event of an error, the return value is -1.
ru: <placeholder-1/> Функция <synopsis>int lo_read(PGconn *conn, int fd, char *buf, size_t len);</synopsis> читает до <parameter>len</parameter> байт из дескриптора большого объекта <parameter>fd</parameter> в буфер <parameter>buf</parameter> (который должен иметь размер <parameter>len</parameter>). В <parameter>fd</parameter> должно передаваться значение, возвращённое предыдущим вызовом <function>lo_open</function>. Возвращает эта функция число фактически прочитанных байт; это число должно быть меньше <parameter>len</parameter>, если при чтении был достигнут конец объекта. В случае ошибки возвращается -1.

source: Seeking in a Large Object
ru: Перемещение в большом объекте

source: <placeholder-1/> To change the current read or write location associated with a large object descriptor, call <synopsis>int lo_lseek(PGconn *conn, int fd, int offset, int whence);</synopsis> This function moves the current location pointer for the large object descriptor identified by <parameter>fd</parameter> to the new location specified by <parameter>offset</parameter>. The valid values for <parameter>whence</parameter> are <symbol>SEEK_SET</symbol> (seek from object start), <symbol>SEEK_CUR</symbol> (seek from current position), and <symbol>SEEK_END</symbol> (seek from object end). The return value is the new location pointer, or -1 on error.
ru: <placeholder-1/> Чтобы изменить текущее положение чтения или записи, связанное с дескриптором большого объекта, вызовите <synopsis>int lo_lseek(PGconn *conn, int fd, int offset, int whence);</synopsis> Эта функция перемещает указатель текущего положения для дескриптора большого объекта <parameter>fd</parameter> в новое положение, заданное аргументом <parameter>offset</parameter>. Для аргумента <parameter>whence</parameter> задаются значения <symbol>SEEK_SET</symbol> (перемещение от начала объекта), <symbol>SEEK_CUR</symbol> (перемещение от текущего положения) и <symbol>SEEK_END</symbol> (перемещение от конца объекта). Возвращает эта функция новое положение указателя, либо -1 в случае ошибки.

source: <placeholder-1/> When dealing with large objects that might exceed 2GB in size, instead use <synopsis>pg_int64 lo_lseek64(PGconn *conn, int fd, pg_int64 offset, int whence);</synopsis> This function has the same behavior as <function>lo_lseek</function>, but it can accept an <parameter>offset</parameter> larger than 2GB and/or deliver a result larger than 2GB. Note that <function>lo_lseek</function> will fail if the new location pointer would be greater than 2GB.
ru: <placeholder-1/> Оперируя с большими объектами, размер которых превышает 2 ГБ, используйте <synopsis>pg_int64 lo_lseek64(PGconn *conn, int fd, pg_int64 offset, int whence);</synopsis> Эта функция действует так же, как и <function>lo_lseek</function>, но может принять значение <parameter>offset</parameter>, превышающее 2 ГБ, и/или вернуть результат, превышающий 2 ГБ. Заметьте, что если новое положение указателя оказывается за границей в 2ГБ, функция <function>lo_lseek</function> выдаёт ошибку.

source: <function>lo_lseek64</function> is new as of <productname>PostgreSQL</productname> 9.3. If this function is run against an older server version, it will fail and return -1.
ru: Функция <function>lo_lseek64</function> появилась в <productname>PostgreSQL</productname> 9.3. Если попытаться выполнить её с сервером более старой версии, произойдёт ошибка и будет возвращено -1.

source: Obtaining the Seek Position of a Large Object
ru: Получение текущего положения в большом объекте

source: <placeholder-1/> To obtain the current read or write location of a large object descriptor, call <synopsis>int lo_tell(PGconn *conn, int fd);</synopsis> If there is an error, the return value is -1.
ru: <placeholder-1/> Чтобы получить текущее положение чтения или записи для дескриптора большого объекта, вызовите <synopsis>int lo_tell(PGconn *conn, int fd);</synopsis> Если возникает ошибка, возвращается -1.

source: <placeholder-1/> When dealing with large objects that might exceed 2GB in size, instead use <synopsis>pg_int64 lo_tell64(PGconn *conn, int fd);</synopsis> This function has the same behavior as <function>lo_tell</function>, but it can deliver a result larger than 2GB. Note that <function>lo_tell</function> will fail if the current read/write location is greater than 2GB.
ru: <placeholder-1/> Оперируя с большими объектами, размер которых может превышать 2 ГБ, используйте <synopsis>pg_int64 lo_tell64(PGconn *conn, int fd);</synopsis> Эта функция действует так же, как <function>lo_tell</function>, но может выдавать результат, превышающий 2 ГБ. Заметьте, что <function>lo_tell</function> выдаёт ошибку, если текущее положение чтения/записи оказывается за границей в 2 ГБ.

source: <function>lo_tell64</function> is new as of <productname>PostgreSQL</productname> 9.3. If this function is run against an older server version, it will fail and return -1.
ru: Функция <function>lo_tell64</function> появилась в <productname>PostgreSQL</productname> 9.3. Если попытаться выполнить её с сервером более старой версии, произойдёт ошибка и будет возвращено -1.

source: Truncating a Large Object
ru: Усечение большого объекта

source: <placeholder-1/> To truncate a large object to a given length, call <synopsis>int lo_truncate(PGcon *conn, int fd, size_t len);</synopsis> This function truncates the large object descriptor <parameter>fd</parameter> to length <parameter>len</parameter>. The <parameter>fd</parameter> argument must have been returned by a previous <function>lo_open</function>. If <parameter>len</parameter> is greater than the large object's current length, the large object is extended to the specified length with null bytes ('\0'). On success, <function>lo_truncate</function> returns zero. On error, the return value is -1.
ru: <placeholder-1/> Чтобы усечь большой объект до требуемой длины, вызовите <synopsis>int lo_truncate(PGcon *conn, int fd, size_t len);</synopsis> Эта функция усекает большой объект с дескриптором <parameter>fd</parameter> до длины <parameter>len</parameter>. В <parameter>fd</parameter> должно передаваться значение, возвращённое предыдущим вызовом <function>lo_open</function>. Если <parameter>len</parameter> превышает текущую длину большого объекта, большой объект расширяется до заданной длины нулевыми байтами ('\0'). В случае успеха <function>lo_truncate</function> возвращает ноль, а при ошибке возвращается -1.

source: The read/write location associated with the descriptor <parameter>fd</parameter> is not changed.
ru: Положение чтения/записи, связанное с дескриптором <parameter>fd</parameter>, при этом не меняется.

source: Although the <parameter>len</parameter> parameter is declared as <type>size_t</type>, <function>lo_truncate</function> will reject length values larger than <literal>INT_MAX</literal>.
ru: Хотя параметр <parameter>len</parameter> объявлен как <type>size_t</type>, <function>lo_truncate</function> не принимает значение длины, превышающее <literal>INT_MAX</literal>.

source: <placeholder-1/> When dealing with large objects that might exceed 2GB in size, instead use <synopsis>int lo_truncate64(PGcon *conn, int fd, pg_int64 len);</synopsis> This function has the same behavior as <function>lo_truncate</function>, but it can accept a <parameter>len</parameter> value exceeding 2GB.
ru: <placeholder-1/> Оперируя с большими объектами, размер которых может превышать 2 ГБ, используйте <synopsis>int lo_truncate64(PGcon *conn, int fd, pg_int64 len);</synopsis> Эта функция действует так же, как <function>lo_truncate</function>, но может принимать значения <parameter>len</parameter>, превышающие 2 ГБ.

source: <function>lo_truncate</function> is new as of <productname>PostgreSQL</productname> 8.3; if this function is run against an older server version, it will fail and return -1.
ru: Функция <function>lo_truncate</function> появилась в <productname>PostgreSQL</productname> 8.3; если попытаться выполнить её с сервером более старой версии, произойдёт ошибка и будет возвращено -1.

source: <function>lo_truncate64</function> is new as of <productname>PostgreSQL</productname> 9.3; if this function is run against an older server version, it will fail and return -1.
ru: Функция <function>lo_truncate64</function> появилась в <productname>PostgreSQL</productname> 9.3; если попытаться выполнить её с сервером более старой версии, произойдёт ошибка и будет возвращено -1.

source: Closing a Large Object Descriptor
ru: Закрытие дескриптора большого объекта

source: <placeholder-1/> A large object descriptor can be closed by calling <synopsis>int lo_close(PGconn *conn, int fd);</synopsis> where <parameter>fd</parameter> is a large object descriptor returned by <function>lo_open</function>. On success, <function>lo_close</function> returns zero. On error, the return value is -1.
ru: <placeholder-1/> Дескриптор большого объекта можно закрыть, вызвав <synopsis>int lo_close(PGconn *conn, int fd);</synopsis> Здесь <parameter>fd</parameter> — дескриптор большого объекта, возвращённый функцией <function>lo_open</function>. В случае успеха <function>lo_close</function> возвращает ноль. При ошибке возвращается -1.

source: Any large object descriptors that remain open at the end of a transaction will be closed automatically.
ru: Все дескрипторы больших объектов, остающиеся открытыми в конце транзакции, закрываются автоматически.

source: Removing a Large Object
ru: Удаление большого объекта

source: <placeholder-1/> To remove a large object from the database, call <synopsis>int lo_unlink(PGconn *conn, Oid lobjId);</synopsis> The <parameter>lobjId</parameter> argument specifies the OID of the large object to remove. Returns 1 if successful, -1 on failure.
ru: <placeholder-1/> Чтобы удалить большой объект из базы данных, вызовите <synopsis>int lo_unlink(PGconn *conn, Oid lobjId);</synopsis> В аргументе <parameter>lobjId</parameter> задаётся OID большого объекта, который нужно удалить. В случае успеха возвращается 1, а в случае ошибки -1.

source: Server-side Functions
ru: Серверные функции

source: Server-side functions tailored for manipulating large objects from SQL are listed in <xref linkend="lo-funcs-table"/>.
ru: Функции, предназначенные для работы с большими объектами на стороне сервера из SQL, перечислены в <xref remap="6" linkend="lo-funcs-table"/>.

source: SQL-oriented Large Object Functions
ru: SQL-ориентированные функции для работы с большими объектами

source: Function
ru: Функция

source: Return Type
ru: Тип результата

source: Description
ru: Описание

source: Example
ru: Пример

source: Result
ru: Результат

source: Create a large object and store data there, returning its OID. Pass <literal>0</literal> to have the system choose an OID.
ru: Создаёт большой объект, сохраняет в нём данные и возвращает его OID. С <literal>0</literal> система выбирает OID сама.

source: Write data at the given offset.
ru: Записывает данные по заданному смещению.

source: Extract contents or a substring thereof.
ru: Извлекает содержимое подстроки.

source: CREATE TABLE image ( name text, raster oid ); SELECT lo_creat(-1); -- returns OID of new, empty large object SELECT lo_create(43213); -- attempts to create large object with OID 43213 SELECT lo_unlink(173454); -- deletes large object with OID 173454 INSERT INTO image (name, raster) VALUES ('beautiful image', lo_import('/etc/motd')); INSERT INTO image (name, raster) -- same as above, but specify OID to use VALUES ('beautiful image', lo_import('/etc/motd', 68583)); SELECT lo_export(image.raster, '/tmp/motd') FROM image WHERE name = 'beautiful image';
ru: CREATE TABLE image ( name text, raster oid ); SELECT lo_creat(-1); -- возвращает OID нового пустого большого объекта SELECT lo_create(43213); -- пытается создать большой объект с OID 43213 SELECT lo_unlink(173454); -- удаляет большой объект с OID 173454 INSERT INTO image (name, raster) VALUES ('beautiful image', lo_import('/etc/motd')); INSERT INTO image (name, raster) -- то же, что выше, но с предопределённым OID VALUES ('beautiful image', lo_import('/etc/motd', 68583)); SELECT lo_export(image.raster, '/tmp/motd') FROM image WHERE name = 'beautiful image';

source: There are additional server-side functions corresponding to each of the client-side functions described earlier; indeed, for the most part the client-side functions are simply interfaces to the equivalent server-side functions. The ones just as convenient to call via SQL commands are <function>lo_creat</function><placeholder-1/>, <function>lo_create</function>, <function>lo_unlink</function><placeholder-2/>, <function>lo_import</function><placeholder-3/>, and <function>lo_export</function><placeholder-4/>. Here are examples of their use: <placeholder-5/>
ru: Каждой из клиентских функций, описанных ранее, соответствуют дополнительные функции на стороне сервера; на самом деле, по большей части клиентские функции представляют собой просто интерфейсы к равнозначным серверным функциям. К функциям, которые так же удобно вызывать командами SQL, относятся: <function>lo_creat</function><placeholder-1/>, <function>lo_create</function>, <function>lo_unlink</function><placeholder-2/>, <function>lo_import</function><placeholder-3/> и <function>lo_export</function><placeholder-4/>. Ниже приведены примеры их использования: <placeholder-5/>

source: The server-side <function>lo_import</function> and <function>lo_export</function> functions behave considerably differently from their client-side analogs. These two functions read and write files in the server's file system, using the permissions of the database's owning user. Therefore, their use is restricted to superusers. In contrast, the client-side import and export functions read and write files in the client's file system, using the permissions of the client program. The client-side functions do not require superuser privilege.
ru: Серверные функции <function>lo_import</function> и <function>lo_export</function> значительно отличаются от их аналогов, выполняемых на стороне клиента. Эти две функции читают и пишут файлы в файловой системе сервера, с правами пользователя, владеющего базами данных. Поэтому использовать их разрешено только суперпользователям. Клиентские функции импорта и экспорта, напротив, читают и пишут файлы в файловой системе клиента, с правами клиентской программы. Для выполнения клиентских функций права суперпользователя не требуются.

source: The functionality of <function>lo_read</function> and <function>lo_write</function> is also available via server-side calls, but the names of the server-side functions differ from the client side interfaces in that they do not contain underscores. You must call these functions as <function>loread</function> and <function>lowrite</function>.
ru: Функциональность <function>lo_read</function> и <function>lo_write</function> также представляется через вызовы на стороне сервера, но имена серверных функций, в отличие от клиентских, не содержат символы подчёркивания. Эти функции нужно вызывать по именам <function>loread</function> и <function>lowrite</function>.

source: Example Program
ru: Пример программы

source: <xref linkend="lo-example"/> is a sample program which shows how the large object interface in <application>libpq</application> can be used. Parts of the program are commented out but are left in the source for the reader's benefit. This program can also be found in <filename>src/test/examples/testlo.c</filename> in the source distribution.
ru: В <xref remap="6" linkend="lo-example"/> представлена пробная программа, демонстрирующая использование интерфейса больших объектов в <application>libpq</application>. Части этой программы закомментированы, но оставлены в тексте для читателя. Эту программу также можно найти в <filename>src/test/examples/testlo.c</filename> в дистрибутиве исходного кода.

source: Large Objects with <application>libpq</application> Example Program
ru: Пример использования больших объектов с применением <application>libpq</application>
