Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ltree.po
Languages: ru

source: This module implements a data type <type>ltree</type> for representing labels of data stored in a hierarchical tree-like structure. Extensive facilities for searching through label trees are provided.
ru: Этот модуль реализует тип данных <type>ltree</type> для представления меток данных в иерархической древовидной структуре. Он также предоставляет расширенные средства для поиска в таких деревьях.

source: Definitions
ru: Определения

source: A <firstterm>label</firstterm> is a sequence of alphanumeric characters and underscores (for example, in C locale the characters <literal>A-Za-z0-9_</literal> are allowed). Labels must be less than 256 bytes long.
ru: <firstterm>Метка</firstterm> — это последовательность алфавитно-цифровых символов и знаков подчёркивания (например, в локали C допускаются символы <literal>A-Za-z0-9_</literal>). Метки должны занимать меньше 256 байт.

source: Examples: <literal>42</literal>, <literal>Personal_Services</literal>
ru: Примеры: <literal>42</literal>, <literal>Personal_Services</literal>

source: A <firstterm>label path</firstterm> is a sequence of zero or more labels separated by dots, for example <literal>L1.L2.L3</literal>, representing a path from the root of a hierarchical tree to a particular node. The length of a label path must be less than 65kB, but keeping it under 2kB is preferable. In practice this is not a major limitation; for example, the longest label path in the DMOZ catalog (<ulink url="http://www.dmoz.org"/>) is about 240 bytes.
ru: <firstterm>Путь метки</firstterm> — это последовательность из нуля или более меток, разделённых точками, (например, <literal>L1.L2.L3</literal>), представляющая путь от корня иерархического дерева к конкретному узлу. Длина пути метки должна быть меньше 65 Кбайт, но лучше, если она будет в пределах 2 Кбайт. На практике это ограничение не является критичным; например, самый длинный путь в каталоге DMOZ (<ulink url="http://www.dmoz.org"/>) имеет длину около 240 байт.

source: Example: <literal>Top.Countries.Europe.Russia</literal>
ru: Пример: <literal>Top.Countries.Europe.Russia</literal>

source: The <filename>ltree</filename> module provides several data types:
ru: Модуль <filename>ltree</filename> предоставляет несколько типов данных:

source: <type>ltree</type> stores a label path.
ru: <type>ltree</type> хранит путь метки.

source: <type>lquery</type> represents a regular-expression-like pattern for matching <type>ltree</type> values. A simple word matches that label within a path. A star symbol (<literal>*</literal>) matches zero or more labels. For example: <synopsis> foo <lineannotation>Match the exact label path <literal>foo</literal></lineannotation> *.foo.* <lineannotation>Match any label path containing the label <literal>foo</literal></lineannotation> *.foo <lineannotation>Match any label path whose last label is <literal>foo</literal></lineannotation> </synopsis>
ru: <type>lquery</type> представляет напоминающий регулярные выражения запрос для поиска нужных значений <type>ltree</type>. Простое слово выбирает путь с этой меткой. Звёздочка (<literal>*</literal>) выбирает ноль или более меток. Например: <synopsis> foo <lineannotation>Выбирает в точности путь метки <literal>foo</literal></lineannotation> *.foo.* <lineannotation>Выбирает путь, содержащий метку <literal>foo</literal></lineannotation> *.foo <lineannotation>Выбирает путь, в котором последняя метка <literal>foo</literal></lineannotation> </synopsis>

source: Star symbols can also be quantified to restrict how many labels they can match: <synopsis> *{<replaceable>n</replaceable>} <lineannotation>Match exactly <replaceable>n</replaceable> labels</lineannotation> *{<replaceable>n</replaceable>,} <lineannotation>Match at least <replaceable>n</replaceable> labels</lineannotation> *{<replaceable>n</replaceable>,<replaceable>m</replaceable>} <lineannotation>Match at least <replaceable>n</replaceable> but not more than <replaceable>m</replaceable> labels</lineannotation> *{,<replaceable>m</replaceable>} <lineannotation>Match at most <replaceable>m</replaceable> labels &mdash; same as </lineannotation> *{0,<replaceable>m</replaceable>} </synopsis>
ru: Звёздочке можно также добавить числовую характеристику, ограничивающую число потенциально совпадающих меток: <synopsis> *{<replaceable>n</replaceable>} <lineannotation>Выбирает ровно <replaceable>n</replaceable> меток</lineannotation> *{<replaceable>n</replaceable>,} <lineannotation>Выбирает не меньше <replaceable>n</replaceable> меток</lineannotation> *{<replaceable>n</replaceable>,<replaceable>m</replaceable>} <lineannotation>Выбирает не меньше <replaceable>n</replaceable> и не больше <replaceable>m</replaceable> меток</lineannotation> *{,<replaceable>m</replaceable>} <lineannotation>Выбирает не больше <replaceable>m</replaceable> меток &mdash; то же самое, что и </lineannotation> *{0,<replaceable>m</replaceable>} </synopsis>

source: There are several modifiers that can be put at the end of a non-star label in <type>lquery</type> to make it match more than just the exact match: <synopsis> @ <lineannotation>Match case-insensitively, for example <literal>a@</literal> matches <literal>A</literal></lineannotation> * <lineannotation>Match any label with this prefix, for example <literal>foo*</literal> matches <literal>foobar</literal></lineannotation> % <lineannotation>Match initial underscore-separated words</lineannotation> </synopsis> The behavior of <literal>%</literal> is a bit complicated. It tries to match words rather than the entire label. For example <literal>foo_bar%</literal> matches <literal>foo_bar_baz</literal> but not <literal>foo_barbaz</literal>. If combined with <literal>*</literal>, prefix matching applies to each word separately, for example <literal>foo_bar%*</literal> matches <literal>foo1_bar2_baz</literal> but not <literal>foo1_br2_baz</literal>.
ru: В конце метки, отличной от звёздочки, в <type>lquery</type> можно добавить модификаторы, чтобы найти что-то сложнее, чем точное соответствие: <synopsis> @ <lineannotation>Выбирать метки без учёта регистра, например, запросу <literal>a@</literal> соответствует <literal>A</literal></lineannotation> * <lineannotation>Выбирать любую метку с данным префиксом, например запросу <literal>foo*</literal> соответствует <literal>foobar</literal></lineannotation> % <lineannotation>Выбирать начальные слова, разделённые подчёркиваниями</lineannotation> </synopsis> Поведение модификатора <literal>%</literal> несколько нетривиальное. Он пытается найти соответствие по словам, а не по всей метке. Например, запросу <literal>foo_bar%</literal> соответствует <literal>foo_bar_baz</literal> но не <literal>foo_barbaz</literal>. В сочетании с <literal>*</literal>, сопоставление префикса применяется отдельно к каждому слову, например запросу <literal>foo_bar%*</literal> соответствует <literal>foo1_bar2_baz</literal>, но не <literal>foo1_br2_baz</literal>.

source: Also, you can write several possibly-modified labels separated with <literal>|</literal> (OR) to match any of those labels, and you can put <literal>!</literal> (NOT) at the start to match any label that doesn't match any of the alternatives.
ru: Также вы можете записать несколько различных меток через знак <literal>|</literal> (обозначающий ИЛИ) для выборки любой из этих меток, либо добавить знак <literal>!</literal> (НЕ) в начале, чтобы выбрать все метки, не соответствующие указанным альтернативам.

source: Here's an annotated example of <type>lquery</type>: <placeholder-1/> This query will match any label path that:
ru: Расширенный пример <type>lquery</type>: <placeholder-1/> Этот запрос выберет путь, который:

source: begins with the label <literal>Top</literal>
ru: начинается с метки <literal>Top</literal>

source: and next has zero to two labels before
ru: и затем включает от нуля до двух меток до

source: a label beginning with the case-insensitive prefix <literal>sport</literal>
ru: метки, начинающейся с префикса <literal>sport</literal> (без учёта регистра)

source: then a label not matching <literal>football</literal> nor <literal>tennis</literal>
ru: затем метку, отличную от <literal>football</literal> и <literal>tennis</literal>

source: and then ends with a label beginning with <literal>Russ</literal> or exactly matching <literal>Spain</literal>.
ru: и заканчивается меткой, которая начинается подстрокой <literal>Russ</literal> или в точности равна <literal>Spain</literal>.

source: <type>ltxtquery</type> represents a full-text-search-like pattern for matching <type>ltree</type> values. An <type>ltxtquery</type> value contains words, possibly with the modifiers <literal>@</literal>, <literal>*</literal>, <literal>%</literal> at the end; the modifiers have the same meanings as in <type>lquery</type>. Words can be combined with <literal>&amp;</literal> (AND), <literal>|</literal> (OR), <literal>!</literal> (NOT), and parentheses. The key difference from <type>lquery</type> is that <type>ltxtquery</type> matches words without regard to their position in the label path.
ru: <type>ltxtquery</type> представляет подобный полнотекстовому запрос поиска подходящих значений <type>ltree</type>. Значение <type>ltxtquery</type> содержит слова, возможно с модификаторами <literal>@</literal>, <literal>*</literal>, <literal>%</literal> в конце; эти модификаторы имеют то же значение, что и в <type>lquery</type>. Слова можно объединять символами <literal>&amp;</literal> (И), <literal>|</literal> (ИЛИ), <literal>!</literal> (НЕ) и скобками. Ключевое отличие от <type>lquery</type> состоит в том, что <type>ltxtquery</type> выбирает слова независимо от их положения в пути метки.

source: Here's an example <type>ltxtquery</type>: <placeholder-1/> This will match paths that contain the label <literal>Europe</literal> and any label beginning with <literal>Russia</literal> (case-insensitive), but not paths containing the label <literal>Transportation</literal>. The location of these words within the path is not important. Also, when <literal>%</literal> is used, the word can be matched to any underscore-separated word within a label, regardless of position.
ru: Пример <type>ltxtquery</type>: <placeholder-1/> Этот запрос выберет пути, содержащие метку <literal>Europe</literal> или любую метку с начальной подстрокой <literal>Russia</literal> (без учёта регистра), но не пути, содержащие метку <literal>Transportation</literal>. Положение этих слов в пути не имеет значения. Кроме того, когда применяется <literal>%</literal>, слово может быть сопоставлено с любым другим отделённым подчёркиваниями словом в метке, вне зависимости от его положения.

source: Note: <type>ltxtquery</type> allows whitespace between symbols, but <type>ltree</type> and <type>lquery</type> do not.
ru: Замечание: <type>ltxtquery</type> допускает пробелы между символами, а <type>ltree</type> и <type>lquery</type> — нет.

source: Operators and Functions
ru: Операторы и функции

source: Type <type>ltree</type> has the usual comparison operators <literal>=</literal>, <literal>&lt;&gt;</literal>, <literal>&lt;</literal>, <literal>&gt;</literal>, <literal>&lt;=</literal>, <literal>&gt;=</literal>. Comparison sorts in the order of a tree traversal, with the children of a node sorted by label text. In addition, the specialized operators shown in <xref linkend="ltree-op-table"/> are available.
ru: Для типа <type>ltree</type> определены обычные операторы сравнения <literal>=</literal>, <literal>&lt;&gt;</literal>, <literal>&lt;</literal>, <literal>&gt;</literal>, <literal>&lt;=</literal>, <literal>&gt;=</literal>. Сравнение сортирует пути в порядке движения по дереву, а потомки узла сортируются по тексту метки. В дополнение к ним есть и специализированные операторы, перечисленные в <xref remap="6" linkend="ltree-op-table"/>.

source: <type>ltree</type> Operators
ru: Операторы <type>ltree</type>

source: Operator
ru: Оператор

source: Returns
ru: Возвращает

source: Description
ru: Описание

source: is left argument an ancestor of right (or equal)?
ru: левый аргумент является предком правого (или равен ему)?

source: is left argument a descendant of right (or equal)?
ru: левый аргумент является потомком правого (или равен ему)?

source: does <type>ltree</type> match <type>lquery</type>?
ru: значение <type>ltree</type> соответствует <type>lquery</type>?

source: does <type>ltree</type> match any <type>lquery</type> in array?
ru: значение <type>ltree</type> соответствует одному из <type>lquery</type> в массиве?

source: does <type>ltree</type> match <type>ltxtquery</type>?
ru: значение <type>ltree</type> соответствует <type>ltxtquery</type>?

source: concatenate <type>ltree</type> paths
ru: объединяет два пути <type>ltree</type>

source: convert text to <type>ltree</type> and concatenate
ru: преобразует текст в <type>ltree</type> и объединяет с путём

source: does array contain an ancestor of <type>ltree</type>?
ru: массив содержит предка <type>ltree</type>?

source: does array contain a descendant of <type>ltree</type>?
ru: массив содержит потомка <type>ltree</type>?

source: does array contain any path matching <type>lquery</type>?
ru: массив содержит путь, соответствующий <type>lquery</type>?

source: does <type>ltree</type> array contain any path matching any <type>lquery</type>?
ru: массив <type>ltree</type> содержит путь, соответствующий любому из <type>lquery</type>?

source: does array contain any path matching <type>ltxtquery</type>?
ru: массив содержит путь, соответствующий <type>ltxtquery</type>?

source: first array entry that is an ancestor of <type>ltree</type>; NULL if none
ru: первый элемент массива, являющийся предком <type>ltree</type>; NULL, если такого нет

source: first array entry that is a descendant of <type>ltree</type>; NULL if none
ru: первый элемент массива, являющийся потомком <type>ltree</type>; NULL, если такого нет

source: first array entry that matches <type>lquery</type>; NULL if none
ru: первый элемент массива, соответствующий <type>lquery</type>; NULL, если такого нет

source: first array entry that matches <type>ltxtquery</type>; NULL if none
ru: первый элемент массива, соответствующий <type>ltxtquery</type>; NULL, если такого нет

source: The operators <literal>&lt;@</literal>, <literal>@&gt;</literal>, <literal>@</literal> and <literal>~</literal> have analogues <literal>^&lt;@</literal>, <literal>^@&gt;</literal>, <literal>^@</literal>, <literal>^~</literal>, which are the same except they do not use indexes. These are useful only for testing purposes.
ru: Операторы <literal>&lt;@</literal>, <literal>@&gt;</literal>, <literal>@</literal> и <literal>~</literal> имеют аналоги в виде <literal>^&lt;@</literal>, <literal>^@&gt;</literal>, <literal>^@</literal>, <literal>^~</literal>, которые отличатся только тем, что не используют индексы. Они полезны только для тестирования.

source: The available functions are shown in <xref linkend="ltree-func-table"/>.
ru: Доступные функции перечислены в <xref remap="6" linkend="ltree-func-table"/>.

source: <type>ltree</type> Functions
ru: Функции <type>ltree</type>

source: Function
ru: Функция

source: Return Type
ru: Тип результата

# entry
source: Example
ru: Пример

source: Result
ru: Результат

source: subpath of <type>ltree</type> from position <parameter>start</parameter> to position <parameter>end</parameter>-1 (counting from 0)
ru: подпуть <type>ltree</type> от позиции <parameter>start</parameter> до позиции <parameter>end</parameter>-1 (начиная с 0)

source: subltree('Top.Child1.Child2',1,2)
ru: subltree('Top.Child1.&zwsp;Child2',1,2)

source: subpath of <type>ltree</type> starting at position <parameter>offset</parameter>, length <parameter>len</parameter>. If <parameter>offset</parameter> is negative, subpath starts that far from the end of the path. If <parameter>len</parameter> is negative, leaves that many labels off the end of the path.
ru: подпуть <type>ltree</type>, начиная с позиции <parameter>offset</parameter>, длиной <parameter>len</parameter>. Если <parameter>offset</parameter> меньше нуля, подпуть начинается с этого смещения от конца пути. Если <parameter>len</parameter> меньше нуля, будет отброшено заданное число меток с конца строки.

source: subpath('Top.Child1.Child2',0,2)
ru: subpath('Top.Child1.&zwsp;Child2',0,2)

source: subpath of <type>ltree</type> starting at position <parameter>offset</parameter>, extending to end of path. If <parameter>offset</parameter> is negative, subpath starts that far from the end of the path.
ru: подпуть <type>ltree</type>, начиная с позиции <parameter>offset</parameter> и до конца пути. Если <parameter>offset</parameter> меньше нуля, подпуть начинается с этого смещения от конца пути.

source: subpath('Top.Child1.Child2',1)
ru: subpath('Top.Child1.&zwsp;Child2',1)

source: number of labels in path
ru: число меток в пути

source: nlevel('Top.Child1.Child2')
ru: nlevel('Top.Child1.&zwsp;Child2')

source: <primary>index</primary>
ru: <primary>индекс</primary>

source: position of first occurrence of <parameter>b</parameter> in <parameter>a</parameter>; -1 if not found
ru: позиция первого вхождения <parameter>b</parameter> в <parameter>a</parameter>; -1, если вхождения нет

source: index('0.1.2.3.5.4.5.6.8.5.6.8','5.6')
ru: index('0.1.2.3.5.4.5.6.&zwsp;8.5.6.8','5.6')

source: position of first occurrence of <parameter>b</parameter> in <parameter>a</parameter>, searching starting at <parameter>offset</parameter>; negative <parameter>offset</parameter> means start <parameter>-offset</parameter> labels from the end of the path
ru: позиция первого вхождения <parameter>b</parameter> в <parameter>a</parameter>, найденного от позиции <parameter>offset</parameter>; если <parameter>offset</parameter> меньше 0, поиск начинается с <parameter>-offset</parameter> меток от конца пути

source: index('0.1.2.3.5.4.5.6.8.5.6.8','5.6',-4)
ru: index('0.1.2.3.5.4.5.6.&zwsp;8.5.6.8','5.6',-4)

source: cast <type>text</type> to <type>ltree</type>
ru: приводит <type>text</type> к типу <type>ltree</type>

source: cast <type>ltree</type> to <type>text</type>
ru: приводит <type>ltree</type> к типу <type>text</type>

source: lowest common ancestor, i.e., longest common prefix of paths (up to 8 arguments supported)
ru: самый нижний общий предок, то есть наибольший общий префикс путей (принимается до 8 аргументов)

source: lowest common ancestor, i.e., longest common prefix of paths
ru: самый нижний предок, то есть наибольший общий префикс путей

source: Indexes
ru: Индексы

source: <filename>ltree</filename> supports several types of indexes that can speed up the indicated operators:
ru: <filename>ltree</filename> поддерживает несколько типов индексов, которые могут ускорить означенные операции:

source: B-tree index over <type>ltree</type>: <literal>&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal>, <literal>&gt;</literal>
ru: B-дерево по значениям <type>ltree</type>: <literal>&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal>, <literal>&gt;</literal>

source: GiST index over <type>ltree</type>: <literal>&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal>, <literal>&gt;</literal>, <literal>@&gt;</literal>, <literal>&lt;@</literal>, <literal>@</literal>, <literal>~</literal>, <literal>?</literal>
ru: GiST по значениям <type>ltree</type>: <literal>&lt;</literal>, <literal>&lt;=</literal>, <literal>=</literal>, <literal>&gt;=</literal>, <literal>&gt;</literal>, <literal>@&gt;</literal>, <literal>&lt;@</literal>, <literal>@</literal>, <literal>~</literal>, <literal>?</literal>

source: Example of creating such an index:
ru: Пример создания такого индекса:

source: GiST index over <type>ltree[]</type>: <literal>ltree[] &lt;@ ltree</literal>, <literal>ltree @&gt; ltree[]</literal>, <literal>@</literal>, <literal>~</literal>, <literal>?</literal>
ru: GiST по столбцу <type>ltree[]</type>: <literal>ltree[] &lt;@ ltree</literal>, <literal>ltree @&gt; ltree[]</literal>, <literal>@</literal>, <literal>~</literal>, <literal>?</literal>

source: Note: This index type is lossy.
ru: Примечание: Индекс этого типа является неточным.

# title
source: Example
ru: Пример

source: This example uses the following data (also available in file <filename>contrib/ltree/ltreetest.sql</filename> in the source distribution):
ru: Для этого примера используются следующие данные (это же описание данных находится в файле <filename>contrib/ltree/ltreetest.sql</filename> в дистрибутиве исходного кода):

source: Now, we have a table <structname>test</structname> populated with data describing the hierarchy shown below:
ru: В итоге мы получаем таблицу <structname>test</structname>, наполненную данными, представляющими следующую иерархию:

source: We can do inheritance: <screen> ltreetest=&gt; SELECT path FROM test WHERE path &lt;@ 'Top.Science'; path ------------------------------------ Top.Science Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology (4 rows) </screen>
ru: Мы можем выбрать потомки в иерархии наследования: <screen> ltreetest=&gt; SELECT path FROM test WHERE path &lt;@ 'Top.Science'; path ------------------------------------ Top.Science Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology (4 rows) </screen>

source: Here are some examples of path matching: <screen> ltreetest=&gt; SELECT path FROM test WHERE path ~ '*.Astronomy.*'; path ----------------------------------------------- Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology Top.Collections.Pictures.Astronomy Top.Collections.Pictures.Astronomy.Stars Top.Collections.Pictures.Astronomy.Galaxies Top.Collections.Pictures.Astronomy.Astronauts (7 rows) ltreetest=&gt; SELECT path FROM test WHERE path ~ '*.!pictures@.*.Astronomy.*'; path ------------------------------------ Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology (3 rows) </screen>
ru: Несколько примеров выборки по путям: <screen> ltreetest=&gt; SELECT path FROM test WHERE path ~ '*.Astronomy.*'; path ----------------------------------------------- Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology Top.Collections.Pictures.Astronomy Top.Collections.Pictures.Astronomy.Stars Top.Collections.Pictures.Astronomy.Galaxies Top.Collections.Pictures.Astronomy.Astronauts (7 rows) ltreetest=&gt; SELECT path FROM test WHERE path ~ '*.!pictures@.*.Astronomy.*'; path ------------------------------------ Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology (3 rows) </screen>

source: Here are some examples of full text search: <screen> ltreetest=&gt; SELECT path FROM test WHERE path @ 'Astro*% &amp; !pictures@'; path ------------------------------------ Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology Top.Hobbies.Amateurs_Astronomy (4 rows) ltreetest=&gt; SELECT path FROM test WHERE path @ 'Astro* &amp; !pictures@'; path ------------------------------------ Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology (3 rows) </screen>
ru: Ещё несколько примеров полнотекстового поиска: <screen> ltreetest=&gt; SELECT path FROM test WHERE path @ 'Astro*% &amp; !pictures@'; path ------------------------------------ Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology Top.Hobbies.Amateurs_Astronomy (4 rows) ltreetest=&gt; SELECT path FROM test WHERE path @ 'Astro* &amp; !pictures@'; path ------------------------------------ Top.Science.Astronomy Top.Science.Astronomy.Astrophysics Top.Science.Astronomy.Cosmology (3 rows) </screen>
