Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ltree.po
Languages: ru

source: Path construction using functions: <screen> ltreetest=&gt; SELECT subpath(path,0,2)||'Space'||subpath(path,2) FROM test WHERE path &lt;@ 'Top.Science.Astronomy'; ?column? ------------------------------------------ Top.Science.Space.Astronomy Top.Science.Space.Astronomy.Astrophysics Top.Science.Space.Astronomy.Cosmology (3 rows) </screen>
ru: Образование пути с помощью функций: <screen> ltreetest=&gt; SELECT subpath(path,0,2)||'Space'||subpath(path,2) FROM test WHERE path &lt;@ 'Top.Science.Astronomy'; ?column? ------------------------------------------ Top.Science.Space.Astronomy Top.Science.Space.Astronomy.Astrophysics Top.Science.Space.Astronomy.Cosmology (3 rows) </screen>

source: We could simplify this by creating a SQL function that inserts a label at a specified position in a path: <screen> CREATE FUNCTION ins_label(ltree, int, text) RETURNS ltree AS 'select subpath($1,0,$2) || $3 || subpath($1,$2);' LANGUAGE SQL IMMUTABLE; ltreetest=&gt; SELECT ins_label(path,2,'Space') FROM test WHERE path &lt;@ 'Top.Science.Astronomy'; ins_label ------------------------------------------ Top.Science.Space.Astronomy Top.Science.Space.Astronomy.Astrophysics Top.Science.Space.Astronomy.Cosmology (3 rows) </screen>
ru: Эту процедуру можно упростить, создав функцию SQL, вставляющую метку в определённую позицию в пути: <screen> CREATE FUNCTION ins_label(ltree, int, text) RETURNS ltree AS 'select subpath($1,0,$2) || $3 || subpath($1,$2);' LANGUAGE SQL IMMUTABLE; ltreetest=&gt; SELECT ins_label(path,2,'Space') FROM test WHERE path &lt;@ 'Top.Science.Astronomy'; ins_label ------------------------------------------ Top.Science.Space.Astronomy Top.Science.Space.Astronomy.Astrophysics Top.Science.Space.Astronomy.Cosmology (3 rows) </screen>

source: Transforms
ru: Трансформации

source: Additional extensions are available that implement transforms for the <type>ltree</type> type for PL/Python. The extensions are called <literal>ltree_plpythonu</literal>, <literal>ltree_plpython2u</literal>, and <literal>ltree_plpython3u</literal> (see <xref linkend="plpython-python23"/> for the PL/Python naming convention). If you install these transforms and specify them when creating a function, <type>ltree</type> values are mapped to Python lists. (The reverse is currently not supported, however.)
ru: Также имеются дополнительные расширения, реализующие трансформации типа <type>ltree</type> для языка PL/Python. Эти расширения называются <literal>ltree_plpythonu</literal>, <literal>ltree_plpython2u</literal> и <literal>ltree_plpython3u</literal> (соглашения об именовании, принятые для интерфейса PL/Python, описаны в <xref remap="6" linkend="plpython-python23"/>). Если вы установите эти трансформации и укажете их при создании функции, значения <type>ltree</type> будут отображаться в списки Python. (Однако обратное преобразование не поддерживается.)

source: Authors
ru: Авторы

source: All work was done by Teodor Sigaev (<email>teodor@stack.net</email>) and Oleg Bartunov (<email>oleg@sai.msu.su</email>). See <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/> for additional information. Authors would like to thank Eugeny Rodichev for helpful discussions. Comments and bug reports are welcome.
ru: Разработку осуществили Фёдор Сигаев (<email>teodor@stack.net</email>) и Олег Бартунов (<email>oleg@sai.msu.su</email>). Дополнительные сведения можно найти на странице <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/>. Авторы выражают благодарность Евгению Родичеву за полезную дискуссии. Замечания и сообщения об ошибках приветствуются.
