Repository: pluzanov/pg-doc-ru
Catalog: 9.6/manage-ag.po
Languages: ru

source: By using tablespaces, an administrator can control the disk layout of a <productname>PostgreSQL</productname> installation. This is useful in at least two ways. First, if the partition or volume on which the cluster was initialized runs out of space and cannot be extended, a tablespace can be created on a different partition and used until the system can be reconfigured.
ru: Табличные пространства позволяют администратору управлять дисковым пространством для инсталляции <productname>PostgreSQL</productname>. Это полезно минимум по двум причинам. Во-первых, это нехватка места в разделе, на котором был инициализирован кластер и невозможность его расширения. Табличное пространство можно создать в другом разделе и использовать его до тех пор, пока не появится возможность переконфигурирования системы.

source: Second, tablespaces allow an administrator to use knowledge of the usage pattern of database objects to optimize performance. For example, an index which is very heavily used can be placed on a very fast, highly available disk, such as an expensive solid state device. At the same time a table storing archived data which is rarely used or not performance critical could be stored on a less expensive, slower disk system.
ru: Во-вторых, табличные пространства позволяют администраторам оптимизировать производительность согласно бизнес-процессам, связанным с объектами базы данных. Например, часто используемый индекс можно разместить на очень быстром и надёжном, но дорогом SSD-диске. В то же время таблица с архивными данными, которые редко используются и скорость к доступа к ним не важна, может быть размещена в более дешёвом и медленном хранилище.

source: Even though located outside the main PostgreSQL data directory, tablespaces are an integral part of the database cluster and <emphasis>cannot</emphasis> be treated as an autonomous collection of data files. They are dependent on metadata contained in the main data directory, and therefore cannot be attached to a different database cluster or backed up individually. Similarly, if you lose a tablespace (file deletion, disk failure, etc), the database cluster might become unreadable or unable to start. Placing a tablespace on a temporary file system like a RAM disk risks the reliability of the entire cluster.
ru: Несмотря на внешнее размещение относительно основного каталога хранения данных PostgreSQL, табличные пространства являются неотъемлемой частью кластера и <emphasis>не могут</emphasis> трактоваться, как самостоятельная коллекция файлов данных. Они зависят от метаданных, расположенных в главном каталоге, и потому не могут быть подключены к другому кластеру, или копироваться по отдельности. Также, в случае потери табличного пространства (при удалении файлов, сбое диска и т. п.), кластер может оказаться недоступным или не сможет запуститься. Таким образом, при размещении табличного пространства во временной файловой системе, например, в RAM-диске, возникает угроза надёжности всего кластера.

source: To define a tablespace, use the <xref linkend="sql-createtablespace"/> command, for example:<placeholder-1/>: <placeholder-2/> The location must be an existing, empty directory that is owned by the <productname>PostgreSQL</productname> operating system user. All objects subsequently created within the tablespace will be stored in files underneath this directory. The location must not be on removable or transient storage, as the cluster might fail to function if the tablespace is missing or lost.
ru: Для создания табличного пространства используется команда <xref linkend="sql-createtablespace"/>, например:<placeholder-1/>: <placeholder-2/> Каталог должен существовать, быть пустым и принадлежать пользователю ОС, под которым запущен <productname>PostgreSQL</productname>. Все созданные впоследствии объекты, принадлежащие целевому табличному пространству, будут храниться в файлах расположенных в этом каталоге. Каталог не должен размещаться на съёмных или устройствах временного хранения, так как кластер может перестать функционировать из-за потери этого пространства.

source: There is usually not much point in making more than one tablespace per logical file system, since you cannot control the location of individual files within a logical file system. However, <productname>PostgreSQL</productname> does not enforce any such limitation, and indeed it is not directly aware of the file system boundaries on your system. It just stores files in the directories you tell it to use.
ru: Обычно нет смысла создавать более одного пространства на одну логическую файловую систему, так как нет возможности контролировать расположение отдельных файлов в файловой системе. Однако <productname>PostgreSQL</productname> не накладывает никаких ограничений в этом отношении, и более того, напрямую не заботится о точках монтирования файловой системы. Просто осуществляется хранение файлов в указанных каталогах.

source: Creation of the tablespace itself must be done as a database superuser, but after that you can allow ordinary database users to use it. To do that, grant them the <literal>CREATE</literal> privilege on it.
ru: Создавать табличное пространство должен суперпользователь базы данных, но после этого можно разрешить обычным пользователям его использовать. Для этого необходимо предоставить привилегию <literal>CREATE</literal> на табличное пространство.

source: Tables, indexes, and entire databases can be assigned to particular tablespaces. To do so, a user with the <literal>CREATE</literal> privilege on a given tablespace must pass the tablespace name as a parameter to the relevant command. For example, the following creates a table in the tablespace <literal>space1</literal>: <placeholder-1/>
ru: Таблицы, индексы и целые базы данных могут храниться в отдельных табличных пространствах. Для этого пользователь с правом <literal>CREATE</literal> на табличное пространство должен указать его имя в качестве параметра соответствующей команды. Например, далее создаётся таблица в табличном пространстве <literal>space1</literal>: <placeholder-1/>

source: Alternatively, use the <xref linkend="guc-default-tablespace"/> parameter: <placeholder-1/> When <varname>default_tablespace</varname> is set to anything but an empty string, it supplies an implicit <literal>TABLESPACE</literal> clause for <command>CREATE TABLE</command> and <command>CREATE INDEX</command> commands that do not have an explicit one.
ru: Как вариант, используйте параметр <xref linkend="guc-default-tablespace"/>: <placeholder-1/> Когда <varname>default_tablespace</varname> имеет значение отличное от пустой строки, он будет использоваться неявно в качестве значения параметра <literal>TABLESPACE</literal> в командах <command>CREATE TABLE</command> и <command>CREATE INDEX</command>, если в самой команде не задано иное.

source: There is also a <xref linkend="guc-temp-tablespaces"/> parameter, which determines the placement of temporary tables and indexes, as well as temporary files that are used for purposes such as sorting large data sets. This can be a list of tablespace names, rather than only one, so that the load associated with temporary objects can be spread over multiple tablespaces. A random member of the list is picked each time a temporary object is to be created.
ru: Существует параметр <xref linkend="guc-temp-tablespaces"/>, который указывает на размещение временных таблиц и индексов, а также файлов, создаваемых, например, при операциях сортировки больших наборов данных. Предпочтительнее, в качестве значения этого параметра, указывать не одно имя, а список из нескольких табличных пространств. Это поможет распределить нагрузку, связанную с временными объектами, по различным табличным пространствам. При каждом создании временного объекта будет случайным образом выбираться имя из указанного списка табличных пространств.

source: The tablespace associated with a database is used to store the system catalogs of that database. Furthermore, it is the default tablespace used for tables, indexes, and temporary files created within the database, if no <literal>TABLESPACE</literal> clause is given and no other selection is specified by <varname>default_tablespace</varname> or <varname>temp_tablespaces</varname> (as appropriate). If a database is created without specifying a tablespace for it, it uses the same tablespace as the template database it is copied from.
ru: Табличное пространство, связанное с базой данных, также используется для хранения её системных каталогов. Более того, это табличное пространство используется по умолчанию для таблиц, индексов и временных файлов, создаваемых в базе данных, если не указано иное в выражении <literal>TABLESPACE</literal>, или переменной <varname>default_tablespace</varname>, или <varname>temp_tablespaces</varname> (соответственно). Если база данных создана без указания конкретного табличного пространства, то используется пространство, к которому принадлежит копируемый шаблон.

source: Two tablespaces are automatically created when the database cluster is initialized. The <literal>pg_global</literal> tablespace is used for shared system catalogs. The <literal>pg_default</literal> tablespace is the default tablespace of the <literal>template1</literal> and <literal>template0</literal> databases (and, therefore, will be the default tablespace for other databases as well, unless overridden by a <literal>TABLESPACE</literal> clause in <command>CREATE DATABASE</command>).
ru: При инициализации кластера автоматически создаются два табличных пространства. Табличное пространство <literal>pg_global</literal> используется для общих системных каталогов. Табличное пространство <literal>pg_default</literal> используется по умолчанию для баз данных <literal>template1</literal> и <literal>template0</literal> (в свою очередь, также является пространством по умолчанию для других баз данных, пока не будет явно указано иное в выражении <literal>TABLESPACE</literal> команды <command>CREATE DATABASE</command>).

source: Once created, a tablespace can be used from any database, provided the requesting user has sufficient privilege. This means that a tablespace cannot be dropped until all objects in all databases using the tablespace have been removed.
ru: После создания, табличное пространство можно использовать в рамках любой базы данных, при условии, что у пользователя имеются необходимые права. Это означает, что табличное пространство невозможно удалить до тех пор, пока не будут удалены все объекты баз данных, использующих это пространство.

source: To remove an empty tablespace, use the <xref linkend="sql-droptablespace"/> command.
ru: Для удаления пустого табличного пространства используйте команду <xref linkend="sql-droptablespace"/>.

source: To determine the set of existing tablespaces, examine the <link linkend="catalog-pg-tablespace"><structname>pg_tablespace</structname></link> system catalog, for example <synopsis> SELECT spcname FROM pg_tablespace; </synopsis> The <xref linkend="app-psql"/> program's <literal>\db</literal> meta-command is also useful for listing the existing tablespaces.
ru: Чтобы получить список табличных пространств можно сделать запрос к системному каталогу <link linkend="catalog-pg-tablespace"><structname>pg_tablespace</structname></link>, например, <synopsis> SELECT spcname FROM pg_tablespace; </synopsis> Метакоманда <literal>\db</literal> утилиты <xref linkend="app-psql"/> также позволяет отобразить список существующих табличных пространств.

source: <productname>PostgreSQL</productname> makes use of symbolic links to simplify the implementation of tablespaces. This means that tablespaces can be used <emphasis>only</emphasis> on systems that support symbolic links.
ru: <productname>PostgreSQL</productname> использует символические ссылки для упрощения реализации табличных пространств. Это означает, что табличные пространства могут использоваться <emphasis>только</emphasis> в системах, поддерживающих символические ссылки.

source: The directory <filename>$PGDATA/pg_tblspc</filename> contains symbolic links that point to each of the non-built-in tablespaces defined in the cluster. Although not recommended, it is possible to adjust the tablespace layout by hand by redefining these links. Under no circumstances perform this operation while the server is running. Note that in PostgreSQL 9.1 and earlier you will also need to update the <structname>pg_tablespace</structname> catalog with the new locations. (If you do not, <literal>pg_dump</literal> will continue to output the old tablespace locations.)
ru: Каталог <filename>$PGDATA/pg_tblspc</filename> содержит символические ссылки, которые указывают на внешние табличные пространства кластера. Хоть и не рекомендуется, но возможно регулировать табличные пространства вручную, переопределяя эти ссылки. Ни при каких обстоятельствах эти операции нельзя проводить, пока запущен сервер баз данных. Обратите внимание, что в версии PostgreSQL 9.1 и более ранних также необходимо обновить информацию в <structname>pg_tablespace</structname> о новых расположениях. (Если это не сделать, то <literal>pg_dump</literal> будет продолжать выводить старые расположения табличных пространств.)
