Repository: pluzanov/pg-doc-ru
Catalog: 9.6/manage-ag.po
Languages: ru

source: Managing Databases
ru: Управление базами данных

source: <primary>database</primary>
ru: <primary>база данных</primary>

source: Every instance of a running <productname>PostgreSQL</productname> server manages one or more databases. Databases are therefore the topmost hierarchical level for organizing <acronym>SQL</acronym> objects (<quote>database objects</quote>). This chapter describes the properties of databases, and how to create, manage, and destroy them.
ru: Каждый работающий экземпляр сервера <productname>PostgreSQL</productname> обслуживает одну или несколько баз данных. Поэтому базы данных представляют собой вершину иерархии <acronym>SQL</acronym>-объектов (<quote>объектов базы данных</quote>). Данная глава описывает свойства баз данных, процессы создания, управления и удаления.

source: Overview
ru: Обзор

source: <primary>schema</primary>
ru: <primary>схема</primary>

source: A database is a named collection of <acronym>SQL</acronym> objects (<quote>database objects</quote>). Generally, every database object (tables, functions, etc.) belongs to one and only one database. (However there are a few system catalogs, for example <literal>pg_database</literal>, that belong to a whole cluster and are accessible from each database within the cluster.) More accurately, a database is a collection of schemas and the schemas contain the tables, functions, etc. So the full hierarchy is: server, database, schema, table (or some other kind of object, such as a function).
ru: База данных — именованная коллекция объектов <acronym>SQL</acronym> (<quote>объектов базы данных</quote>). В целом, каждый объект базы данных (таблицы, функции и т. д.) принадлежит одной и только одной базе данных. (Правда есть несколько системных каталогов, например, <literal>pg_database</literal>, которые принадлежат всему кластеру и доступны для каждой базы данных этого кластера.) Если точнее, база данных это набор схем, которые включают в себя таблицы, функции и т. д. Таким образом, полная иерархия включает в себя: сервер, базу данных, схему, таблицу (или иные типы объектов, к примеру, функции).

source: When connecting to the database server, a client must specify in its connection request the name of the database it wants to connect to. It is not possible to access more than one database per connection. However, an application is not restricted in the number of connections it opens to the same or other databases. Databases are physically separated and access control is managed at the connection level. If one <productname>PostgreSQL</productname> server instance is to house projects or users that should be separate and for the most part unaware of each other, it is therefore recommended to put them into separate databases. If the projects or users are interrelated and should be able to use each other's resources, they should be put in the same database but possibly into separate schemas. Schemas are a purely logical structure and who can access what is managed by the privilege system. More information about managing schemas is in <xref linkend="ddl-schemas"/>.
ru: При подключении к серверу базы данных, клиент должен указать в параметрах подключения имя базы данных, с которой нужно соединиться. Одно соединение не может иметь доступ более чем к одной базе данных. Однако приложение не ограничено в количестве соединений к одной и той же или разным базам данных. Базы данных разделены физически и контроль доступа осуществляется на уровне соединения. В случае, когда один экземпляр сервера <productname>PostgreSQL</productname> обслуживает проекты или пользователей, которых необходимо изолировать друг от друга, рекомендуется размещать их в раздельных базах данных. В случае, когда проекты или пользователи взаимосвязаны и должны иметь возможность использовать общие ресурсы, они должны размещаться в одной базе данных, но, возможно, в раздельных схемах. Схемы — в чистом виде логическая структура, и кто к чему может получить доступ управляется системой привилегий. Более подробная информация по управлению схемами приведена в <xref remap="6" linkend="ddl-schemas"/>.

source: Databases are created with the <command>CREATE DATABASE</command> command (see <xref linkend="manage-ag-createdb"/>) and destroyed with the <command>DROP DATABASE</command> command (see <xref linkend="manage-ag-dropdb"/>). To determine the set of existing databases, examine the <structname>pg_database</structname> system catalog, for example <synopsis> SELECT datname FROM pg_database; </synopsis> The <xref linkend="app-psql"/> program's <literal>\l</literal> meta-command and <option>-l</option> command-line option are also useful for listing the existing databases.
ru: Базы данных создаются командой <command>CREATE DATABASE</command> (см. <xref remap="4" linkend="manage-ag-createdb"/>), а удаляются командой <command>DROP DATABASE</command> (см. <xref remap="4" linkend="manage-ag-dropdb"/>). Список существующих баз данных можно посмотреть в системном каталоге <structname>pg_database</structname>, например, <synopsis> SELECT datname FROM pg_database; </synopsis> Метакоманда <literal>\l</literal> или ключ <option>-l</option> командной строки приложения <xref linkend="app-psql"/> также позволяют вывести список существующих баз данных.

source: The <acronym>SQL</acronym> standard calls databases <quote>catalogs</quote>, but there is no difference in practice.
ru: Стандарт <acronym>SQL</acronym> называет базы данных <quote>каталогами</quote>, но на практике у них нет отличий.

source: Creating a Database
ru: Создание базы данных

source: In order to create a database, the <productname>PostgreSQL</productname> server must be up and running (see <xref linkend="server-start"/>).
ru: Для создания базы данных сервер <productname>PostgreSQL</productname> должен быть развёрнут и запущен (см. <xref remap="4" linkend="server-start"/>).

source: Databases are created with the SQL command <xref linkend="sql-createdatabase"/>: <synopsis> CREATE DATABASE <replaceable>name</replaceable>; </synopsis> where <replaceable>name</replaceable> follows the usual rules for <acronym>SQL</acronym> identifiers. The current role automatically becomes the owner of the new database. It is the privilege of the owner of a database to remove it later (which also removes all the objects in it, even if they have a different owner).
ru: База данных создаётся SQL-командой <xref linkend="sql-createdatabase"/>: <synopsis> CREATE DATABASE <replaceable>имя</replaceable>; </synopsis> где <replaceable>имя</replaceable> подчиняется правилам именования идентификаторов <acronym>SQL</acronym>. Текущий пользователь автоматически назначается владельцем. Владелец может удалить свою базу, что также приведёт к удалению всех её объектов, в том числе, имеющих других владельцев.

source: The creation of databases is a restricted operation. See <xref linkend="role-attributes"/> for how to grant permission.
ru: Создание баз данных это привилегированная операция. Как предоставить права доступа, описано в <xref remap="6" linkend="role-attributes"/>.

source: Since you need to be connected to the database server in order to execute the <command>CREATE DATABASE</command> command, the question remains how the <emphasis>first</emphasis> database at any given site can be created. The first database is always created by the <command>initdb</command> command when the data storage area is initialized. (See <xref linkend="creating-cluster"/>.) This database is called <literal>postgres</literal>.<placeholder-1/> So to create the first <quote>ordinary</quote> database you can connect to <literal>postgres</literal>.
ru: Поскольку для выполнения команды <command>CREATE DATABASE</command> необходимо подключение к серверу базы данных, возникает вопрос как создать самую первую базу данных. Первая база данных всегда создаётся командой <command>initdb</command> при инициализации пространства хранения данных (см. <xref remap="4" linkend="creating-cluster"/>.) Эта база данных называется <literal>postgres</literal>.<placeholder-1/> Далее для создания первой <quote>обычной</quote> базы данных можно подключиться к <literal>postgres</literal>.

source: A second database, <literal>template1</literal>,<placeholder-1/> is also created during database cluster initialization. Whenever a new database is created within the cluster, <literal>template1</literal> is essentially cloned. This means that any changes you make in <literal>template1</literal> are propagated to all subsequently created databases. Because of this, avoid creating objects in <literal>template1</literal> unless you want them propagated to every newly created database. More details appear in <xref linkend="manage-ag-templatedbs"/>.
ru: Вторая база данных <literal>template1</literal>,<placeholder-1/> также создаётся во время инициализации кластера. При каждом создании новой базы данных в рамках кластера по факту производится клонирование шаблона <literal>template1</literal>. При этом любые изменения сделанные в <literal moreinfo=" none">template1</literal> распространяются на все созданные впоследствии базы данных. Следует избегать создания объектов в <literal>template1</literal>, за исключением ситуации, когда их необходимо автоматически добавлять в новые базы. Более подробно в <xref remap="6" linkend="manage-ag-templatedbs"/>.

source: <xref linkend="client-authentication"/> contains information about how to restrict who can connect to a given database.
ru: <xref linkend="client-authentication"/> содержит информацию о том, как ограничить права на подключение к заданной базе данных.

source: CREATE DATABASE <replaceable>dbname</replaceable> OWNER <replaceable>rolename</replaceable>;
ru: CREATE DATABASE <replaceable>имя_базы</replaceable> OWNER <replaceable>имя_роли</replaceable>;

source: createdb -O <replaceable>rolename</replaceable> <replaceable>dbname</replaceable>
ru: createdb -O <replaceable>имя_роли</replaceable> <replaceable>имя_базы</replaceable>

source: Sometimes you want to create a database for someone else, and have them become the owner of the new database, so they can configure and manage it themselves. To achieve that, use one of the following commands: <placeholder-1/> from the SQL environment, or: <placeholder-2/> from the shell. Only the superuser is allowed to create a database for someone else (that is, for a role you are not a member of).
ru: Иногда необходимо создать базу данных для другого пользователя и назначить его владельцем, чтобы он мог конфигурировать и управлять ею. Для этого используйте одну из следующих команд: <placeholder-1/> из среды SQL, или: <placeholder-2/> из командной строки ОС. Лишь суперпользователь может создавать базы данных для других (для ролей, членом которых он не является).

source: Template Databases
ru: Шаблоны баз данных

source: <command>CREATE DATABASE</command> actually works by copying an existing database. By default, it copies the standard system database named <literal>template1</literal>.<placeholder-1/> Thus that database is the <quote>template</quote> from which new databases are made. If you add objects to <literal>template1</literal>, these objects will be copied into subsequently created user databases. This behavior allows site-local modifications to the standard set of objects in databases. For example, if you install the procedural language <application>PL/Perl</application> in <literal>template1</literal>, it will automatically be available in user databases without any extra action being taken when those databases are created.
ru: По факту команда <command>CREATE DATABASE</command> выполняет копирование существующей базы данных. По умолчанию копируется стандартная системная база <literal>template1</literal>. <placeholder-1/> Таким образом, <literal>template1</literal> это шаблон, на основе которого создаются новые базы. Если добавить объекты в <literal>template1</literal>, то впоследствии они будут копироваться в новые базы данных. Это позволяет внести изменения в стандартный набор объектов. Например, если в <literal>template1</literal> установить процедурный язык <application>PL/Perl</application>, то он будет доступен в новых базах без дополнительных действий.

source: There is a second standard system database named <literal>template0</literal>.<placeholder-1/> This database contains the same data as the initial contents of <literal>template1</literal>, that is, only the standard objects predefined by your version of <productname>PostgreSQL</productname>. <literal>template0</literal> should never be changed after the database cluster has been initialized. By instructing <command>CREATE DATABASE</command> to copy <literal>template0</literal> instead of <literal>template1</literal>, you can create a <quote>virgin</quote> user database that contains none of the site-local additions in <literal>template1</literal>. This is particularly handy when restoring a <literal>pg_dump</literal> dump: the dump script should be restored in a virgin database to ensure that one recreates the correct contents of the dumped database, without conflicting with objects that might have been added to <literal>template1</literal> later on.
ru: Также существует вторая системная база <literal>template0</literal>.<placeholder-1/> При инициализации она содержит те же самые объекты, что и <literal>template1</literal>, предопределённые в рамках устанавливаемой версии <productname>PostgreSQL</productname>. Не нужно вносить никаких изменений в <literal>template0</literal> после инициализации кластера. Если в команде <command>CREATE DATABASE</command> указать на необходимость копирования <literal>template0</literal> вместо <literal>template1</literal>, то на выходе можно получить <quote>чистую</quote> пользовательскую базу данных без изменений, внесённых в <literal>template1</literal>. Это удобно, когда производится восстановление из дампа данных с помощью утилиты <literal>pg_dump</literal>: скрипт дампа лучше выполнять в чистую базу, во избежание каких-либо конфликтов с объектами, которые могли быть добавлены в <literal>template1</literal>.

source: Another common reason for copying <literal>template0</literal> instead of <literal>template1</literal> is that new encoding and locale settings can be specified when copying <literal>template0</literal>, whereas a copy of <literal>template1</literal> must use the same settings it does. This is because <literal>template1</literal> might contain encoding-specific or locale-specific data, while <literal>template0</literal> is known not to.
ru: Другая причина, для копирования <literal>template0</literal> вместо <literal>template1</literal> заключается в том, что можно указать новые параметры локали и кодировку при копировании <literal>template0</literal>, в то время как для копий <literal>template1</literal> они не должны меняться. Это связано с тем, что <literal>template1</literal> может содержать данные в специфических кодировках и локалях, в отличие от <literal>template0</literal>.

source: To create a database by copying <literal>template0</literal>, use: <placeholder-1/> from the SQL environment, or: <placeholder-2/> from the shell.
ru: Для создания базы данных на основе <literal>template0</literal>, используйте: <placeholder-1/> из среды SQL, или: <placeholder-2/> из командной строки ОС.

source: It is possible to create additional template databases, and indeed one can copy any database in a cluster by specifying its name as the template for <command>CREATE DATABASE</command>. It is important to understand, however, that this is not (yet) intended as a general-purpose <quote><command>COPY DATABASE</command></quote> facility. The principal limitation is that no other sessions can be connected to the source database while it is being copied. <command>CREATE DATABASE</command> will fail if any other connection exists when it starts; during the copy operation, new connections to the source database are prevented.
ru: Можно создавать дополнительные шаблоны баз данных, и, более того, можно копировать любую базу данных кластера, если указать её имя в качестве шаблона в команде <command>CREATE DATABASE</command>. Важно понимать, что это (пока) не рассматривается в качестве основного инструмента для реализации возможности <quote><command>COPY DATABASE</command></quote>. Важным является то, что при копировании все сессии к копируемой базе данных должны быть закрыты. <command>CREATE DATABASE</command> выдаст ошибку, если есть другие подключения; во время операции копирования новые подключения к этой базе данных не разрешены.

source: Two useful flags exist in <literal>pg_database</literal><placeholder-1/> for each database: the columns <literal>datistemplate</literal> and <literal>datallowconn</literal>. <literal>datistemplate</literal> can be set to indicate that a database is intended as a template for <command>CREATE DATABASE</command>. If this flag is set, the database can be cloned by any user with <literal>CREATEDB</literal> privileges; if it is not set, only superusers and the owner of the database can clone it. If <literal>datallowconn</literal> is false, then no new connections to that database will be allowed (but existing sessions are not terminated simply by setting the flag false). The <literal>template0</literal> database is normally marked <literal>datallowconn = false</literal> to prevent its modification. Both <literal>template0</literal> and <literal>template1</literal> should always be marked with <literal>datistemplate = true</literal>.
ru: В таблице <literal>pg_database</literal><placeholder-1/> есть два полезных флага для каждой базы данных: столбцы <literal>datistemplate</literal> и <literal>datallowconn</literal>. <literal>datistemplate</literal> указывает на факт того, что база данных может выступать в качестве шаблона в команде <command>CREATE DATABASE</command>. Если флаг установлен, то для пользователей с правом <literal>CREATEDB</literal> клонирование доступно; если флаг не установлен, то лишь суперпользователь и владелец базы данных могут её клонировать. Если <literal>datallowconn</literal> не установлен, то новые подключения к этой базе не допустимы (однако текущие сессии не закрываются при сбросе этого флага). База <literal>template0</literal> обычно помечена как <literal>datallowconn = false</literal> для избежания любых её модификаций. И <literal>template0</literal>, и <literal>template1</literal> всегда должны быть помечены флагом <literal>datistemplate = true</literal>.

source: <literal>template1</literal> and <literal>template0</literal> do not have any special status beyond the fact that the name <literal>template1</literal> is the default source database name for <command>CREATE DATABASE</command>. For example, one could drop <literal>template1</literal> and recreate it from <literal>template0</literal> without any ill effects. This course of action might be advisable if one has carelessly added a bunch of junk in <literal>template1</literal>. (To delete <literal>template1</literal>, it must have <literal>pg_database.datistemplate = false</literal>.)
ru: <literal>template1</literal> и <literal>template0</literal> не выделены как-то особенно, кроме того факта, что <literal>template1</literal> используется по умолчанию в команде <command>CREATE DATABASE</command>. Например, можно удалить <literal>template1</literal> и безболезненно создать заново из <literal>template0</literal>. Это можно посоветовать в случае, если <literal>template1</literal> был замусорен. (Чтобы удалить <literal>template1</literal>, необходимо сбросить флаг <literal>pg_database.datistemplate = false</literal>.)

source: The <literal>postgres</literal> database is also created when a database cluster is initialized. This database is meant as a default database for users and applications to connect to. It is simply a copy of <literal>template1</literal> and can be dropped and recreated if necessary.
ru: База данных <literal>postgres</literal> также создаётся при инициализации кластера. Она используется пользователями и приложениями для подключения по умолчанию. Представляет собой всего лишь копию <literal>template1</literal>, и может быть удалена и повторно создана при необходимости.

source: Database Configuration
ru: Конфигурирование баз данных

source: Recall from <xref linkend="runtime-config"/> that the <productname>PostgreSQL</productname> server provides a large number of run-time configuration variables. You can set database-specific default values for many of these settings.
ru: Обратившись к <xref remap="3" linkend="runtime-config"/> можно выяснить, что сервер <productname>PostgreSQL</productname> имеет множество параметров конфигурации времени исполнения. Можно выставить специфичные для базы данных значения по умолчанию.

source: For example, if for some reason you want to disable the <acronym>GEQO</acronym> optimizer for a given database, you'd ordinarily have to either disable it for all databases or make sure that every connecting client is careful to issue <literal>SET geqo TO off</literal>. To make this setting the default within a particular database, you can execute the command: <placeholder-1/> This will save the setting (but not set it immediately). In subsequent connections to this database it will appear as though <literal>SET geqo TO off;</literal> had been executed just before the session started. Note that users can still alter this setting during their sessions; it will only be the default. To undo any such setting, use <literal>ALTER DATABASE <replaceable>dbname</replaceable> RESET <replaceable>varname</replaceable></literal>.
ru: Например, если по какой-то причине необходимо выключить <acronym>GEQO</acronym> оптимизатор в какой-то из баз, то можно, либо выключить его для всех баз данных одновременно, либо убедиться, что все клиенты заботятся об этом, выполняя команду <literal>SET geqo TO off</literal>. Для того чтобы это действовало по умолчанию в конкретной базе данных, необходимо выполнить команду: <placeholder-1/> Установка сохраняется, но не применяется тотчас. В последующих подключениях к этой базе данных, эффект будет таким, будто перед началом сессии была выполнена команда <literal>SET geqo TO off;</literal>. Стоит обратить внимание, что пользователь по-прежнему может изменять этот параметр во время сессии; ведь это просто значение по умолчанию. Чтобы сбросить такое установленное значение, используйте <literal>ALTER DATABASE <replaceable>dbname</replaceable> RESET <replaceable>varname</replaceable></literal>.

source: Destroying a Database
ru: Удаление базы данных

source: You cannot execute the <command>DROP DATABASE</command> command while connected to the victim database. You can, however, be connected to any other database, including the <literal>template1</literal> database. <literal>template1</literal> would be the only option for dropping the last user database of a given cluster.
ru: Невозможно выполнить команду <command>DROP DATABASE</command> пока существует хоть одно подключение к заданной базе. Однако можно подключиться к любой другой, в том числе и <literal>template1</literal>. <literal>template1</literal> может быть единственной возможностью при удалении последней пользовательской базы данных кластера.

source: Tablespaces
ru: Табличные пространства

source: <primary>tablespace</primary>
ru: <primary>табличное пространство</primary>

source: Tablespaces in <productname>PostgreSQL</productname> allow database administrators to define locations in the file system where the files representing database objects can be stored. Once created, a tablespace can be referred to by name when creating database objects.
ru: Табличные пространства в <productname>PostgreSQL</productname> позволяют администраторам организовать логику размещения файлов объектов базы данных в файловой системе. К однажды созданному табличному пространству можно обращаться по имени на этапе создания объектов.
