Repository: pluzanov/pg-doc-ru
Catalog: 9.6/nls.po
Languages: ru

source: Native Language Support
ru: Языковая поддержка

source: For the Translator
ru: Переводчику

source: <productname>PostgreSQL</productname> programs (server and client) can issue their messages in your favorite language &mdash; if the messages have been translated. Creating and maintaining translated message sets needs the help of people who speak their own language well and want to contribute to the <productname>PostgreSQL</productname> effort. You do not have to be a programmer at all to do this. This section explains how to help.
ru: Программы <productname>PostgreSQL</productname> (серверные и клиентские) могут выдавать сообщения на предпочитаемом вами языке &mdash; если эти сообщения были переведены. Создание и поддержка переведённых наборов сообщений предполагает помощь со стороны людей, которые хорошо говорят на своём языке и хотят сотрудничать с <productname>PostgreSQL</productname>. Для этого совершенно не обязательно быть программистом. В данном разделе объясняется, как можно помочь.

source: Requirements
ru: Требования

source: We won't judge your language skills &mdash; this section is about software tools. Theoretically, you only need a text editor. But this is only in the unlikely event that you do not want to try out your translated messages. When you configure your source tree, be sure to use the <option>--enable-nls</option> option. This will also check for the <application>libintl</application> library and the <filename>msgfmt</filename> program, which all end users will need anyway. To try out your work, follow the applicable portions of the installation instructions.
ru: Мы не будем оценивать ваши языковые навыки &mdash; данный раздел посвящён средствам программного обеспечения. Теоретически, требуется лишь текстовый редактор. Но, скорее всего, вы захотите проверить свои переведённые сообщения. Когда вы выполняете <command>configure</command>, обязательно используйте параметр <option>--enable-nls</option>. Это также проверит библиотеку <application>libintl</application> и программу <filename>msgfmt</filename>, которые понадобятся всем пользователям в любом случае. Чтобы проверить свою работу, следуйте соответствующим разделам инструкций по установке.

source: If you want to start a new translation effort or want to do a message catalog merge (described later), you will need the programs <filename>xgettext</filename> and <filename>msgmerge</filename>, respectively, in a GNU-compatible implementation. Later, we will try to arrange it so that if you use a packaged source distribution, you won't need <filename>xgettext</filename>. (If working from Git, you will still need it.) <application>GNU Gettext 0.10.36</application> or later is currently recommended.
ru: Если вы захотите выполнить перевод или слияние каталога сообщений (описано ниже), вам понадобятся, соответственно, программы <filename>xgettext</filename> и <filename>msgmerge</filename> в GNU-совместимой реализации. Позднее, мы постараемся сделать так, что если вы будете использовать дистрибутив исходников, вам не понадобится <filename>xgettext</filename>. (При работе с Git, вам всё же это будет необходимо). В настоящее время рекомендуется <application>GNU Gettext 0.10.36</application> или более поздняя версия.

source: Your local gettext implementation should come with its own documentation. Some of that is probably duplicated in what follows, but for additional details you should look there.
ru: К вашей реализации gettext должна прилагаться документация. Некоторая её часть, возможно, будет продублирована ниже, но более подробную информацию следует искать там.

source: Concepts
ru: Основные понятия

source: The pairs of original (English) messages and their (possibly) translated equivalents are kept in <firstterm>message catalogs</firstterm>, one for each program (although related programs can share a message catalog) and for each target language. There are two file formats for message catalogs: The first is the <quote>PO</quote> file (for Portable Object), which is a plain text file with special syntax that translators edit. The second is the <quote>MO</quote> file (for Machine Object), which is a binary file generated from the respective PO file and is used while the internationalized program is run. Translators do not deal with MO files; in fact hardly anyone does.
ru: Пары оригинальных (английских) сообщений и их (предположительно) переведённых эквивалентов хранятся в <firstterm>каталогах сообщений</firstterm>, по одному для каждой программы (хотя связанные программы могут иметь общий каталог) и для каждого языка перевода. Существует два формата, поддерживающих каталоги сообщений: Первый — <quote>PO</quote> (Portable Object, переносимый объект), который является простым текстовым файлом с особым синтаксисом, редактируемый переводчиками. Второй — <quote>MO</quote> (Machine Object, машинный объект), который является двоичным файлом, генерируемым из соответствующего файла PO, и используется при выполнении интернационализированной программы. Переводчики не работают с файлами MO; фактически с ними едва ли кто-то работает напрямую.

source: The extension of the message catalog file is to no surprise either <filename>.po</filename> or <filename>.mo</filename>. The base name is either the name of the program it accompanies, or the language the file is for, depending on the situation. This is a bit confusing. Examples are <filename>psql.po</filename> (PO file for psql) or <filename>fr.mo</filename> (MO file in French).
ru: Файл каталога сообщений, как можно было предположить, имеет расширение <filename>.po</filename> или <filename>.mo</filename>. Базовым именем является либо имя сопровождаемой им программы, либо язык, для которого создан файл, в зависимости от ситуации. Это создаёт некоторую путаницу. Например, <filename>psql.po</filename> (файл PO для psql) или <filename>fr.mo</filename> (файл MO на французском).

source: The file format of the PO files is illustrated here: <placeholder-1/> The msgid's are extracted from the program source. (They need not be, but this is the most common way.) The msgstr lines are initially empty and are filled in with useful strings by the translator. The strings can contain C-style escape characters and can be continued across lines as illustrated. (The next line must start at the beginning of the line.)
ru: Здесь проиллюстрирован формат файлов PO: <placeholder-1/> Строки msgid извлекаются из исходного кода программы (что необязательно, но это наиболее распространённый способ). Строки msgstr изначально пусты, и переводчик заполняет их переводами. Строки могут содержать экранирующие спецсимволы в стиле С и занимать несколько строк, как в приведённом примере. (Следующая строка должна начинаться с начала строки.)

source: The # character introduces a comment. If whitespace immediately follows the # character, then this is a comment maintained by the translator. There can also be automatic comments, which have a non-whitespace character immediately following the #. These are maintained by the various tools that operate on the PO files and are intended to aid the translator. <placeholder-1/> The #. style comments are extracted from the source file where the message is used. Possibly the programmer has inserted information for the translator, such as about expected alignment. The #: comment indicates the exact location(s) where the message is used in the source. The translator need not look at the program source, but can if there is doubt about the correct translation. The #, comments contain flags that describe the message in some way. There are currently two flags: <literal>fuzzy</literal> is set if the message has possibly been outdated because of changes in the program source. The translator can then verify this and possibly remove the fuzzy flag. Note that fuzzy messages are not made available to the end user. The other flag is <literal>c-format</literal>, which indicates that the message is a <function>printf</function>-style format template. This means that the translation should also be a format string with the same number and type of placeholders. There are tools that can verify this, which key off the c-format flag.
ru: Символ # обозначает начало комментария. Если сразу за символом # следует пробел, то этим комментарием управляет переводчик. Комментарии также могут быть автоматическими, у которых сразу за # следует символ, отличный от пробела. Они управляются различными инструментами, которые работают с файлами PO и предназначены для переводчиков. <placeholder-1/> Комментарии в стиле #. извлекаются из исходного файла, где используется сообщение. Возможно, программист вставил информацию для переводчика, например, о предполагаемом выравнивании. Комментарий #: указывает точное место (места), где сообщение используется в исходном коде. Переводчику не нужно смотреть на исходный код программы, но он может это сделать, если сомневается в точности перевода. Комментарии #, содержат флаги, которые некоторым образом описывают сообщение. В настоящее время существует два флага: <literal>fuzzy</literal> устанавливается, если сообщение, возможно, стало неактуально по причине изменений в исходном коде программы. Переводчик может проверить это и, возможно, удалить флаг fuzzy. Заметьте, что fuzzy сообщения недоступны конечному пользователю. Другой флаг это <literal>c-format</literal>, который указывает, что сообщение является шаблоном формата в стиле <function>printf</function>. Это означает, что перевод также должен быть строкой формата с таким же количеством и типом "заполнителей". Существуют средства, которые распознают и проверяют флаги c-format.

source: Creating and Maintaining Message Catalogs
ru: Создание и управление каталогами сообщений

source: OK, so how does one create a <quote>blank</quote> message catalog? First, go into the directory that contains the program whose messages you want to translate. If there is a file <filename>nls.mk</filename>, then this program has been prepared for translation.
ru: Итак, как же создать <quote>blank</quote> каталог сообщений? Во-первых, зайдите в каталог, содержащий программу, сообщения которой необходимо перевести. Если имеется файл <filename>nls.mk</filename>, данная программа подготовлена к переводу.

source: If there are already some <filename>.po</filename> files, then someone has already done some translation work. The files are named <filename><replaceable>language</replaceable>.po</filename>, where <replaceable>language</replaceable> is the <ulink url="http://www.loc.gov/standards/iso639-2/php/English_list.php"> ISO 639-1 two-letter language code (in lower case)</ulink>, e.g., <filename>fr.po</filename> for French. If there is really a need for more than one translation effort per language then the files can also be named <filename><replaceable>language</replaceable>_<replaceable>region</replaceable>.po</filename> where <replaceable>region</replaceable> is the <ulink url="http://www.iso.org/iso/country_names_and_code_elements"> ISO 3166-1 two-letter country code (in upper case)</ulink>, e.g., <filename>pt_BR.po</filename> for Portuguese in Brazil. If you find the language you wanted you can just start working on that file.
ru: Если уже есть некоторые <filename>.po</filename> файлы, то кто-то уже занимался переводом. Файлы получают имя <filename><replaceable>language</replaceable>.po</filename>, где <replaceable>language</replaceable> это <ulink url="http://www.loc.gov/standards/iso639-2/php/English_list.php"> двухбуквенный языковой код ISO 639-1 (в нижнем регистре)</ulink>, например, <filename>fr.po</filename> для французского. Если требуется больше одного перевода на какой-либо язык, файлы могут также быть названы <filename><replaceable>language</replaceable>_<replaceable>region</replaceable>.po</filename>, где <replaceable>region</replaceable> это <ulink url="http://www.iso.org/iso/country_names_and_code_elements"> двухбуквенный код страны ISO 3166-1 (в верхнем регистре)</ulink>, например, <filename>pt_BR.po</filename> для португальского в Бразилии. Если найден необходимый язык, можно просто начать работать над этим файлом.

source: If you need to start a new translation effort, then first run the command: <placeholder-1/> This will create a file <filename><replaceable>progname</replaceable>.pot</filename>. (<filename>.pot</filename> to distinguish it from PO files that are <quote>in production</quote>. The <literal>T</literal> stands for <quote>template</quote>.) Copy this file to <filename><replaceable>language</replaceable>.po</filename> and edit it. To make it known that the new language is available, also edit the file <filename>nls.mk</filename> and add the language (or language and country) code to the line that looks like: <placeholder-2/> (Other languages can appear, of course.)
ru: Если необходимо начать новый перевод, сначала выполните команду: <placeholder-1/> В результате будет создан файл <filename><replaceable>progname</replaceable>.pot</filename>. (<filename>.pot</filename>, чтобы отличать его от файлов PO, находящихся <quote>в эксплуатации</quote>. <literal>T</literal> означает <quote>шаблон</quote>.) Скопируйте данный файл в <filename><replaceable>language</replaceable>.po</filename> и редактируйте его. Чтобы сообщить о том, что новый язык доступен, также редактируйте файл <filename>nls.mk</filename> и добавляйте языковой код (или код языка и страны) к строке, которая выглядит следующим образом: <placeholder-2/> (Конечно, и другие языки могут появиться.)

source: As the underlying program or library changes, messages might be changed or added by the programmers. In this case you do not need to start from scratch. Instead, run the command: <placeholder-1/> which will create a new blank message catalog file (the pot file you started with) and will merge it with the existing PO files. If the merge algorithm is not sure about a particular message it marks it <quote>fuzzy</quote> as explained above. The new PO file is saved with a <filename>.po.new</filename> extension.
ru: По мере развития базовой программы или библиотеки, сообщения могут быть изменены или добавлены программистами. В этом случае нет необходимости начинать с нуля. Вместо этого выполните команду: <placeholder-1/> что создаст новый пустой файл каталога сообщений (файл с расширением pot, с которого вы начали) и объединит его с существующими файлами PO. Если алгоритм слияния не распознаёт конкретное сообщение, он ставит пометку <quote>fuzzy</quote>, как говорилось выше. Новый файл PO сохраняется с расширением <filename>.po.new</filename>.

source: Editing the PO Files
ru: Редактирование файлов PO

source: The PO files can be edited with a regular text editor. The translator should only change the area between the quotes after the msgstr directive, add comments, and alter the fuzzy flag. There is (unsurprisingly) a PO mode for Emacs, which I find quite useful.
ru: Файлы PO можно редактировать при помощи обычного текстового редактора. Переводчику нужно лишь вставить перевод между кавычками после директивы msgstr, добавить комментарии и изменить флаг fuzzy. Существует также режим PO для Emacs, который представляется довольно полезным.

source: The PO files need not be completely filled in. The software will automatically fall back to the original string if no translation (or an empty translation) is available. It is no problem to submit incomplete translations for inclusions in the source tree; that gives room for other people to pick up your work. However, you are encouraged to give priority to removing fuzzy entries after doing a merge. Remember that fuzzy entries will not be installed; they only serve as reference for what might be the right translation.
ru: Файлы PO не обязательно должны быть полностью заполнены. Программа автоматически вернётся к использованию исходной строки, если перевод недоступен (или отсутствует). Вы вполне можете предлагать для включения в исходный код неполный перевод; это даст возможность другим продолжить работу над ним. Однако после слияния рекомендуется в первую очередь удалить ненужные неточные соответствия. Помните, что неточные соответствия в итоге не будут использоваться, они могут лишь подсказывать, каким мог бы быть перевод похожей строки.

source: Make sure that if the original ends with a newline, the translation does, too. Similarly for tabs, etc.
ru: Если оригинал заканчивается переводом строки, важно, чтобы это было отражено и в переводе. То же относится к табуляции, и т. п.

source: If the original is a <function>printf</function> format string, the translation also needs to be. The translation also needs to have the same format specifiers in the same order. Sometimes the natural rules of the language make this impossible or at least awkward. In that case you can modify the format specifiers like this: <placeholder-1/> Then the first placeholder will actually use the second argument from the list. The <literal><replaceable>digits</replaceable>$</literal> needs to follow the % immediately, before any other format manipulators. (This feature really exists in the <function>printf</function> family of functions. You might not have heard of it before because there is little use for it outside of message internationalization.)
ru: Если оригиналом является строка форматирования <function>printf</function>, то перевод должен иметь такой же вид. Перевод также должен иметь те же спецификаторы формата в том же порядке. Иногда правила языка таковы, что это невозможно или как минимум нелепо. В таком случае можно модифицировать спецификаторы формата подобным образом: <placeholder-1/> Тогда первый заполнитель просто использует второй аргумент из списка.<literal><replaceable>digits</replaceable>$</literal> должен стоять сразу за % до любых других модификаторов формата. (Эта возможность действительно существует в семействе функций <function>printf</function>. Вы, возможно, не слышали о ней раньше, потому что она мало используется где-либо кроме интернационализации сообщений.)

source: If the original string contains a linguistic mistake, report that (or fix it yourself in the program source) and translate normally. The corrected string can be merged in when the program sources have been updated. If the original string contains a factual mistake, report that (or fix it yourself) and do not translate it. Instead, you can mark the string with a comment in the PO file.
ru: Если исходная строка содержит лингвистическую ошибку, сообщите об этом (или исправьте самостоятельно в исходном коде программы) и переведите правильно. Верная строка может быть добавлена, когда исходный программный код будет обновлен. Если исходная строка содержит фактическую ошибку, сообщите об этом (или исправьте самостоятельно) и не переводите её. Вместо этого, можно отметить строку, оставив комментарий в файле PO.

source: Maintain the style and tone of the original string. Specifically, messages that are not sentences (<literal>cannot open file %s</literal>) should probably not start with a capital letter (if your language distinguishes letter case) or end with a period (if your language uses punctuation marks). It might help to read <xref linkend="error-style-guide"/>.
ru: Сохраняйте стиль и тон исходной строки. В частности, сообщения, не являющиеся предложениями (<literal>cannot open file %s</literal>), вероятно, не следует начинать с заглавной буквы (если в вашем языке есть разделение на регистры) или заканчивать точкой (если в вашем языке используются знаки препинания). Дополнительно см. <xref remap="4" linkend="error-style-guide"/>.

source: If you don't know what a message means, or if it is ambiguous, ask on the developers' mailing list. Chances are that English speaking end users might also not understand it or find it ambiguous, so it's best to improve the message.
ru: Если вы не знаете, что означает какое-либо сообщение, или если оно допускает двоякое толкование, обратитесь за помощью через список рассылки разработчиков. По всей вероятности, англоговорящие пользователи могут также его не понять или найти двусмысленным, поэтому лучше исправить это сообщение.

source: Here are some things to keep in mind while editing the translations: <placeholder-1/>
ru: Ниже описаны моменты, которые следует учитывать при редактировании переводов: <placeholder-1/>

source: For the Programmer
ru: Программисту

source: Mechanics
ru: Механизмы

source: This section describes how to implement native language support in a program or library that is part of the <productname>PostgreSQL</productname> distribution. Currently, it only applies to C programs.
ru: Данный раздел описывает как добавить языковую поддержку в программе или библиотеке, которая является частью дистрибутива <productname>PostgreSQL</productname>. В настоящий момент это относится только к программам на языке С.

source: Adding NLS Support to a Program
ru: Добавление языковой поддержки для программы

source: Insert this code into the start-up sequence of the program: <placeholder-1/> (The <replaceable>progname</replaceable> can actually be chosen freely.)
ru: Вставьте этот код в начало программы: <placeholder-1/> (<replaceable>progname</replaceable> фактически может быть выбрана произвольно.)

source: Wherever a message that is a candidate for translation is found, a call to <function>gettext()</function> needs to be inserted. E.g.: <placeholder-1/> would be changed to: <placeholder-2/> (<symbol>gettext</symbol> is defined as a no-op if NLS support is not configured.)
ru: Везде, где сообщение нуждается в переводе, необходимо вставить вызов <function>gettext()</function>. Например: <placeholder-1/> нужно заменить на: <placeholder-2/> (<symbol>gettext</symbol> определяется как холостая команда, если NLS поддержка не настроена.)

source: This tends to add a lot of clutter. One common shortcut is to use: <placeholder-1/> Another solution is feasible if the program does much of its communication through one or a few functions, such as <function>ereport()</function> in the backend. Then you make this function call <function>gettext</function> internally on all input strings.
ru: Это часто приводит к немалой путанице. Один из распространённых подходов в этом случае: <placeholder-1/> Ещё одно решение допустимо, если программа часто выполняет обмен данными через одну или несколько функций, таких как <function>ereport()</function> в серверном процессе. Тогда вы выполняете внутренний вызов функции <function>gettext</function> для каждой входящей строки.

source: The program name, as provided in the <function>textdomain()</function> call.
ru: Имя программы, которое указано в вызове <function>textdomain()</function>.

source: List of provided translations &mdash; initially empty.
ru: Список выполненных переводов (изначально пустой).

source: List of files that contain translatable strings, i.e., those marked with <function>gettext</function> or an alternative solution. Eventually, this will include nearly all source files of the program. If this list gets too long you can make the first <quote>file</quote> be a <literal>+</literal> and the second word be a file that contains one file name per line.
ru: Список файлов, которые содержат подлежащие переводу строки, т. е. помеченные <function>gettext</function> или альтернативным решением. В итоге, в него будут включены почти все исходные файлы программы. Если список станет слишком длинным, можно первый <quote>file</quote> сделать <literal>+</literal> а второе слово — файлом, который содержит по одному имени файла на строку.
