Repository: pluzanov/pg-doc-ru
Catalog: 9.6/nls.po
Languages: ru

source: The tools that generate message catalogs for the translators to work on need to know what function calls contain translatable strings. By default, only <function>gettext()</function> calls are known. If you used <function>_</function> or other identifiers you need to list them here. If the translatable string is not the first argument, the item needs to be of the form <literal>func:2</literal> (for the second argument). If you have a function that supports pluralized messages, the item should look like <literal>func:1,2</literal> (identifying the singular and plural message arguments).
ru: Утилитам, которые генерируют каталоги сообщений для работы переводчиков, должно быть известно, какие вызовы функции содержат строки, подлежащие переводу. По умолчанию распознаются только вызовы <function>gettext()</function>. Если вы использовали <function>_</function> или другие идентификаторы, необходимо перечислить их здесь. Если подлежащая переводу строка не является первым аргументом, необходимо, чтобы элемент имел форму <literal>func:2</literal> (для второго аргумента). Если функция поддерживает сообщения в форме множественного числа, элемент должен выглядеть следующим образом <literal>func:1,2</literal> (идентификация аргументов в виде сообщений в форме единственного и множественного числа).

source: Add a file <filename>nls.mk</filename> in the directory with the program sources. This file will be read as a makefile. The following variable assignments need to be made here: <placeholder-1/>
ru: Добавьте файл <filename>nls.mk</filename> в каталог с исходными кодами программы. Данный файл будет считаться сборочным файлом (makefile). В нём необходимо выполнить присвоение значений для следующих переменных: <placeholder-1/>

source: The build system will automatically take care of building and installing the message catalogs.
ru: Система сборки автоматически соберёт и установит каталоги сообщений.

source: Message-writing Guidelines
ru: Рекомендации по написанию сообщений

source: Do not construct sentences at run-time, like: <placeholder-1/> The word order within the sentence might be different in other languages. Also, even if you remember to call <function>gettext()</function> on each fragment, the fragments might not translate well separately. It's better to duplicate a little code so that each message to be translated is a coherent whole. Only numbers, file names, and such-like run-time variables should be inserted at run time into a message text.
ru: Не составляйте предложения во время выполнения. Например: <placeholder-1/> Порядок слов в предложении может отличаться в других языках. Также, даже если вы не забываете вызывать <function>gettext()</function> для каждого фрагмента, возможно, что по отдельности они не будут переведены хорошо. Лучше продублировать небольшую часть кода, чтобы каждое сообщение было переведено как единое целое. Лишь цифры, имена файлов и подобные текущие переменные следует вставлять в текст сообщения во время выполнения.

source: For similar reasons, this won't work: <placeholder-1/> because it assumes how the plural is formed. If you figured you could solve it like this: <placeholder-2/> then be disappointed. Some languages have more than two forms, with some peculiar rules. It's often best to design the message to avoid the issue altogether, for instance like this: <placeholder-3/>
ru: По тем же причинам следующий подход не будет работать: <placeholder-1/> так как это подразумевает, как формируется форма множественного числа. Если вы думаете, что сможете решить это таким способом: <placeholder-2/> возможно, вы будете разочарованы. В некоторых языках существует более двух форм, и они образуются по особым правилам. Обычно лучше сформулировать сообщение, которое позволит полностью избежать этой проблемы, например: <placeholder-3/>

source: If you really want to construct a properly pluralized message, there is support for this, but it's a bit awkward. When generating a primary or detail error message in <function>ereport()</function>, you can write something like this: <placeholder-1/> The first argument is the format string appropriate for English singular form, the second is the format string appropriate for English plural form, and the third is the integer control value that determines which plural form to use. Subsequent arguments are formatted per the format string as usual. (Normally, the pluralization control value will also be one of the values to be formatted, so it has to be written twice.) In English it only matters whether <replaceable>n</replaceable> is 1 or not 1, but in other languages there can be many different plural forms. The translator sees the two English forms as a group and has the opportunity to supply multiple substitute strings, with the appropriate one being selected based on the run-time value of <replaceable>n</replaceable>.
ru: Если вы действительно хотите формировать правильно составленные сообщения в форме множественного числа, есть способ этого добиться, но это несколько неудобно. При генерировании первичного или детализированного сообщения об ошибке в <function>ereport()</function>, можно написать так: <placeholder-1/> Первым аргументом является строка формата, соответствующая форме единственного числа в английском языке, вторым аргументом — строка формата, соответствующая форме множественного числа в английском языке, и третьим аргументом — управляющее целочисленное значение, которое определяет, какую форму (единственного или множественного числа) использовать. Последующие аргументы форматируются на основе строки формата, как обычно. (Как правило, значение аргумента для управления формой множественного числа будет также одним из значений, подлежащих форматированию, поэтому оно должно быть записано дважды.) В английском языке важно лишь, является ли значение <replaceable>n</replaceable> единицей или нет, но в других языках может быть много различных форм множественного числа. Переводчик рассматривает две английские формы как группу и имеет возможность задать несколько вариантов замены строк, при этом подходящий вариант выбирается исходя из текущего значения <replaceable>n</replaceable>.

source: If you need to pluralize a message that isn't going directly to an <function>errmsg</function> or <function>errdetail</function> report, you have to use the underlying function <function>ngettext</function>. See the gettext documentation.
ru: Если вам нужно составить сообщение в форме множественного числа, которое не используется непосредственно при выводе сообщений в <function>errmsg</function> или <function>errdetail</function>, вы должны воспользоваться базовой функцией <function>ngettext</function>. См. документацию по gettext.

source: If you want to communicate something to the translator, such as about how a message is intended to line up with other output, precede the occurrence of the string with a comment that starts with <literal>translator</literal>, e.g.: <placeholder-1/> These comments are copied to the message catalog files so that the translators can see them.
ru: Если вы хотите передать какую-либо информацию переводчику, например о том, насколько сообщение соотносится с другими выходными данными, перед строкой должен появиться комментарий, который начинается с <literal>translator</literal>, например: <placeholder-1/> Эти комментарии копируются в файлы каталога сообщений, чтобы переводчик мог их видеть.

source: Here are some guidelines for writing messages that are easily translatable. <placeholder-1/>
ru: Ниже описаны некоторые рекомендации по написанию сообщений, которые легко перевести. <placeholder-1/>
