Repository: pluzanov/pg-doc-ru
Catalog: 9.6/pgfreespacemap.po
Languages: ru

source: The <filename>pg_freespacemap</filename> module provides a means for examining the free space map (FSM). It provides a function called <function>pg_freespace</function>, or two overloaded functions, to be precise. The functions show the value recorded in the free space map for a given page, or for all pages in the relation.
ru: Модуль <filename>pg_freespacemap</filename> предоставляет средства для исследования карты свободного пространства (FSM). В нём реализована функция <function>pg_freespace</function>, точнее, две перегруженных функции. Эти функции показывают значение, записанное в карте свободного пространства для данной страницы, либо для всех страниц отношения.

source: By default public access is revoked from the functions, just in case there are security issues lurking.
ru: По умолчанию, роли public на всякий случай, во избежание угрозы безопасности, запрещён доступ к этим функциям.

source: Functions
ru: Функции

source: Returns the amount of free space on the page of the relation, specified by <literal>blkno</literal>, according to the FSM.
ru: Возвращает объём свободного пространства на странице для отношения, заданного параметром <literal>blkno</literal>, согласно FSM.

source: Displays the amount of free space on each page of the relation, according to the FSM. A set of <literal>(blkno bigint, avail int2)</literal> tuples is returned, one tuple for each page in the relation.
ru: Выдаёт объём свободного пространства на каждой странице отношения, согласно FSM. Возвращается набор кортежей <literal>(blkno bigint, avail int2)</literal>, по одному кортежу для каждой страницы в отношении.

source: The values stored in the free space map are not exact. They're rounded to precision of 1/256th of <symbol>BLCKSZ</symbol> (32 bytes with default <symbol>BLCKSZ</symbol>), and they're not kept fully up-to-date as tuples are inserted and updated.
ru: Значения, хранимые в карте свободного пространства, не являются точными. Они округляются до 1/256 величины <symbol>BLCKSZ</symbol> (до 32 байт со значением <symbol>BLCKSZ</symbol> по умолчанию) и не поддерживаются в актуальном состоянии при каждом добавлении и изменении кортежей.

source: For indexes, what is tracked is entirely-unused pages, rather than free space within pages. Therefore, the values are not meaningful, just whether a page is full or empty.
ru: Для индексов отслеживаются полностью неиспользованные страницы, а не свободное пространство в страницах. Таким образом, эти значения отражают только то, что страница занята или свободна.

source: The interface was changed in version 8.4, to reflect the new FSM implementation introduced in the same version.
ru: Интерфейс был изменён в версии 8.4, в соответствии с нововведениями реализации FSM, которые появились в этой версии.

source: Sample Output
ru: Пример вывода

source: Author
ru: Автор

source: Original version by Mark Kirkwood <email>markir@paradise.net.nz</email>. Rewritten in version 8.4 to suit new FSM implementation by Heikki Linnakangas <email>heikki@enterprisedb.com</email>
ru: Исходную версию разработал Марк Кирквуд <email>markir@paradise.net.nz</email>. Для версии 8.4 с новой реализацией FSM код адаптировал Хейкки Линнакангас <email>heikki@enterprisedb.com</email>
