Repository: pluzanov/pg-doc-ru
Catalog: 9.6/pgstandby.po
Languages: ru

source: Application
ru: Приложение

source: supports the creation of a <placeholder-1/> warm standby server
ru: поддерживает создание сервера тёплого резерва <placeholder-1/>

source: option
ru: параметр

source: archivelocation
ru: расположение_архива

source: nextwalfile
ru: следующий_файл_wal

source: xlogfilepath
ru: каталог_xlog

source: restartwalfile
ru: файл_перезапуска_wal

source: Description
ru: Описание

source: <application>pg_standby</application> supports creation of a <quote>warm standby</quote> database server. It is designed to be a production-ready program, as well as a customizable template should you require specific modifications.
ru: Программа <application>pg_standby</application> поддерживает создание сервера в режиме <quote>тёплого резерва</quote>. Она предназначена как для непосредственного применения в производственной среде, так и для использования в качестве настраиваемой заготовки, когда требуются специальные модификации.

source: <application>pg_standby</application> is designed to be a waiting <varname>restore_command</varname>, which is needed to turn a standard archive recovery into a warm standby operation. Other configuration is required as well, all of which is described in the main server manual (see <xref linkend="warm-standby"/>).
ru: <application>pg_standby</application> ожидает выполнения команды <varname>restore_command</varname>, которая, в свою очередь, нужна для перехода от стандартного восстановления архива к режиму тёплого резерва. Для этого также требуется другая настройка, которая описывается в основном руководстве сервера (см. <xref remap="4" linkend="warm-standby"/>).

source: restore_command = 'pg_standby <replaceable>archiveDir</replaceable> %f %p %r'
ru: restore_command = 'pg_standby <replaceable>каталог_архива</replaceable> %f %p %r'

source: To configure a standby server to use <application>pg_standby</application>, put this into its <filename>recovery.conf</filename> configuration file: <placeholder-1/> where <replaceable>archiveDir</replaceable> is the directory from which WAL segment files should be restored.
ru: Чтобы настроить резервный сервер на использование <application>pg_standby</application>, поместите эту строку в файл конфигурации <filename>recovery.conf</filename>: <placeholder-1/> Здесь <replaceable>каталог_архива</replaceable> — каталог, из которого должны восстанавливаться сегменты WAL.

source: If <replaceable>restartwalfile</replaceable> is specified, normally by using the <literal>%r</literal> macro, then all WAL files logically preceding this file will be removed from <replaceable>archivelocation</replaceable>. This minimizes the number of files that need to be retained, while preserving crash-restart capability. Use of this parameter is appropriate if the <replaceable>archivelocation</replaceable> is a transient staging area for this particular standby server, but <emphasis>not</emphasis> when the <replaceable>archivelocation</replaceable> is intended as a long-term WAL archive area.
ru: Если указывается <replaceable>файл_перезапуска_wal</replaceable>, обычно с помощью макроса <literal>%r</literal>, тогда все файлы WAL, предшествующие указанному, будут удалены из каталога <replaceable>расположение_архива</replaceable>. Это позволяет сократить число сохраняемых файлов без потери возможности восстановления при перезапуске. Такой вариант использования уместен, когда <replaceable>расположение_архива</replaceable> указывает на область рабочих файлов конкретного резервного сервера, но <emphasis>не</emphasis> когда <replaceable>расположение_архива</replaceable> — каталог с архивом WAL для долговременного хранения.

source: <application>pg_standby</application> assumes that <replaceable>archivelocation</replaceable> is a directory readable by the server-owning user. If <replaceable>restartwalfile</replaceable> (or <literal>-k</literal>) is specified, the <replaceable>archivelocation</replaceable> directory must be writable too.
ru: <application>pg_standby</application> рассчитывает на то, что <replaceable>расположение_архива</replaceable> доступно для чтения пользователю, владеющему серверным процессом. Если указывается <replaceable>файл_перезапуска_wal</replaceable> (или <literal>-k</literal>), каталог <replaceable>расположение_архива</replaceable> должен быть также доступен для записи.

source: Smart Failover
ru: Умное переключение

source: In smart failover, the server is brought up after applying all WAL files available in the archive. This results in zero data loss, even if the standby server has fallen behind, but if there is a lot of unapplied WAL it can be a long time before the standby server becomes ready. To trigger a smart failover, create a trigger file containing the word <literal>smart</literal>, or just create it and leave it empty.
ru: При умном переключении сервер включается в работу, применив изменения из всех файлов WAL, имеющихся в архиве. В результате никакие данные не теряются, даже если данный резервный сервер отстал, но если применить нужно большое количество изменений WAL, подготовка к работе может быть длительной. Чтобы вызвать умное переключение, создайте файл-триггер, содержащий слово <literal>smart</literal>, либо просто пустой файл.

source: Fast Failover
ru: Быстрое переключение

source: In fast failover, the server is brought up immediately. Any WAL files in the archive that have not yet been applied will be ignored, and all transactions in those files are lost. To trigger a fast failover, create a trigger file and write the word <literal>fast</literal> into it. <application>pg_standby</application> can also be configured to execute a fast failover automatically if no new WAL file appears within a defined interval.
ru: При быстром переключении сервер включается в работу немедленно. Все ещё не применённые файлы WAL в архиве будут игнорироваться и все транзакции в этих файлах будут потеряны. Чтобы вызвать быстрое переключение, создайте фай-триггер и запишите в него слово <literal>fast</literal>. Программу <application>pg_standby</application> можно также настроить так, чтобы быстрое переключение происходило автоматически, если за определённое время не появляется новый файл WAL.

source: There are two ways to fail over to a <quote>warm standby</quote> database server when the master server fails: <placeholder-1/>
ru: При отказе ведущего сервера переключение на сервер <quote>тёплого резерва</quote> возможно двумя способами: <placeholder-1/>

source: Options
ru: Параметры

source: Use <literal>cp</literal> or <literal>copy</literal> command to restore WAL files from archive. This is the only supported behavior so this option is useless.
ru: Применять для восстановления файлов WAL из архива команду <literal>cp</literal> или <literal>copy</literal>. На данный момент поддерживается только это поведение, так что этот параметр бесполезен.

source: Print lots of debug logging output on <filename>stderr</filename>.
ru: Выводить подробные отладочные сообщения в <filename>stderr</filename>.

source: Remove files from <replaceable>archivelocation</replaceable> so that no more than this many WAL files before the current one are kept in the archive. Zero (the default) means not to remove any files from <replaceable>archivelocation</replaceable>. This parameter will be silently ignored if <replaceable>restartwalfile</replaceable> is specified, since that specification method is more accurate in determining the correct archive cut-off point. Use of this parameter is <emphasis>deprecated</emphasis> as of <productname>PostgreSQL</productname> 8.3; it is safer and more efficient to specify a <replaceable>restartwalfile</replaceable> parameter. A too small setting could result in removal of files that are still needed for a restart of the standby server, while a too large setting wastes archive space.
ru: Удалить файлы из каталога <replaceable>расположение_архива</replaceable>, чтобы в нём осталось не больше заданного числа файлов WAL, предшествующих текущему. Ноль (по умолчанию) означает, что не нужно удалять никакие файлы из каталога <replaceable>расположение_архива</replaceable>. Этот параметр будет просто игнорироваться, если указан <replaceable>файл_перезапуска_wal</replaceable>, так как этот метод более точно определяет правильную точку отсечения архива. Этот параметр считается <emphasis>устаревшим</emphasis> с <productname>PostgreSQL</productname> 8.3; надёжнее и эффективнее использовать параметр <replaceable>файл_перезапуска_wal</replaceable>. При слишком маленьком значении данного параметра могут быть удалены файлы, требующиеся для перезапуска резервного сервера, тогда как при слишком большом будет неэффективно расходоваться место в архиве.

source: maxretries
ru: макс_повторов

source: Set the maximum number of times to retry the copy command if it fails (default 3). After each failure, we wait for <replaceable>sleeptime</replaceable> * <replaceable>num_retries</replaceable> so that the wait time increases progressively. So by default, we will wait 5 secs, 10 secs, then 15 secs before reporting the failure back to the standby server. This will be interpreted as end of recovery and the standby will come up fully as a result.
ru: Устанавливает, сколько раз максимум нужно повторять команду copy в случае ошибки (по умолчанию 3). После каждой ошибки программа приостанавливается на <replaceable>время_задержки</replaceable> * <replaceable>число_повторов</replaceable>, так что время ожидания постепенно увеличивается. По умолчанию она ждёт 5, 10, затем 15 секунд, и только потом сообщает резервному серверу об ошибке. Это событие будет воспринято как завершение восстановления, и в результате резервный сервер полностью включится в работу.

source: sleeptime
ru: время_задержки

source: Set the number of seconds (up to 60, default 5) to sleep between tests to see if the WAL file to be restored is available in the archive yet. The default setting is not necessarily recommended; consult <xref linkend="warm-standby"/> for discussion.
ru: Задаёт количество секунд (до 60, по умолчанию 5) для паузы между проверками наличия файла WAL в архиве. Значение по умолчанию не обязательно наилучшее; за подробностями обратитесь к <xref remap="3" linkend="warm-standby"/>.

source: triggerfile
ru: файл_триггер

source: Specify a trigger file whose presence should cause failover. It is recommended that you use a structured file name to avoid confusion as to which server is being triggered when multiple servers exist on the same system; for example <filename>/tmp/pgsql.trigger.5432</filename>.
ru: Указывает файл-триггер, при появлении которого должна начаться отработка отказа. Имя этого файла рекомендуется выбирать по определённой схеме, позволяющей однозначно понять, для какого сервера вызывается отработка отказа, когда таких серверов в одной системе несколько; например, <filename>/tmp/pgsql.trigger.5432</filename>.

source: Print the <application>pg_standby</application> version and exit.
ru: Вывести версию <application>pg_standby</application> и завершиться.

source: maxwaittime
ru: макс_время_ожидания

source: Set the maximum number of seconds to wait for the next WAL file, after which a fast failover will be performed. A setting of zero (the default) means wait forever. The default setting is not necessarily recommended; consult <xref linkend="warm-standby"/> for discussion.
ru: Задаёт максимальное время ожидания (в секундах) следующего файла WAL, по истечении которого будет произведено быстрое переключение. При нуле (значении по умолчанию) ожидание бесконечно. Значение по умолчанию не обязательно наилучшее; за подробностями обратитесь к <xref remap="3" linkend="warm-standby"/>.

source: Show help about <application>pg_standby</application> command line arguments, and exit.
ru: Вывести справку об аргументах командной строки <application>pg_standby</application> и завершиться.

source: <application>pg_standby</application> accepts the following command-line arguments: <placeholder-1/>
ru: <application>pg_standby</application> принимает следующие аргументы командной строки: <placeholder-1/>

source: Notes
ru: Замечания

source: <application>pg_standby</application> is designed to work with <productname>PostgreSQL</productname> 8.2 and later.
ru: Программа <application>pg_standby</application> предназначена для работы с <productname>PostgreSQL</productname> 8.2 и новее.

source: <productname>PostgreSQL</productname> 8.3 provides the <literal>%r</literal> macro, which is designed to let <application>pg_standby</application> know the last file it needs to keep. With <productname>PostgreSQL</productname> 8.2, the <literal>-k</literal> option must be used if archive cleanup is required. This option remains available in 8.3, but its use is deprecated.
ru: С <productname>PostgreSQL</productname>, начиная с 8.3, можно использовать макрос <literal>%r</literal>, который позволяет <application>pg_standby</application> узнать, какой последний файл нужно сохранять. Для <productname>PostgreSQL</productname> 8.2, если требуется очищать архив, нужно применять параметр <literal>-k</literal>. Этот параметр сохранился и после 8.3, но теперь он считается устаревшим.

source: <productname>PostgreSQL</productname> 8.4 provides the <varname>recovery_end_command</varname> option. Without this option a leftover trigger file can be hazardous.
ru: <productname>PostgreSQL</productname>, начиная с 8.4, поддерживает параметр <varname>recovery_end_command</varname>. В нём можно задать команду, удаляющую файл-триггер во избежание ошибок.

source: <application>pg_standby</application> is written in C and has an easy-to-modify source code, with specifically designated sections to modify for your own needs
ru: Программа <application>pg_standby</application> написана на C; её исходный код легко поддаётся модификации (он содержит секции, предназначенные для изменения при надобности)

source: Examples
ru: Примеры

source: produce debugging output in <filename>standby.log</filename>
ru: выводить отладочную информацию в <filename>standby.log</filename>

source: sleep for 2 seconds between checks for next WAL file availability
ru: ждать 2 секунды между проверками появления следующего файла WAL

source: stop waiting only when a trigger file called <filename>/tmp/pgsql.trigger.5442</filename> appears, and perform failover according to its content
ru: прекращать ожидание, только когда появляется файл-триггер с именем <filename>/tmp/pgsql.trigger.5442</filename>, и выполнить переключение согласно его содержимому

source: remove the trigger file when recovery ends
ru: удалять файл-триггер по завершении восстановления

source: remove no-longer-needed files from the archive directory
ru: удалять ставшие ненужными файлы из каталога архива

source: On Linux or Unix systems, you might use: <placeholder-1/> where the archive directory is physically located on the standby server, so that the <varname>archive_command</varname> is accessing it across NFS, but the files are local to the standby (enabling use of <literal>ln</literal>). This will: <placeholder-2/>
ru: В системах Linux или Unix можно использовать команды: <placeholder-1/> Предполагается, что каталог архива физически располагается на резервном сервере, так что команда <varname>archive_command</varname> обращается к нему по NFS, но для резервного сервера эти файлы локальные (для этого применяется <literal>ln</literal>). Эти команды будут: <placeholder-2/>

source: use the <literal>copy</literal> command to restore WAL files from archive
ru: применять команду <literal>copy</literal> для восстановления файлов WAL из архива

source: sleep for 5 seconds between checks for next WAL file availability
ru: ждать 5 секунд между проверками появления следующего файла WAL

source: stop waiting only when a trigger file called <filename>C:\pgsql.trigger.5442</filename> appears, and perform failover according to its content
ru: прекращать ожидание, только когда появляется файл-триггер с именем <filename>C:\pgsql.trigger.5442</filename>, и выполнить переключение согласно его содержимому

source: On Windows, you might use: <placeholder-1/> Note that backslashes need to be doubled in the <varname>archive_command</varname>, but <emphasis>not</emphasis> in the <varname>restore_command</varname> or <varname>recovery_end_command</varname>. This will: <placeholder-2/>
ru: В Windows можно использовать такие команды: <placeholder-1/> Заметьте, что обратную косую черту нужно дублировать в <varname>archive_command</varname>, но <emphasis>не</emphasis> в <varname>restore_command</varname> или <varname>recovery_end_command</varname>. Эти команды будут: <placeholder-2/>

source: The <literal>copy</literal> command on Windows sets the final file size before the file is completely copied, which would ordinarily confuse <application>pg_standby</application>. Therefore <application>pg_standby</application> waits <literal>sleeptime</literal> seconds once it sees the proper file size. GNUWin32's <literal>cp</literal> sets the file size only after the file copy is complete.
ru: Команда <literal>copy</literal> в Windows устанавливает окончательный размер файла до того, как файл будет окончательно скопирован, что обычно сбивает с толку <application>pg_standby</application>. Поэтому <application>pg_standby</application> ждёт <literal>время_задержки</literal> после того, как увидит подходящий размер файла. Команда <literal>cp</literal> из GNUWin32 устанавливает размер файла, только когда завершает копирование.

source: Since the Windows example uses <literal>copy</literal> at both ends, either or both servers might be accessing the archive directory across the network.
ru: Так как в примере для Windows с обеих сторон применяется <literal>copy</literal>, любой или оба этих сервера могут обращаться к каталогу архива по сети.

source: Author
ru: Автор

source: Simon Riggs <email>simon@2ndquadrant.com</email>
ru: Саймон Риггс <email>simon@2ndquadrant.com</email>

source: See Also
ru: См. также
