Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plperl.po
Languages: ru

source: Perl cannot support multiple interpreters within one process unless it was built with the appropriate flags, namely either <literal>usemultiplicity</literal> or <literal>useithreads</literal>. (<literal>usemultiplicity</literal> is preferred unless you actually need to use threads. For more details, see the <citerefentry><refentrytitle>perlembed</refentrytitle></citerefentry> man page.) If <application>PL/Perl</application> is used with a copy of Perl that was not built this way, then it is only possible to have one Perl interpreter per session, and so any one session can only execute either <application>PL/PerlU</application> functions, or <application>PL/Perl</application> functions that are all called by the same SQL role.
ru: Perl поддерживает работу нескольких интерпретаторов в одном процессе, только если он был собран с нужными флагами, а именно, с флагом <literal>usemultiplicity</literal> или с флагом <literal>useithreads</literal>. (В отсутствие веских причин использовать потоки предпочтительным является вариант <literal>usemultiplicity</literal>. Дополнительную информацию вы можете получить на странице man <citerefentry><refentrytitle>perlembed</refentrytitle></citerefentry>.) При использовании <application>PL/Perl</application> с версией Perl, собранной без этих флагов, в рамках сеанса можно будет запустить только один интерпретатор Perl, так что в сеансе будет возможно выполнять либо функции <application>PL/PerlU</application>, либо функции <application>PL/Perl</application> (и вызывать их должна одна роль SQL).

source: PL/Perl Triggers
ru: Триггеры на PL/Perl

source: <literal>NEW</literal> value of column <literal>foo</literal>
ru: Новое значение столбца <literal>foo</literal>

source: <literal>OLD</literal> value of column <literal>foo</literal>
ru: Старое значение столбца <literal>foo</literal>

source: Name of the trigger being called
ru: Имя вызываемого триггера

source: Trigger event: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, <literal>TRUNCATE</literal>, or <literal>UNKNOWN</literal>
ru: Событие триггера: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, <literal>TRUNCATE</literal> или <literal>UNKNOWN</literal>

source: When the trigger was called: <literal>BEFORE</literal>, <literal>AFTER</literal>, <literal>INSTEAD OF</literal>, or <literal>UNKNOWN</literal>
ru: Когда вызывается триггер: <literal>BEFORE</literal> (ДО), <literal>AFTER</literal> (ПОСЛЕ), <literal>INSTEAD OF</literal> (ВМЕСТО) или <literal>UNKNOWN</literal> (НЕИЗВЕСТНО)

source: The trigger level: <literal>ROW</literal>, <literal>STATEMENT</literal>, or <literal>UNKNOWN</literal>
ru: Уровень триггера: <literal>ROW</literal> (СТРОКА), <literal>STATEMENT</literal> (ОПЕРАТОР) или <literal>UNKNOWN</literal> (НЕИЗВЕСТНЫЙ)

source: OID of the table on which the trigger fired
ru: OID таблицы, для которой сработал триггер

source: Name of the table on which the trigger fired
ru: Имя таблицы, для которой сработал триггер

source: Name of the table on which the trigger fired. This has been deprecated, and could be removed in a future release. Please use $_TD-&gt;{table_name} instead.
ru: Имя таблицы, для которой сработал триггер. Это обращение устарело и может быть ликвидировано в будущем выпуске. Используйте вместо него $_TD-&gt;{table_name}.

source: Name of the schema in which the table on which the trigger fired, is
ru: Имя схемы, содержащей таблицу, для которой сработал триггер

source: Number of arguments of the trigger function
ru: Число аргументов в триггерной функции

source: Arguments of the trigger function. Does not exist if <literal>$_TD-&gt;{argc}</literal> is 0.
ru: Аргументы триггерной функции. Не определено, если <literal>$_TD-&gt;{argc}</literal> равно 0.

source: PL/Perl can be used to write trigger functions. In a trigger function, the hash reference <varname>$_TD</varname> contains information about the current trigger event. <varname>$_TD</varname> is a global variable, which gets a separate local value for each invocation of the trigger. The fields of the <varname>$_TD</varname> hash reference are: <placeholder-1/>
ru: PL/Perl можно использовать для написания триггерных функций. В триггерной функции хеш-массив <varname>$_TD</varname> содержит информацию о произошедшем событии триггера. <varname>$_TD</varname> — глобальная переменная, которая получает нужное локальное значение при каждом вызове триггера. Хеш-массив <varname>$_TD</varname> содержит следующие поля: <placeholder-1/>

source: Execute the operation
ru: Выполнить операцию

source: Don't execute the operation
ru: Не выполнять операцию

source: Indicates that the <literal>NEW</literal> row was modified by the trigger function
ru: Указывает, что строка <literal>NEW</literal> была изменена триггерной функцией

source: Row-level triggers can return one of the following: <placeholder-1/>
ru: В триггерах уровня строки возможны следующие варианты возврата: <placeholder-1/>

source: CREATE TABLE test ( i int, v varchar ); CREATE OR REPLACE FUNCTION valid_id() RETURNS trigger AS $$ if (($_TD-&gt;{new}{i} &gt;= 100) || ($_TD-&gt;{new}{i} &lt;= 0)) { return "SKIP"; # skip INSERT/UPDATE command } elsif ($_TD-&gt;{new}{v} ne "immortal") { $_TD-&gt;{new}{v} .= "(modified by trigger)"; return "MODIFY"; # modify row and execute INSERT/UPDATE command } else { return; # execute INSERT/UPDATE command } $$ LANGUAGE plperl; CREATE TRIGGER test_valid_id_trig BEFORE INSERT OR UPDATE ON test FOR EACH ROW EXECUTE PROCEDURE valid_id();
ru: CREATE TABLE test ( i int, v varchar ); CREATE OR REPLACE FUNCTION valid_id() RETURNS trigger AS $$ if (($_TD-&gt;{new}{i} &gt;= 100) || ($_TD-&gt;{new}{i} &lt;= 0)) { return "SKIP"; # пропустить команду INSERT/UPDATE } elsif ($_TD-&gt;{new}{v} ne "immortal") { $_TD-&gt;{new}{v} .= "(modified by trigger)"; return "MODIFY"; # изменить строку и выполнить команду INSERT/UPDATE } else { return; # выполнить команду INSERT/UPDATE } $$ LANGUAGE plperl; CREATE TRIGGER test_valid_id_trig BEFORE INSERT OR UPDATE ON test FOR EACH ROW EXECUTE PROCEDURE valid_id();

source: Here is an example of a trigger function, illustrating some of the above: <placeholder-1/>
ru: Следующий пример триггерной функции иллюстрирует описанные выше варианты: <placeholder-1/>

source: PL/Perl Event Triggers
ru: Событийные триггеры на PL/Perl

source: The name of the event the trigger is fired for.
ru: Имя события, при котором срабатывает этот триггер.

source: The command tag for which the trigger is fired.
ru: Тег команды, для которой срабатывает этот триггер.

source: PL/Perl can be used to write event trigger functions. In an event trigger function, the hash reference <varname>$_TD</varname> contains information about the current trigger event. <varname>$_TD</varname> is a global variable, which gets a separate local value for each invocation of the trigger. The fields of the <varname>$_TD</varname> hash reference are: <placeholder-1/>
ru: PL/Perl можно использовать для написания функций событийных триггеров. В функции событийного триггера хеш-массив <varname>$_TD</varname> содержит информацию о произошедшем событии триггера. <varname>$_TD</varname> — глобальная переменная, которая получает нужное локальное значение при каждом вызове триггера. Хеш-массив <varname>$_TD</varname> содержит следующие поля: <placeholder-1/>

source: The return value of the trigger procedure is ignored.
ru: Возвращаемое значение триггерной процедуры игнорируется.

source: Here is an example of an event trigger function, illustrating some of the above: <placeholder-1/>
ru: Следующий пример функции событийного триггера иллюстрирует описанное выше: <placeholder-1/>

source: PL/Perl Under the Hood
ru: Внутренние особенности PL/Perl

source: Configuration
ru: Конфигурирование

source: This section lists configuration parameters that affect <application>PL/Perl</application>.
ru: В этом разделе описываются параметры конфигурации, влияющие на работу <application>PL/Perl</application>.

source: <primary><varname>plperl.on_init</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>plperl.on_init</varname></primary>

source: Specifies Perl code to be executed when a Perl interpreter is first initialized, before it is specialized for use by <literal>plperl</literal> or <literal>plperlu</literal>. The SPI functions are not available when this code is executed. If the code fails with an error it will abort the initialization of the interpreter and propagate out to the calling query, causing the current transaction or subtransaction to be aborted.
ru: Задаёт код Perl, который будет выполняться при первой инициализации интерпретатора Perl, до того, как он получает специализацию <literal>plperl</literal> или <literal>plperlu</literal>. Когда этот код выполняется, функции SPI ещё не доступны. Если выполнение кода завершается ошибкой, инициализация интерпретатора прерывается и ошибка распространяется в вызывающий запрос, в результате чего текущая транзакция или подтранзакция прерывается.

source: The Perl code is limited to a single string. Longer code can be placed into a module and loaded by the <literal>on_init</literal> string. Examples: <placeholder-1/>
ru: Размер этого кода ограничивается одной строкой. Более объёмный код можно поместить в модуль и загрузить этот модуль в строке <literal>on_init</literal>. Например: <placeholder-1/>

source: Any modules loaded by <literal>plperl.on_init</literal>, either directly or indirectly, will be available for use by <literal>plperl</literal>. This may create a security risk. To see what modules have been loaded you can use: <placeholder-1/>
ru: Любые модули, загруженные в <literal>plperl.on_init</literal>, явно или неявно, будут доступны для использования в коде на языке <literal>plperl</literal>. Это может создать угрозу безопасности. Чтобы определить, какие модули были загружены, можно выполнить: <placeholder-1/>

source: Initialization will happen in the postmaster if the plperl library is included in <xref linkend="guc-shared-preload-libraries"/>, in which case extra consideration should be given to the risk of destabilizing the postmaster. The principal reason for making use of this feature is that Perl modules loaded by <literal>plperl.on_init</literal> need be loaded only at postmaster start, and will be instantly available without loading overhead in individual database sessions. However, keep in mind that the overhead is avoided only for the first Perl interpreter used by a database session &mdash; either PL/PerlU, or PL/Perl for the first SQL role that calls a PL/Perl function. Any additional Perl interpreters created in a database session will have to execute <literal>plperl.on_init</literal> afresh. Also, on Windows there will be no savings whatsoever from preloading, since the Perl interpreter created in the postmaster process does not propagate to child processes.
ru: Если библиотека plperl включена в <xref linkend="guc-shared-preload-libraries"/>, инициализация произойдёт в главном процессе (postmaster) и в этом случае необходимо очень серьёзно оценить риск нарушения работоспособности этого процесса. Основной смысл использовать эту возможность в том, чтобы модули Perl, подключаемые в <literal>plperl.on_init</literal>, загружались только при запуске главного процесса, и это исключало бы издержки загрузки для отдельных сеансов. Однако, имейте в виду, что эти издержки исключаются только при загрузке в сеансе первого интерпретатора Perl &mdash; будь то PL/PerlU или PL/Perl для первой SQL-роли, вызывающей функцию на PL/Perl. Любые дополнительные интерпретаторы Perl, создаваемые в сеансе базы данных, должны будут выполнять <literal>plperl.on_init</literal> заново. Также учтите, что в Windows предварительная загрузка не даёт никакого выигрыша, так как интерпретатор Perl, созданный в главном процессе, не передаётся дочерним процессам.

source: This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>plperl.on_plperl_init</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>plperl.on_plperl_init</varname></primary>

source: <primary><varname>plperl.on_plperlu_init</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>plperl.on_plperlu_init</varname></primary>

source: These parameters specify Perl code to be executed when a Perl interpreter is specialized for <literal>plperl</literal> or <literal>plperlu</literal> respectively. This will happen when a PL/Perl or PL/PerlU function is first executed in a database session, or when an additional interpreter has to be created because the other language is called or a PL/Perl function is called by a new SQL role. This follows any initialization done by <literal>plperl.on_init</literal>. The SPI functions are not available when this code is executed. The Perl code in <literal>plperl.on_plperl_init</literal> is executed after <quote>locking down</quote> the interpreter, and thus it can only perform trusted operations.
ru: В этих параметрах задаётся код Perl, который будет выполняться в момент, когда интерпретатор Perl получает специализацию <literal>plperl</literal> или <literal>plperlu</literal>, соответственно. Это произойдёт, когда в рамках сеанса будет первый раз вызвана функция на PL/Perl или PL/PerlU, либо когда потребуется дополнительный интерпретатор при использовании другого языка или при вызове функции PL/Perl новой SQL-ролью. Этот код выполняется после инициализации, произведённой в <literal>plperl.on_init</literal>. Однако функции SPI в момент исполнения этого кода ещё не доступны. Код в <literal>plperl.on_plperl_init</literal> запускается после того, как интерпретатор <quote>помещается под замок</quote>, так что в нём разрешаются только доверенные операции.

source: If the code fails with an error it will abort the initialization and propagate out to the calling query, causing the current transaction or subtransaction to be aborted. Any actions already done within Perl won't be undone; however, that interpreter won't be used again. If the language is used again the initialization will be attempted again within a fresh Perl interpreter.
ru: Если этот код завершается ошибкой, инициализация прерывается и ошибка распространяется в вызывающий запрос, что приводит к прерыванию текущей транзакции или подтранзакции. При этом любые действия, уже произведённые в Perl, не будут отменены; однако использоваться этот интерпретатор больше не будет. При следующей попытке использовать этот язык система попытается заново инициализировать свежий интерпретатор Perl.

source: Only superusers can change these settings. Although these settings can be changed within a session, such changes will not affect Perl interpreters that have already been used to execute functions.
ru: Изменять эти параметры разрешено только суперпользователям. Хотя изменить их можно в рамках сеанса, такие изменения не повлияют на работу интерпретаторов Perl, задействованных для выполнения функций ранее.

source: <primary><varname>plperl.use_strict</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>plperl.use_strict</varname></primary>

source: When set true subsequent compilations of PL/Perl functions will have the <literal>strict</literal> pragma enabled. This parameter does not affect functions already compiled in the current session.
ru: При значении, равном true, последующая компиляция функций PL/Perl будет выполняться с включённым указанием <literal>strict</literal>. Этот параметр не влияет на функции, уже скомпилированные в текущем сеансе.

source: Limitations and Missing Features
ru: Ограничения и недостающие возможности

source: PL/Perl functions cannot call each other directly.
ru: Функции на PL/Perl не могут напрямую вызывать друг друга.

source: SPI is not yet fully implemented.
ru: SPI ещё не полностью реализован.

source: If you are fetching very large data sets using <literal>spi_exec_query</literal>, you should be aware that these will all go into memory. You can avoid this by using <literal>spi_query</literal>/<literal>spi_fetchrow</literal> as illustrated earlier.
ru: Если вы выбираете очень большие наборы данных, используя <literal>spi_exec_query</literal>, вы должны понимать, что все эти данные загружаются в память. Вы можете избежать этого, используя пару функций <literal>spi_query</literal>/<literal>spi_fetchrow</literal>, как показано ранее.

source: A similar problem occurs if a set-returning function passes a large set of rows back to PostgreSQL via <literal>return</literal>. You can avoid this problem too by instead using <literal>return_next</literal> for each row returned, as shown previously.
ru: Похожая проблема возникает, если функция, возвращающая множество, передаёт в PostgreSQL большое число строк, выполняя <literal>return</literal>. Этой проблемы так же можно избежать, выполняя для каждой возвращаемой строки <literal>return_next</literal>, как показано ранее.

source: When a session ends normally, not due to a fatal error, any <literal>END</literal> blocks that have been defined are executed. Currently no other actions are performed. Specifically, file handles are not automatically flushed and objects are not automatically destroyed.
ru: Когда сеанс завершается штатно, не по причине критической ошибки, в Perl выполняются все блоки <literal>END</literal>, которые были определены. Никакие другие действия в настоящее время не выполняются. В частности, буферы файлов автоматически не сбрасываются и объекты автоматически не уничтожаются.

source: The following features are currently missing from PL/Perl, but they would make welcome contributions. <placeholder-1/>
ru: Следующие возможности в настоящее время в PL/Perl отсутствуют, но их реализация будет желанной доработкой. <placeholder-1/>
