Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plperl.po
Languages: ru

source: Normally, <function>spi_fetchrow</function> should be repeated until it returns <literal>undef</literal>, indicating that there are no more rows to read. The cursor returned by <literal>spi_query</literal> is automatically freed when <function>spi_fetchrow</function> returns <literal>undef</literal>. If you do not wish to read all the rows, instead call <function>spi_cursor_close</function> to free the cursor. Failure to do so will result in memory leaks.
ru: Обычно вызов <function>spi_fetchrow</function> нужно повторять, пока не будет получен результат <literal>undef</literal>, показывающий, что все строки уже прочитаны. Курсор, возвращаемый функцией <literal>spi_query</literal>, автоматически освобождается, когда <function>spi_fetchrow</function> возвращает <literal>undef</literal>. Если вы не хотите читать все строки, освободите курсор, выполнив <function>spi_cursor_close</function>, чтобы не допустить утечки памяти.

source: argument types
ru: типы аргументов

source: <primary>spi_prepare</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_prepare</primary><secondary>в PL/Perl</secondary>

source: plan
ru: план

source: arguments
ru: аргументы

source: <primary>spi_query_prepared</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_query_prepared</primary><secondary>в PL/Perl</secondary>

source: attributes
ru: атрибуты

source: <primary>spi_exec_prepared</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_exec_prepared</primary><secondary>в PL/Perl</secondary>

source: <primary>spi_freeplan</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_freeplan</primary><secondary>в PL/Perl</secondary>

source: <literal>spi_prepare</literal>, <literal>spi_query_prepared</literal>, <literal>spi_exec_prepared</literal>, and <literal>spi_freeplan</literal> implement the same functionality but for prepared queries. <literal>spi_prepare</literal> accepts a query string with numbered argument placeholders ($1, $2, etc) and a string list of argument types: <placeholder-1/> Once a query plan is prepared by a call to <literal>spi_prepare</literal>, the plan can be used instead of the string query, either in <literal>spi_exec_prepared</literal>, where the result is the same as returned by <literal>spi_exec_query</literal>, or in <literal>spi_query_prepared</literal> which returns a cursor exactly as <literal>spi_query</literal> does, which can be later passed to <literal>spi_fetchrow</literal>. The optional second parameter to <literal>spi_exec_prepared</literal> is a hash reference of attributes; the only attribute currently supported is <literal>limit</literal>, which sets the maximum number of rows returned by a query.
ru: Функции <literal>spi_prepare</literal>, <literal>spi_query_prepared</literal>, <literal>spi_exec_prepared</literal> и <literal>spi_freeplan</literal> реализуют ту же функциональность, но для подготовленных запросов. Функция <literal>spi_prepare</literal> принимает строку запроса с нумерованными местозаполнителями аргументов ($1, $2 и т. д.) и список строк с типами аргументов: <placeholder-1/> План запроса, подготовленный вызовом <literal>spi_prepare</literal>, можно использовать вместо строки запроса либо в <literal>spi_exec_prepared</literal>, возвращающей тот же результат, что и <literal>spi_exec_query</literal>, либо в <literal>spi_query_prepared</literal>, возвращающей курсор так же, как <literal>spi_query</literal>, который затем можно передать в <literal>spi_fetchrow</literal>. В необязательном втором параметре <literal>spi_exec_prepared</literal> можно передать хеш с атрибутами; в настоящее время поддерживается только атрибут <literal>limit</literal>, задающий максимальное число строк, которое может вернуть запрос.

source: The advantage of prepared queries is that is it possible to use one prepared plan for more than one query execution. After the plan is not needed anymore, it can be freed with <literal>spi_freeplan</literal>: <placeholder-1/> Note that the parameter subscript in <literal>spi_prepare</literal> is defined via $1, $2, $3, etc, so avoid declaring query strings in double quotes that might easily lead to hard-to-catch bugs.
ru: Подготовленные запросы хороши тем, что позволяют использовать единожды подготовленный план для неоднократного выполнения запроса. Когда план оказывается не нужен, его можно освободить, вызвав <literal>spi_freeplan</literal>: <placeholder-1/> Заметьте, что параметры для <literal>spi_prepare</literal> обозначаются как $1, $2, $3 и т. д., так что по возможности не записывайте строки запросов в двойных кавычках, чтобы не спровоцировать трудноуловимые ошибки.

source: Another example illustrates usage of an optional parameter in <literal>spi_exec_prepared</literal>: <placeholder-1/>
ru: Ещё один пример, иллюстрирующий использование необязательного параметра <literal>spi_exec_prepared</literal>: <placeholder-1/>

source: Utility Functions in PL/Perl
ru: Вспомогательные функции в PL/Perl

source: level
ru: уровень

source: msg
ru: сообщение

source: <primary>elog</primary><secondary>in PL/Perl</secondary>
ru: <primary>elog</primary><secondary>в PL/Perl</secondary>

source: Emit a log or error message. Possible levels are <literal>DEBUG</literal>, <literal>LOG</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, and <literal>ERROR</literal>. <literal>ERROR</literal> raises an error condition; if this is not trapped by the surrounding Perl code, the error propagates out to the calling query, causing the current transaction or subtransaction to be aborted. This is effectively the same as the Perl <literal>die</literal> command. The other levels only generate messages of different priority levels. Whether messages of a particular priority are reported to the client, written to the server log, or both is controlled by the <xref linkend="guc-log-min-messages"/> and <xref linkend="guc-client-min-messages"/> configuration variables. See <xref linkend="runtime-config"/> for more information.
ru: Выдаёт служебное сообщение или сообщение об ошибке. Возможные уровни сообщений: <literal>DEBUG</literal> (ОТЛАДКА), <literal>LOG</literal> (СООБЩЕНИЕ), <literal>INFO</literal> (ИНФОРМАЦИЯ), <literal>NOTICE</literal> (ЗАМЕЧАНИЕ), <literal>WARNING</literal> (ПРЕДУПРЕЖДЕНИЕ) и <literal>ERROR</literal> (ОШИБКА). С уровнем <literal>ERROR</literal> выдаётся ошибка; если она не перехватывается окружающим кодом Perl, она распространяется в вызывающий запрос, что приводит к прерыванию текущей транзакции или подтранзакции. По сути то же самое делает команда <literal>die</literal> языка Perl. При использовании других уровней происходит просто вывод сообщения с заданным уровнем важности. Будут ли сообщения определённого уровня передаваться клиенту и/или записываться в журнал, определяется конфигурационными параметрами <xref linkend="guc-log-min-messages"/> и <xref linkend="guc-client-min-messages"/>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="runtime-config"/>.

source: string
ru: строка

source: <primary>quote_literal</primary><secondary>in PL/Perl</secondary>
ru: <primary>quote_literal</primary><secondary>в PL/Perl</secondary>

source: Return the given string suitably quoted to be used as a string literal in an SQL statement string. Embedded single-quotes and backslashes are properly doubled. Note that <function>quote_literal</function> returns undef on undef input; if the argument might be undef, <function>quote_nullable</function> is often more suitable.
ru: Оформляет переданную строку для использования в качестве текстовой строки в SQL-операторе. Включённые в неё апострофы и обратная косая черта при этом дублируются. Заметьте, что <function>quote_literal</function> возвращает undef, когда получает аргумент undef; если такие аргументы возможны, часто лучше использовать <function>quote_nullable</function>.

source: <primary>quote_nullable</primary><secondary>in PL/Perl</secondary>
ru: <primary>quote_nullable</primary><secondary>в PL/Perl</secondary>

source: Return the given string suitably quoted to be used as a string literal in an SQL statement string; or, if the argument is undef, return the unquoted string "NULL". Embedded single-quotes and backslashes are properly doubled.
ru: Оформляет переданную строку для использования в качестве текстовой строки в SQL-операторе; либо, если поступает аргумент undef, возвращает строку "NULL" (без кавычек). Символы апостроф и обратная косая черта дублируются должным образом.

source: <primary>quote_ident</primary><secondary>in PL/Perl</secondary>
ru: <primary>quote_ident</primary><secondary>в PL/Perl</secondary>

source: Return the given string suitably quoted to be used as an identifier in an SQL statement string. Quotes are added only if necessary (i.e., if the string contains non-identifier characters or would be case-folded). Embedded quotes are properly doubled.
ru: Оформляет переданную строку для использования в качестве идентификатора в SQL-операторе. При необходимости идентификатор заключается в кавычки (например, если он содержит символы, недопустимые в открытом виде, или буквы в разном регистре). Если переданная строка содержит кавычки, они дублируются.

source: <primary>decode_bytea</primary><secondary>in PL/Perl</secondary>
ru: <primary>decode_bytea</primary><secondary>в PL/Perl</secondary>

source: Return the unescaped binary data represented by the contents of the given string, which should be <type>bytea</type> encoded.
ru: Возвращает неформатированные двоичные данные, представленные содержимым заданной строки, которая должна быть закодирована как <type>bytea</type>.

source: <primary>encode_bytea</primary><secondary>in PL/Perl</secondary>
ru: <primary>encode_bytea</primary><secondary>в PL/Perl</secondary>

source: Return the <type>bytea</type> encoded form of the binary data contents of the given string.
ru: Возвращает закодированные в виде <type>bytea</type> двоичные данные, содержащиеся в переданной строке.

source: array
ru: массив

source: <primary>encode_array_literal</primary><secondary>in PL/Perl</secondary>
ru: <primary>encode_array_literal</primary><secondary>в PL/Perl</secondary>

source: delimiter
ru: разделитель

source: Returns the contents of the referenced array as a string in array literal format (see <xref linkend="arrays-input"/>). Returns the argument value unaltered if it's not a reference to an array. The delimiter used between elements of the array literal defaults to "<literal>, </literal>" if a delimiter is not specified or is undef.
ru: Возвращает содержимое указанного массива в виде строки в формате массива (см. <xref remap="4" linkend="arrays-input"/>). Возвращает значение аргумента неизменённым, если это не ссылка не массив. Разделитель элементов в строке массива по умолчанию — "<literal>, </literal>" (если разделитель не определён или undef).

source: value
ru: значение

source: typename
ru: имя_типа

source: <primary>encode_typed_literal</primary><secondary>in PL/Perl</secondary>
ru: <primary>encode_typed_literal</primary><secondary>в PL/Perl</secondary>

source: Converts a Perl variable to the value of the data type passed as a second argument and returns a string representation of this value. Correctly handles nested arrays and values of composite types.
ru: Преобразует переменную Perl в значение типа данных, указанного во втором аргументе, и возвращает строковое представление этого значения. Корректно обрабатывает вложенные массивы и значения составных типов.

source: <primary>encode_array_constructor</primary><secondary>in PL/Perl</secondary>
ru: <primary>encode_array_constructor</primary><secondary>в PL/Perl</secondary>

source: Returns the contents of the referenced array as a string in array constructor format (see <xref linkend="sql-syntax-array-constructors"/>). Individual values are quoted using <function>quote_nullable</function>. Returns the argument value, quoted using <function>quote_nullable</function>, if it's not a reference to an array.
ru: Возвращает содержимое переданного массива в виде строки в формате конструктора массива (см. <xref remap="4" linkend="sql-syntax-array-constructors"/>). Отдельные значения заключаются в кавычки функцией <function>quote_nullable</function>. Возвращает значение аргумента, заключённое в кавычки функцией <function>quote_nullable</function>, если аргумент — не ссылка на массив.

source: <primary>looks_like_number</primary><secondary>in PL/Perl</secondary>
ru: <primary>looks_like_number</primary><secondary>в PL/Perl</secondary>

source: Returns a true value if the content of the given string looks like a number, according to Perl, returns false otherwise. Returns undef if the argument is undef. Leading and trailing space is ignored. <literal>Inf</literal> and <literal>Infinity</literal> are regarded as numbers.
ru: Возвращает значение true, если содержимое переданной строки похоже на число, по правилам Perl, и false в обратном случае. Возвращает undef для аргумента undef. Ведущие и замыкающие пробелы игнорируются. Строки <literal>Inf</literal> и <literal>Infinity</literal> считаются представляющими число (бесконечность).

source: argument
ru: аргумент

source: <primary>is_array_ref</primary><secondary>in PL/Perl</secondary>
ru: <primary>is_array_ref</primary><secondary>в PL/Perl</secondary>

source: Returns a true value if the given argument may be treated as an array reference, that is, if ref of the argument is <literal>ARRAY</literal> or <literal>PostgreSQL::InServer::ARRAY</literal>. Returns false otherwise.
ru: Возвращает значение true, если переданный аргумент можно воспринять как ссылку на массив, то есть это ссылка на <literal>ARRAY</literal> или <literal>PostgreSQL::InServer::ARRAY</literal>. В противном случае возвращает false.

source: Global Values in PL/Perl
ru: Глобальные значения в PL/Perl

source: You can use the global hash <varname>%_SHARED</varname> to store data, including code references, between function calls for the lifetime of the current session.
ru: Вы можете использовать для хранения данных, включая ссылки на код, глобальный хеш <varname>%_SHARED</varname>. Эти данные будут сохраняться между вызовами функции на протяжении всего текущего сеанса.

source: Here is a simple example for shared data: <placeholder-1/>
ru: Простой пример работы с разделяемыми данными: <placeholder-1/>

source: CREATE OR REPLACE FUNCTION myfuncs() RETURNS void AS $$ $_SHARED{myquote} = sub { my $arg = shift; $arg =~ s/(['\\])/\\$1/g; return "'$arg'"; }; $$ LANGUAGE plperl; SELECT myfuncs(); /* initializes the function */ /* Set up a function that uses the quote function */ CREATE OR REPLACE FUNCTION use_quote(TEXT) RETURNS text AS $$ my $text_to_quote = shift; my $qfunc = $_SHARED{myquote}; return &amp;$qfunc($text_to_quote); $$ LANGUAGE plperl;
ru: CREATE OR REPLACE FUNCTION myfuncs() RETURNS void AS $$ $_SHARED{myquote} = sub { my $arg = shift; $arg =~ s/(['\\])/\\$1/g; return "'$arg'"; }; $$ LANGUAGE plperl; SELECT myfuncs(); /* инициализация функции */ /* Определение функции, использующей функцию заключения в кавычки */ CREATE OR REPLACE FUNCTION use_quote(TEXT) RETURNS text AS $$ my $text_to_quote = shift; my $qfunc = $_SHARED{myquote}; return &amp;$qfunc($text_to_quote); $$ LANGUAGE plperl;

source: Here is a slightly more complicated example using a code reference: <placeholder-1/> (You could have replaced the above with the one-liner <literal>return $_SHARED{myquote}-&gt;($_[0]);</literal> at the expense of readability.)
ru: Это чуть более сложный пример, в котором используется ссылка на код: <placeholder-1/> (Код выше можно было бы упростить до однострочной команды <literal>return $_SHARED{myquote}-&gt;($_[0]);</literal> в ущерб читаемости.)

source: For security reasons, PL/Perl executes functions called by any one SQL role in a separate Perl interpreter for that role. This prevents accidental or malicious interference by one user with the behavior of another user's PL/Perl functions. Each such interpreter has its own value of the <varname>%_SHARED</varname> variable and other global state. Thus, two PL/Perl functions will share the same value of <varname>%_SHARED</varname> if and only if they are executed by the same SQL role. In an application wherein a single session executes code under multiple SQL roles (via <literal>SECURITY DEFINER</literal> functions, use of <command>SET ROLE</command>, etc) you may need to take explicit steps to ensure that PL/Perl functions can share data via <varname>%_SHARED</varname>. To do that, make sure that functions that should communicate are owned by the same user, and mark them <literal>SECURITY DEFINER</literal>. You must of course take care that such functions can't be used to do anything unintended.
ru: По соображениям безопасности, PL/Perl выполняет функции, вызываемые некоторой ролью SQL, в отдельном интерпретаторе Perl, выделенном для этой роли. Это предотвращает случайное или злонамеренное влияние одного пользователя на поведение функций PL/Perl другого пользователя. В каждом интерпретаторе будет своё значение переменной <varname>%_SHARED</varname> и собственное глобальное состояние. Таким образом, две функции PL/Perl будут разделять одно значение <varname>%_SHARED</varname>, только если они выполняются одной ролью SQL. В приложении, выполняющем код в одном сеансе с разными ролями SQL (вызывающем функции <literal>SECURITY DEFINER</literal>, использующем команду <command>SET ROLE</command> и т. д.) может понадобиться явно предпринять дополнительные меры, чтобы функции на PL/Perl могли разделять данные через <varname>%_SHARED</varname>. Для этого сначала установите для функций, которые должны взаимодействовать, одного владельца, а затем задайте для них свойство <literal>SECURITY DEFINER</literal>. Разумеется, при этом нужно позаботиться о том, чтобы эти функции не могли сделать ничего непредусмотренного.

source: Trusted and Untrusted PL/Perl
ru: Доверенный и недоверенный PL/Perl

source: <primary>trusted</primary><secondary>PL/Perl</secondary>
ru: <primary>доверенный</primary><secondary>PL/Perl</secondary>

source: Normally, PL/Perl is installed as a <quote>trusted</quote> programming language named <literal>plperl</literal>. In this setup, certain Perl operations are disabled to preserve security. In general, the operations that are restricted are those that interact with the environment. This includes file handle operations, <literal>require</literal>, and <literal>use</literal> (for external modules). There is no way to access internals of the database server process or to gain OS-level access with the permissions of the server process, as a C function can do. Thus, any unprivileged database user can be permitted to use this language.
ru: Обычно PL/Perl устанавливается в базу данных как <quote>доверенный</quote> язык программирования с именем <literal>plperl</literal>. При этом в целях безопасности определённые операции в Perl запрещаются. Вообще говоря, запрещаются все операции, взаимодействующие с окружением. В том числе, это операции с файлами, <literal>require</literal> и <literal>use</literal> (для внешних модулей). Поэтому функции на PL/Perl, в отличие от функций на C, никаким образом не могут взаимодействовать с внутренними механизмами сервера баз данных или обращаться к операционной системе с правами серверного процесса. Вследствие этого, использовать этот язык можно разрешить любому непривилегированному пользователю баз данных.

source: Here is an example of a function that will not work because file system operations are not allowed for security reasons: <placeholder-1/> The creation of this function will fail as its use of a forbidden operation will be caught by the validator.
ru: В следующем примере показана функция, которая не будет работать, потому что операции с файловой системы запрещены по соображениям безопасности: <placeholder-1/> Создать эту функцию не удастся, так как при проверке её правильности будет обнаружено использование запрещённого оператора.

source: Sometimes it is desirable to write Perl functions that are not restricted. For example, one might want a Perl function that sends mail. To handle these cases, PL/Perl can also be installed as an <quote>untrusted</quote> language (usually called <application>PL/PerlU</application><placeholder-1/>). In this case the full Perl language is available. When installing the language, the language name <literal>plperlu</literal> will select the untrusted PL/Perl variant.
ru: Иногда возникает желание написать на Perl код, функциональность которого не будет ограничиваться. Например, может потребоваться функция на Perl, которая будет посылать почту. Для таких потребностей PL/Perl также можно установить как <quote>недоверенный</quote> язык (обычно его называют <application>PL/PerlU</application><placeholder-1/>). В этом случае будут доступны все возможности языка Perl. Устанавливая язык, укажите имя <literal>plperlu</literal>, чтобы выбрать недоверенную вариацию PL/Perl.

source: The writer of a <application>PL/PerlU</application> function must take care that the function cannot be used to do anything unwanted, since it will be able to do anything that could be done by a user logged in as the database administrator. Note that the database system allows only database superusers to create functions in untrusted languages.
ru: Автор функции на <application>PL/PerlU</application> должен позаботиться о том, чтобы эту функцию нельзя было использовать не по назначению, так как она может делать всё, что может пользователь с правами администратора баз данных. Заметьте, что СУБД позволяет создавать функции на недоверенных языках только суперпользователям базы данных.

source: If the above function was created by a superuser using the language <literal>plperlu</literal>, execution would succeed.
ru: Если показанная выше функция будет создана суперпользователем, и при этом будет выбран язык <literal>plperlu</literal>, она выполнится успешно.

source: In the same way, anonymous code blocks written in Perl can use restricted operations if the language is specified as <literal>plperlu</literal> rather than <literal>plperl</literal>, but the caller must be a superuser.
ru: Таким же образом, в анонимном блоке кода на Perl разрешены абсолютно любые операции, если в качестве языка вместо <literal>plperl</literal> выбирается <literal>plperlu</literal>, но выполнять этот код должен суперпользователь.

source: While <application>PL/Perl</application> functions run in a separate Perl interpreter for each SQL role, all <application>PL/PerlU</application> functions executed in a given session run in a single Perl interpreter (which is not any of the ones used for <application>PL/Perl</application> functions). This allows <application>PL/PerlU</application> functions to share data freely, but no communication can occur between <application>PL/Perl</application> and <application>PL/PerlU</application> functions.
ru: Тогда как функции на <application>PL/Perl</application> исполняются отдельными интерпретаторами Perl для каждой роли SQL, все функции на <application>PL/PerlU</application>, вызываемые в рамках сеанса, исполняются в одном интерпретаторе Perl (отличном от тех, что исполняют функции <application>PL/Perl</application>). Благодаря этому, функции <application>PL/PerlU</application> могут свободно разделять общие данные, но между функциями <application>PL/Perl</application> и <application>PL/PerlU</application> взаимодействие невозможно.
