Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plperl.po
Languages: ru

source: PL/Perl - Perl Procedural Language
ru: PL/Perl — процедурный язык Perl

source: PL/Perl is a loadable procedural language that enables you to write <productname>PostgreSQL</productname> functions in the <ulink url="http://www.perl.org">Perl programming language</ulink>.
ru: PL/Perl — это загружаемый процедурный язык, позволяющий реализовывать функции <productname>PostgreSQL</productname> на <ulink url="http://www.perl.org">языке программирования Perl</ulink>.

source: The main advantage to using PL/Perl is that this allows use, within stored functions, of the manyfold <quote>string munging</quote> operators and functions available for Perl. Parsing complex strings might be easier using Perl than it is with the string functions and control structures provided in PL/pgSQL.
ru: Основным преимуществом PL/Perl является то, что он позволяет применять в сохранённых функциях множество функций и операторов <quote>перемалывания строк</quote>, имеющихся в Perl. Разобрать сложные строки на языке Perl может быть гораздо проще, чем используя строковые функции и управляющие структуры в PL/pgSQL.

source: To install PL/Perl in a particular database, use <literal>CREATE EXTENSION plperl</literal>, or from the shell command line use <literal>createlang plperl <replaceable>dbname</replaceable></literal>.
ru: Чтобы установить PL/Perl в определённую базу данных, выполните команду <literal>CREATE EXTENSION plperl</literal>, либо запустите в оболочке системы <literal>createlang plperl <replaceable>имя_базы</replaceable></literal>.

source: If a language is installed into <literal>template1</literal>, all subsequently created databases will have the language installed automatically.
ru: Если язык устанавливается в <literal>template1</literal>, он будет автоматически установлен во все создаваемые впоследствии базы данных.

source: Users of source packages must specially enable the build of PL/Perl during the installation process. (Refer to <xref linkend="installation"/> for more information.) Users of binary packages might find PL/Perl in a separate subpackage.
ru: Пользователи, имеющие дело с исходным кодом, должны явно включить сборку PL/Perl в процессе установки. (За дополнительными сведениями обратитесь к <xref remap="3" linkend="installation"/>.) Пользователи двоичных пакетов могут найти PL/Perl в отдельном модуле.

source: PL/Perl Functions and Arguments
ru: Функции на PL/Perl и их аргументы

source: CREATE FUNCTION <replaceable>funcname</replaceable> (<replaceable>argument-types</replaceable>) RETURNS <replaceable>return-type</replaceable> AS $$ # PL/Perl function body $$ LANGUAGE plperl;
ru: CREATE FUNCTION <replaceable>имя_функции</replaceable> (<replaceable>типы-аргументов</replaceable>) RETURNS <replaceable>тип-результата</replaceable> AS $$ # Тело функции на PL/Perl $$ LANGUAGE plperl;

source: To create a function in the PL/Perl language, use the standard <xref linkend="sql-createfunction"/> syntax: <placeholder-1/> The body of the function is ordinary Perl code. In fact, the PL/Perl glue code wraps it inside a Perl subroutine. A PL/Perl function is called in a scalar context, so it can't return a list. You can return non-scalar values (arrays, records, and sets) by returning a reference, as discussed below.
ru: Чтобы создать функцию на языке PL/Perl, используйте стандартный синтаксис <xref linkend="sql-createfunction"/>: <placeholder-1/> Тело функции содержит обычный код Perl. Фактически, код обвязки PL/Perl помещает этот код в подпрограмму Perl. Функция PL/Perl вызывается в скалярном контексте, так что она не может вернуть список. Не скалярные значения (массивы, записи и множества) можно вернуть по ссылке, как описывается ниже.

source: DO $$ # PL/Perl code $$ LANGUAGE plperl;
ru: DO $$ # Код PL/Perl $$ LANGUAGE plperl;

source: PL/Perl also supports anonymous code blocks called with the <xref linkend="sql-do"/> statement: <placeholder-1/> An anonymous code block receives no arguments, and whatever value it might return is discarded. Otherwise it behaves just like a function.
ru: PL/Perl также поддерживает анонимные блоки кода, которые выполняются оператором <xref linkend="sql-do"/>: <placeholder-1/> Анонимный блок кода не принимает аргументы, а любое значение, которое он мог бы вернуть, отбрасывается. В остальном он работает подобно коду функции.

source: The use of named nested subroutines is dangerous in Perl, especially if they refer to lexical variables in the enclosing scope. Because a PL/Perl function is wrapped in a subroutine, any named subroutine you place inside one will be nested. In general, it is far safer to create anonymous subroutines which you call via a coderef. For more information, see the entries for <literal>Variable "%s" will not stay shared</literal> and <literal>Variable "%s" is not available</literal> in the <citerefentry><refentrytitle>perldiag</refentrytitle></citerefentry> man page, or search the Internet for <quote>perl nested named subroutine</quote>.
ru: Использовать вложенные именованные подпрограммы в Perl опасно, особенно если они обращаются к лексическим переменным в окружающей области. Так как функция PL/Perl оборачивается в подпрограмму, любая именованная функция внутри неё будет вложенной. Вообще гораздо безопаснее создавать анонимные подпрограммы и вызывать их по ссылке на код. Дополнительную информацию вы можете получить на странице руководства man <citerefentry><refentrytitle>perldiag</refentrytitle></citerefentry>, в описании ошибок <literal>Variable "%s" will not stay shared</literal> (Переменная "%s" не останется разделяемой) и <literal>Variable "%s" is not available</literal> (Переменная "%s" недоступна), либо найти в Интернете по ключевым словам <quote>perl nested named subroutine</quote> (perl вложенная именованная подпрограмма).

source: The syntax of the <command>CREATE FUNCTION</command> command requires the function body to be written as a string constant. It is usually most convenient to use dollar quoting (see <xref linkend="sql-syntax-dollar-quoting"/>) for the string constant. If you choose to use escape string syntax <literal>E''</literal>, you must double any single quote marks (<literal>'</literal>) and backslashes (<literal>\</literal>) used in the body of the function (see <xref linkend="sql-syntax-strings"/>).
ru: Синтаксис команды <command>CREATE FUNCTION</command> требует, чтобы тело функции было записано как строковая константа. Обычно для этого удобнее всего заключать строковую константу в доллары (см. <xref remap="4" linkend="sql-syntax-dollar-quoting"/>). Если вы решите применять синтаксис спецпоследовательностей <literal>E''</literal>, вам придётся дублировать апострофы (<literal>'</literal>) и обратную косую черту (<literal>\</literal>) в теле функции (см. <xref remap="4" linkend="sql-syntax-strings"/>).

source: Arguments and results are handled as in any other Perl subroutine: arguments are passed in <varname>@_</varname>, and a result value is returned with <literal>return</literal> or as the last expression evaluated in the function.
ru: Аргументы и результат обрабатываются как и в любой другой подпрограмме на Perl: аргументы передаются в <varname>@_</varname>, а результирующим значением будет указанное в <literal>return</literal> или полученное в последнем выражении, вычисленном в функции.

source: For example, a function returning the greater of two integer values could be defined as: <placeholder-1/>
ru: Например, функцию, возвращающую большее из двух целых чисел, можно определить так: <placeholder-1/>

source: Arguments will be converted from the database's encoding to UTF-8 for use inside PL/Perl, and then converted from UTF-8 back to the database encoding upon return.
ru: Аргументы будут преобразованы из кодировки базы данных в UTF-8 для использования в PL/Perl, а при выходе снова будут преобразованы из UTF-8 в кодировку базы данных.

source: <primary>null value</primary><secondary sortas="PL/Perl">in PL/Perl</secondary>
ru: <primary>NULL-значение</primary><secondary sortas="PL/Perl">в PL/Perl</secondary>

source: If an SQL null value<placeholder-1/> is passed to a function, the argument value will appear as <quote>undefined</quote> in Perl. The above function definition will not behave very nicely with null inputs (in fact, it will act as though they are zeroes). We could add <literal>STRICT</literal> to the function definition to make <productname>PostgreSQL</productname> do something more reasonable: if a null value is passed, the function will not be called at all, but will just return a null result automatically. Alternatively, we could check for undefined inputs in the function body. For example, suppose that we wanted <function>perl_max</function> with one null and one nonnull argument to return the nonnull argument, rather than a null value: <placeholder-2/> As shown above, to return an SQL null value from a PL/Perl function, return an undefined value. This can be done whether the function is strict or not.
ru: Если функции передаётся NULL-значение SQL<placeholder-1/>, значением аргумента в Perl станет <quote>undefined</quote>. Показанное выше определение функции будет не очень хорошо обрабатывать значения NULL (в действительности они будут восприняты как нули). Мы могли бы добавить указание <literal>STRICT</literal> в это определение, чтобы <productname>PostgreSQL</productname> поступал немного разумнее: при передаче значения NULL функция вовсе не будет вызываться, будет сразу возвращён результат NULL. С другой стороны, мы могли бы проверить значения undefined в теле функции. Например, предположим, что нам нужна функция <function>perl_max</function>, которая с одним аргументом NULL и вторым аргументом не NULL должна возвращать не NULL, а второй аргумент: <placeholder-2/> Как показано выше, чтобы выдать значение SQL NULL, нужно вернуть значение undefined. Это можно сделать и в строгой, и в нестрогой функции.

source: Anything in a function argument that is not a reference is a string, which is in the standard <productname>PostgreSQL</productname> external text representation for the relevant data type. In the case of ordinary numeric or text types, Perl will just do the right thing and the programmer will normally not have to worry about it. However, in other cases the argument will need to be converted into a form that is more usable in Perl. For example, the <function>decode_bytea</function> function can be used to convert an argument of type <type>bytea</type> into unescaped binary.
ru: Всё в аргументах функции, что не является ссылкой, является строкой, то есть стандартным для <productname>PostgreSQL</productname> внешним текстовым представлением соответствующего типа данных. В случае с обычными числовыми или текстовыми типами, Perl просто воспринимает их должным образом, и программист, как правило, может об этом не думать. Однако в более сложных случаях может потребоваться преобразовать аргумент в форму, подходящую для использования в Perl. Например, для преобразования типа <type>bytea</type> в двоичное значение можно использовать функцию <function>decode_bytea</function>.

source: Similarly, values passed back to <productname>PostgreSQL</productname> must be in the external text representation format. For example, the <function>encode_bytea</function> function can be used to escape binary data for a return value of type <type>bytea</type>.
ru: Аналогично, значения, передаваемые в <productname>PostgreSQL</productname>, должны быть в формате внешнего текстового представления. Например, для подготовки двоичных данных к возврату в значении <type>bytea</type> можно воспользоваться функцией <function>encode_bytea</function>.

source: Perl can return <productname>PostgreSQL</productname> arrays as references to Perl arrays. Here is an example: <placeholder-1/>
ru: Perl может возвращать массивы <productname>PostgreSQL</productname> как ссылки на массивы Perl. Например, так: <placeholder-1/>

source: CREATE OR REPLACE FUNCTION concat_array_elements(text[]) RETURNS TEXT AS $$ my $arg = shift; my $result = ""; return undef if (!defined $arg); # as an array reference for (@$arg) { $result .= $_; } # also works as a string $result .= $arg; return $result; $$ LANGUAGE plperl; SELECT concat_array_elements(ARRAY['PL','/','Perl']);
ru: CREATE OR REPLACE FUNCTION concat_array_elements(text[]) RETURNS TEXT AS $$ my $arg = shift; my $result = ""; return undef if (!defined $arg); # в качестве ссылки на массив for (@$arg) { $result .= $_; } # также работает со строкой $result .= $arg; return $result; $$ LANGUAGE plperl; SELECT concat_array_elements(ARRAY['PL','/','Perl']);

source: Multidimensional arrays are represented as references to lower-dimensional arrays of references in a way common to every Perl programmer.
ru: Многомерные массивы представляются как ссылки на массивы меньшей размерности со ссылками — этот способ хорошо знаком каждому программисту на Perl.

source: Perl passes <productname>PostgreSQL</productname> arrays as a blessed <type>PostgreSQL::InServer::ARRAY</type> object. This object may be treated as an array reference or a string, allowing for backward compatibility with Perl code written for <productname>PostgreSQL</productname> versions below 9.1 to run. For example: <placeholder-1/> <placeholder-2/>
ru: Perl передаёт массивы <productname>PostgreSQL</productname> как объект, сопоставленный с <type>PostgreSQL::InServer::ARRAY</type>. С этим объектом можно работать как со ссылкой на массив или строкой, что допускает обратную совместимость с кодом Perl, написанным для <productname>PostgreSQL</productname> версии до 9.1. Например: <placeholder-1/> <placeholder-2/>

source: Composite-type arguments are passed to the function as references to hashes. The keys of the hash are the attribute names of the composite type. Here is an example: <placeholder-1/>
ru: Аргументы составного типа передаются функции как ссылки на хеши. Ключами хеша являются имена атрибутов составного типа. Например: <placeholder-1/>

source: A PL/Perl function can return a composite-type result using the same approach: return a reference to a hash that has the required attributes. For example: <placeholder-1/> Any columns in the declared result data type that are not present in the hash will be returned as null values.
ru: Функция на PL/Perl может вернуть результат составного типа, применяя тот же подход: возвратить ссылку на хеш с требуемыми атрибутами. Например, так: <placeholder-1/> Столбцы объявленного типа результата, отсутствующие в хеше, будут возвращены как значения NULL.

source: PL/Perl functions can also return sets of either scalar or composite types. Usually you'll want to return rows one at a time, both to speed up startup time and to keep from queuing up the entire result set in memory. You can do this with <function>return_next</function> as illustrated below. Note that after the last <function>return_next</function>, you must put either <literal>return</literal> or (better) <literal>return undef</literal>. <placeholder-1/> For small result sets, you can return a reference to an array that contains either scalars, references to arrays, or references to hashes for simple types, array types, and composite types, respectively. Here are some simple examples of returning the entire result set as an array reference: <placeholder-2/>
ru: Функции на PL/Perl могут также возвращать множества со скалярными или составными типами. Обычно желательно возвращать результат по одной строке, чтобы сократить время подготовки с одной стороны, и чтобы не потребовалось накапливать весь набор данных в памяти, с другой. Это можно реализовать с помощью функции <function>return_next</function>, как показано ниже. Заметьте, что после последнего вызова <function>return_next</function>, нужно поместить <literal>return</literal> или (что лучше) <literal>return undef</literal>. <placeholder-1/> Для небольших наборов данных можно также вернуть ссылку на массив, содержащий скаляры, ссылки на массивы, либо ссылки на хеши для простых типов, типов массивов и составных типов, соответственно. Ниже приведена пара простых примеров, показывающих, как возвратить весь набор данных в виде ссылки на массив: <placeholder-2/>

source: If you wish to use the <literal>strict</literal> pragma with your code you have a few options. For temporary global use you can <command>SET</command> <literal>plperl.use_strict</literal> to true. This will affect subsequent compilations of <application>PL/Perl</application> functions, but not functions already compiled in the current session. For permanent global use you can set <literal>plperl.use_strict</literal> to true in the <filename>postgresql.conf</filename> file.
ru: Если вы хотите использовать в своём коде <literal>strict</literal>, у вас есть несколько вариантов. Для временного глобального использования вы можете задать для <literal>plperl.use_strict</literal> значение true командой <command>SET</command>. Это повлияет на компилируемые впоследствии функции <application>PL/Perl</application>, но не на функции, уже скомпилированные в текущем сеансе. Для постоянного глобального использования вы можете присвоить параметру <literal>plperl.use_strict</literal> значение true в файле <filename>postgresql.conf</filename>.

source: For permanent use in specific functions you can simply put: <placeholder-1/> at the top of the function body.
ru: Для постоянного использования strict в опредёлённых функциях вы можете просто написать: <placeholder-1/> в начале тела этих функций.

source: The <literal>feature</literal> pragma is also available to <function>use</function> if your Perl is version 5.10.0 or higher.
ru: Вы также можете использовать указания <literal>feature</literal> в <function>use</function>, если используете Perl версии 5.10.0 или новее.

source: Data Values in PL/Perl
ru: Значения в PL/Perl

source: The argument values supplied to a PL/Perl function's code are simply the input arguments converted to text form (just as if they had been displayed by a <command>SELECT</command> statement). Conversely, the <function>return</function> and <function>return_next</function> commands will accept any string that is acceptable input format for the function's declared return type.
ru: Значения аргументов, передаваемые в код функции PL/Perl, представляют собой просто входные аргументы, преобразованные в текстовый вид (так же, как при выводе оператором <command>SELECT</command>). И наоборот, команды <function>return</function> и <function>return_next</function> могут принять любую строку, соответствующую формату ввода для объявленного типа результата функции.

source: Built-in Functions
ru: Встроенные функции

source: Database Access from PL/Perl
ru: Обращение к базе данных из PL/Perl

source: Access to the database itself from your Perl function can be done via the following functions:
ru: Обращаться к самой базе данных из кода Perl можно, используя следующие функции:

source: query
ru: запрос

source: max-rows
ru: макс-строк

source: <primary>spi_exec_query</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_exec_query</primary><secondary>в PL/Perl</secondary>

source: <literal>spi_exec_query</literal> executes an SQL command and returns the entire row set as a reference to an array of hash references. <emphasis>You should only use this command when you know that the result set will be relatively small.</emphasis> Here is an example of a query (<command>SELECT</command> command) with the optional maximum number of rows: <placeholder-1/> This returns up to 5 rows from the table <literal>my_table</literal>. If <literal>my_table</literal> has a column <literal>my_column</literal>, you can get that value from row <literal>$i</literal> of the result like this: <placeholder-2/> The total number of rows returned from a <command>SELECT</command> query can be accessed like this: <placeholder-3/>
ru: <literal>spi_exec_query</literal> выполняет команду SQL и возвращает весь набор строк в виде ссылки на массив хешей. <emphasis>Эту функцию следует использовать, только если вы знаете, что набор будет относительно небольшим.</emphasis> Так выглядит пример запроса (<command>SELECT</command>) с дополнительно заданным максимальным числом строк: <placeholder-1/> Этот запрос возвращает не больше 5 строк из таблицы <literal>my_table</literal>. Если в <literal>my_table</literal> есть столбец <literal>my_column</literal>, получить его значение из строки <literal>$i</literal> результата можно следующим образом: <placeholder-2/> Общее число строк, возвращённых запросом <command>SELECT</command>, можно получить так: <placeholder-3/>

source: Here is an example using a different command type: <placeholder-1/> You can then access the command status (e.g., <literal>SPI_OK_INSERT</literal>) like this: <placeholder-2/> To get the number of rows affected, do: <placeholder-3/>
ru: Так можно выполнить команду другого типа: <placeholder-1/> Затем можно получить статус команды (например, <literal>SPI_OK_INSERT</literal>) следующим образом: <placeholder-2/> Чтобы получить число затронутых строк, выполните: <placeholder-3/>

source: Here is a complete example: <placeholder-1/>
ru: Полный пример: <placeholder-1/>

source: command
ru: команда

source: <primary>spi_query</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_query</primary><secondary>в PL/Perl</secondary>

source: <primary>spi_fetchrow</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_fetchrow</primary><secondary>в PL/Perl</secondary>

source: <primary>spi_cursor_close</primary><secondary>in PL/Perl</secondary>
ru: <primary>spi_cursor_close</primary><secondary>в PL/Perl</secondary>

source: CREATE TYPE foo_type AS (the_num INTEGER, the_text TEXT); CREATE OR REPLACE FUNCTION lotsa_md5 (INTEGER) RETURNS SETOF foo_type AS $$ use Digest::MD5 qw(md5_hex); my $file = '/usr/share/dict/words'; my $t = localtime; elog(NOTICE, "opening file $file at $t" ); open my $fh, '&lt;', $file # ooh, it's a file access! or elog(ERROR, "cannot open $file for reading: $!"); my @words = &lt;$fh&gt;; close $fh; $t = localtime; elog(NOTICE, "closed file $file at $t"); chomp(@words); my $row; my $sth = spi_query("SELECT * FROM generate_series(1,$_[0]) AS b(a)"); while (defined ($row = spi_fetchrow($sth))) { return_next({ the_num =&gt; $row-&gt;{a}, the_text =&gt; md5_hex($words[rand @words]) }); } return; $$ LANGUAGE plperlu; SELECT * from lotsa_md5(500);
ru: CREATE TYPE foo_type AS (the_num INTEGER, the_text TEXT); CREATE OR REPLACE FUNCTION lotsa_md5 (INTEGER) RETURNS SETOF foo_type AS $$ use Digest::MD5 qw(md5_hex); my $file = '/usr/share/dict/words'; my $t = localtime; elog(NOTICE, "opening file $file at $t" ); open my $fh, '&lt;', $file # здесь мы обращаемся к файлу! or elog(ERROR, "cannot open $file for reading: $!"); my @words = &lt;$fh&gt;; close $fh; $t = localtime; elog(NOTICE, "closed file $file at $t"); chomp(@words); my $row; my $sth = spi_query("SELECT * FROM generate_series(1,$_[0]) AS b(a)"); while (defined ($row = spi_fetchrow($sth))) { return_next({ the_num =&gt; $row-&gt;{a}, the_text =&gt; md5_hex($words[rand @words]) }); } return; $$ LANGUAGE plperlu; SELECT * from lotsa_md5(500);

source: <literal>spi_query</literal> and <literal>spi_fetchrow</literal> work together as a pair for row sets which might be large, or for cases where you wish to return rows as they arrive. <literal>spi_fetchrow</literal> works <emphasis>only</emphasis> with <literal>spi_query</literal>. The following example illustrates how you use them together: <placeholder-1/>
ru: Функции <literal>spi_query</literal> и <literal>spi_fetchrow</literal> применяются в паре, когда набор строк может быть очень большим или когда нужно возвращать строки по мере их поступления. Функция <literal>spi_fetchrow</literal> работает <emphasis>только</emphasis> с <literal>spi_query</literal>. Следующий пример показывает, как использовать их вместе: <placeholder-1/>
