Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: <literal>FOUND</literal> is a local variable within each <application>PL/pgSQL</application> function; any changes to it affect only the current function.
ru: <literal>FOUND</literal> является локальной переменной в каждой функции <application>PL/pgSQL</application> и любые её изменения, влияют только на текущую функцию.

source: Doing Nothing At All
ru: Не делать ничего

source: Sometimes a placeholder statement that does nothing is useful. For example, it can indicate that one arm of an if/then/else chain is deliberately empty. For this purpose, use the <command>NULL</command> statement: <synopsis>NULL;</synopsis>
ru: Иногда бывает полезен оператор, который не делает ничего. Например, он может показывать, что одна из ветвей if/then/else сознательно оставлена пустой. Для этих целей используется <command>NULL</command>: <synopsis>NULL;</synopsis>

source: BEGIN y := x / 0; EXCEPTION WHEN division_by_zero THEN NULL; -- ignore the error END;
ru: BEGIN y := x / 0; EXCEPTION WHEN division_by_zero THEN NULL; -- игнорируем ошибку END;

source: BEGIN y := x / 0; EXCEPTION WHEN division_by_zero THEN -- ignore the error END;
ru: BEGIN y := x / 0; EXCEPTION WHEN division_by_zero THEN -- игнорируем ошибку END;

source: For example, the following two fragments of code are equivalent: <placeholder-1/> <placeholder-2/> Which is preferable is a matter of taste.
ru: В следующем примере два фрагмента кода эквивалентны: <placeholder-1/> <placeholder-2/> Какой вариант выбрать — дело вкуса.

source: In Oracle's PL/SQL, empty statement lists are not allowed, and so <command>NULL</command> statements are <emphasis>required</emphasis> for situations such as this. <application>PL/pgSQL</application> allows you to just write nothing, instead.
ru: В Oracle PL/SQL не допускаются пустые списки операторов, поэтому <command>NULL</command> <emphasis>обязателен</emphasis> в подобных ситуациях. В <application>PL/pgSQL</application> разрешается не писать ничего.

source: Control Structures
ru: Управляющие структуры

source: Control structures are probably the most useful (and important) part of <application>PL/pgSQL</application>. With <application>PL/pgSQL</application>'s control structures, you can manipulate <productname>PostgreSQL</productname> data in a very flexible and powerful way.
ru: Управляющие структуры, вероятно, наиболее полезная и важная часть <application>PL/pgSQL</application>. С их помощью можно очень гибко и эффективно манипулировать данными <productname>PostgreSQL</productname>.

source: Returning From a Function
ru: Команды для возврата значения из функции

source: There are two commands available that allow you to return data from a function: <command>RETURN</command> and <command>RETURN NEXT</command>.
ru: Две команды позволяют вернуть данные из функции: <command>RETURN</command> и <command>RETURN NEXT</command>.

source: expression
ru: выражение

source: <command>RETURN</command> with an expression terminates the function and returns the value of <replaceable>expression</replaceable> to the caller. This form is used for <application>PL/pgSQL</application> functions that do not return a set.
ru: <command>RETURN</command> с последующим выражением прекращает выполнение функции и возвращает значение выражения в вызывающую программу. Эта форма используется для функций <application>PL/pgSQL</application>, которые не возвращают набор строк.

source: In a function that returns a scalar type, the expression's result will automatically be cast into the function's return type as described for assignments. But to return a composite (row) value, you must write an expression delivering exactly the requested column set. This may require use of explicit casting.
ru: В функции, возвращающей скалярный тип, результирующее выражение автоматически приводится к типу возвращаемого значения. Однако, чтобы вернуть составной тип (строку), возвращаемое выражение должно в точности содержать требуемый набор столбцов. При этом может потребоваться явное приведение типов.

source: If you declared the function with output parameters, write just <command>RETURN</command> with no expression. The current values of the output parameter variables will be returned.
ru: Для функции с выходными параметрами просто используйте <command>RETURN</command> без выражения. Будут возвращены текущие значения выходных параметров.

source: If you declared the function to return <type>void</type>, a <command>RETURN</command> statement can be used to exit the function early; but do not write an expression following <command>RETURN</command>.
ru: Для функции, возвращающей <type>void</type>, <command>RETURN</command> можно использовать в любом месте, но без выражения после <command>RETURN</command>.

source: The return value of a function cannot be left undefined. If control reaches the end of the top-level block of the function without hitting a <command>RETURN</command> statement, a run-time error will occur. This restriction does not apply to functions with output parameters and functions returning <type>void</type>, however. In those cases a <command>RETURN</command> statement is automatically executed if the top-level block finishes.
ru: Возвращаемое значение функции не может остаться не определённым. Если достигнут конец блока верхнего уровня, а оператор <command>RETURN</command> так и не встретился, происходит ошибка времени исполнения. Это не касается функций с выходными параметрами и функций, возвращающих <type>void</type>. Для них оператор <command>RETURN</command> выполняется автоматически по окончании блока верхнего уровня.

source: -- functions returning a scalar type RETURN 1 + 2; RETURN scalar_var; -- functions returning a composite type RETURN composite_type_var; RETURN (1, 2, 'three'::text); -- must cast columns to correct types
ru: -- Функции, возвращающие скалярный тип данных RETURN 1 + 2; RETURN scalar_var; -- Функции, возвращающие составной тип данных RETURN composite_type_var; RETURN (1, 2, 'three'::text); -- требуется приведение типов

source: Some examples: <placeholder-1/>
ru: Несколько примеров: <placeholder-1/>

source: <command>RETURN NEXT</command> and <command>RETURN QUERY</command>
ru: <command>RETURN NEXT</command> и <command>RETURN QUERY</command>

source: query
ru: запрос

source: command-string
ru: строка-команды

source: When a <application>PL/pgSQL</application> function is declared to return <literal>SETOF <replaceable>sometype</replaceable></literal>, the procedure to follow is slightly different. In that case, the individual items to return are specified by a sequence of <command>RETURN NEXT</command> or <command>RETURN QUERY</command> commands, and then a final <command>RETURN</command> command with no argument is used to indicate that the function has finished executing. <command>RETURN NEXT</command> can be used with both scalar and composite data types; with a composite result type, an entire <quote>table</quote> of results will be returned. <command>RETURN QUERY</command> appends the results of executing a query to the function's result set. <command>RETURN NEXT</command> and <command>RETURN QUERY</command> can be freely intermixed in a single set-returning function, in which case their results will be concatenated.
ru: Для функций на <application>PL/pgSQL</application>, возвращающих <literal>SETOF <replaceable>sometype</replaceable></literal>, нужно действовать несколько по-иному. Отдельные элементы возвращаемого значения формируются командами <command>RETURN NEXT</command> или <command>RETURN QUERY</command>, а финальная команда <command>RETURN</command> без аргументов завершает выполнение функции. <command>RETURN NEXT</command> используется как со скалярными, так и с составными типами данных. Для составного типа результат функции возвращается в виде таблицы. <command>RETURN QUERY</command> добавляет результат выполнения запроса к результату функции. <command>RETURN NEXT</command> и <command>RETURN QUERY</command> можно свободно смешивать в теле функции, в этом случае их результаты будут объединены.

source: <command>RETURN NEXT</command> and <command>RETURN QUERY</command> do not actually return from the function &mdash; they simply append zero or more rows to the function's result set. Execution then continues with the next statement in the <application>PL/pgSQL</application> function. As successive <command>RETURN NEXT</command> or <command>RETURN QUERY</command> commands are executed, the result set is built up. A final <command>RETURN</command>, which should have no argument, causes control to exit the function (or you can just let control reach the end of the function).
ru: <command>RETURN NEXT</command> и <command>RETURN QUERY</command> не выполняют возврат из функции. Они просто добавляют строки в результирующее множество. Затем выполнение продолжается со следующего оператора в функции. Успешное выполнение <command>RETURN NEXT</command> и <command>RETURN QUERY</command> формирует множество строк результата. Для выхода из функции используется <command>RETURN</command>, обязательно без аргументов (или можно просто дождаться окончания выполнения функции).

source: <command>RETURN QUERY</command> has a variant <command>RETURN QUERY EXECUTE</command>, which specifies the query to be executed dynamically. Parameter expressions can be inserted into the computed query string via <literal>USING</literal>, in just the same way as in the <command>EXECUTE</command> command.
ru: <command>RETURN QUERY</command> имеет разновидность <command>RETURN QUERY EXECUTE</command>, предназначенную для динамического выполнения запроса. В текст запроса можно добавить параметры, используя <literal>USING</literal>, также как и с командой <command>EXECUTE</command>.

source: If you declared the function with output parameters, write just <command>RETURN NEXT</command> with no expression. On each execution, the current values of the output parameter variable(s) will be saved for eventual return as a row of the result. Note that you must declare the function as returning <literal>SETOF record</literal> when there are multiple output parameters, or <literal>SETOF <replaceable>sometype</replaceable></literal> when there is just one output parameter of type <replaceable>sometype</replaceable>, in order to create a set-returning function with output parameters.
ru: Для функции с выходными параметрами просто используйте <command>RETURN NEXT</command> без аргументов. При каждом исполнении <command>RETURN NEXT</command> текущие значения выходных параметров сохраняются для последующего возврата в качестве строки результата. Обратите внимание, что если функция с выходными параметрами должна возвращать множество значений, то при объявлении нужно указывать <literal>RETURNS SETOF</literal>. При этом если выходных параметров несколько, то используется <literal>RETURNS SETOF record</literal>, а если только один с типом <replaceable>sometype</replaceable>, то <literal>RETURNS SETOF <replaceable>sometype</replaceable></literal>.

source: CREATE TABLE foo (fooid INT, foosubid INT, fooname TEXT); INSERT INTO foo VALUES (1, 2, 'three'); INSERT INTO foo VALUES (4, 5, 'six'); CREATE OR REPLACE FUNCTION get_all_foo() RETURNS SETOF foo AS $BODY$ DECLARE r foo%rowtype; BEGIN FOR r IN SELECT * FROM foo WHERE fooid &gt; 0 LOOP -- can do some processing here RETURN NEXT r; -- return current row of SELECT END LOOP; RETURN; END $BODY$ LANGUAGE plpgsql; SELECT * FROM get_all_foo();
ru: CREATE TABLE foo (fooid INT, foosubid INT, fooname TEXT); INSERT INTO foo VALUES (1, 2, 'three'); INSERT INTO foo VALUES (4, 5, 'six'); CREATE OR REPLACE FUNCTION get_all_foo() RETURNS SETOF foo AS $BODY$ DECLARE r foo%rowtype; BEGIN FOR r IN SELECT * FROM foo WHERE fooid &gt; 0 LOOP -- здесь возможна обработка данных RETURN NEXT r; -- добавляет текущую строку запроса к возвращаемому результату END LOOP; RETURN; END $BODY$ LANGUAGE plpgsql; SELECT * FROM get_all_foo();

source: Here is an example of a function using <command>RETURN NEXT</command>: <placeholder-1/>
ru: Пример использования <command>RETURN NEXT</command>: <placeholder-1/>

source: CREATE FUNCTION get_available_flightid(date) RETURNS SETOF integer AS $BODY$ BEGIN RETURN QUERY SELECT flightid FROM flight WHERE flightdate &gt;= $1 AND flightdate &lt; ($1 + 1); -- Since execution is not finished, we can check whether rows were returned -- and raise exception if not. IF NOT FOUND THEN RAISE EXCEPTION 'No flight at %.', $1; END IF; RETURN; END $BODY$ LANGUAGE plpgsql; -- Returns available flights or raises exception if there are no -- available flights. SELECT * FROM get_available_flightid(CURRENT_DATE);
ru: CREATE FUNCTION get_available_flightid(date) RETURNS SETOF integer AS $BODY$ BEGIN RETURN QUERY SELECT flightid FROM flight WHERE flightdate &gt;= $1 AND flightdate &lt; ($1 + 1); -- Так как выполнение ещё не закончено, можно проверить, были ли возвращены строки -- Если нет, то вызываем исключение IF NOT FOUND THEN RAISE EXCEPTION 'Нет рейсов на дату: %.', $1; END IF; RETURN; END $BODY$ LANGUAGE plpgsql; -- Возвращает доступные рейсы, либо вызывает исключение SELECT * FROM get_available_flightid(CURRENT_DATE);

source: Here is an example of a function using <command>RETURN QUERY</command>: <placeholder-1/>
ru: Пример использования <command>RETURN QUERY</command>: <placeholder-1/>

source: The current implementation of <command>RETURN NEXT</command> and <command>RETURN QUERY</command> stores the entire result set before returning from the function, as discussed above. That means that if a <application>PL/pgSQL</application> function produces a very large result set, performance might be poor: data will be written to disk to avoid memory exhaustion, but the function itself will not return until the entire result set has been generated. A future version of <application>PL/pgSQL</application> might allow users to define set-returning functions that do not have this limitation. Currently, the point at which data begins being written to disk is controlled by the <xref linkend="guc-work-mem"/> configuration variable. Administrators who have sufficient memory to store larger result sets in memory should consider increasing this parameter.
ru: В текущей реализации <command>RETURN NEXT</command> и <command>RETURN QUERY</command> результирующее множество накапливается целиком, прежде чем будет возвращено из функции. Если множество очень большое, то это может отрицательно сказаться на производительности, так как при нехватке оперативной памяти данные записываются на диск. В следующих версиях <application>PL/pgSQL</application> это ограничение будет снято. В настоящее время управлять количеством оперативной памяти в подобных случаях можно параметром конфигурации <xref linkend="guc-work-mem"/>. При наличии свободной памяти администраторы должны рассмотреть возможность увеличения значения данного параметра.

source: Conditionals
ru: Условные операторы

source: <command>IF</command> and <command>CASE</command> statements let you execute alternative commands based on certain conditions. <application>PL/pgSQL</application> has three forms of <command>IF</command>: <placeholder-1/> and two forms of <command>CASE</command>: <placeholder-2/>
ru: Операторы <command>IF</command> и <command>CASE</command> позволяют выполнять команды в зависимости от определённых условий. <application>PL/pgSQL</application> поддерживает три формы <command>IF</command>: <placeholder-1/> и две формы <command>CASE</command>: <placeholder-2/>

source: <literal>IF-THEN</literal> statements are the simplest form of <literal>IF</literal>. The statements between <literal>THEN</literal> and <literal>END IF</literal> will be executed if the condition is true. Otherwise, they are skipped.
ru: <literal>IF-THEN</literal> это простейшая форма <literal>IF</literal>. Операторы между <literal>THEN</literal> и <literal>END IF</literal> выполняются, если условие (<replaceable>boolean-expression</replaceable>) истинно. В противном случае они опускаются.

source: Example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: <literal>IF-THEN-ELSE</literal> statements add to <literal>IF-THEN</literal> by letting you specify an alternative set of statements that should be executed if the condition is not true. (Note this includes the case where the condition evaluates to NULL.)
ru: <literal>IF-THEN-ELSE</literal> добавляет к <literal>IF-THEN</literal> возможность указать альтернативный набор операторов, которые будут выполнены, если условие не истинно (в том числе, если условие NULL).

source: Examples: <placeholder-1/> <placeholder-2/>
ru: Примеры: <placeholder-1/> <placeholder-2/>

source: Sometimes there are more than just two alternatives. <literal>IF-THEN-ELSIF</literal> provides a convenient method of checking several alternatives in turn. The <literal>IF</literal> conditions are tested successively until the first one that is true is found. Then the associated statement(s) are executed, after which control passes to the next statement after <literal>END IF</literal>. (Any subsequent <literal>IF</literal> conditions are <emphasis>not</emphasis> tested.) If none of the <literal>IF</literal> conditions is true, then the <literal>ELSE</literal> block (if any) is executed.
ru: В некоторых случаях двух альтернатив недостаточно. <literal>IF-THEN-ELSIF</literal> обеспечивает удобный способ проверки нескольких вариантов по очереди. Условия в <literal>IF</literal> последовательно проверяются до тех пор, пока не будет найдено первое истинное. После этого операторы, относящиеся к этому условию, выполняются, и управление переходит к следующей после <literal>END IF</literal> команде. (Все последующие условия не проверяются.) Если ни одно из условий <literal>IF</literal> не является истинным, то выполняется блок <literal>ELSE</literal> (если присутствует).

source: IF number = 0 THEN result := 'zero'; ELSIF number &gt; 0 THEN result := 'positive'; ELSIF number &lt; 0 THEN result := 'negative'; ELSE -- hmm, the only other possibility is that number is null result := 'NULL'; END IF;
ru: IF number = 0 THEN result := 'zero'; ELSIF number &gt; 0 THEN result := 'positive'; ELSIF number &lt; 0 THEN result := 'negative'; ELSE -- раз мы здесь, значит значение number не определено (NULL) result := 'NULL'; END IF;

source: Here is an example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: The key word <literal>ELSIF</literal> can also be spelled <literal>ELSEIF</literal>.
ru: Вместо ключевого слова <literal>ELSIF</literal> можно использовать <literal>ELSEIF</literal>.

source: An alternative way of accomplishing the same task is to nest <literal>IF-THEN-ELSE</literal> statements, as in the following example: <placeholder-1/>
ru: Другой вариант сделать то же самое, это использование вложенных операторов <literal>IF-THEN-ELSE</literal>, как в следующем примере: <placeholder-1/>

source: However, this method requires writing a matching <literal>END IF</literal> for each <literal>IF</literal>, so it is much more cumbersome than using <literal>ELSIF</literal> when there are many alternatives.
ru: Однако это требует написания соответствующих <literal>END IF</literal> для каждого <literal>IF</literal>, что при наличии нескольких альтернатив делает код более громоздким, чем использование <literal>ELSIF</literal>.

source: Simple <literal>CASE</literal>
ru: Простой <literal>CASE</literal>

source: The simple form of <command>CASE</command> provides conditional execution based on equality of operands. The <replaceable>search-expression</replaceable> is evaluated (once) and successively compared to each <replaceable>expression</replaceable> in the <literal>WHEN</literal> clauses. If a match is found, then the corresponding <replaceable>statements</replaceable> are executed, and then control passes to the next statement after <literal>END CASE</literal>. (Subsequent <literal>WHEN</literal> expressions are not evaluated.) If no match is found, the <literal>ELSE</literal> <replaceable>statements</replaceable> are executed; but if <literal>ELSE</literal> is not present, then a <literal>CASE_NOT_FOUND</literal> exception is raised.
ru: Простая форма <command>CASE</command> реализует условное выполнение на основе сравнения операндов. <replaceable>search-expression</replaceable> вычисляется (один раз) и последовательно сравнивается с каждым <replaceable>expression</replaceable> в условиях <literal>WHEN</literal>. Если совпадение найдено, то выполняются соответствующие <replaceable>statements</replaceable> и управление переходит к следующей после <literal>END CASE</literal> команде. (Все последующие выражения <literal>WHEN</literal> не проверяются.) Если совпадение не было найдено, то выполняются <literal>ELSE</literal> <replaceable>statements</replaceable>. Но если <literal>ELSE</literal> нет, то вызывается исключение <literal>CASE_NOT_FOUND</literal>.

source: CASE x WHEN 1, 2 THEN msg := 'one or two'; ELSE msg := 'other value than one or two'; END CASE;
ru: CASE x WHEN 1, 2 THEN msg := 'один или два'; ELSE msg := 'значение, отличное от один или два'; END CASE;

source: Here is a simple example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: Searched <literal>CASE</literal>
ru: <literal>CASE</literal> с перебором условий

source: The searched form of <command>CASE</command> provides conditional execution based on truth of Boolean expressions. Each <literal>WHEN</literal> clause's <replaceable>boolean-expression</replaceable> is evaluated in turn, until one is found that yields <literal>true</literal>. Then the corresponding <replaceable>statements</replaceable> are executed, and then control passes to the next statement after <literal>END CASE</literal>. (Subsequent <literal>WHEN</literal> expressions are not evaluated.) If no true result is found, the <literal>ELSE</literal> <replaceable>statements</replaceable> are executed; but if <literal>ELSE</literal> is not present, then a <literal>CASE_NOT_FOUND</literal> exception is raised.
ru: Эта форма <command>CASE</command> реализует условное выполнение, основываясь на истинности логических условий. Каждое выражение <replaceable>boolean-expression</replaceable> в предложении <literal>WHEN</literal> вычисляется по порядку до тех пор, пока не будет найдено истинное. Затем выполняются соответствующие <replaceable>statements</replaceable> и управление переходит к следующей после <literal>END CASE</literal> команде. (Все последующие выражения <literal>WHEN</literal> не проверяются.) Если ни одно из условий не окажется истинным, то выполняются <literal>ELSE</literal> <replaceable>statements</replaceable>. Но если <literal>ELSE</literal> нет, то вызывается исключение <literal>CASE_NOT_FOUND</literal>.

source: CASE WHEN x BETWEEN 0 AND 10 THEN msg := 'value is between zero and ten'; WHEN x BETWEEN 11 AND 20 THEN msg := 'value is between eleven and twenty'; END CASE;
ru: CASE WHEN x BETWEEN 0 AND 10 THEN msg := 'значение в диапазоне между 0 и 10'; WHEN x BETWEEN 11 AND 20 THEN msg := 'значение в диапазоне между 11 и 20'; END CASE;

source: This form of <command>CASE</command> is entirely equivalent to <literal>IF-THEN-ELSIF</literal>, except for the rule that reaching an omitted <literal>ELSE</literal> clause results in an error rather than doing nothing.
ru: Эта форма <command>CASE</command> полностью эквивалента <literal>IF-THEN-ELSIF</literal>, за исключением того, что при невыполнении всех условий и отсутствии <literal>ELSE</literal>, <literal>IF-THEN-ELSIF</literal> ничего не делает, а <command>CASE</command> вызывает ошибку.

source: Simple Loops
ru: Простые циклы
