Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: If no error occurs, this form of block simply executes all the <replaceable>statements</replaceable>, and then control passes to the next statement after <literal>END</literal>. But if an error occurs within the <replaceable>statements</replaceable>, further processing of the <replaceable>statements</replaceable> is abandoned, and control passes to the <literal>EXCEPTION</literal> list. The list is searched for the first <replaceable>condition</replaceable> matching the error that occurred. If a match is found, the corresponding <replaceable>handler_statements</replaceable> are executed, and then control passes to the next statement after <literal>END</literal>. If no match is found, the error propagates out as though the <literal>EXCEPTION</literal> clause were not there at all: the error can be caught by an enclosing block with <literal>EXCEPTION</literal>, or if there is none it aborts processing of the function.
ru: Если ошибок не было, то выполняются все <replaceable>операторы</replaceable> блока и управление переходит к следующему оператору после <literal>END</literal>. Но если при выполнении <replaceable>оператора</replaceable> происходит ошибка, то дальнейшая обработка прекращается и управление переходит к списку исключений в секции <literal>EXCEPTION</literal>. В этом списке ищется первое исключение, условие которого соответствует ошибке. Если исключение найдено, то выполняются соответствующие <replaceable>операторы_обработчика</replaceable> и управление переходит к следующему оператору после <literal>END</literal>. Если исключение не найдено, то ошибка передаётся наружу, как будто секции <literal>EXCEPTION</literal> не было. При этом ошибку можно перехватить в секции <literal>EXCEPTION</literal> внешнего блока. Если ошибка так и не была перехвачена, то обработка функции прекращается.

source: The <replaceable>condition</replaceable> names can be any of those shown in <xref linkend="errcodes-appendix"/>. A category name matches any error within its category. The special condition name <literal>OTHERS</literal> matches every error type except <literal>QUERY_CANCELED</literal> and <literal>ASSERT_FAILURE</literal>. (It is possible, but often unwise, to trap those two error types by name.) Condition names are not case-sensitive. Also, an error condition can be specified by <literal>SQLSTATE</literal> code; for example these are equivalent: <placeholder-1/>
ru: В качестве <replaceable>условия</replaceable> может задаваться одно из имён, перечисленных в <xref remap="6" linkend="errcodes-appendix"/>. Если задаётся имя категории, ему соответствуют все ошибки в данной категории. Специальному имени условия <literal>OTHERS</literal> (другие) соответствуют все типы ошибок, кроме <literal>QUERY_CANCELED</literal> и <literal>ASSERT_FAILURE</literal>. (И эти два типа ошибок можно перехватить по имени, но часто это неразумно.) Имена условий воспринимаются без учёта регистра. Условие ошибки также можно задать кодом <literal>SQLSTATE</literal>; например, эти два варианта равнозначны: <placeholder-1/>

source: If a new error occurs within the selected <replaceable>handler_statements</replaceable>, it cannot be caught by this <literal>EXCEPTION</literal> clause, but is propagated out. A surrounding <literal>EXCEPTION</literal> clause could catch it.
ru: Если при выполнении <replaceable>handler_statements</replaceable> возникнет новая ошибка, то она не может быть перехвачена в этой секции <literal>EXCEPTION</literal>. Ошибка передаётся наружу и её можно перехватить в секции <literal>EXCEPTION</literal> внешнего блока.

source: INSERT INTO mytab(firstname, lastname) VALUES('Tom', 'Jones'); BEGIN UPDATE mytab SET firstname = 'Joe' WHERE lastname = 'Jones'; x := x + 1; y := x / 0; EXCEPTION WHEN division_by_zero THEN RAISE NOTICE 'caught division_by_zero'; RETURN x; END;
ru: INSERT INTO mytab(firstname, lastname) VALUES('Tom', 'Jones'); BEGIN UPDATE mytab SET firstname = 'Joe' WHERE lastname = 'Jones'; x := x + 1; y := x / 0; EXCEPTION WHEN division_by_zero THEN RAISE NOTICE 'перехватили ошибку division_by_zero'; RETURN x; END;

source: When an error is caught by an <literal>EXCEPTION</literal> clause, the local variables of the <application>PL/pgSQL</application> function remain as they were when the error occurred, but all changes to persistent database state within the block are rolled back. As an example, consider this fragment: <placeholder-1/> When control reaches the assignment to <literal>y</literal>, it will fail with a <literal>division_by_zero</literal> error. This will be caught by the <literal>EXCEPTION</literal> clause. The value returned in the <command>RETURN</command> statement will be the incremented value of <literal>x</literal>, but the effects of the <command>UPDATE</command> command will have been rolled back. The <command>INSERT</command> command preceding the block is not rolled back, however, so the end result is that the database contains <literal>Tom Jones</literal> not <literal>Joe Jones</literal>.
ru: При выполнении команд в секции <literal>EXCEPTION</literal> локальные переменные функции на <application>PL/pgSQL</application> сохраняют те значения, которые были на момент возникновения ошибки. Однако, будут отменены все изменения в базе данных, выполненные в блоке. В качестве примера рассмотрим следующий фрагмент: <placeholder-1/> При присвоении значения переменной <literal>y</literal> произойдёт ошибка <literal>division_by_zero</literal>. Она будет перехвачена в секции <literal>EXCEPTION</literal>. Оператор <command>RETURN</command> вернёт значение <literal>x</literal>, увеличенное на единицу, но изменения сделанные командой <command>UPDATE</command> будут отменены. Изменения, выполненные командой <command>INSERT</command>, которая предшествует блоку, не будут отменены. В результате, база данных будет содержать <literal>Tom Jones</literal>, а не <literal>Joe Jones</literal>.

source: A block containing an <literal>EXCEPTION</literal> clause is significantly more expensive to enter and exit than a block without one. Therefore, don't use <literal>EXCEPTION</literal> without need.
ru: Наличие секции <literal>EXCEPTION</literal> значительно увеличивает накладные расходы на вход/выход из блока. Поэтому не используйте <literal>EXCEPTION</literal> без надобности.

source: Exceptions with <command>UPDATE</command>/<command>INSERT</command>
ru: Обработка исключений для команд <command>UPDATE</command>/<command>INSERT</command>

source: CREATE TABLE db (a INT PRIMARY KEY, b TEXT); CREATE FUNCTION merge_db(key INT, data TEXT) RETURNS VOID AS $$ BEGIN LOOP -- first try to update the key UPDATE db SET b = data WHERE a = key; IF found THEN RETURN; END IF; -- not there, so try to insert the key -- if someone else inserts the same key concurrently, -- we could get a unique-key failure BEGIN INSERT INTO db(a,b) VALUES (key, data); RETURN; EXCEPTION WHEN unique_violation THEN -- Do nothing, and loop to try the UPDATE again. END; END LOOP; END; $$ LANGUAGE plpgsql; SELECT merge_db(1, 'david'); SELECT merge_db(1, 'dennis');
ru: CREATE TABLE db (a INT PRIMARY KEY, b TEXT); CREATE FUNCTION merge_db(key INT, data TEXT) RETURNS VOID AS $$ BEGIN LOOP -- для начала UPDATE записи по значению ключа UPDATE db SET b = data WHERE a = key; IF found THEN RETURN; END IF; -- записи с таким ключом нет, поэтому попытаемся её вставить -- если параллельно с нами кто-то ещё пытается вставить запись с таким же ключом, -- то мы получим ошибку уникальности BEGIN INSERT INTO db(a,b) VALUES (key, data); RETURN; EXCEPTION WHEN unique_violation THEN -- Здесь ничего не делаем, -- продолжаем цикл, чтобы повторить UPDATE. END; END LOOP; END; $$ LANGUAGE plpgsql; SELECT merge_db(1, 'david'); SELECT merge_db(1, 'dennis');

source: This example uses exception handling to perform either <command>UPDATE</command> or <command>INSERT</command>, as appropriate. It is recommended that applications use <command>INSERT</command> with <literal>ON CONFLICT DO UPDATE</literal> rather than actually using this pattern. This example serves primarily to illustrate use of <application>PL/pgSQL</application> control flow structures: <placeholder-1/> This coding assumes the <literal>unique_violation</literal> error is caused by the <command>INSERT</command>, and not by, say, an <command>INSERT</command> in a trigger function on the table. It might also misbehave if there is more than one unique index on the table, since it will retry the operation regardless of which index caused the error. More safety could be had by using the features discussed next to check that the trapped error was the one expected.
ru: В этом примере обработка исключений помогает выполнить либо команду <command>UPDATE</command>, либо <command>INSERT</command>, в зависимости от ситуации. Однако в современных приложениях вместо этого приёма рекомендуется использовать <command>INSERT</command> с <literal>ON CONFLICT DO UPDATE</literal>. Данный пример предназначен в первую очередь для демонстрации управления выполнением <application>PL/pgSQL</application>: <placeholder-1/> В этом коде предполагается, что ошибка <literal>unique_violation</literal> вызывается самой командой <command>INSERT</command>, а не, скажем, внутренним оператором <command>INSERT</command> в функции триггера для этой таблицы. Некорректное поведение также возможно, если в таблице будет несколько уникальных индексов; тогда операция будет повторяться вне зависимости от того, нарушение какого индекса вызвало ошибку. Используя средства, рассмотренные далее, можно сделать код более надёжным, проверяя, что перехвачена именно ожидаемая ошибка.

source: Obtaining Information About an Error
ru: Получение информации об ошибке

source: Exception handlers frequently need to identify the specific error that occurred. There are two ways to get information about the current exception in <application>PL/pgSQL</application>: special variables and the <command>GET STACKED DIAGNOSTICS</command> command.
ru: При обработке исключений часто бывает необходимым получить детальную информацию о произошедшей ошибке. Для этого в <application>PL/pgSQL</application> есть два способа: использование специальных переменных и команда <command>GET STACKED DIAGNOSTICS</command>.

source: Within an exception handler, the special variable <varname>SQLSTATE</varname> contains the error code that corresponds to the exception that was raised (refer to <xref linkend="errcodes-table"/> for a list of possible error codes). The special variable <varname>SQLERRM</varname> contains the error message associated with the exception. These variables are undefined outside exception handlers.
ru: Внутри секции <literal>EXCEPTION</literal> специальная переменная <varname>SQLSTATE</varname> содержит код ошибки, для которой было вызвано исключение (список возможных кодов ошибок приведён в <xref remap="6" linkend="errcodes-table"/>). Специальная переменная <varname>SQLERRM</varname> содержит сообщение об ошибке, связанное с исключением. Эти переменные являются неопределёнными вне секции <literal>EXCEPTION</literal>.

source: the SQLSTATE error code of the exception
ru: код исключения, возвращаемый SQLSTATE

source: the name of the column related to exception
ru: имя столбца, относящегося к исключению

source: the name of the constraint related to exception
ru: имя ограничения целостности, относящегося к исключению

source: the name of the data type related to exception
ru: имя типа данных, относящегося к исключению

source: the text of the exception's primary message
ru: текст основного сообщения исключения

source: the name of the table related to exception
ru: имя таблицы, относящейся к исключению

source: the name of the schema related to exception
ru: имя схемы, относящейся к исключению

source: the text of the exception's detail message, if any
ru: текст детального сообщения исключения (если есть)

source: the text of the exception's hint message, if any
ru: текст подсказки к исключению (если есть)

source: If the exception did not set a value for an item, an empty string will be returned.
ru: Если исключение не устанавливает значение для идентификатора, то возвращается пустая строка.

source: DECLARE text_var1 text; text_var2 text; text_var3 text; BEGIN -- some processing which might cause an exception ... EXCEPTION WHEN OTHERS THEN GET STACKED DIAGNOSTICS text_var1 = MESSAGE_TEXT, text_var2 = PG_EXCEPTION_DETAIL, text_var3 = PG_EXCEPTION_HINT; END;
ru: DECLARE text_var1 text; text_var2 text; text_var3 text; BEGIN -- здесь происходит обработка, которая может вызвать исключение ... EXCEPTION WHEN OTHERS THEN GET STACKED DIAGNOSTICS text_var1 = MESSAGE_TEXT, text_var2 = PG_EXCEPTION_DETAIL, text_var3 = PG_EXCEPTION_HINT; END;

source: CREATE OR REPLACE FUNCTION outer_func() RETURNS integer AS $$ BEGIN RETURN inner_func(); END; $$ LANGUAGE plpgsql; CREATE OR REPLACE FUNCTION inner_func() RETURNS integer AS $$ DECLARE stack text; BEGIN GET DIAGNOSTICS stack = PG_CONTEXT; RAISE NOTICE E'--- Call Stack ---\n%', stack; RETURN 1; END; $$ LANGUAGE plpgsql; SELECT outer_func(); NOTICE: --- Call Stack --- PL/pgSQL function inner_func() line 5 at GET DIAGNOSTICS PL/pgSQL function outer_func() line 3 at RETURN CONTEXT: PL/pgSQL function outer_func() line 3 at RETURN outer_func ------------ 1 (1 row)
ru: CREATE OR REPLACE FUNCTION outer_func() RETURNS integer AS $$ BEGIN RETURN inner_func(); END; $$ LANGUAGE plpgsql; CREATE OR REPLACE FUNCTION inner_func() RETURNS integer AS $$ DECLARE stack text; BEGIN GET DIAGNOSTICS stack = PG_CONTEXT; RAISE NOTICE E'--- Стек вызова ---\n%', stack; RETURN 1; END; $$ LANGUAGE plpgsql; SELECT outer_func(); NOTICE: --- Стек вызова --- PL/pgSQL function inner_func() line 5 at GET DIAGNOSTICS PL/pgSQL function outer_func() line 3 at RETURN CONTEXT: PL/pgSQL function outer_func() line 3 at RETURN outer_func ------------ 1 (1 row)

source: Cursors
ru: Курсоры

source: Rather than executing a whole query at once, it is possible to set up a <firstterm>cursor</firstterm> that encapsulates the query, and then read the query result a few rows at a time. One reason for doing this is to avoid memory overrun when the result contains a large number of rows. (However, <application>PL/pgSQL</application> users do not normally need to worry about that, since <literal>FOR</literal> loops automatically use a cursor internally to avoid memory problems.) A more interesting usage is to return a reference to a cursor that a function has created, allowing the caller to read the rows. This provides an efficient way to return large row sets from functions.
ru: Вместо того чтобы сразу выполнять весь запрос, есть возможность настроить курсор, инкапсулирующий запрос, и затем получать результат запроса по нескольку строк за раз. Одна из причин так делать заключается в том, чтобы избежать переполнения памяти, когда результат содержит большое количество строк. (Пользователям <application>PL/pgSQL</application> не нужно об этом беспокоиться, так как циклы <literal>FOR</literal> автоматически используют курсоры, чтобы избежать проблем с памятью.) Более интересным вариантом использования является возврат из функции ссылки на курсор, что позволяет вызывающему получать строки запроса. Это эффективный способ получать большие наборы строк из функций.

source: Declaring Cursor Variables
ru: Объявление курсорных переменных

source: All access to cursors in <application>PL/pgSQL</application> goes through cursor variables, which are always of the special data type <type>refcursor</type>. One way to create a cursor variable is just to declare it as a variable of type <type>refcursor</type>. Another way is to use the cursor declaration syntax, which in general is: <synopsis><replaceable>name</replaceable> <optional> <optional> NO </optional> SCROLL </optional> CURSOR <optional> ( <replaceable>arguments</replaceable> ) </optional> FOR <replaceable>query</replaceable>;</synopsis> (<literal>FOR</literal> can be replaced by <literal>IS</literal> for <productname>Oracle</productname> compatibility.) If <literal>SCROLL</literal> is specified, the cursor will be capable of scrolling backward; if <literal>NO SCROLL</literal> is specified, backward fetches will be rejected; if neither specification appears, it is query-dependent whether backward fetches will be allowed. <replaceable>arguments</replaceable>, if specified, is a comma-separated list of pairs <literal><replaceable>name</replaceable> <replaceable>datatype</replaceable></literal> that define names to be replaced by parameter values in the given query. The actual values to substitute for these names will be specified later, when the cursor is opened.
ru: Доступ к курсорам в <application>PL/pgSQL</application> осуществляется через курсорные переменные, которые всегда имеют специальный тип данных <type>refcursor</type>. Один из способов создать курсорную переменную, просто объявить её как переменную типа <type>refcursor</type>. Другой способ заключается в использовании синтаксиса объявления курсора, который в общем виде выглядит так: <synopsis><replaceable>name</replaceable> <optional> <optional> NO </optional> SCROLL </optional> CURSOR <optional> ( <replaceable>arguments</replaceable> ) </optional> FOR <replaceable>query</replaceable>;</synopsis> (Для совместимости с Oracle, <literal>FOR</literal> можно заменять на <literal>IS</literal>.) С указанием <literal>SCROLL</literal> курсор можно будет прокручивать назад. При <literal>NO SCROLL</literal> прокрутка назад не разрешается. Если ничего не указано, то возможность прокрутки назад зависит от запроса. Если указаны <replaceable>arguments</replaceable>, то они должны представлять собой пары <literal><replaceable>name</replaceable> <replaceable>datatype</replaceable></literal>, разделённые через запятую. Эти пары определяют имена, которые будут заменены значениями параметров в данном запросе. Фактические значения для замены этих имён появятся позже, при открытии курсора.

source: Some examples: <placeholder-1/> All three of these variables have the data type <type>refcursor</type>, but the first can be used with any query, while the second has a fully specified query already <firstterm>bound</firstterm> to it, and the last has a parameterized query bound to it. (<literal>key</literal> will be replaced by an integer parameter value when the cursor is opened.) The variable <literal>curs1</literal> is said to be <firstterm>unbound</firstterm> since it is not bound to any particular query.
ru: Примеры: <placeholder-1/> Все три переменные имеют тип данных <type>refcursor</type>. Первая может быть использована с любым запросом, вторая связана (<literal>bound</literal>) с полностью сформированным запросом, а последняя связана с параметризованным запросом. (<literal>key</literal> будет заменён целочисленным значением параметра при открытии курсора.) Про переменную <literal>curs1</literal> говорят, что она является несвязанной (<literal>unbound</literal>), так как к ней не привязан никакой запрос.

source: Opening Cursors
ru: Открытие курсора

source: Before a cursor can be used to retrieve rows, it must be <firstterm>opened</firstterm>. (This is the equivalent action to the SQL command <command>DECLARE CURSOR</command>.) <application>PL/pgSQL</application> has three forms of the <command>OPEN</command> statement, two of which use unbound cursor variables while the third uses a bound cursor variable.
ru: Прежде чем получать строки из курсора, его нужно открыть. (Это эквивалентно действию SQL-команды <command>DECLARE CURSOR</command>.) В <application>PL/pgSQL</application> есть три формы оператора <command>OPEN</command>, две из которых используются для несвязанных курсорных переменных, а третья для связанных.

source: Bound cursor variables can also be used without explicitly opening the cursor, via the <command>FOR</command> statement described in <xref linkend="plpgsql-cursor-for-loop"/>.
ru: Связанные курсорные переменные можно использовать с циклом <command>FOR</command> без явного открытия курсора, как описано в <xref remap="6" linkend="plpgsql-cursor-for-loop"/>.

source: The cursor variable is opened and given the specified query to execute. The cursor cannot be open already, and it must have been declared as an unbound cursor variable (that is, as a simple <type>refcursor</type> variable). The query must be a <command>SELECT</command>, or something else that returns rows (such as <command>EXPLAIN</command>). The query is treated in the same way as other SQL commands in <application>PL/pgSQL</application>: <application>PL/pgSQL</application> variable names are substituted, and the query plan is cached for possible reuse. When a <application>PL/pgSQL</application> variable is substituted into the cursor query, the value that is substituted is the one it has at the time of the <command>OPEN</command>; subsequent changes to the variable will not affect the cursor's behavior. The <literal>SCROLL</literal> and <literal>NO SCROLL</literal> options have the same meanings as for a bound cursor.
ru: Курсорная переменная открывается и получает конкретный запрос для выполнения. Курсор не может уже быть открытым, а курсорная переменная обязана быть несвязанной (то есть просто переменной типа <type>refcursor</type>). Запрос должен быть командой <command>SELECT</command> или любой другой, которая возвращает строки (к примеру <command>EXPLAIN</command>). Запрос обрабатывается так же, как и другие команды SQL в <application>PL/pgSQL</application>: имена переменных <application>PL/pgSQL</application> заменяются на значения, план запроса кешируется для повторного использования. Подстановка значений переменных <application>PL/pgSQL</application> проводится при открытии курсора командой <command>OPEN</command>, последующие изменения значений переменных не влияют на работу курсора. <literal>SCROLL</literal> и <literal>NO SCROLL</literal> имеют тот же смысл, что и для связанного курсора.

source: query_string
ru: строка_запроса

source: The cursor variable is opened and given the specified query to execute. The cursor cannot be open already, and it must have been declared as an unbound cursor variable (that is, as a simple <type>refcursor</type> variable). The query is specified as a string expression, in the same way as in the <command>EXECUTE</command> command. As usual, this gives flexibility so the query plan can vary from one run to the next (see <xref linkend="plpgsql-plan-caching"/>), and it also means that variable substitution is not done on the command string. As with <command>EXECUTE</command>, parameter values can be inserted into the dynamic command via <literal>format()</literal> and <literal>USING</literal>. The <literal>SCROLL</literal> and <literal>NO SCROLL</literal> options have the same meanings as for a bound cursor.
ru: Переменная курсора открывается и получает конкретный запрос для выполнения. Курсор не может быть уже открыт и он должен быть объявлен как несвязанная переменная курсора (то есть, как просто переменная <type>refcursor</type>). Запрос задаётся строковым выражением, так же, как в команде <command>EXECUTE</command>. Как обычно, это даёт возможность гибко менять план запроса от раза к разу (см. <xref remap="4" linkend="plpgsql-plan-caching"/>). Это также означает, что замена переменных происходит не в самой строке команды. Как и с <command>EXECUTE</command>, значения параметров вставляются в динамическую команду, используя <literal>format()</literal> и <literal>USING</literal>. Параметры <literal>SCROLL</literal> и <literal>NO SCROLL</literal> здесь действуют так же, как и со связанным курсором.
