Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: Oftentimes you will want to generate dynamic commands inside your <application>PL/pgSQL</application> functions, that is, commands that will involve different tables or different data types each time they are executed. <application>PL/pgSQL</application>'s normal attempts to cache plans for commands (as discussed in <xref linkend="plpgsql-plan-caching"/>) will not work in such scenarios. To handle this sort of problem, the <command>EXECUTE</command> statement is provided: <synopsis>EXECUTE <replaceable class="command">command-string</replaceable> <optional> INTO <optional>STRICT</optional> <replaceable>target</replaceable> </optional> <optional> USING <replaceable>expression</replaceable> <optional>, ... </optional> </optional>;</synopsis> where <replaceable>command-string</replaceable> is an expression yielding a string (of type <type>text</type>) containing the command to be executed. The optional <replaceable>target</replaceable> is a record variable, a row variable, or a comma-separated list of simple variables and record/row fields, into which the results of the command will be stored. The optional <literal>USING</literal> expressions supply values to be inserted into the command.
ru: Часто требуется динамически формировать команды внутри функций на <application>PL/pgSQL</application>, то есть такие команды, в которых при каждом выполнении могут использоваться разные таблицы или типы данных. Обычно <application>PL/pgSQL</application> кеширует планы выполнения (как описано в <xref remap="6" linkend="plpgsql-plan-caching"/>), но в случае с динамическими командами это не будет работать. Для исполнения динамических команд предусмотрен оператор <command>EXECUTE</command>: <synopsis>EXECUTE <replaceable class="command">command-string</replaceable> <optional> INTO <optional>STRICT</optional> <replaceable>target</replaceable> </optional> <optional> USING <replaceable>expression</replaceable> <optional>, ... </optional> </optional>;</synopsis> где <replaceable>command-string</replaceable> это выражение, формирующее строку (типа <type>text</type>) с текстом команды, которую нужно выполнить. Необязательный <replaceable>target</replaceable>, куда присваивается результат команды, может быть переменной типа <type>record</type>, строковой переменной или разделённым через запятую списком скалярных переменных, полей записи/строки. Необязательные выражения в <literal>USING</literal> формируют значения, которые будут вставлены в команду.

source: No substitution of <application>PL/pgSQL</application> variables is done on the computed command string. Any required variable values must be inserted in the command string as it is constructed; or you can use parameters as described below.
ru: В сформированном тексте команды замена имён переменных <application>PL/pgSQL</application> на их значения проводиться не будет. Все необходимые значения переменных должны быть вставлены в командную строку при её построении, либо нужно использовать параметры, как описано ниже.

source: Also, there is no plan caching for commands executed via <command>EXECUTE</command>. Instead, the command is always planned each time the statement is run. Thus the command string can be dynamically created within the function to perform actions on different tables and columns.
ru: Также, нет никакого плана кеширования для команд, выполняемых с помощью <command>EXECUTE</command>. Вместо этого план создаётся каждый раз при выполнении. Таким образом, строка команды может динамически создаваться внутри функции для выполнения действий с различными таблицами и столбцами.

source: The <literal>INTO</literal> clause specifies where the results of a SQL command returning rows should be assigned. If a row or variable list is provided, it must exactly match the structure of the query's results (when a record variable is used, it will configure itself to match the result structure automatically). If multiple rows are returned, only the first will be assigned to the <literal>INTO</literal> variable. If no rows are returned, NULL is assigned to the <literal>INTO</literal> variable(s). If no <literal>INTO</literal> clause is specified, the query results are discarded.
ru: Предложение <literal>INTO</literal> указывает, куда должны быть помещены результаты SQL-команды, возвращающей строки. Если используется переменная строкового типа или список переменных, то они должны в точности соответствовать структуре результата запроса (когда используется переменная типа <type>record</type>, она автоматически приводится к строковому типу результата запроса). Если возвращается несколько строк, то только первая будет присвоена переменной(ым) в <literal>INTO</literal>. Если не возвращается ни одной строки, то присваивается NULL. Без предложения <literal>INTO</literal> результаты запроса отбрасываются.

source: If the <literal>STRICT</literal> option is given, an error is reported unless the query produces exactly one row.
ru: С указанием <literal>STRICT</literal> запрос должен вернуть ровно одну строку, иначе выдаётся сообщение об ошибке.

source: The command string can use parameter values, which are referenced in the command as <literal>$1</literal>, <literal>$2</literal>, etc. These symbols refer to values supplied in the <literal>USING</literal> clause. This method is often preferable to inserting data values into the command string as text: it avoids run-time overhead of converting the values to text and back, and it is much less prone to SQL-injection attacks since there is no need for quoting or escaping. An example is: <placeholder-1/>
ru: В тексте команды можно использовать значения параметров, ссылки на параметры обозначаются как <literal>$1</literal>, <literal>$2</literal> и т. д. Эти символы указывают на значения, находящиеся в предложении <literal>USING</literal>. Такой метод зачастую предпочтительнее, чем вставка значений в команду в виде текста: он позволяет исключить во время исполнения дополнительные расходы на преобразования значений в текст и обратно, и не открывает возможности для SQL-инъекций, не требуя применять экранирование или кавычки для спецсимволов. Пример: <placeholder-1/>

source: Note that parameter symbols can only be used for data values &mdash; if you want to use dynamically determined table or column names, you must insert them into the command string textually. For example, if the preceding query needed to be done against a dynamically selected table, you could do this: <placeholder-1/> A cleaner approach is to use <function>format()</function>'s <literal>%I</literal> specification for table or column names (strings separated by a newline are concatenated): <placeholder-2/> Another restriction on parameter symbols is that they only work in <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> commands. In other statement types (generically called utility statements), you must insert values textually even if they are just data values.
ru: Обратите внимание, что символы параметров можно использовать только вместо значений данных. Если же требуется динамически формировать имена таблиц или столбцов, их необходимо вставлять в виде текста. Например, если в предыдущем запросе необходимо динамически задавать имя таблицы, можно сделать следующее: <placeholder-1/> В качестве более аккуратного решения, вместо имени таблиц или столбцов можно использовать указание формата <literal>%I</literal> с функцией <function>format()</function> (текст, разделённый символами новой строки, соединяется вместе): <placeholder-2/> Ещё одно ограничение состоит в том, что символы параметров могут использоваться только в командах <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. В операторы других типов (обычно называемые служебными) значения нужно вставлять в текстовом виде, даже если это просто значения данных.

source: An <command>EXECUTE</command> with a simple constant command string and some <literal>USING</literal> parameters, as in the first example above, is functionally equivalent to just writing the command directly in <application>PL/pgSQL</application> and allowing replacement of <application>PL/pgSQL</application> variables to happen automatically. The important difference is that <command>EXECUTE</command> will re-plan the command on each execution, generating a plan that is specific to the current parameter values; whereas <application>PL/pgSQL</application> may otherwise create a generic plan and cache it for re-use. In situations where the best plan depends strongly on the parameter values, it can be helpful to use <command>EXECUTE</command> to positively ensure that a generic plan is not selected.
ru: Команда <command>EXECUTE</command> c неизменяемым текстом и параметрами USING (как в первом примере выше), функционально эквивалентна команде, записанной напрямую в <application>PL/pgSQL</application>, в которой переменные <application>PL/pgSQL</application> автоматически заменяются значениями. Важное отличие в том, что <command>EXECUTE</command> при каждом исполнении заново строит план команды с учётом текущих значений параметров, тогда как <application>PL/pgSQL</application> строит общий план выполнения и кеширует его при повторном использовании. В тех случаях, когда наилучший план выполнения сильно зависит от значений параметров, может быть полезно использовать <command>EXECUTE</command> для гарантии того, что не будет выбран общий план.

source: <command>SELECT INTO</command> is not currently supported within <command>EXECUTE</command>; instead, execute a plain <command>SELECT</command> command and specify <literal>INTO</literal> as part of the <command>EXECUTE</command> itself.
ru: В настоящее время команда <command>SELECT INTO</command> не поддерживается в <command>EXECUTE</command>, вместо этого нужно выполнять обычный <command>SELECT</command> и указать <literal>INTO</literal> для самой команды <command>EXECUTE</command>.

source: The <application>PL/pgSQL</application> <command>EXECUTE</command> statement is not related to the <xref linkend="sql-execute"/> SQL statement supported by the <productname>PostgreSQL</productname> server. The server's <command>EXECUTE</command> statement cannot be used directly within <application>PL/pgSQL</application> functions (and is not needed).
ru: Оператор <command>EXECUTE</command> в <application>PL/pgSQL</application> не имеет отношения к одноименному SQL-оператору сервера <productname>PostgreSQL</productname>. Серверный <command>EXECUTE</command> не может напрямую использоваться в функциях на <application>PL/pgSQL</application> (и в этом нет необходимости).

source: Quoting Values In Dynamic Queries
ru: Использование кавычек в динамических запросах

source: When working with dynamic commands you will often have to handle escaping of single quotes. The recommended method for quoting fixed text in your function body is dollar quoting. (If you have legacy code that does not use dollar quoting, please refer to the overview in <xref linkend="plpgsql-quote-tips"/>, which can save you some effort when translating said code to a more reasonable scheme.)
ru: При работе с динамическими командами часто приходится иметь дело с экранированием одинарных кавычек. Рекомендуемым методом для взятия текста в кавычки в теле функции является экранирование знаками доллара. (Если имеется унаследованный код, не использующий этот метод, пожалуйста, обратитесь к обзору в <xref remap="6" linkend="plpgsql-quote-tips"/>, это поможет сэкономить усилия при переводе кода к более приемлемому виду.)

source: Dynamic values require careful handling since they might contain quote characters. An example using <function>format()</function> (this assumes that you are dollar quoting the function body so quote marks need not be doubled): <placeholder-1/> It is also possible to call the quoting functions directly: <placeholder-2/>
ru: Динамические значения требуют особого внимания, так как они могут содержать апострофы. Например, можно использовать функцию <function>format()</function> (предполагается, что тело функции заключается в доллары, так что апострофы дублировать не нужно): <placeholder-1/> Также можно напрямую вызывать функции заключения в кавычки: <placeholder-2/>

source: This example demonstrates the use of the <function>quote_ident</function> and <function>quote_literal</function> functions (see <xref linkend="functions-string"/>). For safety, expressions containing column or table identifiers should be passed through <function>quote_ident</function> before insertion in a dynamic query. Expressions containing values that should be literal strings in the constructed command should be passed through <function>quote_literal</function>. These functions take the appropriate steps to return the input text enclosed in double or single quotes respectively, with any embedded special characters properly escaped.
ru: Этот пример демонстрирует использование функций <function>quote_ident</function> и <function>quote_literal</function> (см. <xref remap="4" linkend="functions-string"/>). Для надёжности, выражения, содержащие идентификаторы столбцов и таблиц должны использовать функцию <function>quote_ident</function> при добавлении в текст запроса. А для выражений со значениями, которые должны быть обычными строками, используется функция <function>quote_literal</function>. Эти функции выполняют соответствующие шаги, чтобы вернуть текст, по ситуации заключённый в двойные или одинарные кавычки и с правильно экранированными специальными символами.

source: Because <function>quote_literal</function> is labeled <literal>STRICT</literal>, it will always return null when called with a null argument. In the above example, if <literal>newvalue</literal> or <literal>keyvalue</literal> were null, the entire dynamic query string would become null, leading to an error from <command>EXECUTE</command>. You can avoid this problem by using the <function>quote_nullable</function> function, which works the same as <function>quote_literal</function> except that when called with a null argument it returns the string <literal>NULL</literal>. For example, <placeholder-1/> If you are dealing with values that might be null, you should usually use <function>quote_nullable</function> in place of <function>quote_literal</function>.
ru: Так как функция <function>quote_literal</function> помечена как <literal>STRICT</literal>, то она всегда возвращает NULL, если переданный ей аргумент имеет значение NULL. В приведённом выше примере, если <literal>newvalue</literal> или <literal>keyvalue</literal> были NULL, вся строка с текстом запроса станет NULL, что приведёт к ошибке в <command>EXECUTE</command>. Для предотвращения этой проблемы используйте функцию <function>quote_nullable</function>, которая работает так же, как <function>quote_literal</function> за исключением того, что при вызове с пустым аргументом возвращает строку 'NULL'. Например: <placeholder-1/> Если вы имеете дело со значениями, которые могут быть пустыми, то, как правило, нужно использовать <function>quote_nullable</function> вместо <function>quote_literal</function>.

source: As always, care must be taken to ensure that null values in a query do not deliver unintended results. For example the <literal>WHERE</literal> clause <placeholder-1/> will never succeed if <literal>keyvalue</literal> is null, because the result of using the equality operator <literal>=</literal> with a null operand is always null. If you wish null to work like an ordinary key value, you would need to rewrite the above as <placeholder-2/> (At present, <literal>IS NOT DISTINCT FROM</literal> is handled much less efficiently than <literal>=</literal>, so don't do this unless you must. See <xref linkend="functions-comparison"/> for more information on nulls and <literal>IS DISTINCT</literal>.)
ru: Как обычно, необходимо убедиться, что значения NULL в запросе не принесут неожиданных результатов. Например, следующее условие <literal>WHERE</literal> <placeholder-1/> никогда не выполнится, если <literal>keyvalue</literal> — NULL, так как применение <literal>=</literal> с операндом, имеющим значение NULL, всегда даёт NULL. Если требуется, чтобы NULL обрабатывалось как обычное значение, то условие выше нужно переписать так: <placeholder-2/> (В настоящее время <literal>IS NOT DISTINCT FROM</literal> работает менее эффективно, чем <literal>=</literal>, так что используйте этот способ, только если это действительно необходимо. Подробнее особенности NULL и <literal>IS DISTINCT</literal> описаны в <xref remap="6" linkend="functions-comparison"/>.)

source: Note that dollar quoting is only useful for quoting fixed text. It would be a very bad idea to try to write this example as: <placeholder-1/> because it would break if the contents of <literal>newvalue</literal> happened to contain <literal>$$</literal>. The same objection would apply to any other dollar-quoting delimiter you might pick. So, to safely quote text that is not known in advance, you <emphasis>must</emphasis> use <function>quote_literal</function>, <function>quote_nullable</function>, or <function>quote_ident</function>, as appropriate.
ru: Обратите внимание, что использование знака $ полезно только для взятия в кавычки фиксированного текста. Плохая идея написать этот пример так: <placeholder-1/> потому что <literal>newvalue</literal> может также содержать <literal>$$</literal>. Эта же проблема может возникнуть и с любым другим разделителем, используемым после знака <literal>$</literal>. Поэтому, чтобы безопасно заключить заранее неизвестный текст в кавычки, <emphasis>нужно</emphasis> использовать соответствующие функции: <function>quote_literal</function>, <function>quote_nullable</function>, или <function>quote_ident</function>.

source: Dynamic SQL statements can also be safely constructed using the <function>format</function> function (see <xref linkend="functions-string"/>). For example: <placeholder-1/> <literal>%I</literal> is equivalent to <function>quote_ident</function>, and <literal>%L</literal> is equivalent to <function>quote_nullable</function>. The <function>format</function> function can be used in conjunction with the <literal>USING</literal> clause: <placeholder-2/> This form is better because the variables are handled in their native data type format, rather than unconditionally converting them to text and quoting them via <literal>%L</literal>. It is also more efficient.
ru: Динамические операторы SQL также можно безопасно сформировать, используя функцию <function>format</function> (см. <xref remap="4" linkend="functions-string"/>). Например: <placeholder-1/> Указание <literal>%I</literal> равнозначно вызову <function>quote_ident</function>, а <literal>%L</literal> — вызову <function>quote_nullable</function>. Функция <function>format</function> может применяться в сочетании с предложением <literal>USING</literal>: <placeholder-2/> Эта форма лучше, так как с ней переменные обрабатываются в их собственном формате данных, а не преобразуются безусловно в текст, чтобы затем выводиться с использованием <literal>%L</literal>. Она также и более эффективна.

source: A much larger example of a dynamic command and <command>EXECUTE</command> can be seen in <xref linkend="plpgsql-porting-ex2"/>, which builds and executes a <command>CREATE FUNCTION</command> command to define a new function.
ru: Более объёмный пример использования динамической команды и <command>EXECUTE</command> можно увидеть в <xref remap="6" linkend="plpgsql-porting-ex2"/>. В нём создаётся и динамически выполняется команда <command>CREATE FUNCTION</command> для определения новой функции.

source: Obtaining the Result Status
ru: Статус выполнения команды

source: Name
ru: Имя

source: Type
ru: Тип

source: Description
ru: Описание

source: A <command>SELECT INTO</command> statement sets <literal>FOUND</literal> true if a row is assigned, false if no row is returned.
ru: <command>SELECT INTO</command> записывает в <literal>FOUND</literal> true, если строка присвоена, или false, если строки не были получены.

source: A <command>PERFORM</command> statement sets <literal>FOUND</literal> true if it produces (and discards) one or more rows, false if no row is produced.
ru: <command>PERFORM</command> записывает в <literal>FOUND</literal> true, если строки выбраны (и отброшены) или false, если строки не выбраны.

source: <command>UPDATE</command>, <command>INSERT</command>, and <command>DELETE</command> statements set <literal>FOUND</literal> true if at least one row is affected, false if no row is affected.
ru: <command>UPDATE</command>, <command>INSERT</command> и <command>DELETE</command> записывают в <literal>FOUND</literal> true, если при их выполнении была задействована хотя бы одна строка, или false, если ни одна строка не была задействована.

source: A <command>FETCH</command> statement sets <literal>FOUND</literal> true if it returns a row, false if no row is returned.
ru: <command>FETCH</command> записывают в <literal>FOUND</literal> true, если команда вернула строку, или false, если строка не выбрана.

source: A <command>MOVE</command> statement sets <literal>FOUND</literal> true if it successfully repositions the cursor, false otherwise.
ru: <command>MOVE</command> записывают в <literal>FOUND</literal> true при успешном перемещении курсора, в противном случае — false.

source: A <command>FOR</command> or <command>FOREACH</command> statement sets <literal>FOUND</literal> true if it iterates one or more times, else false. <literal>FOUND</literal> is set this way when the loop exits; inside the execution of the loop, <literal>FOUND</literal> is not modified by the loop statement, although it might be changed by the execution of other statements within the loop body.
ru: <command>FOR</command>, как и <command>FOREACH</command>, записывает в <literal>FOUND</literal> true, если была произведена хотя бы одна итерация цикла, в противном случае — false. При этом значение <literal>FOUND</literal> будет установлено только после выхода из цикла. Пока цикл выполняется, оператор цикла не изменяет значение переменной. Но другие операторы внутри цикла могут менять значение <literal>FOUND</literal>.

source: <command>RETURN QUERY</command> and <command>RETURN QUERY EXECUTE</command> statements set <literal>FOUND</literal> true if the query returns at least one row, false if no row is returned.
ru: <command>RETURN QUERY</command> и <command>RETURN QUERY EXECUTE</command> записывают в <literal>FOUND</literal> true, если запрос вернул хотя бы одну строку, или false, если строки не выбраны.

source: The second method to determine the effects of a command is to check the special variable named <literal>FOUND</literal>, which is of type <type>boolean</type>. <literal>FOUND</literal> starts out false within each <application>PL/pgSQL</application> function call. It is set by each of the following types of statements: <placeholder-1/> Other <application>PL/pgSQL</application> statements do not change the state of <literal>FOUND</literal>. Note in particular that <command>EXECUTE</command> changes the output of <command>GET DIAGNOSTICS</command>, but does not change <literal>FOUND</literal>.
ru: Второй способ определения статуса выполнения команды заключается в проверке значения специальной переменной <literal>FOUND</literal>, имеющей тип <type>boolean</type>. При вызове функции на <application>PL/pgSQL</application>, переменная <literal>FOUND</literal> инициализируется в ложь. Далее, значение переменной изменяется следующими операторами: <placeholder-1/> Другие операторы <application>PL/pgSQL</application> не меняют значение <literal>FOUND</literal>. Помните в частности, что <command>EXECUTE</command> изменяет вывод <command>GET DIAGNOSTICS</command>, но не меняет <literal>FOUND</literal>.
