Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: Instead of packages, use schemas to organize your functions into groups.
ru: Для группировки функций вместо пакетов используются схемы.

source: Since there are no packages, there are no package-level variables either. This is somewhat annoying. You can keep per-session state in temporary tables instead.
ru: Так как пакетов нет, нет и пакетных переменных. Это несколько раздражает. Вместо этого можно хранить состояние каждого сеанса во временных таблицах.

source: Integer <command>FOR</command> loops with <literal>REVERSE</literal> work differently: <application>PL/SQL</application> counts down from the second number to the first, while <application>PL/pgSQL</application> counts down from the first number to the second, requiring the loop bounds to be swapped when porting. This incompatibility is unfortunate but is unlikely to be changed. (See <xref linkend="plpgsql-integer-for"/>.)
ru: Целочисленные циклы <command>FOR</command> с указанием <literal>REVERSE</literal> работают по-разному. В <application>PL/SQL</application> значение счётчика уменьшается от второго числа к первому, в то время как в <application>PL/pgSQL</application> счётчик уменьшается от первого ко второму. Поэтому при портировании нужно менять местами границы цикла. Это печально, но вряд ли будет изменено. (См. <xref remap="4" linkend="plpgsql-integer-for"/>.)

source: <command>FOR</command> loops over queries (other than cursors) also work differently: the target variable(s) must have been declared, whereas <application>PL/SQL</application> always declares them implicitly. An advantage of this is that the variable values are still accessible after the loop exits.
ru: Циклы <command>FOR</command> по запросам (не курсорам) также работают по-разному. Переменная цикла должна быть объявлена, в то время как в <application>PL/SQL</application> она объявляется неявно. Преимущество в том, что значения переменных доступны и после выхода из цикла.

source: There are various notational differences for the use of cursor variables.
ru: Существуют некоторые отличия в нотации при использовании курсорных переменных.

source: <application>PL/pgSQL</application> is similar to PL/SQL in many aspects. It is a block-structured, imperative language, and all variables have to be declared. Assignments, loops, conditionals are similar. The main differences you should keep in mind when porting from <application>PL/SQL</application> to <application>PL/pgSQL</application> are: <placeholder-1/>
ru: <application>PL/pgSQL</application> во многих аспектах похож на PL/SQL . Это блочно-структурированный, императивный язык, в котором все переменные должны объявляться. Присвоения, циклы, условные операторы в обоих языках похожи. Основные отличия, которые необходимо иметь в виду при портировании с <application>PL/SQL</application> в <application>PL/pgSQL</application>, следующие: <placeholder-1/>

source: Porting Examples
ru: Примеры портирования

source: <xref linkend="pgsql-porting-ex1"/> shows how to port a simple function from <application>PL/SQL</application> to <application>PL/pgSQL</application>.
ru: <xref linkend="pgsql-porting-ex1"/> показывает, как портировать простую функцию из <application>PL/SQL</application> в <application>PL/pgSQL</application>.

source: Porting a Simple Function from <application>PL/SQL</application> to <application>PL/pgSQL</application>
ru: Портирование простой функции из <application>PL/SQL</application> в <application>PL/pgSQL</application>

source: Here is an <productname>Oracle</productname> <application>PL/SQL</application> function: <placeholder-1/>
ru: Функция <productname>Oracle</productname> <application>PL/SQL</application>: <placeholder-1/>

source: The type name <type>varchar2</type> has to be changed to <type>varchar</type> or <type>text</type>. In the examples in this section, we'll use <type>varchar</type>, but <type>text</type> is often a better choice if you do not need specific string length limits.
ru: Имя типа <type>varchar2</type> нужно сменить на <type>varchar</type> или <type>text</type>. В примерах данного раздела мы будем использовать <type>varchar</type>, но обычно лучше выбрать <type>text</type>, если не требуется ограничивать длину строк.

source: The <literal>RETURN</literal> key word in the function prototype (not the function body) becomes <literal>RETURNS</literal> in <productname>PostgreSQL</productname>. Also, <literal>IS</literal> becomes <literal>AS</literal>, and you need to add a <literal>LANGUAGE</literal> clause because <application>PL/pgSQL</application> is not the only possible function language.
ru: Ключевое слово <literal>RETURN</literal> в прототипе функции (не в теле функции) заменяется на <literal>RETURNS</literal> в <productname>PostgreSQL</productname>. Кроме того, <literal>IS</literal> становится <literal>AS</literal>, и нужно добавить предложение <literal>LANGUAGE</literal>, потому что <application>PL/pgSQL</application> — не единственный возможный язык.

source: In <productname>PostgreSQL</productname>, the function body is considered to be a string literal, so you need to use quote marks or dollar quotes around it. This substitutes for the terminating <literal>/</literal> in the Oracle approach.
ru: В <productname>PostgreSQL</productname> тело функции является строкой, поэтому нужно использовать кавычки или знаки доллара. Это заменяет завершающий <literal>/</literal> в подходе Oracle.

source: The <literal>show errors</literal> command does not exist in <productname>PostgreSQL</productname>, and is not needed since errors are reported automatically.
ru: Команда <literal>show errors</literal> не существует в <productname>PostgreSQL</productname> и не требуется, так как ошибки будут выводиться автоматически.

source: Let's go through this function and see the differences compared to <application>PL/pgSQL</application>: <placeholder-1/>
ru: Пройдемся по этой функции и посмотрим различия по сравнению с <application>PL/pgSQL</application>: <placeholder-1/>

source: This is how this function would look when ported to <productname>PostgreSQL</productname>: <placeholder-1/>
ru: Вот как эта функция будет выглядеть после портирования в <productname>PostgreSQL</productname>: <placeholder-1/>

source: <xref linkend="plpgsql-porting-ex2"/> shows how to port a function that creates another function and how to handle the ensuing quoting problems.
ru: <xref linkend="plpgsql-porting-ex2"/> показывает, как портировать функцию, которая создаёт другую функцию, и как обрабатывать проблемы с кавычками.

source: Porting a Function that Creates Another Function from <application>PL/SQL</application> to <application>PL/pgSQL</application>
ru: Портирование функции, создающей другую функцию, из <application>PL/SQL</application> в <application>PL/pgSQL</application>

source: The following procedure grabs rows from a <command>SELECT</command> statement and builds a large function with the results in <literal>IF</literal> statements, for the sake of efficiency.
ru: Следующая процедура получает строки из <command>SELECT</command> и строит большую функцию, в целях эффективности возвращающую результат в операторах <literal>IF</literal>.

source: This is the Oracle version: <placeholder-1/>
ru: Версия Oracle: <placeholder-1/>

source: Here is how this function would end up in <productname>PostgreSQL</productname>: <placeholder-1/> Notice how the body of the function is built separately and passed through <literal>quote_literal</literal> to double any quote marks in it. This technique is needed because we cannot safely use dollar quoting for defining the new function: we do not know for sure what strings will be interpolated from the <structfield>referrer_key.key_string</structfield> field. (We are assuming here that <structfield>referrer_key.kind</structfield> can be trusted to always be <literal>host</literal>, <literal>domain</literal>, or <literal>url</literal>, but <structfield>referrer_key.key_string</structfield> might be anything, in particular it might contain dollar signs.) This function is actually an improvement on the Oracle original, because it will not generate broken code when <structfield>referrer_key.key_string</structfield> or <structfield>referrer_key.referrer_type</structfield> contain quote marks.
ru: В конечном итоге в <productname>PostgreSQL</productname> эта функция может выглядеть так: <placeholder-1/> Обратите внимание, что тело функции строится отдельно, с использованием <literal>quote_literal</literal> для удвоения кавычек. Эта техника необходима, потому что мы не можем безопасно использовать знаки доллара при определении новой функции: мы не знаем наверняка, какие строки будут вставлены из <structfield>referrer_key.key_string</structfield>. (Мы предполагаем, что <structfield>referrer_key.kind</structfield> всегда имеет значение из списка: <literal>host</literal>, <literal>domain</literal> или <literal>url</literal>, но <structfield>referrer_key.key_string</structfield> может быть чем угодно, в частности, может содержать знаки доллара.) На самом деле, в этой функций есть улучшение по сравнению с оригиналом Oracle, потому что не будет генерироваться неправильный код, когда <structfield>referrer_key.key_string</structfield> или <structfield>referrer_key.referrer_type</structfield> содержат кавычки.

source: <xref linkend="plpgsql-porting-ex3"/> shows how to port a function with <literal>OUT</literal> parameters and string manipulation. <productname>PostgreSQL</productname> does not have a built-in <function>instr</function> function, but you can create one using a combination of other functions. In <xref linkend="plpgsql-porting-appendix"/> there is a <application>PL/pgSQL</application> implementation of <function>instr</function> that you can use to make your porting easier.
ru: <xref linkend="plpgsql-porting-ex3"/> показывает, как портировать функцию с выходными параметрами (<literal>OUT</literal>) и манипулирующую строками. В <productname>PostgreSQL</productname> нет встроенной функции <function>instr</function>, но её можно создать, используя комбинацию других функций. В <xref linkend="plpgsql-porting-appendix"/> приведена реализации <function>instr</function> на <application>PL/pgSQL</application>, которая может быть полезна вам при портировании ваших функций.

source: Porting a Procedure With String Manipulation and <literal>OUT</literal> Parameters from <application>PL/SQL</application> to <application>PL/pgSQL</application>
ru: Портирование из <application>PL/SQL</application> в <application>PL/pgSQL</application> процедуры, которая манипулирует строками и содержит <literal>OUT</literal> параметры

source: The following <productname>Oracle</productname> PL/SQL procedure is used to parse a URL and return several elements (host, path, and query).
ru: Следующая процедура на языке <productname>Oracle</productname> PL/SQL разбирает URL и возвращает составляющие его элементы (сервер, путь и запрос).

source: CREATE OR REPLACE PROCEDURE cs_parse_url( v_url IN VARCHAR2, v_host OUT VARCHAR2, -- This will be passed back v_path OUT VARCHAR2, -- This one too v_query OUT VARCHAR2) -- And this one IS a_pos1 INTEGER; a_pos2 INTEGER; BEGIN v_host := NULL; v_path := NULL; v_query := NULL; a_pos1 := instr(v_url, '//'); IF a_pos1 = 0 THEN RETURN; END IF; a_pos2 := instr(v_url, '/', a_pos1 + 2); IF a_pos2 = 0 THEN v_host := substr(v_url, a_pos1 + 2); v_path := '/'; RETURN; END IF; v_host := substr(v_url, a_pos1 + 2, a_pos2 - a_pos1 - 2); a_pos1 := instr(v_url, '?', a_pos2 + 1); IF a_pos1 = 0 THEN v_path := substr(v_url, a_pos2); RETURN; END IF; v_path := substr(v_url, a_pos2, a_pos1 - a_pos2); v_query := substr(v_url, a_pos1 + 1); END; / show errors;
ru: CREATE OR REPLACE PROCEDURE cs_parse_url( v_url IN VARCHAR2, v_host OUT VARCHAR2, -- Возвращается обратно v_path OUT VARCHAR2, -- И это тоже v_query OUT VARCHAR2) -- И это IS a_pos1 INTEGER; a_pos2 INTEGER; BEGIN v_host := NULL; v_path := NULL; v_query := NULL; a_pos1 := instr(v_url, '//'); IF a_pos1 = 0 THEN RETURN; END IF; a_pos2 := instr(v_url, '/', a_pos1 + 2); IF a_pos2 = 0 THEN v_host := substr(v_url, a_pos1 + 2); v_path := '/'; RETURN; END IF; v_host := substr(v_url, a_pos1 + 2, a_pos2 - a_pos1 - 2); a_pos1 := instr(v_url, '?', a_pos2 + 1); IF a_pos1 = 0 THEN v_path := substr(v_url, a_pos2); RETURN; END IF; v_path := substr(v_url, a_pos2, a_pos1 - a_pos2); v_query := substr(v_url, a_pos1 + 1); END; / show errors;

source: CREATE OR REPLACE FUNCTION cs_parse_url( v_url IN VARCHAR, v_host OUT VARCHAR, -- This will be passed back v_path OUT VARCHAR, -- This one too v_query OUT VARCHAR) -- And this one AS $$ DECLARE a_pos1 INTEGER; a_pos2 INTEGER; BEGIN v_host := NULL; v_path := NULL; v_query := NULL; a_pos1 := instr(v_url, '//'); IF a_pos1 = 0 THEN RETURN; END IF; a_pos2 := instr(v_url, '/', a_pos1 + 2); IF a_pos2 = 0 THEN v_host := substr(v_url, a_pos1 + 2); v_path := '/'; RETURN; END IF; v_host := substr(v_url, a_pos1 + 2, a_pos2 - a_pos1 - 2); a_pos1 := instr(v_url, '?', a_pos2 + 1); IF a_pos1 = 0 THEN v_path := substr(v_url, a_pos2); RETURN; END IF; v_path := substr(v_url, a_pos2, a_pos1 - a_pos2); v_query := substr(v_url, a_pos1 + 1); END; $$ LANGUAGE plpgsql;
ru: CREATE OR REPLACE FUNCTION cs_parse_url( v_url IN VARCHAR, v_host OUT VARCHAR, -- Возвращается обратно v_path OUT VARCHAR, -- И это возвращается v_query OUT VARCHAR) -- И это AS $$ DECLARE a_pos1 INTEGER; a_pos2 INTEGER; BEGIN v_host := NULL; v_path := NULL; v_query := NULL; a_pos1 := instr(v_url, '//'); IF a_pos1 = 0 THEN RETURN; END IF; a_pos2 := instr(v_url, '/', a_pos1 + 2); IF a_pos2 = 0 THEN v_host := substr(v_url, a_pos1 + 2); v_path := '/'; RETURN; END IF; v_host := substr(v_url, a_pos1 + 2, a_pos2 - a_pos1 - 2); a_pos1 := instr(v_url, '?', a_pos2 + 1); IF a_pos1 = 0 THEN v_path := substr(v_url, a_pos2); RETURN; END IF; v_path := substr(v_url, a_pos2, a_pos1 - a_pos2); v_query := substr(v_url, a_pos1 + 1); END; $$ LANGUAGE plpgsql;

source: Here is a possible translation into <application>PL/pgSQL</application>: <placeholder-1/> This function could be used like this: <placeholder-2/>
ru: Вот возможная трансляция в <application>PL/pgSQL</application>: <placeholder-1/> Эту функцию можно использовать так: <placeholder-2/>

source: <xref linkend="plpgsql-porting-ex4"/> shows how to port a procedure that uses numerous features that are specific to Oracle.
ru: <xref linkend="plpgsql-porting-ex4"/> показывает, как портировать процедуру, использующую большое количество специфических для Oracle возможностей.

source: Porting a Procedure from <application>PL/SQL</application> to <application>PL/pgSQL</application>
ru: Портирование процедуры из <application>PL/SQL</application> в <application>PL/pgSQL</application>

source: CREATE OR REPLACE PROCEDURE cs_create_job(v_job_id IN INTEGER) IS a_running_job_count INTEGER; PRAGMA AUTONOMOUS_TRANSACTION;<co id="co.plpgsql-porting-pragma"></co> BEGIN LOCK TABLE cs_jobs IN EXCLUSIVE MODE;<co id="co.plpgsql-porting-locktable"></co> SELECT count(*) INTO a_running_job_count FROM cs_jobs WHERE end_stamp IS NULL; IF a_running_job_count &gt; 0 THEN COMMIT; -- free lock<co id="co.plpgsql-porting-commit"></co> raise_application_error(-20000, 'Unable to create a new job: a job is currently running.'); END IF; DELETE FROM cs_active_job; INSERT INTO cs_active_job(job_id) VALUES (v_job_id); BEGIN INSERT INTO cs_jobs (job_id, start_stamp) VALUES (v_job_id, sysdate); EXCEPTION WHEN dup_val_on_index THEN NULL; -- don't worry if it already exists END; COMMIT; END; / show errors
ru: CREATE OR REPLACE PROCEDURE cs_create_job(v_job_id IN INTEGER) IS a_running_job_count INTEGER; PRAGMA AUTONOMOUS_TRANSACTION;<co id="co.plpgsql-porting-pragma"></co> BEGIN LOCK TABLE cs_jobs IN EXCLUSIVE MODE;<co id="co.plpgsql-porting-locktable"></co> SELECT count(*) INTO a_running_job_count FROM cs_jobs WHERE end_stamp IS NULL; IF a_running_job_count &gt; 0 THEN COMMIT; -- free lock<co id="co.plpgsql-porting-commit"></co> raise_application_error(-20000, 'Не удалось создать новое задание. Задание сейчас выполняется.'); END IF; DELETE FROM cs_active_job; INSERT INTO cs_active_job(job_id) VALUES (v_job_id); BEGIN INSERT INTO cs_jobs (job_id, start_stamp) VALUES (v_job_id, sysdate); EXCEPTION WHEN dup_val_on_index THEN NULL; -- don't worry if it already exists END; COMMIT; END; / show errors

source: The Oracle version: <placeholder-1/>
ru: Версия Oracle: <placeholder-1/>

source: There is no <literal>PRAGMA</literal> statement in <productname>PostgreSQL</productname>.
ru: В <productname>PostgreSQL</productname> нет оператора <literal>PRAGMA</literal>.

source: If you do a <command>LOCK TABLE</command> in <application>PL/pgSQL</application>, the lock will not be released until the calling transaction is finished.
ru: Если выполнить <command>LOCK TABLE</command> в <application>PL/pgSQL</application>, блокировка не будет снята, пока не завершится вызывающая транзакция.

source: You cannot issue <command>COMMIT</command> in a <application>PL/pgSQL</application> function. The function is running within some outer transaction and so <command>COMMIT</command> would imply terminating the function's execution. However, in this particular case it is not necessary anyway, because the lock obtained by the <command>LOCK TABLE</command> will be released when we raise an error.
ru: В функции на <application>PL/pgSQL</application> нельзя использовать <command>COMMIT</command>. Функция работает в рамках некоторой внешней транзакции, и поэтому <command>COMMIT</command> будет означать прекращение выполнения функции. Однако, в данном конкретном случае, в этом нет необходимости, потому что блокировка, полученная командой <command>LOCK TABLE</command>, будет снята при вызове ошибки.

source: Procedures like this can easily be converted into <productname>PostgreSQL</productname> functions returning <type>void</type>. This procedure in particular is interesting because it can teach us some things: <placeholder-1/>
ru: Подобные процедуры легко преобразуются в функции <productname>PostgreSQL</productname>, возвращающие <type>void</type>. На примере этой процедуры можно научиться следующему: <placeholder-1/>

source: CREATE OR REPLACE FUNCTION cs_create_job(v_job_id integer) RETURNS void AS $$ DECLARE a_running_job_count integer; BEGIN LOCK TABLE cs_jobs IN EXCLUSIVE MODE; SELECT count(*) INTO a_running_job_count FROM cs_jobs WHERE end_stamp IS NULL; IF a_running_job_count &gt; 0 THEN RAISE EXCEPTION 'Unable to create a new job: a job is currently running';<co id="co.plpgsql-porting-raise"></co> END IF; DELETE FROM cs_active_job; INSERT INTO cs_active_job(job_id) VALUES (v_job_id); BEGIN INSERT INTO cs_jobs (job_id, start_stamp) VALUES (v_job_id, now()); EXCEPTION WHEN unique_violation THEN <co id="co.plpgsql-porting-exception"></co> -- don't worry if it already exists END; END; $$ LANGUAGE plpgsql;
ru: CREATE OR REPLACE FUNCTION cs_create_job(v_job_id integer) RETURNS void AS $$ DECLARE a_running_job_count integer; BEGIN LOCK TABLE cs_jobs IN EXCLUSIVE MODE; SELECT count(*) INTO a_running_job_count FROM cs_jobs WHERE end_stamp IS NULL; IF a_running_job_count &gt; 0 THEN RAISE EXCEPTION 'Не удалось создать новое задание. Задание сейчас выполняется.';<co id="co.plpgsql-porting-raise"></co> END IF; DELETE FROM cs_active_job; INSERT INTO cs_active_job(job_id) VALUES (v_job_id); BEGIN INSERT INTO cs_jobs (job_id, start_stamp) VALUES (v_job_id, now()); EXCEPTION WHEN unique_violation THEN <co id="co.plpgsql-porting-exception"></co> -- don't worry if it already exists END; END; $$ LANGUAGE plpgsql;

source: The syntax of <literal>RAISE</literal> is considerably different from Oracle's statement, although the basic case <literal>RAISE</literal> <replaceable class="parameter">exception_name</replaceable> works similarly.
ru: Синтаксис <literal>RAISE</literal> существенно отличается от Oracle, хотя основной вариант <literal>RAISE</literal> <replaceable class="parameter">exception_name</replaceable> работает похоже.

source: The exception names supported by <application>PL/pgSQL</application> are different from Oracle's. The set of built-in exception names is much larger (see <xref linkend="errcodes-appendix"/>). There is not currently a way to declare user-defined exception names, although you can throw user-chosen SQLSTATE values instead.
ru: Имена исключений, поддерживаемые <application>PL/pgSQL</application>, отличаются от исключений в Oracle. Количество встроенных имён исключений значительно больше (см. <xref remap="4" linkend="errcodes-appendix"/>). В настоящее время нет способа задать пользовательское имя исключения, хотя вместо этого можно вызывать ошибку с заданным пользователем значением SQLSTATE.

source: This is how we could port this procedure to <application>PL/pgSQL</application>: <placeholder-1/> <placeholder-2/> The main functional difference between this procedure and the Oracle equivalent is that the exclusive lock on the <literal>cs_jobs</literal> table will be held until the calling transaction completes. Also, if the caller later aborts (for example due to an error), the effects of this procedure will be rolled back.
ru: В <application>PL/pgSQL</application> эту процедуру можно портировать так: <placeholder-1/> <placeholder-2/> Основное функциональное отличие между этой процедурой и Oracle эквивалента в том, что монопольная блокировка таблицы <literal>cs_jobs</literal> будет продолжаться до окончания вызывающей транзакции. Кроме того, если впоследствии работа вызывающей программы прервётся (например из-за ошибки), произойдёт откат всех действий, выполненных в этой процедуре.

source: Other Things to Watch For
ru: На что ещё обратить внимание

source: This section explains a few other things to watch for when porting Oracle <application>PL/SQL</application> functions to <productname>PostgreSQL</productname>.
ru: В этом разделе рассматриваются ещё несколько вещей, на которые нужно обращать внимание при портировании функций из Oracle <application>PL/SQL</application> в <productname>PostgreSQL</productname>.

source: Implicit Rollback after Exceptions
ru: Неявный откат изменений после возникновения исключения

source: BEGIN SAVEPOINT s1; ... code here ... EXCEPTION WHEN ... THEN ROLLBACK TO s1; ... code here ... WHEN ... THEN ROLLBACK TO s1; ... code here ... END;
ru: BEGIN SAVEPOINT s1; ... здесь код ... EXCEPTION WHEN ... THEN ROLLBACK TO s1; ... здесь код ... WHEN ... THEN ROLLBACK TO s1; ... здесь код ... END;

source: In <application>PL/pgSQL</application>, when an exception is caught by an <literal>EXCEPTION</literal> clause, all database changes since the block's <literal>BEGIN</literal> are automatically rolled back. That is, the behavior is equivalent to what you'd get in Oracle with: <placeholder-1/> If you are translating an Oracle procedure that uses <command>SAVEPOINT</command> and <command>ROLLBACK TO</command> in this style, your task is easy: just omit the <command>SAVEPOINT</command> and <command>ROLLBACK TO</command>. If you have a procedure that uses <command>SAVEPOINT</command> and <command>ROLLBACK TO</command> in a different way then some actual thought will be required.
ru: В <application>PL/pgSQL</application> при перехвате исключения в секции <literal>EXCEPTION</literal> все изменения в базе данных с начала блока автоматически откатываются. В Oracle это эквивалентно следующему: <placeholder-1/> При портировании процедуры Oracle, которая использует <command>SAVEPOINT</command> и <command>ROLLBACK TO</command> в таком же стиле, задача простая: достаточно убрать операторы <command>SAVEPOINT</command> и <command>ROLLBACK TO</command>. Если же <command>SAVEPOINT</command> и <command>ROLLBACK TO</command> используются по-другому, то придётся подумать.
