Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: Use the <command>RAISE</command> statement to report messages and raise errors. <synopsis>RAISE <optional> <replaceable class="parameter">level</replaceable> </optional> '<replaceable class="parameter">format</replaceable>' <optional>, <replaceable class="parameter">expression</replaceable> <optional>, ... </optional></optional> <optional> USING <replaceable class="parameter">option</replaceable> = <replaceable class="parameter">expression</replaceable> <optional>, ... </optional> </optional>; RAISE <optional> <replaceable class="parameter">level</replaceable> </optional> <replaceable class="parameter">condition_name</replaceable> <optional> USING <replaceable class="parameter">option</replaceable> = <replaceable class="parameter">expression</replaceable> <optional>, ... </optional> </optional>; RAISE <optional> <replaceable class="parameter">level</replaceable> </optional> SQLSTATE '<replaceable class="parameter">sqlstate</replaceable>' <optional> USING <replaceable class="parameter">option</replaceable> = <replaceable class="parameter">expression</replaceable> <optional>, ... </optional> </optional>; RAISE <optional> <replaceable class="parameter">level</replaceable> </optional> USING <replaceable class="parameter">option</replaceable> = <replaceable class="parameter">expression</replaceable> <optional>, ... </optional>; RAISE ;</synopsis> The <replaceable class="parameter">level</replaceable> option specifies the error severity. Allowed levels are <literal>DEBUG</literal>, <literal>LOG</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, and <literal>EXCEPTION</literal>, with <literal>EXCEPTION</literal> being the default. <literal>EXCEPTION</literal> raises an error (which normally aborts the current transaction); the other levels only generate messages of different priority levels. Whether messages of a particular priority are reported to the client, written to the server log, or both is controlled by the <xref linkend="guc-log-min-messages"/> and <xref linkend="guc-client-min-messages"/> configuration variables. See <xref linkend="runtime-config"/> for more information.
ru: Команда <command>RAISE</command> предназначена для вывода сообщений и вызова ошибок. <synopsis>RAISE <optional> <replaceable class="parameter">уровень</replaceable> </optional> '<replaceable class="parameter">формат</replaceable>' <optional>, <replaceable class="parameter">выражение</replaceable> <optional>, ... </optional></optional> <optional> USING <replaceable class="parameter">параметр</replaceable> = <replaceable class="parameter">значение</replaceable> <optional>, ... </optional> </optional>; RAISE <optional> <replaceable class="parameter">уровень</replaceable> </optional> <replaceable class="parameter">имя_условия</replaceable> <optional> USING <replaceable class="parameter">параметр</replaceable> = <replaceable class="parameter">выражение</replaceable> <optional>, ... </optional> </optional>; RAISE <optional> <replaceable class="parameter">уровень</replaceable> </optional> SQLSTATE '<replaceable class="parameter">sqlstate</replaceable>' <optional> USING <replaceable class="parameter">параметр</replaceable> = <replaceable class="parameter">выражение</replaceable> <optional>, ... </optional> </optional>; RAISE <optional> <replaceable class="parameter">уровень</replaceable> </optional> USING <replaceable class="parameter">параметр</replaceable> = <replaceable class="parameter">выражение</replaceable> <optional>, ... </optional>; RAISE ;</synopsis> <replaceable class="parameter">уровень</replaceable> задаёт уровень важности ошибки. Возможные значения: <literal>DEBUG</literal>, <literal>LOG</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal> и <literal>EXCEPTION</literal>. По умолчанию используется <literal>EXCEPTION</literal>. <literal>EXCEPTION</literal> вызывает ошибку (что обычно прерывает текущую транзакцию), остальные значения <replaceable class="parameter">уровня</replaceable> только генерируют сообщения с различными уровнями приоритета. Будут ли сообщения конкретного приоритета переданы клиенту или записаны в журнал сервера, или и то, и другое, зависит от конфигурационных переменных <xref linkend="guc-log-min-messages"/> и <xref linkend="guc-client-min-messages"/>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="runtime-config"/>.

source: After <replaceable class="parameter">level</replaceable> if any, you can write a <replaceable class="parameter">format</replaceable> (which must be a simple string literal, not an expression). The format string specifies the error message text to be reported. The format string can be followed by optional argument expressions to be inserted into the message. Inside the format string, <literal>%</literal> is replaced by the string representation of the next optional argument's value. Write <literal>%%</literal> to emit a literal <literal>%</literal>. The number of arguments must match the number of <literal>%</literal> placeholders in the format string, or an error is raised during the compilation of the function.
ru: После указания <replaceable class="parameter">уровня</replaceable>, если оно есть, можно задать <replaceable class="parameter">формат</replaceable> (это должна быть простая строковая константа, не выражение). Строка формата определяет вид текста об ошибке, который будет выдан. За строкой формата могут следовать необязательные выражения аргументов, которые будут вставлены в сообщение. Внутри строки формата знак <literal>%</literal> заменяется строковым представлением значения очередного аргумента. Чтобы выдать символ <literal>%</literal> буквально, продублируйте его (как <literal>%%</literal>). Число аргументов должно совпадать с числом местозаполнителей <literal>%</literal> в строке формата, иначе при компиляции функции возникнет ошибка.

source: RAISE NOTICE 'Calling cs_create_job(%)', v_job_id;
ru: RAISE NOTICE 'Вызов функции cs_create_job(%)', v_job_id;

source: In this example, the value of <literal>v_job_id</literal> will replace the <literal>%</literal> in the string: <placeholder-1/>
ru: В следующем примере символ <literal>%</literal> будет заменён на значение <literal>v_job_id</literal>: <placeholder-1/>

source: Sets the error message text. This option can't be used in the form of <command>RAISE</command> that includes a format string before <literal>USING</literal>.
ru: Устанавливает текст сообщения об ошибке. Этот параметр не может использоваться, если в команде <command>RAISE</command> присутствует <replaceable class="parameter">format</replaceable> перед <literal>USING</literal>.

source: Supplies an error detail message.
ru: Предоставляет детальное сообщение об ошибке.

source: Supplies a hint message.
ru: Предоставляет подсказку по вызванной ошибке.

source: Specifies the error code (SQLSTATE) to report, either by condition name, as shown in <xref linkend="errcodes-appendix"/>, or directly as a five-character SQLSTATE code.
ru: Устанавливает код ошибки (<literal>SQLSTATE</literal>). Код ошибки задаётся либо по имени, как показано в <xref remap="6" linkend="errcodes-appendix"/>, или напрямую, пятисимвольный код <literal>SQLSTATE</literal>.

source: Supplies the name of a related object.
ru: Предоставляет имя соответствующего объекта, связанного с ошибкой.

source: You can attach additional information to the error report by writing <literal>USING</literal> followed by <replaceable class="parameter">option</replaceable> = <replaceable class="parameter">expression</replaceable> items. Each <replaceable class="parameter">expression</replaceable> can be any string-valued expression. The allowed <replaceable class="parameter">option</replaceable> key words are: <placeholder-1/>
ru: При помощи <literal>USING</literal> и последующих элементов <replaceable class="parameter">option</replaceable> = <replaceable class="parameter">expression</replaceable> можно добавить дополнительную информацию к отчёту об ошибке. Все <replaceable class="parameter">expression</replaceable> представляют собой строковые выражения. Возможные ключевые слова для <replaceable class="parameter">option</replaceable> следующие: <placeholder-1/>

source: RAISE EXCEPTION 'Nonexistent ID --&gt; %', user_id USING HINT = 'Please check your user ID';
ru: RAISE EXCEPTION 'Несуществующий ID --&gt; %', user_id USING HINT = 'Проверьте ваш пользовательский ID';

source: This example will abort the transaction with the given error message and hint: <placeholder-1/>
ru: Этот пример прерывает транзакцию и устанавливает сообщение об ошибке с подсказкой: <placeholder-1/>

source: These two examples show equivalent ways of setting the SQLSTATE: <placeholder-1/>
ru: Следующие два примера демонстрируют эквивалентные способы задания <literal>SQLSTATE</literal>: <placeholder-1/>

source: RAISE unique_violation USING MESSAGE = 'Duplicate user ID: ' || user_id;
ru: RAISE unique_violation USING MESSAGE = 'ID пользователя уже существует: ' || user_id;

source: There is a second <command>RAISE</command> syntax in which the main argument is the condition name or SQLSTATE to be reported, for example: <placeholder-1/> In this syntax, <literal>USING</literal> can be used to supply a custom error message, detail, or hint. Another way to do the earlier example is <placeholder-2/>
ru: У команды <command>RAISE</command> есть и другой синтаксис, в котором в качестве главного аргумента используется имя или код <literal>SQLSTATE</literal> ошибки. Например: <placeholder-1/> Предложение <literal>USING</literal> в этом синтаксисе можно использовать для того, чтобы переопределить стандартное сообщение об ошибке, детальное сообщение, подсказку. Ещё один вариант предыдущего примера: <placeholder-2/>

source: Still another variant is to write <literal>RAISE USING</literal> or <literal>RAISE <replaceable class="parameter">level</replaceable> USING</literal> and put everything else into the <literal>USING</literal> list.
ru: Ещё один вариант — использовать <literal>RAISE USING</literal> или <literal>RAISE <replaceable class="parameter">level</replaceable> USING</literal>, а всё остальное записать в списке <literal>USING</literal>.

source: The last variant of <command>RAISE</command> has no parameters at all. This form can only be used inside a <literal>BEGIN</literal> block's <literal>EXCEPTION</literal> clause; it causes the error currently being handled to be re-thrown.
ru: И заключительный вариант, в котором <command>RAISE</command> не имеет параметров вообще. Эта форма может использоваться только в секции <literal>EXCEPTION</literal> блока и предназначена для того, чтобы повторно вызвать ошибку, которая сейчас перехвачена и обрабатывается.

source: Before <productname>PostgreSQL</productname> 9.1, <command>RAISE</command> without parameters was interpreted as re-throwing the error from the block containing the active exception handler. Thus an <literal>EXCEPTION</literal> clause nested within that handler could not catch it, even if the <command>RAISE</command> was within the nested <literal>EXCEPTION</literal> clause's block. This was deemed surprising as well as being incompatible with Oracle's PL/SQL.
ru: До версии <productname>PostgreSQL</productname> 9.1 команда <command>RAISE</command> без параметров всегда вызывала ошибку с выходом из блока, содержащего активную секцию <literal>EXCEPTION</literal>. Эту ошибку нельзя было перехватить, даже если <command>RAISE</command> в секции <literal>EXCEPTION</literal> поместить во вложенный блок со своей секцией <literal>EXCEPTION</literal>. Это было сочтено удивительным и не совместимым с Oracle PL/SQL.

source: If no condition name nor SQLSTATE is specified in a <command>RAISE EXCEPTION</command> command, the default is to use <literal>RAISE_EXCEPTION</literal> (<literal>P0001</literal>). If no message text is specified, the default is to use the condition name or SQLSTATE as message text.
ru: Если в команде <command>RAISE EXCEPTION</command> не задано ни имя, ни <literal>SQLSTATE</literal> код, то по умолчанию используются <literal>RAISE_EXCEPTION</literal> (<literal>P0001</literal>). В качестве текста сообщения об ошибке (если не задан) используется имя или <literal>SQLSTATE</literal> код.

source: When specifying an error code by SQLSTATE code, you are not limited to the predefined error codes, but can select any error code consisting of five digits and/or upper-case ASCII letters, other than <literal>00000</literal>. It is recommended that you avoid throwing error codes that end in three zeroes, because these are category codes and can only be trapped by trapping the whole category.
ru: При задании <literal>SQLSTATE</literal> кода необязательно использовать только список предопределённых кодов ошибок. В качестве кода ошибки может быть любое пятисимвольное значение, состоящее из цифр и/или ASCII символов в верхнем регистре, кроме <literal>00000</literal>. Не рекомендуется использовать коды ошибок, которые заканчиваются на <literal>000</literal>, потому что так обозначаются коды категорий. И чтобы их перехватить, нужно перехватывать целую категорию.

source: Checking Assertions
ru: Проверка утверждений

source: <primary>ASSERT</primary><secondary>in PL/pgSQL</secondary>
ru: <primary>ASSERT</primary><secondary>в PL/pgSQL</secondary>

source: <primary>assertions</primary><secondary>in PL/pgSQL</secondary>
ru: <primary>утверждения</primary><secondary>в PL/pgSQL</secondary>

source: <primary><varname>plpgsql.check_asserts</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>plpgsql.check_asserts</varname></primary>

source: The <command>ASSERT</command> statement is a convenient shorthand for inserting debugging checks into <application>PL/pgSQL</application> functions. <synopsis>ASSERT <replaceable class="parameter">condition</replaceable> <optional> , <replaceable class="parameter">message</replaceable> </optional>;</synopsis> The <replaceable class="parameter">condition</replaceable> is a Boolean expression that is expected to always evaluate to true; if it does, the <command>ASSERT</command> statement does nothing further. If the result is false or null, then an <literal>ASSERT_FAILURE</literal> exception is raised. (If an error occurs while evaluating the <replaceable class="parameter">condition</replaceable>, it is reported as a normal error.)
ru: Оператор <command>ASSERT</command> представляет удобное средство вставлять отладочные проверки в функции <application>PL/pgSQL</application>. <synopsis>ASSERT <replaceable class="parameter">условие</replaceable> <optional> , <replaceable class="parameter">сообщение</replaceable> </optional>;</synopsis> Здесь <replaceable class="parameter">условие</replaceable> — это булевское выражение, которое, как ожидается, должно быть всегда истинным; если это так, оператор <command>ASSERT</command> больше ничего не делает. Если же оно возвращает ложь или NULL, этот оператор выдаёт исключение <literal>ASSERT_FAILURE</literal>. (Если ошибка происходит при вычислении <replaceable class="parameter">условия</replaceable>, она выдаётся как обычная ошибка.)

source: If the optional <replaceable class="parameter">message</replaceable> is provided, it is an expression whose result (if not null) replaces the default error message text <quote>assertion failed</quote>, should the <replaceable class="parameter">condition</replaceable> fail. The <replaceable class="parameter">message</replaceable> expression is not evaluated in the normal case where the assertion succeeds.
ru: Если в нём задаётся необязательное <replaceable class="parameter">сообщение</replaceable>, результат этого выражения (если он не NULL) заменяет сообщение об ошибке по умолчанию <quote>assertion failed</quote> (нарушение истинности), в случае, если <replaceable class="parameter">условие</replaceable> не выполняется. В обычном случае, когда условие утверждения выполняется, выражение <replaceable class="parameter">сообщения</replaceable> не вычисляется.

source: Testing of assertions can be enabled or disabled via the configuration parameter <literal>plpgsql.check_asserts</literal>, which takes a Boolean value; the default is <literal>on</literal>. If this parameter is <literal>off</literal> then <command>ASSERT</command> statements do nothing.
ru: Проверку утверждений можно включить или отключить с помощью конфигурационного параметра <literal>plpgsql.check_asserts</literal>, принимающего булевское значение; по умолчанию она включена (<literal>on</literal>). Если этот параметр отключён (<literal>off</literal>), операторы <command>ASSERT</command> ничего не делают.

source: Note that <command>ASSERT</command> is meant for detecting program bugs, not for reporting ordinary error conditions. Use the <command>RAISE</command> statement, described above, for that.
ru: Учтите, что оператор <command>ASSERT</command> предназначен для выявления программных дефектов, а не для вывода обычных ошибок (для этого используется оператор <command>RAISE</command>, описанный выше).

source: Trigger Procedures
ru: Триггерные процедуры

source: Triggers on Data Changes
ru: Триггеры на изменение данных

source: Data type <type>RECORD</type>; variable holding the new database row for <command>INSERT</command>/<command>UPDATE</command> operations in row-level triggers. This variable is unassigned in statement-level triggers and for <command>DELETE</command> operations.
ru: Тип данных <type>RECORD</type>. Переменная содержит новую строку базы данных для команд <command>INSERT</command>/<command>UPDATE</command> в триггерах уровня строки. В триггерах уровня оператора и для команды <command>DELETE</command> этой переменной значение не присваивается.

source: Data type <type>RECORD</type>; variable holding the old database row for <command>UPDATE</command>/<command>DELETE</command> operations in row-level triggers. This variable is unassigned in statement-level triggers and for <command>INSERT</command> operations.
ru: Тип данных <type>RECORD</type>. Переменная содержит старую строку базы данных для команд <command>UPDATE</command>/<command>DELETE</command> в триггерах уровня строки. В триггерах уровня оператора и для команды <command>INSERT</command> этой переменной значение не присваивается.

source: Data type <type>name</type>; variable that contains the name of the trigger actually fired.
ru: Тип данных <type>name</type>. Переменная содержит имя сработавшего триггера.

source: Data type <type>text</type>; a string of <literal>BEFORE</literal>, <literal>AFTER</literal>, or <literal>INSTEAD OF</literal>, depending on the trigger's definition.
ru: Тип данных <type>text</type>. Строка, содержащая <literal>BEFORE</literal>, <literal>AFTER</literal> или <literal>INSTEAD OF</literal>, в зависимости от определения триггера.

source: Data type <type>text</type>; a string of either <literal>ROW</literal> or <literal>STATEMENT</literal> depending on the trigger's definition.
ru: Тип данных <type>text</type>. Строка, содержащая <literal>ROW</literal> или <literal>STATEMENT</literal>, в зависимости от определения триггера.

source: Data type <type>text</type>; a string of <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, or <literal>TRUNCATE</literal> telling for which operation the trigger was fired.
ru: Тип данных <type>text</type>. Строка, содержащая <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> или <literal>TRUNCATE</literal>, в зависимости от того, для какой операции сработал триггер.

source: Data type <type>oid</type>; the object ID of the table that caused the trigger invocation.
ru: Тип данных <type>oid</type>. OID таблицы, для которой сработал триггер.

source: Data type <type>name</type>; the name of the table that caused the trigger invocation. This is now deprecated, and could disappear in a future release. Use <literal>TG_TABLE_NAME</literal> instead.
ru: Тип данных <type>name</type>. Имя таблицы, для которой сработал триггер. Эта переменная устарела и может стать недоступной в будущих релизах. Вместо неё нужно использовать <literal>TG_TABLE_NAME</literal>.

source: Data type <type>name</type>; the name of the table that caused the trigger invocation.
ru: Тип данных <type>name</type>. Имя таблицы, для которой сработал триггер.

source: Data type <type>name</type>; the name of the schema of the table that caused the trigger invocation.
ru: Тип данных <type>name</type>. Имя схемы, содержащей таблицу, для которой сработал триггер.

source: Data type <type>integer</type>; the number of arguments given to the trigger procedure in the <command>CREATE TRIGGER</command> statement.
ru: Тип данных <type>integer</type>. Число аргументов в команде <command>CREATE TRIGGER</command>, которые передаются в триггерную процедуру.

source: Data type array of <type>text</type>; the arguments from the <command>CREATE TRIGGER</command> statement. The index counts from 0. Invalid indexes (less than 0 or greater than or equal to <varname>tg_nargs</varname>) result in a null value.
ru: Тип данных массив <type>text</type>. Аргументы от оператора <command>CREATE TRIGGER</command>. Индекс массива начинается с 0. Для недопустимых значений индекса ( &lt; 0 или &gt;= <varname>tg_nargs</varname>) возвращается NULL.

source: When a <application>PL/pgSQL</application> function is called as a trigger, several special variables are created automatically in the top-level block. They are: <placeholder-1/>
ru: Когда функция на <application>PL/pgSQL</application> срабатывает как триггер, в блоке верхнего уровня автоматически создаются несколько специальных переменных: <placeholder-1/>

source: A trigger function must return either <symbol>NULL</symbol> or a record/row value having exactly the structure of the table the trigger was fired for.
ru: Триггерная функция должна вернуть либо <symbol>NULL</symbol>, либо запись/строку, соответствующую структуре таблице, для которой сработал триггер.
