Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: <application>PL/pgSQL</application> (or more precisely, the SPI manager) can furthermore attempt to cache the execution plan associated with any particular prepared statement. If a cached plan is not used, then a fresh execution plan is generated on each visit to the statement, and the current parameter values (that is, <application>PL/pgSQL</application> variable values) can be used to optimize the selected plan. If the statement has no parameters, or is executed many times, the SPI manager will consider creating a <firstterm>generic</firstterm> plan that is not dependent on specific parameter values, and caching that for re-use. Typically this will happen only if the execution plan is not very sensitive to the values of the <application>PL/pgSQL</application> variables referenced in it. If it is, generating a plan each time is a net win. See <xref linkend="sql-prepare"/> for more information about the behavior of prepared statements.
ru: Кроме того, <application>PL/pgSQL</application> (точнее, менеджер интерфейса программирования сервера) будет пытаться кешировать план выполнения для любого подготовленного к исполнению оператора. При каждом вызове оператора, если не используется план из кеша, генерируется новый план выполнения, и текущие значения параметров (то есть значения переменных <application>PL/pgSQL</application>) могут быть использованы для оптимизации нового плана. Если оператор не имеет параметров или выполняется много раз, менеджер интерфейса программирования сервера рассмотрит вопрос о создании и кешировании (для повторного использования) общего плана, не зависящего от значений параметров. Как правило, это происходит в тех случаях, когда план выполнения не очень чувствителен к имеющимся ссылкам на значения переменных <application>PL/pgSQL</application>. В противном случае, выгоднее каждый раз формировать новый план. Более подробно поведение подготовленных операторов рассматривается в <xref remap="6" linkend="sql-prepare"/>.

source: Because <application>PL/pgSQL</application> saves prepared statements and sometimes execution plans in this way, SQL commands that appear directly in a <application>PL/pgSQL</application> function must refer to the same tables and columns on every execution; that is, you cannot use a parameter as the name of a table or column in an SQL command. To get around this restriction, you can construct dynamic commands using the <application>PL/pgSQL</application> <command>EXECUTE</command> statement &mdash; at the price of performing new parse analysis and constructing a new execution plan on every execution.
ru: Чтобы <application>PL/pgSQL</application> мог сохранять подготовленные операторы и планы выполнения, команды SQL в коде <application>PL/pgSQL</application>, должны использовать одни и те же таблицы и столбцы при каждом исполнении. А это значит, что в SQL-командах нельзя использовать названия таблиц и столбцов в качестве параметров. Чтобы обойти это ограничение, нужно построить динамическую команду для оператора <application>PL/pgSQL</application> <command>EXECUTE</command> &mdash; ценой будет разбор и построение нового плана выполнения при каждом вызове.

source: The mutable nature of record variables presents another problem in this connection. When fields of a record variable are used in expressions or statements, the data types of the fields must not change from one call of the function to the next, since each expression will be analyzed using the data type that is present when the expression is first reached. <command>EXECUTE</command> can be used to get around this problem when necessary.
ru: Изменчивая природа переменных типа <type>record</type> представляет ещё одну проблему в этой связи. Когда поля переменной типа <type>record</type> используются в выражениях или операторах, типы данных полей не должны меняться от одного вызова функции к другому, так как при анализе каждого выражения будет использоваться тот тип данных, который присутствовал при первом вызове. При необходимости можно использовать <command>EXECUTE</command> для решения этой проблемы.

source: If the same function is used as a trigger for more than one table, <application>PL/pgSQL</application> prepares and caches statements independently for each such table &mdash; that is, there is a cache for each trigger function and table combination, not just for each function. This alleviates some of the problems with varying data types; for instance, a trigger function will be able to work successfully with a column named <literal>key</literal> even if it happens to have different types in different tables.
ru: Если функция используется в качестве триггера более чем для одной таблицы, <application>PL/pgSQL</application> независимо подготавливает и кеширует операторы для каждой такой таблицы. То есть создаётся кеш для каждой комбинации триггерная функция + таблица, а не только для каждой функции. Это устраняет некоторые проблемы, связанные с различными типами данных. Например, триггерная функция сможет успешно работать со столбцом <literal>key</literal>, даже если в разных таблицах этот столбец имеет разные типы данных.

source: Likewise, functions having polymorphic argument types have a separate statement cache for each combination of actual argument types they have been invoked for, so that data type differences do not cause unexpected failures.
ru: Таким же образом, функции с полиморфными типами аргументов имеют отдельный кеш для каждой комбинации фактических типов аргументов, так что различия типов данных не вызывают неожиданных сбоев.

source: Statement caching can sometimes have surprising effects on the interpretation of time-sensitive values. For example there is a difference between what these two functions do: <placeholder-1/> and: <placeholder-2/>
ru: Кеширование операторов иногда приводит к неожиданным эффектам при интерпретации чувствительных ко времени значений. Например, есть разница между тем, что делают эти две функции: <placeholder-1/> и <placeholder-2/>

source: In the case of <function>logfunc1</function>, the <productname>PostgreSQL</productname> main parser knows when analyzing the <command>INSERT</command> that the string <literal>'now'</literal> should be interpreted as <type>timestamp</type>, because the target column of <classname>logtable</classname> is of that type. Thus, <literal>'now'</literal> will be converted to a <type>timestamp</type> constant when the <command>INSERT</command> is analyzed, and then used in all invocations of <function>logfunc1</function> during the lifetime of the session. Needless to say, this isn't what the programmer wanted. A better idea is to use the <literal>now()</literal> or <literal>current_timestamp</literal> function.
ru: В случае <function>logfunc1</function>, при анализе <command>INSERT</command>, основной анализатор <productname>PostgreSQL</productname> знает, что строку <literal>'now'</literal> следует толковать как <type>timestamp</type>, потому что целевой столбец таблицы <classname>logtable</classname> имеет такой тип данных. Таким образом, <literal>'now'</literal> будет преобразовано в константу <type>timestamp</type> при анализе <command>INSERT</command>, а затем эта константа будет использоваться в последующих вызовах <function>logfunc1</function> в течение всей сессии. Разумеется, это не то, что хотел программист. Лучше было бы использовать функцию <literal>now()</literal> или <literal>current_timestamp</literal>.

source: In the case of <function>logfunc2</function>, the <productname>PostgreSQL</productname> main parser does not know what type <literal>'now'</literal> should become and therefore it returns a data value of type <type>text</type> containing the string <literal>now</literal>. During the ensuing assignment to the local variable <varname>curtime</varname>, the <application>PL/pgSQL</application> interpreter casts this string to the <type>timestamp</type> type by calling the <function>text_out</function> and <function>timestamp_in</function> functions for the conversion. So, the computed time stamp is updated on each execution as the programmer expects. Even though this happens to work as expected, it's not terribly efficient, so use of the <literal>now()</literal> function would still be a better idea.
ru: В случае <function>logfunc2</function>, основной анализатор <productname>PostgreSQL</productname> не знает, какого типа будет <literal>'now'</literal> и поэтому возвращает значение типа <type>text</type>, содержащее строку <literal>now</literal>. При последующем присвоении локальной переменной <varname>curtime</varname> интерпретатор <application>PL/pgSQL</application> приводит эту строку к типу <type>timestamp</type>, вызывая функции <function>text_out</function> и <function>timestamp_in</function>. Таким образом, метка времени будет обновляться при каждом выполнении, как и ожидается программистом. И хотя всё работает как ожидалось, это ужасно неэффективно, поэтому использование функции <literal>now()</literal> по-прежнему значительно лучше.

source: Tips for Developing in <application>PL/pgSQL</application>
ru: Советы по разработке на <application>PL/pgSQL</application>

source: One good way to develop in <application>PL/pgSQL</application> is to use the text editor of your choice to create your functions, and in another window, use <application>psql</application> to load and test those functions. If you are doing it this way, it is a good idea to write the function using <command>CREATE OR REPLACE FUNCTION</command>. That way you can just reload the file to update the function definition. For example: <placeholder-1/>
ru: Хороший способ разрабатывать на <application>PL/pgSQL</application> заключается в том, чтобы в одном окне с текстовым редактором по выбору создавать тексты функций, а в другом окне с <application>psql</application> загружать и тестировать эти функции. В таком случае удобно записывать функцию, используя <command>CREATE OR REPLACE FUNCTION</command>. Таким образом, можно легко загрузить файл для обновления определения функции. Например: <placeholder-1/>

source: While running <application>psql</application>, you can load or reload such a function definition file with: <placeholder-1/> and then immediately issue SQL commands to test the function.
ru: В <application>psql</application>, можно загрузить или перезагрузить такой файл определения функции, выполнив: <placeholder-1/> а затем сразу выполнять команды SQL для тестирования функции.

source: Another good way to develop in <application>PL/pgSQL</application> is with a GUI database access tool that facilitates development in a procedural language. One example of such a tool is <application>pgAdmin</application>, although others exist. These tools often provide convenient features such as escaping single quotes and making it easier to recreate and debug functions.
ru: Ещё один хороший способ разрабатывать на <application>PL/pgSQL</application> связан с использованием GUI инструментов, облегчающих разработку на процедурном языке. Один из примеров такого инструмента <application>pgAdmin</application>, хотя есть и другие. Такие инструменты часто предоставляют удобные возможности, такие как экранирование одинарных кавычек, отладка и повторное создание функций.

source: Handling of Quotation Marks
ru: Обработка кавычек

source: The code of a <application>PL/pgSQL</application> function is specified in <command>CREATE FUNCTION</command> as a string literal. If you write the string literal in the ordinary way with surrounding single quotes, then any single quotes inside the function body must be doubled; likewise any backslashes must be doubled (assuming escape string syntax is used). Doubling quotes is at best tedious, and in more complicated cases the code can become downright incomprehensible, because you can easily find yourself needing half a dozen or more adjacent quote marks. It's recommended that you instead write the function body as a <quote>dollar-quoted</quote> string literal (see <xref linkend="sql-syntax-dollar-quoting"/>). In the dollar-quoting approach, you never double any quote marks, but instead take care to choose a different dollar-quoting delimiter for each level of nesting you need. For example, you might write the <command>CREATE FUNCTION</command> command as: <placeholder-1/> Within this, you might use quote marks for simple literal strings in SQL commands and <literal>$$</literal> to delimit fragments of SQL commands that you are assembling as strings. If you need to quote text that includes <literal>$$</literal>, you could use <literal>$Q$</literal>, and so on.
ru: Код функции на <application>PL/pgSQL</application> указывается в команде <command>CREATE FUNCTION</command> в виде строки. Если писать строку в обычном порядке, внутри одинарных кавычек, то любой символ одинарной кавычки должен быть удвоен, также как и должен быть удвоен каждый знак обратной косой черты (если используется синтаксис с экранированием в строках). Удвоение кавычек в лучшем случае утомительно, а в более сложных случаях код может стать совершенно непонятным, так как легко может потребоваться полудюжина или более кавычек идущих подряд. Вместо этого при создании тела функции рекомендуется использовать знаки доллара в качестве кавычек (см. <xref remap="4" linkend="sql-syntax-dollar-quoting"/>). При таком подходе никогда не потребуется дублировать кавычки, но придётся позаботиться о том, чтобы иметь разные долларовые разделители для каждого уровня вложенности. Например, команду <command>CREATE FUNCTION</command> можно записать так: <placeholder-1/> Внутри можно использовать кавычки для простых текстовых строк и <literal>$$</literal> для разграничения фрагментов SQL-команды, собираемой из отдельных строк. Если нужно взять в кавычки текст, который включает <literal>$$</literal>, можно использовать <literal>$Q$</literal>, и так далее.

source: The following chart shows what you have to do when writing quote marks without dollar quoting. It might be useful when translating pre-dollar quoting code into something more comprehensible.
ru: Следующая таблица показывает, как применяются знаки кавычек, если не используется экранирование долларами. Это может быть полезно при переводе кода, не использующего экранирование знаками доллара, в нечто более понятное.

source: 1 quotation mark
ru: 1 кавычка

source: To begin and end the function body, for example: <placeholder-1/> Anywhere within a single-quoted function body, quote marks <emphasis>must</emphasis> appear in pairs.
ru: В начале и конце тела функции, например: <placeholder-1/> Внутри такой функции любая кавычка <emphasis>должна</emphasis> дублироваться.

source: 2 quotation marks
ru: 2 кавычки

source: For string literals inside the function body, for example: <placeholder-1/> In the dollar-quoting approach, you'd just write: <placeholder-2/> which is exactly what the <application>PL/pgSQL</application> parser would see in either case.
ru: Для строковых литералов внутри тела функции, например: <placeholder-1/> При использовании знаков доллара можно просто написать: <placeholder-2/> и именно это увидит исполнитель <application>PL/pgSQL</application> в обоих случаях.

source: 4 quotation marks
ru: 4 кавычки

source: When you need a single quotation mark in a string constant inside the function body, for example: <placeholder-1/> The value actually appended to <literal>a_output</literal> would be: <literal> AND name LIKE 'foobar' AND xyz</literal>.
ru: Когда нужны одинарные кавычки в строковой константе внутри тела функции, например: <placeholder-1/> К <literal>a_output</literal> будет добавлено: <literal> AND name LIKE 'foobar' AND xyz</literal>

source: In the dollar-quoting approach, you'd write: <placeholder-1/> being careful that any dollar-quote delimiters around this are not just <literal>$$</literal>.
ru: При использовании знаков доллара это записывается так: <placeholder-1/> будьте внимательны, при этом не должно быть внешнего долларового разделителя <literal>$$</literal>.

source: 6 quotation marks
ru: 6 кавычек

source: When a single quotation mark in a string inside the function body is adjacent to the end of that string constant, for example: <placeholder-1/> The value appended to <literal>a_output</literal> would then be: <literal> AND name LIKE 'foobar'</literal>.
ru: Когда нужны одинарные кавычки в строковой константе внутри тела функции, при этом кавычки находятся в конце строковой константы. Например: <placeholder-1/> К <literal>a_output</literal> будет добавлено: <literal> AND name LIKE 'foobar'</literal>.

source: In the dollar-quoting approach, this becomes: <placeholder-1/>
ru: При использовании знаков доллара это записывается так: <placeholder-1/>

source: 10 quotation marks
ru: 10 кавычек

source: When you want two single quotation marks in a string constant (which accounts for 8 quotation marks) and this is adjacent to the end of that string constant (2 more). You will probably only need that if you are writing a function that generates other functions, as in <xref linkend="plpgsql-porting-ex2"/>. For example: <placeholder-1/> The value of <literal>a_output</literal> would then be: <placeholder-2/>
ru: Когда нужны две одиночные кавычки в строковой константе (это уже 8 кавычек), примыкающие к концу строковой константы (ещё 2). Вероятно, такое может понадобиться при разработке функции, которая генерирует другие функции, как показано в <xref remap="6" linkend="plpgsql-porting-ex2"/>. Например: <placeholder-1/> Значение <literal>a_output</literal> затем будет: <placeholder-2/>

source: In the dollar-quoting approach, this becomes: <placeholder-1/> where we assume we only need to put single quote marks into <literal>a_output</literal>, because it will be re-quoted before use.
ru: При использовании знаков доллара: <placeholder-1/> где предполагается, что нужны только одиночные кавычки в <literal>a_output</literal>, так как потребуется повторное взятие в кавычки перед использованием.

source: Additional Compile-time Checks
ru: Дополнительные проверки во время компиляции

source: To aid the user in finding instances of simple but common problems before they cause harm, <application>PL/PgSQL</application> provides additional <replaceable>checks</replaceable>. When enabled, depending on the configuration, they can be used to emit either a <literal>WARNING</literal> or an <literal>ERROR</literal> during the compilation of a function. A function which has received a <literal>WARNING</literal> can be executed without producing further messages, so you are advised to test in a separate development environment.
ru: Чтобы помочь найти и предупредить простые, но часто встречающиеся проблемы, <application>PL/PgSQL</application> предоставляет дополнительные проверки <replaceable>checks</replaceable>. Если они включены в конфигурации, то во время компиляции функций будут выдаваться дополнительные сообщения <literal>WARNING</literal> или ошибки <literal>ERROR</literal>. Функция, при компиляции которой выдавалось <literal>WARNING</literal>, при последующем выполнении не будет выдавать это сообщение и её можно протестировать в отдельной среде разработки.

source: Checks if a declaration shadows a previously defined variable.
ru: Проверяет, что объявление новой переменной не скрывает ранее объявленную переменную.

source: These additional checks are enabled through the configuration variables <varname>plpgsql.extra_warnings</varname> for warnings and <varname>plpgsql.extra_errors</varname> for errors. Both can be set either to a comma-separated list of checks, <literal>"none"</literal> or <literal>"all"</literal>. The default is <literal>"none"</literal>. Currently the list of available checks includes only one: <placeholder-1/> The following example shows the effect of <varname>plpgsql.extra_warnings</varname> set to <varname>shadowed_variables</varname>: <placeholder-2/>
ru: Для включения этих проверок используются параметры конфигурации <varname>plpgsql.extra_warnings</varname> для предупреждений и <varname>plpgsql.extra_errors</varname> для ошибок. Каждому из параметров можно присвоить список значений, разделённый через запятую, значение <literal>"none"</literal> или <literal>"all"</literal>. По умолчанию используется <literal>"none"</literal>. В настоящий момент доступна только одна проверка: <placeholder-1/> Следующий пример показывает эффект от установки <varname>plpgsql.extra_warnings</varname> в значение <varname>shadowed_variables</varname>: <placeholder-2/>

source: Porting from <productname>Oracle</productname> PL/SQL
ru: Портирование из <productname>Oracle</productname> PL/SQL

source: This section explains differences between <productname>PostgreSQL</productname>'s <application>PL/pgSQL</application> language and Oracle's <application>PL/SQL</application> language, to help developers who port applications from <trademark class="registered">Oracle</trademark> to <productname>PostgreSQL</productname>.
ru: В этом разделе рассматриваются различия между языками <productname>PostgreSQL</productname> <application>PL/pgSQL</application> и Oracle <application>PL/SQL</application>, чтобы помочь разработчикам, переносящим приложения из <trademark class="registered">Oracle</trademark> в <productname>PostgreSQL</productname>.

source: If a name used in a SQL command could be either a column name of a table or a reference to a variable of the function, <application>PL/SQL</application> treats it as a column name. This corresponds to <application>PL/pgSQL</application>'s <literal>plpgsql.variable_conflict</literal> = <literal>use_column</literal> behavior, which is not the default, as explained in <xref linkend="plpgsql-var-subst"/>. It's often best to avoid such ambiguities in the first place, but if you have to port a large amount of code that depends on this behavior, setting <literal>variable_conflict</literal> may be the best solution.
ru: Если имя, используемое в SQL-команде, может быть как именем столбца таблицы, так и ссылкой на переменную функции, то <application>PL/SQL</application> считает, что это имя столбца таблицы. Это соответствует поведению <application>PL/pgSQL</application> при <literal>plpgsql.variable_conflict</literal> = <literal>use_column</literal>, что не является значением по умолчанию, как описано в <xref remap="6" linkend="plpgsql-var-subst"/>. В первую очередь, было бы правильно избегать таких двусмысленностей, но если требуется портировать большое количество кода, зависящее от данного поведения, то установка переменной <literal>variable_conflict</literal> может быть лучшим решением.

source: In <productname>PostgreSQL</productname> the function body must be written as a string literal. Therefore you need to use dollar quoting or escape single quotes in the function body. (See <xref linkend="plpgsql-quote-tips"/>.)
ru: В <productname>PostgreSQL</productname> тело функции должно быть записано в виде строки. Поэтому нужно использовать знак доллара в качестве кавычек или экранировать одиночные кавычки в теле функции. (См. <xref remap="4" linkend="plpgsql-quote-tips"/>.)

source: Data type names often need translation. For example, in Oracle string values are commonly declared as being of type <type>varchar2</type>, which is a non-SQL-standard type. In <productname>PostgreSQL</productname>, use type <type>varchar</type> or <type>text</type> instead. Similarly, replace type <type>number</type> with <type>numeric</type>, or use some other numeric data type if there's a more appropriate one.
ru: Имена типов данных часто требуют корректировки. Например, в Oracle строковые значения часто объявляются с типом <type>varchar2</type>, не являющимся стандартным типом SQL. В <productname>PostgreSQL</productname> вместо него нужно использовать <type>varchar</type> или <type>text</type>. Подобным образом, тип <type>number</type> нужно заменять на <type>numeric</type> или другой числовой тип, если найдётся более подходящий.
