Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: <application>PL/pgSQL</application> - <acronym>SQL</acronym> Procedural Language
ru: <application>PL/pgSQL</application> — процедурный язык <acronym>SQL</acronym>

source: Overview
ru: Обзор

source: can be used to create functions and trigger procedures,
ru: используется для создания функций и триггеров,

source: adds control structures to the <acronym>SQL</acronym> language,
ru: добавляет управляющие структуры к языку <acronym>SQL</acronym>,

source: can perform complex computations,
ru: может выполнять сложные вычисления,

source: inherits all user-defined types, functions, and operators,
ru: наследует все пользовательские типы, функции и операторы,

source: can be defined to be trusted by the server,
ru: может быть определён как доверенный язык,

source: is easy to use.
ru: прост в использовании.

source: <application>PL/pgSQL</application> is a loadable procedural language for the <productname>PostgreSQL</productname> database system. The design goals of <application>PL/pgSQL</application> were to create a loadable procedural language that <placeholder-1/>
ru: <application>PL/pgSQL</application> это процедурный язык для СУБД <productname>PostgreSQL</productname>. Целью проектирования <application>PL/pgSQL</application> было создание загружаемого процедурного языка, который: <placeholder-1/>

source: Functions created with <application>PL/pgSQL</application> can be used anywhere that built-in functions could be used. For example, it is possible to create complex conditional computation functions and later use them to define operators or use them in index expressions.
ru: Функции <application>PL/pgSQL</application> могут использоваться везде, где допустимы встроенные функции. Например, можно создать функции со сложными вычислениями и условной логикой, а затем использовать их при определении операторов или в индексных выражениях.

source: In <productname>PostgreSQL</productname> 9.0 and later, <application>PL/pgSQL</application> is installed by default. However it is still a loadable module, so especially security-conscious administrators could choose to remove it.
ru: В версии <productname>PostgreSQL</productname> 9.0 и выше, <application>PL/pgSQL</application> устанавливается по умолчанию. Тем не менее, это по-прежнему загружаемый модуль и администраторы, особо заботящиеся о безопасности, могут удалить его при необходимости.

source: Advantages of Using <application>PL/pgSQL</application>
ru: Преимущества использования <application>PL/pgSQL</application>

source: <acronym>SQL</acronym> is the language <productname>PostgreSQL</productname> and most other relational databases use as query language. It's portable and easy to learn. But every <acronym>SQL</acronym> statement must be executed individually by the database server.
ru: <productname>PostgreSQL</productname> и большинство других СУБД используют <acronym>SQL</acronym> в качестве языка запросов. <acronym>SQL</acronym> хорошо переносим и прост в изучении. Однако каждый оператор <acronym>SQL</acronym> выполняется индивидуально на сервере базы данных.

source: That means that your client application must send each query to the database server, wait for it to be processed, receive and process the results, do some computation, then send further queries to the server. All this incurs interprocess communication and will also incur network overhead if your client is on a different machine than the database server.
ru: Это значит, что ваше клиентское приложение должно каждый запрос отправлять на сервер, ждать пока он будет обработан, получать результат, делать некоторые вычисления, затем отправлять последующие запросы на сервер. Всё это требует межпроцессного взаимодействия, а также несёт нагрузку на сеть, если клиент и сервер базы данных расположены на разных компьютерах.

source: With <application>PL/pgSQL</application> you can group a block of computation and a series of queries <emphasis>inside</emphasis> the database server, thus having the power of a procedural language and the ease of use of SQL, but with considerable savings of client/server communication overhead.
ru: <application>PL/pgSQL</application> позволяет сгруппировать блок вычислений и последовательность запросов <emphasis>внутри</emphasis> сервера базы данных, таким образом, мы получаем силу процедурного языка и простоту использования <acronym>SQL</acronym> при значительной экономии накладных расходов на клиент-серверное взаимодействие.

source: Extra round trips between client and server are eliminated
ru: Исключаются дополнительные обращения между клиентом и сервером

source: Intermediate results that the client does not need do not have to be marshaled or transferred between server and client
ru: Промежуточные ненужные результаты не передаются между сервером и клиентом

source: Multiple rounds of query parsing can be avoided
ru: Есть возможность избежать многочисленных разборов одного запроса

source: This can result in a considerable performance increase as compared to an application that does not use stored functions.
ru: В результате это приводит к значительному увеличению производительности по сравнению с приложением, которое не использует хранимых функций.

source: Also, with <application>PL/pgSQL</application> you can use all the data types, operators and functions of SQL.
ru: Кроме того, <application>PL/pgSQL</application> позволяет использовать все типы данных, операторы и функции <acronym>SQL</acronym>.

source: Supported Argument and Result Data Types
ru: Поддерживаемые типы данных аргументов и возвращаемых значений

source: Functions written in <application>PL/pgSQL</application> can accept as arguments any scalar or array data type supported by the server, and they can return a result of any of these types. They can also accept or return any composite type (row type) specified by name. It is also possible to declare a <application>PL/pgSQL</application> function as returning <type>record</type>, which means that the result is a row type whose columns are determined by specification in the calling query, as discussed in <xref linkend="queries-tablefunctions"/>.
ru: Функции на <application>PL/pgSQL</application> могут принимать в качестве аргументов все поддерживаемые сервером скалярные типы данных или массивы и возвращать в качестве результата любой из этих типов. Они могут принимать и возвращать именованные составные типы (строковый тип). Также есть возможность объявить функцию на <application>PL/pgSQL</application>, возвращающую <type>record</type>, это означает, что результатом является строковый тип, чьи столбцы будут определены в спецификации вызывающего запроса, как описано в <xref remap="6" linkend="queries-tablefunctions"/>.

source: <application>PL/pgSQL</application> functions can be declared to accept a variable number of arguments by using the <literal>VARIADIC</literal> marker. This works exactly the same way as for SQL functions, as discussed in <xref linkend="xfunc-sql-variadic-functions"/>.
ru: Использование маркера <literal>VARIADIC</literal> позволяет объявлять функции на <application>PL/pgSQL</application> с переменным числом аргументов. Это работает точно так же, как и для функций на SQL, как описано в <xref remap="6" linkend="xfunc-sql-variadic-functions"/>.

source: <application>PL/pgSQL</application> functions can also be declared to accept and return the polymorphic types <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type>, and <type>anyrange</type>. The actual data types handled by a polymorphic function can vary from call to call, as discussed in <xref linkend="extend-types-polymorphic"/>. An example is shown in <xref linkend="plpgsql-declaration-parameters"/>.
ru: Функции на <application>PL/pgSQL</application> могут принимать и возвращать полиморфные типы <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type> и <type>anyrange</type>. В таких случаях фактические типы данных могут меняться от вызова к вызову, как описано в <xref linkend="extend-types-polymorphic"/>. Пример показан в <xref remap="6" linkend="plpgsql-declaration-parameters"/>.

source: <application>PL/pgSQL</application> functions can also be declared to return a <quote>set</quote> (or table) of any data type that can be returned as a single instance. Such a function generates its output by executing <command>RETURN NEXT</command> for each desired element of the result set, or by using <command>RETURN QUERY</command> to output the result of evaluating a query.
ru: Функции на <application>PL/pgSQL</application> могут возвращать <quote>множества</quote> (или таблицы) любого типа, которые могут быть возвращены в виде одного объекта. Такие функции генерируют вывод, выполняя команду <command>RETURN NEXT</command> для каждого элемента результирующего набора или <command>RETURN QUERY</command> для вывода результата запроса.

source: Finally, a <application>PL/pgSQL</application> function can be declared to return <type>void</type> if it has no useful return value.
ru: Наконец, при отсутствии полезного возвращаемого значения функция на <application>PL/pgSQL</application> может возвращать <type>void</type>.

source: <application>PL/pgSQL</application> functions can also be declared with output parameters in place of an explicit specification of the return type. This does not add any fundamental capability to the language, but it is often convenient, especially for returning multiple values. The <literal>RETURNS TABLE</literal> notation can also be used in place of <literal>RETURNS SETOF</literal>.
ru: Функции на <application>PL/pgSQL</application> можно объявить с выходными параметрами вместо явного задания типа возвращаемого значения. Это не добавляет никаких фундаментальных возможностей языку, но часто бывает удобно, особенно для возвращения нескольких значений. Нотация <literal>RETURNS TABLE</literal> может использоваться вместо <literal>RETURNS SETOF</literal>.

source: Specific examples appear in <xref linkend="plpgsql-declaration-parameters"/> and <xref linkend="plpgsql-statements-returning"/>.
ru: Конкретные примеры рассматриваются в <xref remap="6" linkend="plpgsql-declaration-parameters"/> и <xref remap="6" linkend="plpgsql-statements-returning"/>.

source: Structure of <application>PL/pgSQL</application>
ru: Структура <application>PL/pgSQL</application>

source: <application>PL/pgSQL</application> is a block-structured language. The complete text of a function definition must be a <firstterm>block</firstterm>. A block is defined as: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> <optional> DECLARE <replaceable>declarations</replaceable> </optional> BEGIN <replaceable>statements</replaceable> END <optional> <replaceable>label</replaceable> </optional>;</synopsis>
ru: <application>PL/pgSQL</application> это блочно-структурированный язык. Текст определения функции должен быть <firstterm>блоком</firstterm>. Структура блока: <synopsis><optional> &lt;&lt;<replaceable>метка</replaceable>&gt;&gt; </optional> <optional> DECLARE <replaceable>объявления</replaceable> </optional> BEGIN <replaceable>операторы</replaceable> END <optional> <replaceable>метка</replaceable> </optional>;</synopsis>

source: Each declaration and each statement within a block is terminated by a semicolon. A block that appears within another block must have a semicolon after <literal>END</literal>, as shown above; however the final <literal>END</literal> that concludes a function body does not require a semicolon.
ru: Каждое объявление и каждый оператор в блоке должны завершаться символом ";"(точка с запятой). Блок, вложенный в другой блок, должен иметь точку с запятой после <literal>END</literal>, как показано выше. Однако финальный <literal>END</literal>, завершающий тело функции, не требует точки с запятой.

source: A common mistake is to write a semicolon immediately after <literal>BEGIN</literal>. This is incorrect and will result in a syntax error.
ru: Распространённой ошибкой является добавление точки с запятой сразу после <literal>BEGIN</literal>. Это неправильно и приведёт к синтаксической ошибке.

source: A <replaceable>label</replaceable> is only needed if you want to identify the block for use in an <literal>EXIT</literal> statement, or to qualify the names of the variables declared in the block. If a label is given after <literal>END</literal>, it must match the label at the block's beginning.
ru: <replaceable>Метка</replaceable> требуется только тогда, когда нужно идентифицировать блок в операторе <literal>EXIT</literal>, или дополнить имена переменных, объявленных в этом блоке. Если метка указана после <literal>END</literal>, то она должна совпадать с меткой в начале блока.

source: All key words are case-insensitive. Identifiers are implicitly converted to lower case unless double-quoted, just as they are in ordinary SQL commands.
ru: Ключевые слова не чувствительны к регистру символов. Как и в обычных SQL-командах, идентификаторы неявно преобразуются к нижнему регистру, если они не взяты в двойные кавычки.

source: Comments work the same way in <application>PL/pgSQL</application> code as in ordinary SQL. A double dash (<literal>--</literal>) starts a comment that extends to the end of the line. A <literal>/*</literal> starts a block comment that extends to the matching occurrence of <literal>*/</literal>. Block comments nest.
ru: Комментарии в <application>PL/pgSQL</application> коде работают так же, как и в обычном SQL. Двойное тире (<literal>--</literal>) начинает комментарий, который завершается в конце строки. Блочный комментарий начинается с <literal>/*</literal> и завершается <literal>*/</literal>. Блочные комментарии могут быть вложенными.

source: CREATE FUNCTION somefunc() RETURNS integer AS $$ &lt;&lt; outerblock &gt;&gt; DECLARE quantity integer := 30; BEGIN RAISE NOTICE 'Quantity here is %', quantity; -- Prints 30 quantity := 50; -- -- Create a subblock -- DECLARE quantity integer := 80; BEGIN RAISE NOTICE 'Quantity here is %', quantity; -- Prints 80 RAISE NOTICE 'Outer quantity here is %', outerblock.quantity; -- Prints 50 END; RAISE NOTICE 'Quantity here is %', quantity; -- Prints 50 RETURN quantity; END; $$ LANGUAGE plpgsql;
ru: CREATE FUNCTION somefunc() RETURNS integer AS $$ &lt;&lt; outerblock &gt;&gt; DECLARE quantity integer := 30; BEGIN RAISE NOTICE 'Сейчас quantity = %', quantity; -- Выводится 30 quantity := 50; -- -- Создаем вложенный блок -- DECLARE quantity integer := 80; BEGIN RAISE NOTICE 'Сейчас quantity = %', quantity; -- Выводится 80 RAISE NOTICE 'Во внешнем блоке quantity = %', outerblock.quantity; -- Выводится 50 END; RAISE NOTICE 'Сейчас quantity = %', quantity; -- Выводится 50 RETURN quantity; END; $$ LANGUAGE plpgsql;

source: Any statement in the statement section of a block can be a <firstterm>subblock</firstterm>. Subblocks can be used for logical grouping or to localize variables to a small group of statements. Variables declared in a subblock mask any similarly-named variables of outer blocks for the duration of the subblock; but you can access the outer variables anyway if you qualify their names with their block's label. For example: <placeholder-1/>
ru: Любой оператор в выполняемой секции блока может быть <firstterm>вложенным блоком</firstterm>. Вложенные блоки используются для логической группировки нескольких операторов или локализации области действия переменных для группы операторов. Во время выполнения вложенного блока переменные, объявленные в нём, скрывают переменные внешних блоков с такими же именами. Чтобы получить доступ к внешним переменным, нужно дополнить их имена меткой блока. Например: <placeholder-1/>

source: There is actually a hidden <quote>outer block</quote> surrounding the body of any <application>PL/pgSQL</application> function. This block provides the declarations of the function's parameters (if any), as well as some special variables such as <literal>FOUND</literal> (see <xref linkend="plpgsql-statements-diagnostics"/>). The outer block is labeled with the function's name, meaning that parameters and special variables can be qualified with the function's name.
ru: Существует скрытый <quote>внешний блок</quote>, окружающий тело каждой функции на <application>PL/pgSQL</application>. Этот блок содержит объявления параметров функции (если они есть), а также некоторые специальные переменные, такие как <literal>FOUND</literal> (см. <xref remap="4" linkend="plpgsql-statements-diagnostics"/>). Этот блок имеет метку, совпадающую с именем функции, таким образом, параметры и специальные переменные могут быть дополнены именем функции.

source: It is important not to confuse the use of <command>BEGIN</command>/<command>END</command> for grouping statements in <application>PL/pgSQL</application> with the similarly-named SQL commands for transaction control. <application>PL/pgSQL</application>'s <command>BEGIN</command>/<command>END</command> are only for grouping; they do not start or end a transaction. Functions and trigger procedures are always executed within a transaction established by an outer query &mdash; they cannot start or commit that transaction, since there would be no context for them to execute in. However, a block containing an <literal>EXCEPTION</literal> clause effectively forms a subtransaction that can be rolled back without affecting the outer transaction. For more about that see <xref linkend="plpgsql-error-trapping"/>.
ru: Важно не путать использование <command>BEGIN</command>/<command>END</command> для группировки операторов в <application>PL/pgSQL</application> с одноименными SQL-командами для управления транзакциями. <command>BEGIN</command>/<command>END</command> в <application>PL/pgSQL</application> служат только для группировки предложений; они не начинают и не заканчивают транзакции. Функции и триггерные процедуры всегда выполняются в рамках транзакции, начатой во внешнем запросе — они не могут начать или завершить эту транзакцию, так как у них внутри нет контекста для выполнения таких действий. Однако блок содержащий секцию <literal>EXCEPTION</literal> создаёт вложенную транзакцию, которая может быть отменена, не затрагивая внешней транзакции. Подробнее это описано в <xref remap="6" linkend="plpgsql-error-trapping"/>.

source: Declarations
ru: Объявления

source: All variables used in a block must be declared in the declarations section of the block. (The only exceptions are that the loop variable of a <literal>FOR</literal> loop iterating over a range of integer values is automatically declared as an integer variable, and likewise the loop variable of a <literal>FOR</literal> loop iterating over a cursor's result is automatically declared as a record variable.)
ru: Все переменные, используемые в блоке, должны быть определены в секции объявления. (За исключением переменной-счётчика цикла <literal>FOR</literal>, которая объявляется автоматически. Для цикла по диапазону чисел автоматически объявляется целочисленная переменная, а для цикла по результатам курсора - переменная типа <literal>record</literal>.)

source: <application>PL/pgSQL</application> variables can have any SQL data type, such as <type>integer</type>, <type>varchar</type>, and <type>char</type>.
ru: Переменные <application>PL/pgSQL</application> могут иметь любой тип данных SQL, такой как <type>integer</type>, <type>varchar</type>, <type>char</type>.

source: Here are some examples of variable declarations: <placeholder-1/>
ru: Примеры объявления переменных: <placeholder-1/>

source: The general syntax of a variable declaration is: <synopsis><replaceable>name</replaceable> <optional> CONSTANT </optional> <replaceable>type</replaceable> <optional> COLLATE <replaceable>collation_name</replaceable> </optional> <optional> NOT NULL </optional> <optional> { DEFAULT | := | = } <replaceable>expression</replaceable> </optional>;</synopsis> The <literal>DEFAULT</literal> clause, if given, specifies the initial value assigned to the variable when the block is entered. If the <literal>DEFAULT</literal> clause is not given then the variable is initialized to the <acronym>SQL</acronym> null value. The <literal>CONSTANT</literal> option prevents the variable from being assigned to after initialization, so that its value will remain constant for the duration of the block. The <literal>COLLATE</literal> option specifies a collation to use for the variable (see <xref linkend="plpgsql-declaration-collation"/>). If <literal>NOT NULL</literal> is specified, an assignment of a null value results in a run-time error. All variables declared as <literal>NOT NULL</literal> must have a nonnull default value specified. Equal (<literal>=</literal>) can be used instead of PL/SQL-compliant <literal>:=</literal>.
ru: Общий синтаксис объявления переменной: <synopsis><replaceable>name</replaceable> <optional> CONSTANT </optional> <replaceable>type</replaceable> <optional> COLLATE <replaceable>collation_name</replaceable> </optional> <optional> NOT NULL </optional> <optional> { DEFAULT | := | = } <replaceable>expression</replaceable> </optional>;</synopsis> Предложение <literal>DEFAULT</literal>, если присутствует, задаёт начальное значение, которое присваивается переменной при входе в блок. Если отсутствует, то переменная инициализируется SQL значением <literal>NULL</literal>. Указание <literal>CONSTANT</literal> предотвращает изменение значения переменной после инициализации, таким образом, значение остаётся постоянным в течение всего блока. Параметр <literal>COLLATE</literal> определяет правило сортировки, которое будет использоваться для этой переменной (см. <xref remap="4" linkend="plpgsql-declaration-collation"/>). Если указано <literal>NOT NULL</literal>, то попытка присвоить <literal>NULL</literal> во время выполнения приведёт к ошибке. Все переменные, объявленные как <literal>NOT NULL</literal>, должны иметь непустые значения по умолчанию. Можно использовать знак равенства (<literal>=</literal>) вместо совместимого с PL/SQL <literal>:=</literal>.

source: A variable's default value is evaluated and assigned to the variable each time the block is entered (not just once per function call). So, for example, assigning <literal>now()</literal> to a variable of type <type>timestamp</type> causes the variable to have the time of the current function call, not the time when the function was precompiled.
ru: Значение по умолчанию вычисляется и присваивается переменной каждый раз при входе в блок (не только при первом вызове функции). Так, например, если переменная типа <type>timestamp</type> имеет функцию <literal>now()</literal> в качестве значения по умолчанию, это приведёт к тому, что переменная всегда будет содержать время текущего вызова функции, а не время, когда функция была предварительно скомпилирована.

source: Examples: <placeholder-1/>
ru: Примеры: <placeholder-1/>

source: Declaring Function Parameters
ru: Объявление параметров функции

source: Parameters passed to functions are named with the identifiers <literal>$1</literal>, <literal>$2</literal>, etc. Optionally, aliases can be declared for <literal>$<replaceable>n</replaceable></literal> parameter names for increased readability. Either the alias or the numeric identifier can then be used to refer to the parameter value.
ru: Переданные в функцию параметры именуются идентификаторами <literal>$1</literal>, <literal>$2</literal> и т. д. Дополнительно, для улучшения читаемости, можно объявить псевдонимы для параметров <literal>$<replaceable>n</replaceable></literal>. Либо псевдоним, либо цифровой идентификатор используются для обозначения параметра.
