Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: The <application>PL/pgSQL</application> version of <command>EXECUTE</command> works similarly to the <application>PL/SQL</application> version, but you have to remember to use <function>quote_literal</function> and <function>quote_ident</function> as described in <xref linkend="plpgsql-statements-executing-dyn"/>. Constructs of the type <literal>EXECUTE 'SELECT * FROM $1';</literal> will not work reliably unless you use these functions.
ru: <application>PL/pgSQL</application> версия <command>EXECUTE</command> работает аналогично версии в <application>PL/SQL</application>, но нужно помнить об использовании <function>quote_literal</function> и <function>quote_ident</function>, как описано в <xref remap="6" linkend="plpgsql-statements-executing-dyn"/>. Без использования этих функций конструкции типа <literal>EXECUTE 'SELECT * FROM $1';</literal> будут работать ненадёжно.

source: Optimizing <application>PL/pgSQL</application> Functions
ru: Оптимизация функций на <application>PL/pgSQL</application>

source: <productname>PostgreSQL</productname> gives you two function creation modifiers to optimize execution: <quote>volatility</quote> (whether the function always returns the same result when given the same arguments) and <quote>strictness</quote> (whether the function returns null if any argument is null). Consult the <xref linkend="sql-createfunction"/> reference page for details.
ru: Для оптимизации исполнения <productname>PostgreSQL</productname> предоставляет два модификатора при создании функции: <quote>изменчивость</quote> (будет ли функция всегда возвращать тот же результат при тех же аргументах) и <quote>строгость</quote> (возвращает ли функция NULL, если хотя бы один из аргументов NULL). Для получения подробной информации обратитесь к справочной странице <xref linkend="sql-createfunction"/>.

source: When making use of these optimization attributes, your <command>CREATE FUNCTION</command> statement might look something like this: <placeholder-1/>
ru: При использовании этих атрибутов оптимизации оператор <command>CREATE FUNCTION</command> может выглядеть примерно так: <placeholder-1/>

source: Appendix
ru: Приложение

source: This section contains the code for a set of Oracle-compatible <function>instr</function> functions that you can use to simplify your porting efforts.
ru: Этот раздел содержит код для совместимых с Oracle функций <function>instr</function>, которые можно использовать для упрощения портирования.

source: <primary><function>instr</function> function</primary>
ru: <primary>функция <function>instr</function></primary>
