Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: With the <literal>LOOP</literal>, <literal>EXIT</literal>, <literal>CONTINUE</literal>, <literal>WHILE</literal>, <literal>FOR</literal>, and <literal>FOREACH</literal> statements, you can arrange for your <application>PL/pgSQL</application> function to repeat a series of commands.
ru: Операторы <literal>LOOP</literal>, <literal>EXIT</literal>, <literal>CONTINUE</literal>, <literal>WHILE</literal>, <literal>FOR</literal> и <literal>FOREACH</literal> позволяют повторить серию команд в функции на <application>PL/pgSQL</application>.

source: label
ru: метка

source: <literal>LOOP</literal> defines an unconditional loop that is repeated indefinitely until terminated by an <literal>EXIT</literal> or <command>RETURN</command> statement. The optional <replaceable>label</replaceable> can be used by <literal>EXIT</literal> and <literal>CONTINUE</literal> statements within nested loops to specify which loop those statements refer to.
ru: <literal>LOOP</literal> организует безусловный цикл, который повторяется до бесконечности, пока не будет прекращён операторами <literal>EXIT</literal> или <command>RETURN</command>. Для вложенных циклов можно использовать <replaceable>label</replaceable> в операторах <literal>EXIT</literal> и <literal>CONTINUE</literal>, чтобы указать к какому циклу эти операторы относятся.

source: If no <replaceable>label</replaceable> is given, the innermost loop is terminated and the statement following <literal>END LOOP</literal> is executed next. If <replaceable>label</replaceable> is given, it must be the label of the current or some outer level of nested loop or block. Then the named loop or block is terminated and control continues with the statement after the loop's/block's corresponding <literal>END</literal>.
ru: Если <replaceable>label</replaceable> не указана, то завершается самый внутренний цикл, далее выполняется оператор, следующий за <literal>END LOOP</literal>. Если <replaceable>label</replaceable> указана, то она должна относиться к текущему или внешнему циклу, или это может быть метка блока. При этом в именованном цикле/блоке выполнение прекращается, а управление переходит к следующему оператору после соответствующего <literal>END</literal>.

source: If <literal>WHEN</literal> is specified, the loop exit occurs only if <replaceable>boolean-expression</replaceable> is true. Otherwise, control passes to the statement after <literal>EXIT</literal>.
ru: При наличии <literal>WHEN</literal> цикл прекращается, только если <replaceable>boolean-expression</replaceable> истинно. В противном случае управление переходит к оператору следующему за <literal>EXIT</literal>.

source: <literal>EXIT</literal> can be used with all types of loops; it is not limited to use with unconditional loops.
ru: <literal>EXIT</literal> можно использовать со всеми типами циклов, не только с безусловным.

source: When used with a <literal>BEGIN</literal> block, <literal>EXIT</literal> passes control to the next statement after the end of the block. Note that a label must be used for this purpose; an unlabeled <literal>EXIT</literal> is never considered to match a <literal>BEGIN</literal> block. (This is a change from pre-8.4 releases of <productname>PostgreSQL</productname>, which would allow an unlabeled <literal>EXIT</literal> to match a <literal>BEGIN</literal> block.)
ru: Когда <literal>EXIT</literal> используется для выхода из блока, управление переходит к следующему оператору после окончания блока. Обратите внимание, что для выхода из блока нужно обязательно указывать <replaceable>label</replaceable>. <literal>EXIT</literal> без <replaceable>label</replaceable> не позволяет прекратить работу блока. (Это изменение по сравнению с версиями <productname>PostgreSQL</productname> до 8.4, в которых разрешалось использовать <literal>EXIT</literal> без <replaceable>label</replaceable> для прекращения работы текущего блока.)

source: LOOP -- some computations IF count &gt; 0 THEN EXIT; -- exit loop END IF; END LOOP; LOOP -- some computations EXIT WHEN count &gt; 0; -- same result as previous example END LOOP; &lt;&lt;ablock&gt;&gt; BEGIN -- some computations IF stocks &gt; 100000 THEN EXIT ablock; -- causes exit from the BEGIN block END IF; -- computations here will be skipped when stocks &gt; 100000 END;
ru: LOOP -- здесь вычисления IF count &gt; 0 THEN EXIT; -- выход из цикла END IF; END LOOP; LOOP -- здесь вычисления EXIT WHEN count &gt; 0; -- аналогично предыдущему примеру END LOOP; &lt;&lt;ablock&gt;&gt; BEGIN -- здесь вычисления IF stocks &gt; 100000 THEN EXIT ablock; -- выход из блока ablock END IF; -- вычисления не будут выполнены, если stocks &gt; 100000 END;

source: If no <replaceable>label</replaceable> is given, the next iteration of the innermost loop is begun. That is, all statements remaining in the loop body are skipped, and control returns to the loop control expression (if any) to determine whether another loop iteration is needed. If <replaceable>label</replaceable> is present, it specifies the label of the loop whose execution will be continued.
ru: Если <replaceable>label</replaceable> не указана, то начинается следующая итерация самого внутреннего цикла. То есть все оставшиеся в цикле операторы пропускаются, и управление переходит к управляющему выражению цикла (если есть) для определения, нужна ли ещё одна итерация цикла. Если <replaceable>label</replaceable> присутствует, то она указывает на метку цикла, выполнение которого будет продолжено.

source: If <literal>WHEN</literal> is specified, the next iteration of the loop is begun only if <replaceable>boolean-expression</replaceable> is true. Otherwise, control passes to the statement after <literal>CONTINUE</literal>.
ru: При наличии <literal>WHEN</literal> следующая итерация цикла начинается только тогда, когда <replaceable>boolean-expression</replaceable> истинно. В противном случае управление переходит к оператору, следующему за <literal>CONTINUE</literal>.

source: <literal>CONTINUE</literal> can be used with all types of loops; it is not limited to use with unconditional loops.
ru: <literal>CONTINUE</literal> можно использовать со всеми типами циклов, не только с безусловным.

source: LOOP -- some computations EXIT WHEN count &gt; 100; CONTINUE WHEN count &lt; 50; -- some computations for count IN [50 .. 100] END LOOP;
ru: LOOP -- здесь вычисления EXIT WHEN count &gt; 100; CONTINUE WHEN count &lt; 50; -- Вычисления для count в диапазоне 50 .. 100 END LOOP;

source: The <literal>WHILE</literal> statement repeats a sequence of statements so long as the <replaceable>boolean-expression</replaceable> evaluates to true. The expression is checked just before each entry to the loop body.
ru: <literal>WHILE</literal> выполняет серию команд до тех пор, пока истинно выражение <replaceable>boolean-expression</replaceable>. Выражение проверяется непосредственно перед каждым входом в тело цикла.

source: WHILE amount_owed &gt; 0 AND gift_certificate_balance &gt; 0 LOOP -- some computations here END LOOP; WHILE NOT done LOOP -- some computations here END LOOP;
ru: WHILE amount_owed &gt; 0 AND gift_certificate_balance &gt; 0 LOOP -- здесь вычисления END LOOP; WHILE NOT done LOOP -- здесь вычисления END LOOP;

source: For example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: <literal>FOR</literal> (Integer Variant)
ru: <literal>FOR</literal> (целочисленный вариант)

source: This form of <literal>FOR</literal> creates a loop that iterates over a range of integer values. The variable <replaceable>name</replaceable> is automatically defined as type <type>integer</type> and exists only inside the loop (any existing definition of the variable name is ignored within the loop). The two expressions giving the lower and upper bound of the range are evaluated once when entering the loop. If the <literal>BY</literal> clause isn't specified the iteration step is 1, otherwise it's the value specified in the <literal>BY</literal> clause, which again is evaluated once on loop entry. If <literal>REVERSE</literal> is specified then the step value is subtracted, rather than added, after each iteration.
ru: В этой форме цикла <literal>FOR</literal> итерации выполняются по диапазону целых чисел. Переменная <replaceable>name</replaceable> автоматически определяется с типом <type>integer</type> и существует только внутри цикла (если уже существует переменная с таким именем, то внутри цикла она будет игнорироваться). Выражения для нижней и верхней границы диапазона чисел вычисляются один раз при входе в цикл. Если не указано <literal>BY</literal>, то шаг итерации 1, в противном случае используется значение в <literal>BY</literal>, которое вычисляется, опять же, один раз при входе в цикл. Если указано <literal>REVERSE</literal>, то после каждой итерации величина шага вычитается, а не добавляется.

source: FOR i IN 1..10 LOOP -- i will take on the values 1,2,3,4,5,6,7,8,9,10 within the loop END LOOP; FOR i IN REVERSE 10..1 LOOP -- i will take on the values 10,9,8,7,6,5,4,3,2,1 within the loop END LOOP; FOR i IN REVERSE 10..1 BY 2 LOOP -- i will take on the values 10,8,6,4,2 within the loop END LOOP;
ru: FOR i IN 1..10 LOOP -- внутри цикла переменная i будет иметь значения 1,2,3,4,5,6,7,8,9,10 END LOOP; FOR i IN REVERSE 10..1 LOOP -- внутри цикла переменная i будет иметь значения 10,9,8,7,6,5,4,3,2,1 END LOOP; FOR i IN REVERSE 10..1 BY 2 LOOP -- внутри цикла переменная i будет иметь значения 10,8,6,4,2 END LOOP;

source: Some examples of integer <literal>FOR</literal> loops: <placeholder-1/>
ru: Примеры целочисленного <literal>FOR</literal>: <placeholder-1/>

source: If the lower bound is greater than the upper bound (or less than, in the <literal>REVERSE</literal> case), the loop body is not executed at all. No error is raised.
ru: Если нижняя граница цикла больше верхней границы (или меньше, в случае <literal>REVERSE</literal>), то тело цикла не выполняется вообще. При этом ошибка не возникает.

source: If a <replaceable>label</replaceable> is attached to the <literal>FOR</literal> loop then the integer loop variable can be referenced with a qualified name, using that <replaceable>label</replaceable>.
ru: Если у цикла есть метка, то к переменной цикла можно обращаться по имени, дополненному меткой.

source: Looping Through Query Results
ru: Цикл по результатам запроса

source: CREATE FUNCTION cs_refresh_mviews() RETURNS integer AS $$ DECLARE mviews RECORD; BEGIN RAISE NOTICE 'Refreshing materialized views...'; FOR mviews IN SELECT * FROM cs_materialized_views ORDER BY sort_key LOOP -- Now "mviews" has one record from cs_materialized_views RAISE NOTICE 'Refreshing materialized view %s ...', quote_ident(mviews.mv_name); EXECUTE format('TRUNCATE TABLE %I', mviews.mv_name); EXECUTE format('INSERT INTO %I %s', mviews.mv_name, mviews.mv_query); END LOOP; RAISE NOTICE 'Done refreshing materialized views.'; RETURN 1; END; $$ LANGUAGE plpgsql;
ru: CREATE FUNCTION cs_refresh_mviews() RETURNS integer AS $$ DECLARE mviews RECORD; BEGIN RAISE NOTICE 'Refreshing materialized views...'; FOR mviews IN SELECT * FROM cs_materialized_views ORDER BY sort_key LOOP -- Здесь "mviews" содержит одну запись из cs_materialized_views RAISE NOTICE 'Refreshing materialized view %s ...', quote_ident(mviews.mv_name); EXECUTE format('TRUNCATE TABLE %I', mviews.mv_name); EXECUTE format('INSERT INTO %I %s', mviews.mv_name, mviews.mv_query); END LOOP; RAISE NOTICE 'Done refreshing materialized views.'; RETURN 1; END; $$ LANGUAGE plpgsql;

source: Using a different type of <literal>FOR</literal> loop, you can iterate through the results of a query and manipulate that data accordingly. The syntax is: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOR <replaceable>target</replaceable> IN <replaceable>query</replaceable> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis> The <replaceable>target</replaceable> is a record variable, row variable, or comma-separated list of scalar variables. The <replaceable>target</replaceable> is successively assigned each row resulting from the <replaceable>query</replaceable> and the loop body is executed for each row. Here is an example: <placeholder-1/> If the loop is terminated by an <literal>EXIT</literal> statement, the last assigned row value is still accessible after the loop.
ru: Другой вариант <literal>FOR</literal> позволяет организовать цикл по результатам запроса. Синтаксис: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOR <replaceable>target</replaceable> IN <replaceable>query</replaceable> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis> Переменная <replaceable>target</replaceable> может быть строковой переменной, переменной типа <type>record</type> или разделённым запятыми списком скалярных переменных. В переменную <replaceable>target</replaceable> последовательно присваиваются строки результата запроса, и для каждой строки выполняется тело цикла. Пример: <placeholder-1/> Если цикл завершается по команде <literal>EXIT</literal>, то последняя присвоенная строка доступна и после цикла.

source: The <replaceable>query</replaceable> used in this type of <literal>FOR</literal> statement can be any SQL command that returns rows to the caller: <command>SELECT</command> is the most common case, but you can also use <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> with a <literal>RETURNING</literal> clause. Some utility commands such as <command>EXPLAIN</command> will work too.
ru: В цикле <literal>FOR</literal> можно использовать любые <literal>SQL</literal>-команды, возвращающие строки. Чаще всего это <command>SELECT</command>, но могут быть и <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command> с предложением <literal>RETURNING</literal>. А также некоторые утилиты, например <command>EXPLAIN</command>.

source: <application>PL/pgSQL</application> variables are substituted into the query text, and the query plan is cached for possible re-use, as discussed in detail in <xref linkend="plpgsql-var-subst"/> and <xref linkend="plpgsql-plan-caching"/>.
ru: Для переменных <application>PL/pgSQL</application> в тексте запроса выполняется подстановка значений, план запроса кешируется для возможного повторного использования, как подробно описано в <xref remap="6" linkend="plpgsql-var-subst"/> и <xref remap="6" linkend="plpgsql-plan-caching"/>.

source: The <literal>FOR-IN-EXECUTE</literal> statement is another way to iterate over rows: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOR <replaceable>target</replaceable> IN EXECUTE <replaceable>text_expression</replaceable> <optional> USING <replaceable>expression</replaceable> <optional>, ... </optional> </optional> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis> This is like the previous form, except that the source query is specified as a string expression, which is evaluated and replanned on each entry to the <literal>FOR</literal> loop. This allows the programmer to choose the speed of a preplanned query or the flexibility of a dynamic query, just as with a plain <command>EXECUTE</command> statement. As with <command>EXECUTE</command>, parameter values can be inserted into the dynamic command via <literal>USING</literal>.
ru: Ещё одна разновидность этого типа цикла <literal>FOR-IN-EXECUTE</literal>: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOR <replaceable>target</replaceable> IN EXECUTE <replaceable>text_expression</replaceable> <optional> USING <replaceable>expression</replaceable> <optional>, ... </optional> </optional> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis> Она похожа на предыдущую форму, за исключением того, что текст запроса указывается в виде строкового выражения. Текст запроса формируется и для него строится план выполнения при каждом входе в цикл. Это даёт программисту выбор между скоростью предварительно разобранного запроса и гибкостью динамического запроса, так же, как и в случае с обычным оператором <command>EXECUTE</command>. Как и в <command>EXECUTE</command>, значения параметров могут быть добавлены в команду с использованием <literal>USING</literal>.

source: Another way to specify the query whose results should be iterated through is to declare it as a cursor. This is described in <xref linkend="plpgsql-cursor-for-loop"/>.
ru: Ещё один способ организовать цикл по результатам запроса это объявить курсор. Описание в <xref remap="6" linkend="plpgsql-cursor-for-loop"/>.

source: Looping Through Arrays
ru: Цикл по элементам массива

source: The <literal>FOREACH</literal> loop is much like a <literal>FOR</literal> loop, but instead of iterating through the rows returned by a SQL query, it iterates through the elements of an array value. (In general, <literal>FOREACH</literal> is meant for looping through components of a composite-valued expression; variants for looping through composites besides arrays may be added in future.) The <literal>FOREACH</literal> statement to loop over an array is: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOREACH <replaceable>target</replaceable> <optional> SLICE <replaceable>number</replaceable> </optional> IN ARRAY <replaceable>expression</replaceable> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis>
ru: Цикл <literal>FOREACH</literal> очень похож на <literal>FOR</literal>. Отличие в том, что вместо перебора строк SQL-запроса происходит перебор элементов массива. (В целом, <literal>FOREACH</literal> предназначен для перебора выражений составного типа. Варианты реализации цикла для работы с прочими составными выражениями помимо массивов могут быть добавлены в будущем.) Синтаксис цикла <literal>FOREACH</literal>: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOREACH <replaceable>target</replaceable> <optional> SLICE <replaceable>number</replaceable> </optional> IN ARRAY <replaceable>expression</replaceable> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis>

source: Without <literal>SLICE</literal>, or if <literal>SLICE 0</literal> is specified, the loop iterates through individual elements of the array produced by evaluating the <replaceable>expression</replaceable>. The <replaceable>target</replaceable> variable is assigned each element value in sequence, and the loop body is executed for each element. Here is an example of looping through the elements of an integer array: <placeholder-1/> The elements are visited in storage order, regardless of the number of array dimensions. Although the <replaceable>target</replaceable> is usually just a single variable, it can be a list of variables when looping through an array of composite values (records). In that case, for each array element, the variables are assigned from successive columns of the composite value.
ru: Без указания <literal>SLICE</literal>, или если <literal>SLICE</literal> равен 0, цикл выполняется по всем элементам массива, полученного из <replaceable>expression</replaceable>. В переменную <replaceable>target</replaceable> последовательно присваивается каждый элемент массива и для него выполняется тело цикла. Пример цикла по элементам целочисленного массива: <placeholder-1/> Обход элементов проводится в том порядке, в котором они сохранялись, независимо от размерности массива. Как правило, <replaceable>target</replaceable> это одиночная переменная, но может быть и списком переменных, когда элементы массива имеют составной тип (записи). В этом случае переменным присваиваются значения из последовательных столбцов составного элемента массива.

source: With a positive <literal>SLICE</literal> value, <literal>FOREACH</literal> iterates through slices of the array rather than single elements. The <literal>SLICE</literal> value must be an integer constant not larger than the number of dimensions of the array. The <replaceable>target</replaceable> variable must be an array, and it receives successive slices of the array value, where each slice is of the number of dimensions specified by <literal>SLICE</literal>. Here is an example of iterating through one-dimensional slices: <placeholder-1/>
ru: При положительном значении <literal>SLICE</literal> <literal>FOREACH</literal> выполняет итерации по срезам массива, а не по отдельным элементам. Значение <literal>SLICE</literal> должно быть целым числом, не превышающим размерности массива. Переменная <replaceable>target</replaceable> должна быть массивом, который получает последовательные срезы исходного массива, где размерность каждого среза задаётся значением <literal>SLICE</literal>. Пример цикла по одномерным срезам: <placeholder-1/>

source: Trapping Errors
ru: Обработка ошибок

source: By default, any error occurring in a <application>PL/pgSQL</application> function aborts execution of the function, and indeed of the surrounding transaction as well. You can trap errors and recover from them by using a <command>BEGIN</command> block with an <literal>EXCEPTION</literal> clause. The syntax is an extension of the normal syntax for a <command>BEGIN</command> block: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> <optional> DECLARE <replaceable>declarations</replaceable> </optional> BEGIN <replaceable>statements</replaceable> EXCEPTION WHEN <replaceable>condition</replaceable> <optional> OR <replaceable>condition</replaceable> ... </optional> THEN <replaceable>handler_statements</replaceable> <optional> WHEN <replaceable>condition</replaceable> <optional> OR <replaceable>condition</replaceable> ... </optional> THEN <replaceable>handler_statements</replaceable> ... </optional> END;</synopsis>
ru: По умолчанию любая возникающая ошибка прерывает выполнение функции на <application>PL/pgSQL</application>, а также транзакцию, относящуюся к этой функции. Использование в блоке секции <literal>EXCEPTION</literal> позволяет перехватывать и обрабатывать ошибки. Синтаксис секции <literal>EXCEPTION</literal> расширяет синтаксис обычного блока: <synopsis><optional> &lt;&lt;<replaceable>метка</replaceable>&gt;&gt; </optional> <optional> DECLARE <replaceable>объявления</replaceable> </optional> BEGIN <replaceable>операторы</replaceable> EXCEPTION WHEN <replaceable>условие</replaceable> <optional> OR <replaceable>условие</replaceable> ... </optional> THEN <replaceable>операторы_обработчика</replaceable> <optional> WHEN <replaceable>условие</replaceable> <optional> OR <replaceable>условие</replaceable> ... </optional> THEN <replaceable>операторы_обработчика</replaceable> ... </optional> END;</synopsis>
