Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: -- -- Main tables - time dimension and sales fact. -- CREATE TABLE time_dimension ( time_key integer NOT NULL, day_of_week integer NOT NULL, day_of_month integer NOT NULL, month integer NOT NULL, quarter integer NOT NULL, year integer NOT NULL ); CREATE UNIQUE INDEX time_dimension_key ON time_dimension(time_key); CREATE TABLE sales_fact ( time_key integer NOT NULL, product_key integer NOT NULL, store_key integer NOT NULL, amount_sold numeric(12,2) NOT NULL, units_sold integer NOT NULL, amount_cost numeric(12,2) NOT NULL ); CREATE INDEX sales_fact_time ON sales_fact(time_key); -- -- Summary table - sales by time. -- CREATE TABLE sales_summary_bytime ( time_key integer NOT NULL, amount_sold numeric(15,2) NOT NULL, units_sold numeric(12) NOT NULL, amount_cost numeric(15,2) NOT NULL ); CREATE UNIQUE INDEX sales_summary_bytime_key ON sales_summary_bytime(time_key); -- -- Function and trigger to amend summarized column(s) on UPDATE, INSERT, DELETE. -- CREATE OR REPLACE FUNCTION maint_sales_summary_bytime() RETURNS TRIGGER AS $maint_sales_summary_bytime$ DECLARE delta_time_key integer; delta_amount_sold numeric(15,2); delta_units_sold numeric(12); delta_amount_cost numeric(15,2); BEGIN -- Work out the increment/decrement amount(s). IF (TG_OP = 'DELETE') THEN delta_time_key = OLD.time_key; delta_amount_sold = -1 * OLD.amount_sold; delta_units_sold = -1 * OLD.units_sold; delta_amount_cost = -1 * OLD.amount_cost; ELSIF (TG_OP = 'UPDATE') THEN -- forbid updates that change the time_key - -- (probably not too onerous, as DELETE + INSERT is how most -- changes will be made). IF ( OLD.time_key != NEW.time_key) THEN RAISE EXCEPTION 'Update of time_key : % -&gt; % not allowed', OLD.time_key, NEW.time_key; END IF; delta_time_key = OLD.time_key; delta_amount_sold = NEW.amount_sold - OLD.amount_sold; delta_units_sold = NEW.units_sold - OLD.units_sold; delta_amount_cost = NEW.amount_cost - OLD.amount_cost; ELSIF (TG_OP = 'INSERT') THEN delta_time_key = NEW.time_key; delta_amount_sold = NEW.amount_sold; delta_units_sold = NEW.units_sold; delta_amount_cost = NEW.amount_cost; END IF; -- Insert or update the summary row with the new values. &lt;&lt;insert_update&gt;&gt; LOOP UPDATE sales_summary_bytime SET amount_sold = amount_sold + delta_amount_sold, units_sold = units_sold + delta_units_sold, amount_cost = amount_cost + delta_amount_cost WHERE time_key = delta_time_key; EXIT insert_update WHEN found; BEGIN INSERT INTO sales_summary_bytime ( time_key, amount_sold, units_sold, amount_cost) VALUES ( delta_time_key, delta_amount_sold, delta_units_sold, delta_amount_cost ); EXIT insert_update; EXCEPTION WHEN UNIQUE_VIOLATION THEN -- do nothing END; END LOOP insert_update; RETURN NULL; END; $maint_sales_summary_bytime$ LANGUAGE plpgsql; CREATE TRIGGER maint_sales_summary_bytime AFTER INSERT OR UPDATE OR DELETE ON sales_fact FOR EACH ROW EXECUTE PROCEDURE maint_sales_summary_bytime(); INSERT INTO sales_fact VALUES(1,1,1,10,3,15); INSERT INTO sales_fact VALUES(1,2,1,20,5,35); INSERT INTO sales_fact VALUES(2,2,1,40,15,135); INSERT INTO sales_fact VALUES(2,3,1,10,1,13); SELECT * FROM sales_summary_bytime; DELETE FROM sales_fact WHERE product_key = 1; SELECT * FROM sales_summary_bytime; UPDATE sales_fact SET units_sold = units_sold * 2; SELECT * FROM sales_summary_bytime;
ru: -- -- Основные таблицы: таблица измерений временных периодов и таблица фактов продаж -- CREATE TABLE time_dimension ( time_key integer NOT NULL, day_of_week integer NOT NULL, day_of_month integer NOT NULL, month integer NOT NULL, quarter integer NOT NULL, year integer NOT NULL ); CREATE UNIQUE INDEX time_dimension_key ON time_dimension(time_key); CREATE TABLE sales_fact ( time_key integer NOT NULL, product_key integer NOT NULL, store_key integer NOT NULL, amount_sold numeric(12,2) NOT NULL, units_sold integer NOT NULL, amount_cost numeric(12,2) NOT NULL ); CREATE INDEX sales_fact_time ON sales_fact(time_key); -- -- Таблица с итогами продаж по периодам -- CREATE TABLE sales_summary_bytime ( time_key integer NOT NULL, amount_sold numeric(15,2) NOT NULL, units_sold numeric(12) NOT NULL, amount_cost numeric(15,2) NOT NULL ); CREATE UNIQUE INDEX sales_summary_bytime_key ON sales_summary_bytime(time_key); -- -- Функция и триггер, обновляющие столбцы с итоговыми значениями при выполнении -- команд INSERT, UPDATE, DELETE -- CREATE OR REPLACE FUNCTION maint_sales_summary_bytime() RETURNS TRIGGER AS $maint_sales_summary_bytime$ DECLARE delta_time_key integer; delta_amount_sold numeric(15,2); delta_units_sold numeric(12); delta_amount_cost numeric(15,2); BEGIN -- определим на сколько произошло увеличение/уменьшение количеств IF (TG_OP = 'DELETE') THEN delta_time_key = OLD.time_key; delta_amount_sold = -1 * OLD.amount_sold; delta_units_sold = -1 * OLD.units_sold; delta_amount_cost = -1 * OLD.amount_cost; ELSIF (TG_OP = 'UPDATE') THEN -- запрещаем изменять time_key -- для таких изменений больше подходит DELETE + INSERT IF ( OLD.time_key != NEW.time_key) THEN RAISE EXCEPTION 'Запрещено изменение time_key : % -&gt; %', OLD.time_key, NEW.time_key; END IF; delta_time_key = OLD.time_key; delta_amount_sold = NEW.amount_sold - OLD.amount_sold; delta_units_sold = NEW.units_sold - OLD.units_sold; delta_amount_cost = NEW.amount_cost - OLD.amount_cost; ELSIF (TG_OP = 'INSERT') THEN delta_time_key = NEW.time_key; delta_amount_sold = NEW.amount_sold; delta_units_sold = NEW.units_sold; delta_amount_cost = NEW.amount_cost; END IF; -- вставляем или обновляем строку в таблице итогов. &lt;&lt;insert_update&gt;&gt; LOOP UPDATE sales_summary_bytime SET amount_sold = amount_sold + delta_amount_sold, units_sold = units_sold + delta_units_sold, amount_cost = amount_cost + delta_amount_cost WHERE time_key = delta_time_key; EXIT insert_update WHEN found; BEGIN INSERT INTO sales_summary_bytime ( time_key, amount_sold, units_sold, amount_cost) VALUES ( delta_time_key, delta_amount_sold, delta_units_sold, delta_amount_cost ); EXIT insert_update; EXCEPTION WHEN UNIQUE_VIOLATION THEN -- ничего не делаем END; END LOOP insert_update; RETURN NULL; END; $maint_sales_summary_bytime$ LANGUAGE plpgsql; CREATE TRIGGER maint_sales_summary_bytime AFTER INSERT OR UPDATE OR DELETE ON sales_fact FOR EACH ROW EXECUTE PROCEDURE maint_sales_summary_bytime(); INSERT INTO sales_fact VALUES(1,1,1,10,3,15); INSERT INTO sales_fact VALUES(1,2,1,20,5,35); INSERT INTO sales_fact VALUES(2,2,1,40,15,135); INSERT INTO sales_fact VALUES(2,3,1,10,1,13); SELECT * FROM sales_summary_bytime; DELETE FROM sales_fact WHERE product_key = 1; SELECT * FROM sales_summary_bytime; UPDATE sales_fact SET units_sold = units_sold * 2; SELECT * FROM sales_summary_bytime;

source: Triggers on Events
ru: Триггеры событий

source: Data type <type>text</type>; a string representing the event the trigger is fired for.
ru: Тип данных <type>text</type>. Строка, содержащая событие, для которого сработал триггер.

source: Data type <type>text</type>; variable that contains the command tag for which the trigger is fired.
ru: Тип данных <type>text</type>. Переменная, содержащая тег команды, для которой сработал триггер.

source: A <application>PL/pgSQL</application> Event Trigger Procedure
ru: Процедура событийного триггера в <application>PL/pgSQL</application>

source: This example trigger simply raises a <literal>NOTICE</literal> message each time a supported command is executed.
ru: Этот пример триггера просто выдаёт сообщение <literal>NOTICE</literal> каждый раз, когда выполняется поддерживаемая команда.

source: CREATE OR REPLACE FUNCTION snitch() RETURNS event_trigger AS $$ BEGIN RAISE NOTICE 'snitch: % %', tg_event, tg_tag; END; $$ LANGUAGE plpgsql; CREATE EVENT TRIGGER snitch ON ddl_command_start EXECUTE PROCEDURE snitch();
ru: CREATE OR REPLACE FUNCTION snitch() RETURNS event_trigger AS $$ BEGIN RAISE NOTICE 'Произошло событие: % %', tg_event, tg_tag; END; $$ LANGUAGE plpgsql; CREATE EVENT TRIGGER snitch ON ddl_command_start EXECUTE PROCEDURE snitch();

source: <application>PL/pgSQL</application> Under the Hood
ru: <application>PL/pgSQL</application> изнутри

source: This section discusses some implementation details that are frequently important for <application>PL/pgSQL</application> users to know.
ru: В этом разделе обсуждаются некоторые детали реализации, которые пользователям <application>PL/pgSQL</application> важно знать.

source: Variable Substitution
ru: Подстановка переменных

source: SQL statements and expressions within a <application>PL/pgSQL</application> function can refer to variables and parameters of the function. Behind the scenes, <application>PL/pgSQL</application> substitutes query parameters for such references. Parameters will only be substituted in places where a parameter or column reference is syntactically allowed. As an extreme case, consider this example of poor programming style: <placeholder-1/> The first occurrence of <literal>foo</literal> must syntactically be a table name, so it will not be substituted, even if the function has a variable named <literal>foo</literal>. The second occurrence must be the name of a column of the table, so it will not be substituted either. Only the third occurrence is a candidate to be a reference to the function's variable.
ru: SQL-операторы и выражения внутри функции на <application>PL/pgSQL</application> могут ссылаться на переменные и параметры этой функции. За кулисами <application>PL/pgSQL</application> заменяет параметры запросов для таких ссылок. Параметры будут заменены только в местах, где параметр или ссылка на столбец синтаксически допустимы. Как крайний случай, рассмотрим следующий пример плохого стиля программирования: <placeholder-1/> Первый раз <literal>foo</literal> появляется на том месте, где синтаксически должно быть имя таблицы, поэтому замены не будет, даже если функция имеет переменную <literal>foo</literal>. Второй раз <literal>foo</literal> встречается там, где должно быть имя столбца таблицы, поэтому замены не будет и здесь. Только третье вхождение <literal>foo</literal> является кандидатом на то, чтобы быть ссылкой на переменную функции.

source: <productname>PostgreSQL</productname> versions before 9.0 would try to substitute the variable in all three cases, leading to syntax errors.
ru: Версии <productname>PostgreSQL</productname> до 9.0 пытаются заменить переменную во всех трёх случаях, что приводит к синтаксической ошибке.

source: Since the names of variables are syntactically no different from the names of table columns, there can be ambiguity in statements that also refer to tables: is a given name meant to refer to a table column, or a variable? Let's change the previous example to <placeholder-1/> Here, <literal>dest</literal> and <literal>src</literal> must be table names, and <literal>col</literal> must be a column of <literal>dest</literal>, but <literal>foo</literal> and <literal>bar</literal> might reasonably be either variables of the function or columns of <literal>src</literal>.
ru: Если имена переменных синтаксически не отличаются от названий столбцов таблицы, то возможна двусмысленность и в ссылках на таблицы. Является ли данное имя ссылкой на столбец таблицы или ссылкой на переменную? Изменим предыдущий пример: <placeholder-1/> Здесь <literal>dest</literal> и <literal>src</literal> должны быть именами таблиц, <literal>col</literal> должен быть столбцом <literal>dest</literal>. Однако, <literal>foo</literal> и <literal>bar</literal> могут быть как переменными функции, так и столбцами <literal>src</literal>.

source: By default, <application>PL/pgSQL</application> will report an error if a name in a SQL statement could refer to either a variable or a table column. You can fix such a problem by renaming the variable or column, or by qualifying the ambiguous reference, or by telling <application>PL/pgSQL</application> which interpretation to prefer.
ru: По умолчанию, <application>PL/pgSQL</application> выдаст ошибку, если имя в операторе SQL может относиться как к переменной, так и к столбцу таблицы. Ситуацию можно исправить переименованием переменной, переименованием столбца, точной квалификацией неоднозначной ссылки или указанием <application>PL/pgSQL</application> машине, какую интерпретацию предпочесть.

source: The simplest solution is to rename the variable or column. A common coding rule is to use a different naming convention for <application>PL/pgSQL</application> variables than you use for column names. For example, if you consistently name function variables <literal>v_<replaceable>something</replaceable></literal> while none of your column names start with <literal>v_</literal>, no conflicts will occur.
ru: Самое простое решение — переименовать переменную или столбец. Общее правило кодирования предполагает использование различных соглашений о наименовании для переменных <application>PL/pgSQL</application> и столбцов таблиц. Например, если имена переменных всегда имеют вид <literal>v_<replaceable>something</replaceable></literal>, а имена столбцов никогда не начинаются на <literal>v_</literal>, то конфликты исключены.

source: Alternatively you can qualify ambiguous references to make them clear. In the above example, <literal>src.foo</literal> would be an unambiguous reference to the table column. To create an unambiguous reference to a variable, declare it in a labeled block and use the block's label (see <xref linkend="plpgsql-structure"/>). For example, <placeholder-1/> Here <literal>block.foo</literal> means the variable even if there is a column <literal>foo</literal> in <literal>src</literal>. Function parameters, as well as special variables such as <literal>FOUND</literal>, can be qualified by the function's name, because they are implicitly declared in an outer block labeled with the function's name.
ru: В качестве альтернативы можно дополнить имена неоднозначных ссылок, чтобы сделать их точными. В приведённом выше примере <literal>src.foo</literal> однозначно бы определялась, как ссылка на столбец таблицы. Чтобы сделать однозначной ссылку на переменную, переменная должна быть объявлена в блоке с меткой, и далее нужно использовать эту метку (см. <xref remap="4" linkend="plpgsql-structure"/>). Например: <placeholder-1/> Здесь <literal>block.foo</literal> ссылается на переменную, даже если в таблице <literal>src</literal> есть столбец <literal>foo</literal>. Параметры функции, а также специальные переменные, такие как <literal>FOUND</literal>, могут быть дополнены именем функции, потому что они неявно объявлены во внешнем блоке, метка которого совпадает с именем функции.

source: Sometimes it is impractical to fix all the ambiguous references in a large body of <application>PL/pgSQL</application> code. In such cases you can specify that <application>PL/pgSQL</application> should resolve ambiguous references as the variable (which is compatible with <application>PL/pgSQL</application>'s behavior before <productname>PostgreSQL</productname> 9.0), or as the table column (which is compatible with some other systems such as <productname>Oracle</productname>).
ru: Иногда может быть не очень практичным исправлять таким способом все неоднозначные ссылки в большом куске <application>PL/pgSQL</application> кода. В таких случаях можно указать, чтобы <application>PL/pgSQL</application> разрешал неоднозначные ссылки в пользу переменных (это совместимо с <application>PL/pgSQL</application> до версии <productname>PostgreSQL</productname> 9.0), или в пользу столбцов таблицы (совместимо с некоторыми другими системами, такими как <productname>Oracle</productname>).

source: To change this behavior on a system-wide basis, set the configuration parameter <literal>plpgsql.variable_conflict</literal> to one of <literal>error</literal>, <literal>use_variable</literal>, or <literal>use_column</literal> (where <literal>error</literal> is the factory default). This parameter affects subsequent compilations of statements in <application>PL/pgSQL</application> functions, but not statements already compiled in the current session. Because changing this setting can cause unexpected changes in the behavior of <application>PL/pgSQL</application> functions, it can only be changed by a superuser.
ru: На уровне всей системы поведение <application>PL/pgSQL</application> регулируется установкой конфигурационного параметра <literal>plpgsql.variable_conflict</literal>, имеющего значения: <literal>error</literal>, <literal>use_variable</literal> или <literal>use_column</literal> (<literal>error</literal> устанавливается по умолчанию при установке системы). Изменение этого параметра влияет на все последующие компиляции операторов в функциях на <application>PL/pgSQL</application>, но не на операторы уже скомпилированные в текущей сессии. Так как изменение этого параметра может привести к неожиданным изменениям в поведении функций на <application>PL/pgSQL</application>, он может быть изменён только суперпользователем.

source: You can also set the behavior on a function-by-function basis, by inserting one of these special commands at the start of the function text: <placeholder-1/> These commands affect only the function they are written in, and override the setting of <literal>plpgsql.variable_conflict</literal>. An example is <placeholder-2/> In the <literal>UPDATE</literal> command, <literal>curtime</literal>, <literal>comment</literal>, and <literal>id</literal> will refer to the function's variable and parameters whether or not <literal>users</literal> has columns of those names. Notice that we had to qualify the reference to <literal>users.id</literal> in the <literal>WHERE</literal> clause to make it refer to the table column. But we did not have to qualify the reference to <literal>comment</literal> as a target in the <literal>UPDATE</literal> list, because syntactically that must be a column of <literal>users</literal>. We could write the same function without depending on the <literal>variable_conflict</literal> setting in this way: <placeholder-3/>
ru: Поведение <application>PL/pgSQL</application> можно изменять для каждой отдельной функции, если добавить в начало функции одну из этих специальных команд: <placeholder-1/> Эти команды влияют только на функцию, в которой они записаны и перекрывают действие <literal>plpgsql.variable_conflict</literal>. Пример: <placeholder-2/> В команде <literal>UPDATE</literal>, <literal>curtime</literal>, <literal>comment</literal> и <literal>id</literal> будут ссылаться на переменные и параметры функции вне зависимости от того, есть ли столбцы с такими именами в таблице <literal>users</literal>. Обратите внимание, что нужно дополнить именем таблицы ссылку на <literal>users.id</literal> в предложении <literal>WHERE</literal>, чтобы она ссылалась на столбец таблицы. При этом необязательно дополнять ссылку на <literal>comment</literal> в левой части списка <literal>UPDATE</literal>, так как синтаксически в этом месте должно быть имя столбца таблицы <literal>users</literal>. Эту функцию можно было бы записать и без зависимости от значения <literal>variable_conflict</literal>: <placeholder-3/>

source: Variable substitution does not happen in the command string given to <command>EXECUTE</command> or one of its variants. If you need to insert a varying value into such a command, do so as part of constructing the string value, or use <literal>USING</literal>, as illustrated in <xref linkend="plpgsql-statements-executing-dyn"/>.
ru: Замена переменных не происходит в строке, исполняемой командой <command>EXECUTE</command> или её вариантом. Если нужно вставлять изменяющиеся значения в такую команду, то это делается либо при построении самой командной строки или с использованием <literal>USING</literal>, как показано в <xref remap="6" linkend="plpgsql-statements-executing-dyn"/>.

source: Variable substitution currently works only in <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> commands, because the main SQL engine allows query parameters only in these commands. To use a non-constant name or value in other statement types (generically called utility statements), you must construct the utility statement as a string and <command>EXECUTE</command> it.
ru: Замена переменных в настоящее время работает только в командах <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>, потому что основная SQL машина допускает использование параметров запроса только в этих командах. Чтобы использовать изменяемые имена или значения в других типах операторов (обычно называются утилиты), необходимо построить текст команды в виде строки и выполнить её в <command>EXECUTE</command>.

source: Plan Caching
ru: Кеширование плана

source: The <application>PL/pgSQL</application> interpreter parses the function's source text and produces an internal binary instruction tree the first time the function is called (within each session). The instruction tree fully translates the <application>PL/pgSQL</application> statement structure, but individual <acronym>SQL</acronym> expressions and <acronym>SQL</acronym> commands used in the function are not translated immediately.
ru: Интерпретатор <application>PL/pgSQL</application> анализирует исходный текст функции и строит внутреннее бинарное дерево инструкций при первом вызове функции (для каждой сессии). В дерево инструкций полностью переводится вся структура операторов <application>PL/pgSQL</application>, но для выражений и команд <acronym>SQL</acronym>, используемых в функции, это происходит не сразу.

source: <placeholder-1/> As each expression and <acronym>SQL</acronym> command is first executed in the function, the <application>PL/pgSQL</application> interpreter parses and analyzes the command to create a prepared statement, using the <acronym>SPI</acronym> manager's <function>SPI_prepare</function> function. Subsequent visits to that expression or command reuse the prepared statement. Thus, a function with conditional code paths that are seldom visited will never incur the overhead of analyzing those commands that are never executed within the current session. A disadvantage is that errors in a specific expression or command cannot be detected until that part of the function is reached in execution. (Trivial syntax errors will be detected during the initial parsing pass, but anything deeper will not be detected until execution.)
ru: <placeholder-1/> При первом выполнении в функции каждого выражения или команды <acronym>SQL</acronym> интерпретатор <application>PL/pgSQL</application> разбирает и анализирует команду для создания подготовленного к выполнению оператора с помощью функции <function>SPI_prepare</function> менеджера интерфейса программирования сервера. Последующие обращения к этому выражению или команде повторно используют подготовленный к выполнению оператор. Таким образом, <acronym>SQL</acronym>-команды, находящиеся в редко посещаемой ветке кода условного оператора, не несут накладных расходов на разбор команд, если они так и не будут выполнены в текущей сессии. Здесь есть недостаток, заключающийся в том, что ошибки в определённом выражении или команде не могут быть обнаружены, пока выполнение не дойдёт до этой части функции. (Тривиальные синтаксические ошибки обнаружатся в ходе первоначального разбора, но ничего более серьёзного не будет обнаружено до исполнения.)
