Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: There are two ways to create an alias. The preferred way is to give a name to the parameter in the <command>CREATE FUNCTION</command> command, for example: <placeholder-1/> The other way is to explicitly declare an alias, using the declaration syntax <synopsis><replaceable>name</replaceable> ALIAS FOR $<replaceable>n</replaceable>;</synopsis> The same example in this style looks like: <placeholder-2/>
ru: Создать псевдоним можно двумя способами. Предпочтительный способ это дать имя параметру в команде <command>CREATE FUNCTION</command>, например: <placeholder-1/> Другой способ это явное объявление псевдонима при помощи синтаксиса: <synopsis><replaceable>name</replaceable> ALIAS FOR $<replaceable>n</replaceable>;</synopsis> Предыдущий пример для этого стиля выглядит так: <placeholder-2/>

source: These two examples are not perfectly equivalent. In the first case, <literal>subtotal</literal> could be referenced as <literal>sales_tax.subtotal</literal>, but in the second case it could not. (Had we attached a label to the inner block, <literal>subtotal</literal> could be qualified with that label, instead.)
ru: Эти два примера не полностью эквивалентны. В первом случае, на <literal>subtotal</literal> можно ссылаться как <literal>sales_tax.subtotal</literal>, а во втором случае такая ссылка невозможна. (Если бы к внутреннему блоку была добавлена метка, то <literal>subtotal</literal> можно было бы дополнить этой меткой.)

source: CREATE FUNCTION instr(varchar, integer) RETURNS integer AS $$ DECLARE v_string ALIAS FOR $1; index ALIAS FOR $2; BEGIN -- some computations using v_string and index here END; $$ LANGUAGE plpgsql; CREATE FUNCTION concat_selected_fields(in_t sometablename) RETURNS text AS $$ BEGIN RETURN in_t.f1 || in_t.f3 || in_t.f5 || in_t.f7; END; $$ LANGUAGE plpgsql;
ru: CREATE FUNCTION instr(varchar, integer) RETURNS integer AS $$ DECLARE v_string ALIAS FOR $1; index ALIAS FOR $2; BEGIN -- здесь вычисления, использующие v_string и index END; $$ LANGUAGE plpgsql; CREATE FUNCTION concat_selected_fields(in_t sometablename) RETURNS text AS $$ BEGIN RETURN in_t.f1 || in_t.f3 || in_t.f5 || in_t.f7; END; $$ LANGUAGE plpgsql;

source: Some more examples: <placeholder-1/>
ru: Ещё несколько примеров: <placeholder-1/>

source: When a <application>PL/pgSQL</application> function is declared with output parameters, the output parameters are given <literal>$<replaceable>n</replaceable></literal> names and optional aliases in just the same way as the normal input parameters. An output parameter is effectively a variable that starts out NULL; it should be assigned to during the execution of the function. The final value of the parameter is what is returned. For instance, the sales-tax example could also be done this way: <placeholder-1/> Notice that we omitted <literal>RETURNS real</literal> &mdash; we could have included it, but it would be redundant.
ru: Когда функция на <application>PL/pgSQL</application> объявляется с выходными параметрами, им выдаются цифровые идентификаторы <literal>$<replaceable>n</replaceable></literal> и для них можно создавать псевдонимы точно таким же способом, как и для обычных входных параметров. Выходной параметр это фактически переменная, стартующая с NULL и которой присваивается значение во время выполнения функции. Возвращается последнее присвоенное значение. Например, функция sales_tax может быть переписана так: <placeholder-1/> Обратите внимание, что мы опустили <literal>RETURNS real</literal> &mdash; хотя можно было и включить, но это было бы излишним.

source: Output parameters are most useful when returning multiple values. A trivial example is: <placeholder-1/> As discussed in <xref linkend="xfunc-output-parameters"/>, this effectively creates an anonymous record type for the function's results. If a <literal>RETURNS</literal> clause is given, it must say <literal>RETURNS record</literal>.
ru: Выходные параметры наиболее полезны для возвращения нескольких значений. Простейший пример: <placeholder-1/> Как обсуждалось в <xref remap="6" linkend="xfunc-output-parameters"/>, здесь фактически создаётся анонимный тип <literal>record</literal> для возвращения результата функции. Если используется предложение <literal>RETURNS</literal>, то оно должна выглядеть как <literal>RETURNS record</literal>.

source: CREATE FUNCTION extended_sales(p_itemno int) RETURNS TABLE(quantity int, total numeric) AS $$ BEGIN RETURN QUERY SELECT s.quantity, s.quantity * s.price FROM sales AS s WHERE s.itemno = p_itemno; END; $$ LANGUAGE plpgsql;
ru: CREATE FUNCTION extended_sales(p_itemno int) RETURNS TABLE(quantity int, total numeric) AS $$ BEGIN RETURN QUERY SELECT s.quantity, s.quantity * s.price FROM sales s WHERE s.itemno = p_itemno; END; $$ LANGUAGE plpgsql;

source: Another way to declare a <application>PL/pgSQL</application> function is with <literal>RETURNS TABLE</literal>, for example: <placeholder-1/> This is exactly equivalent to declaring one or more <literal>OUT</literal> parameters and specifying <literal>RETURNS SETOF <replaceable>sometype</replaceable></literal>.
ru: Есть ещё способ объявить функцию на <application>PL/pgSQL</application> с использованием <literal>RETURNS TABLE</literal>, например: <placeholder-1/> Это в точности соответствует объявлению одного или нескольких параметров <literal>OUT</literal> и указанию <literal>RETURNS SETOF <replaceable>sometype</replaceable></literal>.

source: When the return type of a <application>PL/pgSQL</application> function is declared as a polymorphic type (<type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type>, or <type>anyrange</type>), a special parameter <literal>$0</literal> is created. Its data type is the actual return type of the function, as deduced from the actual input types (see <xref linkend="extend-types-polymorphic"/>). This allows the function to access its actual return type as shown in <xref linkend="plpgsql-declaration-type"/>. <literal>$0</literal> is initialized to null and can be modified by the function, so it can be used to hold the return value if desired, though that is not required. <literal>$0</literal> can also be given an alias. For example, this function works on any data type that has a <literal>+</literal> operator: <placeholder-1/>
ru: Для функции на <application>PL/pgSQL</application>, возвращающей полиморфный тип (<type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type>, <type>anyrange</type>), создаётся специальный параметр <literal>$0</literal>. Его тип данных соответствует типу, фактически возвращаемому функцией, и который устанавливается на основании фактических типов входных параметров (см. <xref remap="4" linkend="extend-types-polymorphic"/>). Это позволяет функции получить доступ к фактически возвращаемому типу данных, как показано в <xref remap="6" linkend="plpgsql-declaration-type"/>. Параметр <literal>$0</literal> инициализируется в <literal>NULL</literal> и его можно изменять внутри функции. Таким образом, его можно использовать для хранения возвращаемого значения, хотя это необязательно. Параметру <literal>$0</literal> можно дать псевдоним. В следующем примере функция работает с любым типом данных, поддерживающим оператор <literal>+</literal>: <placeholder-1/>

source: The same effect can be obtained by declaring one or more output parameters as polymorphic types. In this case the special <literal>$0</literal> parameter is not used; the output parameters themselves serve the same purpose. For example: <placeholder-1/>
ru: Такой же эффект получается при объявлении одного или нескольких выходных параметров полиморфного типа. При этом <literal>$0</literal> не создаётся; выходные параметры сами используются для этой цели. Например: <placeholder-1/>

source: The <literal>ALIAS</literal> syntax is more general than is suggested in the previous section: you can declare an alias for any variable, not just function parameters. The main practical use for this is to assign a different name for variables with predetermined names, such as <varname>NEW</varname> or <varname>OLD</varname> within a trigger procedure.
ru: Синтаксис <literal>ALIAS</literal> более общий, чем предполагалось в предыдущем разделе: псевдонимы можно объявлять для любых переменных, а не только для параметров функции. Основная практическая польза в том, чтобы назначить другие имена переменным с предопределёнными названиями, таким как <varname>NEW</varname> или <varname>OLD</varname> в триггерной процедуре.

source: Since <literal>ALIAS</literal> creates two different ways to name the same object, unrestricted use can be confusing. It's best to use it only for the purpose of overriding predetermined names.
ru: Поскольку <literal>ALIAS</literal> даёт два различных способа именования одних и тех же объектов, то его неограниченное использование может привести к путанице. Лучше всего использовать <literal>ALIAS</literal> для переименования предопределённых имён.

source: Copying Types
ru: Наследование типов данных

source: variable
ru: переменная

source: <literal>%TYPE</literal> provides the data type of a variable or table column. You can use this to declare variables that will hold database values. For example, let's say you have a column named <literal>user_id</literal> in your <literal>users</literal> table. To declare a variable with the same data type as <literal>users.user_id</literal> you write: <placeholder-1/>
ru: Конструкция <literal>%TYPE</literal> предоставляет тип данных переменной или столбца таблицы. Её можно использовать для объявления переменных, содержащих значения из базы данных. Например, для объявления переменной с таким же типом, как и столбец <literal>user_id</literal> в таблице <literal>users</literal> нужно написать: <placeholder-1/>

source: By using <literal>%TYPE</literal> you don't need to know the data type of the structure you are referencing, and most importantly, if the data type of the referenced item changes in the future (for instance: you change the type of <literal>user_id</literal> from <type>integer</type> to <type>real</type>), you might not need to change your function definition.
ru: Используя <literal>%TYPE</literal>, не нужно знать тип данных структуры, на которую вы ссылаетесь. И самое главное, если в будущем тип данных изменится (например: тип данных для <literal>user_id</literal> поменяется с <type>integer</type> на <type>real</type>), то вам может не понадобиться изменять определение функции.

source: <literal>%TYPE</literal> is particularly valuable in polymorphic functions, since the data types needed for internal variables can change from one call to the next. Appropriate variables can be created by applying <literal>%TYPE</literal> to the function's arguments or result placeholders.
ru: Использование <literal>%TYPE</literal> особенно полезно в полиморфных функциях, поскольку типы данных, необходимые для внутренних переменных, могут меняться от одного вызова к другому. Соответствующие переменные могут быть созданы с применением <literal>%TYPE</literal> к аргументам и возвращаемому значению функции.

source: Row Types
ru: Типы кортежей

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: composite_type_name
ru: имя_составного_типа

source: A variable of a composite type is called a <firstterm>row</firstterm> variable (or <firstterm>row-type</firstterm> variable). Such a variable can hold a whole row of a <command>SELECT</command> or <command>FOR</command> query result, so long as that query's column set matches the declared type of the variable. The individual fields of the row value are accessed using the usual dot notation, for example <literal>rowvar.field</literal>.
ru: Переменная составного типа называется <firstterm>строковой</firstterm> переменной (или переменной <firstterm>типа строки</firstterm>). Значением такой переменной может быть целая строка, полученная в результате выполнения запроса <command>SELECT</command> или <command>FOR</command>, при условии, что набор столбцов запроса соответствует заявленному типу переменной. Доступ к отдельным значениям полей строковой переменной осуществляется, как обычно, через точку, например <literal>rowvar.field</literal>.

source: A row variable can be declared to have the same type as the rows of an existing table or view, by using the <replaceable>table_name</replaceable><literal>%ROWTYPE</literal> notation; or it can be declared by giving a composite type's name. (Since every table has an associated composite type of the same name, it actually does not matter in <productname>PostgreSQL</productname> whether you write <literal>%ROWTYPE</literal> or not. But the form with <literal>%ROWTYPE</literal> is more portable.)
ru: Строковая переменная может быть объявлена с таким же типом, как и строка в существующей таблице или представлении, используя нотацию <replaceable>имя_таблицы</replaceable><literal>%ROWTYPE</literal>; или с именем составного типа. (Поскольку каждая таблица имеет соответствующий составной тип с таким же именем, то на самом деле в <productname>PostgreSQL</productname> не имеет значения, пишете ли вы <literal>%ROWTYPE</literal> или нет. Но использование <literal>%ROWTYPE</literal> более переносимо.)

source: Parameters to a function can be composite types (complete table rows). In that case, the corresponding identifier <literal>$<replaceable>n</replaceable></literal> will be a row variable, and fields can be selected from it, for example <literal>$1.user_id</literal>.
ru: Параметры функции могут быть составного типа (строки таблицы). В этом случае соответствующий идентификатор <literal>$<replaceable>n</replaceable></literal> будет строковой переменной, поля которой можно выбирать, например <literal>$1.user_id</literal>.

source: Only the user-defined columns of a table row are accessible in a row-type variable, not the OID or other system columns (because the row could be from a view). The fields of the row type inherit the table's field size or precision for data types such as <type>char(<replaceable>n</replaceable>)</type>.
ru: Только определённые пользователем столбцы таблицы доступны в переменной строкового типа, но не OID или другие системные столбцы (потому что это может быть строка представления). Поля строкового типа наследуют размер и точность от типов данных столбцов таблицы, таких как <type>char(<replaceable>n</replaceable>)</type>.

source: Here is an example of using composite types. <structname>table1</structname> and <structname>table2</structname> are existing tables having at least the mentioned fields: <placeholder-1/>
ru: Ниже приведён пример использования составных типов. <structname>table1</structname> и <structname>table2</structname> это существующие таблицы, имеющие, по меньшей мере, перечисленные столбцы: <placeholder-1/>

source: Record Types
ru: Тип <type>record</type>

source: Record variables are similar to row-type variables, but they have no predefined structure. They take on the actual row structure of the row they are assigned during a <command>SELECT</command> or <command>FOR</command> command. The substructure of a record variable can change each time it is assigned to. A consequence of this is that until a record variable is first assigned to, it has no substructure, and any attempt to access a field in it will draw a run-time error.
ru: Переменные типа <type>record</type> похожи на переменные строкового типа, но они не имеют предопределённой структуры. Они приобретают фактическую структуру от строки, которая им присваивается командами <command>SELECT</command> или <command>FOR</command>. Структура переменной типа <type>record</type> может меняться каждый раз при присвоении значения. Следствием этого является то, что пока значение не присвоено первый раз, переменная типа <type>record</type> не имеет структуры и любая попытка получить доступ к отдельному полю приведёт к ошибке во время исполнения.

source: Note that <literal>RECORD</literal> is not a true data type, only a placeholder. One should also realize that when a <application>PL/pgSQL</application> function is declared to return type <type>record</type>, this is not quite the same concept as a record variable, even though such a function might use a record variable to hold its result. In both cases the actual row structure is unknown when the function is written, but for a function returning <type>record</type> the actual structure is determined when the calling query is parsed, whereas a record variable can change its row structure on-the-fly.
ru: Обратите внимание, что <literal>RECORD</literal> это не подлинный тип данных, а только лишь заполнитель. Также следует понимать, что функция на <application>PL/pgSQL</application>, имеющая тип возвращаемого значения <type>record</type>, это не то же самое, что и переменная типа <type>record</type>, хотя такая функция может использовать переменную типа <type>record</type> для хранения своего результата. В обоих случаях фактическая структура строки неизвестна во время создания функции, но для функции, возвращающей <type>record</type>, фактическая структура определяется во время разбора вызывающего запроса, в то время как переменная типа <type>record</type> может менять свою структуру на лету.

source: Collation of <application>PL/pgSQL</application> Variables
ru: Упорядочение переменных <application>PL/pgSQL</application>

source: When a <application>PL/pgSQL</application> function has one or more parameters of collatable data types, a collation is identified for each function call depending on the collations assigned to the actual arguments, as described in <xref linkend="collation"/>. If a collation is successfully identified (i.e., there are no conflicts of implicit collations among the arguments) then all the collatable parameters are treated as having that collation implicitly. This will affect the behavior of collation-sensitive operations within the function. For example, consider <placeholder-1/> The first use of <function>less_than</function> will use the common collation of <structfield>text_field_1</structfield> and <structfield>text_field_2</structfield> for the comparison, while the second use will use <literal>C</literal> collation.
ru: Когда функция на <application>PL/pgSQL</application> имеет один или несколько параметров сортируемых типов данных, правило сортировки определяется при каждом вызове функции в зависимости от правил сортировки фактических аргументов, как описано в <xref remap="6" linkend="collation"/>. Если оно определено успешно (т. е. среди аргументов нет конфликтов между неявными правилами сортировки), то все соответствующие параметры неявно трактуются как имеющее это правило сортировки. Внутри функции это будет влиять на поведение операторов, зависящих от используемого правила сортировки. Рассмотрим пример: <placeholder-1/> В первом случае <function>less_than</function> будет использовать для сравнения общее правило сортировки для <structfield>text_field_1</structfield> и <structfield>text_field_2</structfield>, в то время как во втором случае будет использоваться правило <literal>C</literal>.

source: Furthermore, the identified collation is also assumed as the collation of any local variables that are of collatable types. Thus this function would not work any differently if it were written as <placeholder-1/>
ru: Кроме того, определённое для вызова функции правило сортировки также будет использоваться для любых локальных переменных соответствующего типа. Таким образом, функция не станет работать по-другому, если её переписать так: <placeholder-1/>

source: If there are no parameters of collatable data types, or no common collation can be identified for them, then parameters and local variables use the default collation of their data type (which is usually the database's default collation, but could be different for variables of domain types).
ru: Если параметров с типами данных, поддерживающими сортировку, нет, или для параметров невозможно определить общее правило сортировки, тогда для параметров и локальных переменных применяются правила, принятые для их типа данных по умолчанию (которые обычно совпадают с правилами сортировки по умолчанию, принятыми для базы данных, но могут отличаться для переменных доменных типов).

source: A local variable of a collatable data type can have a different collation associated with it by including the <literal>COLLATE</literal> option in its declaration, for example <placeholder-1/> This option overrides the collation that would otherwise be given to the variable according to the rules above.
ru: Локальная переменная может иметь правило сортировки, отличное от правила по умолчанию. Для этого используется параметр <literal>COLLATE</literal> в объявлении переменной, например: <placeholder-1/> Этот параметр переопределяет правило сортировки, которое получила бы переменная в соответствии с вышеуказанными правилами.

source: Also, of course explicit <literal>COLLATE</literal> clauses can be written inside a function if it is desired to force a particular collation to be used in a particular operation. For example, <placeholder-1/> This overrides the collations associated with the table columns, parameters, or local variables used in the expression, just as would happen in a plain SQL command.
ru: И, конечно же, можно явно указывать параметр <literal>COLLATE</literal> для конкретных операций внутри функции, если к ним требуется применить конкретное правило сортировки. Например: <placeholder-1/> Как и в обычной SQL-команде, это переопределяет правила сортировки, связанные с полями таблицы, параметрами и локальными переменными, которые используются в данном выражении.

source: Expressions
ru: Выражения
