Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: Row-level triggers fired <literal>BEFORE</literal> can return null to signal the trigger manager to skip the rest of the operation for this row (i.e., subsequent triggers are not fired, and the <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> does not occur for this row). If a nonnull value is returned then the operation proceeds with that row value. Returning a row value different from the original value of <varname>NEW</varname> alters the row that will be inserted or updated. Thus, if the trigger function wants the triggering action to succeed normally without altering the row value, <varname>NEW</varname> (or a value equal thereto) has to be returned. To alter the row to be stored, it is possible to replace single values directly in <varname>NEW</varname> and return the modified <varname>NEW</varname>, or to build a complete new record/row to return. In the case of a before-trigger on <command>DELETE</command>, the returned value has no direct effect, but it has to be nonnull to allow the trigger action to proceed. Note that <varname>NEW</varname> is null in <command>DELETE</command> triggers, so returning that is usually not sensible. The usual idiom in <command>DELETE</command> triggers is to return <varname>OLD</varname>.
ru: Если <literal>BEFORE</literal> триггер уровня строки возвращает <symbol>NULL</symbol>, то все дальнейшие действия с этой строкой прекращаются (т. е. не срабатывают последующие триггеры, команда <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> для этой строки не выполняется). Если возвращается не <symbol>NULL</symbol>, то дальнейшая обработка продолжается именно с этой строкой. Возвращение строки отличной от начальной <varname>NEW</varname>, изменяет строку, которая будет вставлена или изменена. Поэтому, если в триггерной функции нужно выполнить некоторые действия и не менять саму строку, то нужно возвратить переменную <varname>NEW</varname> (или её эквивалент). Для того чтобы изменить сохраняемую строку, можно поменять отдельные значения в переменной <varname>NEW</varname> и затем её вернуть. Либо создать и вернуть полностью новую переменную. В случае строчного триггера <literal>BEFORE</literal> для команды <command>DELETE</command> само возвращаемое значение не имеет прямого эффекта, но оно должно быть отличным от <symbol>NULL</symbol>, чтобы не прерывать обработку строки. Обратите внимание, что переменная <varname>NEW</varname> всегда <symbol>NULL</symbol> в триггерах на <command>DELETE</command>, поэтому возвращать её не имеет смысла. Традиционной идиомой для триггеров <command>DELETE</command> является возврат переменной <varname>OLD</varname>.

source: <literal>INSTEAD OF</literal> triggers (which are always row-level triggers, and may only be used on views) can return null to signal that they did not perform any updates, and that the rest of the operation for this row should be skipped (i.e., subsequent triggers are not fired, and the row is not counted in the rows-affected status for the surrounding <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command>). Otherwise a nonnull value should be returned, to signal that the trigger performed the requested operation. For <command>INSERT</command> and <command>UPDATE</command> operations, the return value should be <varname>NEW</varname>, which the trigger function may modify to support <command>INSERT RETURNING</command> and <command>UPDATE RETURNING</command> (this will also affect the row value passed to any subsequent triggers, or passed to a special <varname>EXCLUDED</varname> alias reference within an <command>INSERT</command> statement with an <literal>ON CONFLICT DO UPDATE</literal> clause). For <command>DELETE</command> operations, the return value should be <varname>OLD</varname>.
ru: Триггеры <literal>INSTEAD OF</literal> (это всегда триггеры уровня строк и они могут применяться только с представлениями) могут возвращать NULL, чтобы показать, что они не выполняли никаких изменений, так что обработку этой строки можно не продолжать (то есть, не вызывать последующие триггеры и не считать строку в числе обработанных строк для окружающих команд <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command>). В противном случае должно быть возвращено значение, отличное от NULL, показывающее, что триггер выполнил запрошенную операцию. Для операций <command>INSERT</command> и <command>UPDATE</command> возвращаемым значением должно быть <varname>NEW</varname>, которое триггерная функция может модифицировать для поддержки предложений <command>INSERT RETURNING</command> и <command>UPDATE RETURNING</command> (это также повлияет на значение строки, передаваемое последующим триггерам, или доступное под специальным псевдонимом <varname>EXCLUDED</varname> в операторе <command>INSERT</command> с предложением <literal>ON CONFLICT DO UPDATE</literal>). Для операций <command>DELETE</command> возвращаемым значением должно быть <varname>OLD</varname>.

source: The return value of a row-level trigger fired <literal>AFTER</literal> or a statement-level trigger fired <literal>BEFORE</literal> or <literal>AFTER</literal> is always ignored; it might as well be null. However, any of these types of triggers might still abort the entire operation by raising an error.
ru: Возвращаемое значение для строчного триггера AFTER и триггеров уровня оператора (BEFORE или AFTER) всегда игнорируется. Это может быть и NULL. Однако, в этих триггерах по-прежнему можно прервать вызвавшую их команду, для этого нужно явно вызвать ошибку.

source: <xref linkend="plpgsql-trigger-example"/> shows an example of a trigger procedure in <application>PL/pgSQL</application>.
ru: <xref linkend="plpgsql-trigger-example"/> показывает пример триггерной процедуры в <application>PL/pgSQL</application>.

source: A <application>PL/pgSQL</application> Trigger Procedure
ru: Триггерная процедура <application>PL/pgSQL</application>

source: This example trigger ensures that any time a row is inserted or updated in the table, the current user name and time are stamped into the row. And it checks that an employee's name is given and that the salary is a positive value.
ru: Триггер гарантирует, что всякий раз, когда в таблице добавляется или изменяется запись, в этой записи сохраняется информация о текущем пользователе и временной метке. Также контролируется, что имя сотрудника указано и размер зарплаты выше нуля.

source: CREATE TABLE emp ( empname text, salary integer, last_date timestamp, last_user text ); CREATE FUNCTION emp_stamp() RETURNS trigger AS $emp_stamp$ BEGIN -- Check that empname and salary are given IF NEW.empname IS NULL THEN RAISE EXCEPTION 'empname cannot be null'; END IF; IF NEW.salary IS NULL THEN RAISE EXCEPTION '% cannot have null salary', NEW.empname; END IF; -- Who works for us when they must pay for it? IF NEW.salary &lt; 0 THEN RAISE EXCEPTION '% cannot have a negative salary', NEW.empname; END IF; -- Remember who changed the payroll when NEW.last_date := current_timestamp; NEW.last_user := current_user; RETURN NEW; END; $emp_stamp$ LANGUAGE plpgsql; CREATE TRIGGER emp_stamp BEFORE INSERT OR UPDATE ON emp FOR EACH ROW EXECUTE PROCEDURE emp_stamp();
ru: CREATE TABLE emp ( empname text, salary integer, last_date timestamp, last_user text ); CREATE FUNCTION emp_stamp() RETURNS trigger AS $emp_stamp$ BEGIN -- Проверить, что указаны имя сотрудника и зарплата IF NEW.empname IS NULL THEN RAISE EXCEPTION 'empname cannot be null'; END IF; IF NEW.salary IS NULL THEN RAISE EXCEPTION '% cannot have null salary', NEW.empname; END IF; -- Кто будет работать, если за это надо будет платить? IF NEW.salary &lt; 0 THEN RAISE EXCEPTION '% cannot have a negative salary', NEW.empname; END IF; -- Запомнить, кто и когда изменил запись NEW.last_date := current_timestamp; NEW.last_user := current_user; RETURN NEW; END; $emp_stamp$ LANGUAGE plpgsql; CREATE TRIGGER emp_stamp BEFORE INSERT OR UPDATE ON emp FOR EACH ROW EXECUTE PROCEDURE emp_stamp();

source: Another way to log changes to a table involves creating a new table that holds a row for each insert, update, or delete that occurs. This approach can be thought of as auditing changes to a table. <xref linkend="plpgsql-trigger-audit-example"/> shows an example of an audit trigger procedure in <application>PL/pgSQL</application>.
ru: Другой вариант вести журнал изменений для таблицы предполагает создание новой таблицы, которая будет содержать отдельную запись для каждой выполненной команды INSERT, UPDATE, DELETE. Этот подход можно рассматривать как протоколирование изменений таблицы для аудита. <xref linkend="plpgsql-trigger-audit-example"/> показывает реализацию соответствующей триггерной процедуры в <application>PL/pgSQL</application>.

source: A <application>PL/pgSQL</application> Trigger Procedure For Auditing
ru: Триггерная процедура для аудита в <application>PL/pgSQL</application>

source: This example trigger ensures that any insert, update or delete of a row in the <literal>emp</literal> table is recorded (i.e., audited) in the <literal>emp_audit</literal> table. The current time and user name are stamped into the row, together with the type of operation performed on it.
ru: Триггер гарантирует, что любая команда на вставку, изменение или удаление строки в таблице <literal>emp</literal> будет записана для аудита в таблице <literal>emp_audit</literal>. Также записывается информация о пользователе, выполнившем операцию, временной метке и типе операции.

source: CREATE TABLE emp ( empname text NOT NULL, salary integer ); CREATE TABLE emp_audit( operation char(1) NOT NULL, stamp timestamp NOT NULL, userid text NOT NULL, empname text NOT NULL, salary integer ); CREATE OR REPLACE FUNCTION process_emp_audit() RETURNS TRIGGER AS $emp_audit$ BEGIN -- -- Create a row in emp_audit to reflect the operation performed on emp, -- make use of the special variable TG_OP to work out the operation. -- IF (TG_OP = 'DELETE') THEN INSERT INTO emp_audit SELECT 'D', now(), user, OLD.*; RETURN OLD; ELSIF (TG_OP = 'UPDATE') THEN INSERT INTO emp_audit SELECT 'U', now(), user, NEW.*; RETURN NEW; ELSIF (TG_OP = 'INSERT') THEN INSERT INTO emp_audit SELECT 'I', now(), user, NEW.*; RETURN NEW; END IF; RETURN NULL; -- result is ignored since this is an AFTER trigger END; $emp_audit$ LANGUAGE plpgsql; CREATE TRIGGER emp_audit AFTER INSERT OR UPDATE OR DELETE ON emp FOR EACH ROW EXECUTE PROCEDURE process_emp_audit();
ru: CREATE TABLE emp ( empname text NOT NULL, salary integer ); CREATE TABLE emp_audit( operation char(1) NOT NULL, stamp timestamp NOT NULL, userid text NOT NULL, empname text NOT NULL, salary integer ); CREATE OR REPLACE FUNCTION process_emp_audit() RETURNS TRIGGER AS $emp_audit$ BEGIN -- -- Создаем строку в emp_audit, которая отражает выполненную операцию. -- Воспользуемся переменной TG_OP для определения типа операции. -- IF (TG_OP = 'DELETE') THEN INSERT INTO emp_audit SELECT 'D', now(), user, OLD.*; RETURN OLD; ELSIF (TG_OP = 'UPDATE') THEN INSERT INTO emp_audit SELECT 'U', now(), user, NEW.*; RETURN NEW; ELSIF (TG_OP = 'INSERT') THEN INSERT INTO emp_audit SELECT 'I', now(), user, NEW.*; RETURN NEW; END IF; RETURN NULL; -- возвращаемое значение для триггера AFTER не имеет значения END; $emp_audit$ LANGUAGE plpgsql; CREATE TRIGGER emp_audit AFTER INSERT OR UPDATE OR DELETE ON emp FOR EACH ROW EXECUTE PROCEDURE process_emp_audit();

source: A variation of the previous example uses a view joining the main table to the audit table, to show when each entry was last modified. This approach still records the full audit trail of changes to the table, but also presents a simplified view of the audit trail, showing just the last modified timestamp derived from the audit trail for each entry. <xref linkend="plpgsql-view-trigger-audit-example"/> shows an example of an audit trigger on a view in <application>PL/pgSQL</application>.
ru: У предыдущего примера есть разновидность, которая использует представление, соединяющее основную таблицу и таблицу аудита, для отображения даты последнего изменения каждой строки. При этом подходе по-прежнему ведётся полный журнал аудита в отдельной таблице, но также имеется представление с упрощенным аудиторским следом. Это представление содержит временную метку, которая вычисляется для каждой строки из данных аудиторской таблицы. <xref linkend="plpgsql-view-trigger-audit-example"/> показывает пример триггера на представление для аудита в <application>PL/pgSQL</application>.

source: A <application>PL/pgSQL</application> View Trigger Procedure For Auditing
ru: Триггер на представление для аудита в <application>PL/pgSQL</application>

source: This example uses a trigger on the view to make it updatable, and ensure that any insert, update or delete of a row in the view is recorded (i.e., audited) in the <literal>emp_audit</literal> table. The current time and user name are recorded, together with the type of operation performed, and the view displays the last modified time of each row.
ru: Триггер на представление используется для того, чтобы сделать это представление изменяемым и гарантировать, что любая команда на вставку, изменение или удаление строки в представлении будет записана для аудита в таблицу <literal>emp_audit</literal>. Также записываются временная метка, имя пользователя и тип выполняемой операции. Представление показывает дату последнего изменения для каждой строки.

source: CREATE TABLE emp ( empname text PRIMARY KEY, salary integer ); CREATE TABLE emp_audit( operation char(1) NOT NULL, userid text NOT NULL, empname text NOT NULL, salary integer, stamp timestamp NOT NULL ); CREATE VIEW emp_view AS SELECT e.empname, e.salary, max(ea.stamp) AS last_updated FROM emp e LEFT JOIN emp_audit ea ON ea.empname = e.empname GROUP BY 1, 2; CREATE OR REPLACE FUNCTION update_emp_view() RETURNS TRIGGER AS $$ BEGIN -- -- Perform the required operation on emp, and create a row in emp_audit -- to reflect the change made to emp. -- IF (TG_OP = 'DELETE') THEN DELETE FROM emp WHERE empname = OLD.empname; IF NOT FOUND THEN RETURN NULL; END IF; OLD.last_updated = now(); INSERT INTO emp_audit VALUES('D', user, OLD.*); RETURN OLD; ELSIF (TG_OP = 'UPDATE') THEN UPDATE emp SET salary = NEW.salary WHERE empname = OLD.empname; IF NOT FOUND THEN RETURN NULL; END IF; NEW.last_updated = now(); INSERT INTO emp_audit VALUES('U', user, NEW.*); RETURN NEW; ELSIF (TG_OP = 'INSERT') THEN INSERT INTO emp VALUES(NEW.empname, NEW.salary); NEW.last_updated = now(); INSERT INTO emp_audit VALUES('I', user, NEW.*); RETURN NEW; END IF; END; $$ LANGUAGE plpgsql; CREATE TRIGGER emp_audit INSTEAD OF INSERT OR UPDATE OR DELETE ON emp_view FOR EACH ROW EXECUTE PROCEDURE update_emp_view();
ru: CREATE TABLE emp ( empname text PRIMARY KEY, salary integer ); CREATE TABLE emp_audit( operation char(1) NOT NULL, userid text NOT NULL, empname text NOT NULL, salary integer, stamp timestamp NOT NULL ); CREATE VIEW emp_view AS SELECT e.empname, e.salary, max(ea.stamp) AS last_updated FROM emp e LEFT JOIN emp_audit ea ON ea.empname = e.empname GROUP BY 1, 2; CREATE OR REPLACE FUNCTION update_emp_view() RETURNS TRIGGER AS $$ BEGIN -- -- Выполняем требуемую операцию в emp и создаем строку в emp_audit, -- которая отражает сделанную операцию. -- IF (TG_OP = 'DELETE') THEN DELETE FROM emp WHERE empname = OLD.empname; IF NOT FOUND THEN RETURN NULL; END IF; OLD.last_updated = now(); INSERT INTO emp_audit VALUES('D', user, OLD.*); RETURN OLD; ELSIF (TG_OP = 'UPDATE') THEN UPDATE emp SET salary = NEW.salary WHERE empname = OLD.empname; IF NOT FOUND THEN RETURN NULL; END IF; NEW.last_updated = now(); INSERT INTO emp_audit VALUES('U', user, NEW.*); RETURN NEW; ELSIF (TG_OP = 'INSERT') THEN INSERT INTO emp VALUES(NEW.empname, NEW.salary); NEW.last_updated = now(); INSERT INTO emp_audit VALUES('I', user, NEW.*); RETURN NEW; END IF; END; $$ LANGUAGE plpgsql; CREATE TRIGGER emp_audit INSTEAD OF INSERT OR UPDATE OR DELETE ON emp_view FOR EACH ROW EXECUTE PROCEDURE update_emp_view();

source: One use of triggers is to maintain a summary table of another table. The resulting summary can be used in place of the original table for certain queries &mdash; often with vastly reduced run times. This technique is commonly used in Data Warehousing, where the tables of measured or observed data (called fact tables) might be extremely large. <xref linkend="plpgsql-trigger-summary-example"/> shows an example of a trigger procedure in <application>PL/pgSQL</application> that maintains a summary table for a fact table in a data warehouse.
ru: Один из вариантов использования триггеров это поддержание в актуальном состоянии отдельной таблицы итогов для некоторой таблицы. В некоторых случаях отдельная таблица с итогами может использоваться в запросах вместо основной таблицы. При этом зачастую время выполнения запросов значительно сокращается. Эта техника широко используется в хранилищах данных, где таблицы фактов могут быть очень большими. <xref linkend="plpgsql-trigger-summary-example"/> показывает триггерную процедуру в <application>PL/pgSQL</application>, которая поддерживает таблицу итогов для таблицы фактов в хранилище данных.

source: A <application>PL/pgSQL</application> Trigger Procedure For Maintaining A Summary Table
ru: Триггерная процедура в <application>PL/pgSQL</application> для поддержки таблицы итогов

source: The schema detailed here is partly based on the <emphasis>Grocery Store </emphasis> example from <emphasis>The Data Warehouse Toolkit</emphasis> by Ralph Kimball.
ru: Представленная здесь схема данных частично основана на примере <emphasis>Grocery Store </emphasis> из книги <emphasis>The Data Warehouse Toolkit</emphasis> (автор Ralph Kimball).
