Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: All expressions used in <application>PL/pgSQL</application> statements are processed using the server's main <acronym>SQL</acronym> executor. For example, when you write a <application>PL/pgSQL</application> statement like <synopsis>IF <replaceable>expression</replaceable> THEN ...</synopsis> <application>PL/pgSQL</application> will evaluate the expression by feeding a query like <synopsis>SELECT <replaceable>expression</replaceable></synopsis> to the main SQL engine. While forming the <command>SELECT</command> command, any occurrences of <application>PL/pgSQL</application> variable names are replaced by parameters, as discussed in detail in <xref linkend="plpgsql-var-subst"/>. This allows the query plan for the <command>SELECT</command> to be prepared just once and then reused for subsequent evaluations with different values of the variables. Thus, what really happens on first use of an expression is essentially a <command>PREPARE</command> command. For example, if we have declared two integer variables <literal>x</literal> and <literal>y</literal>, and we write <placeholder-1/> what happens behind the scenes is equivalent to <placeholder-2/> and then this prepared statement is <command>EXECUTE</command>d for each execution of the <command>IF</command> statement, with the current values of the <application>PL/pgSQL</application> variables supplied as parameter values. Normally these details are not important to a <application>PL/pgSQL</application> user, but they are useful to know when trying to diagnose a problem. More information appears in <xref linkend="plpgsql-plan-caching"/>.
ru: Все выражения, используемые в операторах <application>PL/pgSQL</application>, обрабатываются основным исполнителем <acronym>SQL</acronym>-сервера. Например, для вычисления такого выражения: <synopsis>IF <replaceable>expression</replaceable> THEN ...</synopsis> <application>PL/pgSQL</application> отправит следующий запрос исполнителю SQL: <synopsis>SELECT <replaceable>expression</replaceable></synopsis> При формировании команды <command>SELECT</command> все вхождения имён переменных <application>PL/pgSQL</application> заменяются параметрами, как подробно описано в <xref remap="6" linkend="plpgsql-var-subst"/>. Это позволяет один раз подготовить план выполнения команды <command>SELECT</command> и повторно использовать его в последующих вычислениях с различными значениями переменных. Таким образом, при первом использовании выражения, по сути происходит выполнение команды <command>PREPARE</command>. Например, если мы объявили две целочисленные переменные <literal>x</literal> и <literal>y</literal>, и написали: <placeholder-1/> то, что реально происходит за сценой, эквивалентно: <placeholder-2/> и затем, эта подготовленная команда исполняется (<command>EXECUTE</command>) для каждого оператора <command>IF</command> с текущими значениями переменных <application>PL/pgSQL</application>, переданных как значения параметров. Обычно эти детали не важны для пользователей <application>PL/pgSQL</application>, но их полезно знать при диагностировании проблем. Более подробно об этом рассказывается в <xref remap="6" linkend="plpgsql-plan-caching"/>.

source: Basic Statements
ru: Основные операторы

source: In this section and the following ones, we describe all the statement types that are explicitly understood by <application>PL/pgSQL</application>. Anything not recognized as one of these statement types is presumed to be an SQL command and is sent to the main database engine to execute, as described in <xref linkend="plpgsql-statements-sql-noresult"/> and <xref linkend="plpgsql-statements-sql-onerow"/>.
ru: В этом и последующих разделах описаны все типы операторов, которые понимает <application>PL/pgSQL</application>. Все, что не признается в качестве одного из этих типов операторов, считается командой SQL и отправляется для исполнения в основную машину базы данных, как описано в <xref remap="6" linkend="plpgsql-statements-sql-noresult"/> и <xref remap="6" linkend="plpgsql-statements-sql-onerow"/>.

source: Assignment
ru: Присваивания

source: An assignment of a value to a <application>PL/pgSQL</application> variable is written as: <synopsis><replaceable>variable</replaceable> { := | = } <replaceable>expression</replaceable>;</synopsis> As explained previously, the expression in such a statement is evaluated by means of an SQL <command>SELECT</command> command sent to the main database engine. The expression must yield a single value (possibly a row value, if the variable is a row or record variable). The target variable can be a simple variable (optionally qualified with a block name), a field of a row or record variable, or an element of an array that is a simple variable or field. Equal (<literal>=</literal>) can be used instead of PL/SQL-compliant <literal>:=</literal>.
ru: Присвоение значения переменной <application>PL/pgSQL</application> записывается в виде: <synopsis><replaceable>переменная</replaceable> { := | = } <replaceable>выражение</replaceable>;</synopsis> Как описывалось ранее, выражение в таком операторе вычисляется с помощью SQL-команды <command>SELECT</command>, посылаемой в основную машину базы данных. Выражение должно получить одно значение (возможно, значение строки, если переменная строкового типа или типа <type>record</type>). Целевая переменная может быть простой переменной (возможно, дополненной именем блока), полем в переменной строкового типа или записи; или элементом массива, который является простой переменной или полем. Для присвоения можно использовать знак равенства (<literal>=</literal>) вместо совместимого с PL/SQL <literal>:=</literal>.

source: If the expression's result data type doesn't match the variable's data type, the value will be coerced as though by an assignment cast (see <xref linkend="typeconv-query"/>). If no assignment cast is known for the pair of data types involved, the <application>PL/pgSQL</application> interpreter will attempt to convert the result value textually, that is by applying the result type's output function followed by the variable type's input function. Note that this could result in run-time errors generated by the input function, if the string form of the result value is not acceptable to the input function.
ru: Если тип данных результата выражения не соответствует типу данных переменной, это значение будет преобразовано к нужному типу с использованием приведения присваивания (см. <xref remap="4" linkend="typeconv-query"/>). В случае отсутствия приведения присваивания для этой пары типов, интерпретатор <application>PL/pgSQL</application> попытается преобразовать значение результата через текстовый формат, то есть применив функцию вывода типа результата, а за ней функцию ввода типа переменной. Заметьте, что при этом функция ввода может выдавать ошибки времени выполнения, если не воспримет строковое представление значения результата.

source: Executing a Command With No Result
ru: Выполнение команды, не возвращающей результат

source: For any SQL command that does not return rows, for example <command>INSERT</command> without a <literal>RETURNING</literal> clause, you can execute the command within a <application>PL/pgSQL</application> function just by writing the command.
ru: В функции на <application>PL/pgSQL</application> можно выполнить любую команду SQL, не возвращающую строк, просто написав эту команду (например, <command>INSERT</command> без предложения <literal>RETURNING</literal>).

source: Any <application>PL/pgSQL</application> variable name appearing in the command text is treated as a parameter, and then the current value of the variable is provided as the parameter value at run time. This is exactly like the processing described earlier for expressions; for details see <xref linkend="plpgsql-var-subst"/>.
ru: Имя любой переменной <application>PL/pgSQL</application> в тексте команды рассматривается как параметр, а затем текущее значение переменной подставляется в качестве значения параметра во время выполнения. Это в точности совпадает с описанной ранее обработкой для выражений; за подробностями обратитесь к <xref remap="3" linkend="plpgsql-var-subst"/>.

source: When executing a SQL command in this way, <application>PL/pgSQL</application> may cache and re-use the execution plan for the command, as discussed in <xref linkend="plpgsql-plan-caching"/>.
ru: При выполнении SQL-команды таким образом, <application>PL/pgSQL</application> может кешировать и повторно использовать план выполнения команды, как обсуждается в <xref remap="6" linkend="plpgsql-plan-caching"/>.

source: Sometimes it is useful to evaluate an expression or <command>SELECT</command> query but discard the result, for example when calling a function that has side-effects but no useful result value. To do this in <application>PL/pgSQL</application>, use the <command>PERFORM</command> statement: <synopsis>PERFORM <replaceable>query</replaceable>;</synopsis> This executes <replaceable>query</replaceable> and discards the result. Write the <replaceable>query</replaceable> the same way you would write an SQL <command>SELECT</command> command, but replace the initial keyword <command>SELECT</command> with <command>PERFORM</command>. For <command>WITH</command> queries, use <command>PERFORM</command> and then place the query in parentheses. (In this case, the query can only return one row.) <application>PL/pgSQL</application> variables will be substituted into the query just as for commands that return no result, and the plan is cached in the same way. Also, the special variable <literal>FOUND</literal> is set to true if the query produced at least one row, or false if it produced no rows (see <xref linkend="plpgsql-statements-diagnostics"/>).
ru: Иногда бывает полезно вычислить значение выражения или запроса <command>SELECT</command>, но отказаться от результата, например, при вызове функции, у которой есть побочные эффекты, но нет полезного результата. Для этого в <application>PL/pgSQL</application>, используется оператор <command>PERFORM</command>: <synopsis>PERFORM <replaceable>query</replaceable>;</synopsis> Эта команда выполняет <replaceable>query</replaceable> и отбрасывает результат. Запросы (<replaceable>query</replaceable>) пишутся таким же образом, как и в команде SQL <command>SELECT</command>, но ключевое слово <command>SELECT</command> заменяется на <command>PERFORM</command>. Для запросов <command>WITH</command> после <command>PERFORM</command> нужно поместить запрос в скобки. (В этом случае запрос может вернуть только одну строку.) Переменные <application>PL/pgSQL</application> будут подставлены в запрос так же, как и в команду, не возвращающую результат, план запроса также кешируется. Кроме того, специальная переменная <literal>FOUND</literal> устанавливается в истину, если запрос возвращает, по крайней мере, одну строку, или ложь, если не возвращает ни одной строки (см. <xref remap="4" linkend="plpgsql-statements-diagnostics"/>).

source: One might expect that writing <command>SELECT</command> directly would accomplish this result, but at present the only accepted way to do it is <command>PERFORM</command>. A SQL command that can return rows, such as <command>SELECT</command>, will be rejected as an error unless it has an <literal>INTO</literal> clause as discussed in the next section.
ru: Можно предположить, что такой же результат получается непосредственно командой <command>SELECT</command>, но в настоящее время использование <command>PERFORM</command> является единственным способом. Команда SQL, которая может возвращать строки, например <command>SELECT</command>, будет отклонена с ошибкой, если не имеет предложения <literal>INTO</literal>, как описано в следующем разделе.

source: An example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: Executing a Query with a Single-row Result
ru: Выполнение запроса, возвращающего одну строку

source: The result of a SQL command yielding a single row (possibly of multiple columns) can be assigned to a record variable, row-type variable, or list of scalar variables. This is done by writing the base SQL command and adding an <literal>INTO</literal> clause. For example, <synopsis>SELECT <replaceable>select_expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable> FROM ...; INSERT ... RETURNING <replaceable>expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable>; UPDATE ... RETURNING <replaceable>expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable>; DELETE ... RETURNING <replaceable>expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable>;</synopsis> where <replaceable>target</replaceable> can be a record variable, a row variable, or a comma-separated list of simple variables and record/row fields. <application>PL/pgSQL</application> variables will be substituted into the rest of the query, and the plan is cached, just as described above for commands that do not return rows. This works for <command>SELECT</command>, <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> with <literal>RETURNING</literal>, and utility commands that return row-set results (such as <command>EXPLAIN</command>). Except for the <literal>INTO</literal> clause, the SQL command is the same as it would be written outside <application>PL/pgSQL</application>.
ru: Результат SQL-команды, возвращающей одну строку (возможно из нескольких столбцов), может быть присвоен переменной типа <type>record</type>, переменной строкового типа или списку скалярных переменных. Для этого нужно к основной команде SQL добавить предложение <literal>INTO</literal>. Так, например: <synopsis>SELECT <replaceable>select_expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable> FROM ...; INSERT ... RETURNING <replaceable>expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable>; UPDATE ... RETURNING <replaceable>expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable>; DELETE ... RETURNING <replaceable>expressions</replaceable> INTO <optional>STRICT</optional> <replaceable>target</replaceable>;</synopsis> где <replaceable>target</replaceable> может быть переменной типа <type>record</type>, строковой переменной или разделённым запятыми списком скалярных переменных, полей записи/строки. Переменные <application>PL/pgSQL</application> подставляются в оставшуюся часть запроса, план выполнения кешируется, так же, как было описано выше для команд, не возвращающих строки. Это работает для команд <command>SELECT</command>, <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> с предложением <literal>RETURNING</literal> и утилит, возвращающих результат в виде набора строк (таких, как <command>EXPLAIN</command>). За исключением предложения <literal>INTO</literal>, это те же SQL-команды, как их можно написать вне <application>PL/pgSQL</application>.

source: Note that this interpretation of <command>SELECT</command> with <literal>INTO</literal> is quite different from <productname>PostgreSQL</productname>'s regular <command>SELECT INTO</command> command, wherein the <literal>INTO</literal> target is a newly created table. If you want to create a table from a <command>SELECT</command> result inside a <application>PL/pgSQL</application> function, use the syntax <command>CREATE TABLE ... AS SELECT</command>.
ru: Обратите внимание, что данная интерпретация <command>SELECT</command> с <literal>INTO</literal> полностью отличается от <productname>PostgreSQL</productname> команды <command>SELECT INTO</command>, где в <literal>INTO</literal> указывается вновь создаваемая таблица. Если вы хотите в функции на <application>PL/pgSQL</application> создать таблицу, основанную на результате команды <command>SELECT</command>, используйте синтаксис <command>CREATE TABLE ... AS SELECT</command>.

source: If a row or a variable list is used as target, the query's result columns must exactly match the structure of the target as to number and data types, or else a run-time error occurs. When a record variable is the target, it automatically configures itself to the row type of the query result columns.
ru: Если результат запроса присваивается переменной строкового типа или списку переменных, то они должны в точности соответствовать по количеству и типам данных столбцам результата, иначе произойдёт ошибка во время выполнения. Если используется переменная типа <type>record</type>, то она автоматически приводится к строковому типу результата запроса.

source: The <literal>INTO</literal> clause can appear almost anywhere in the SQL command. Customarily it is written either just before or just after the list of <replaceable>select_expressions</replaceable> in a <command>SELECT</command> command, or at the end of the command for other command types. It is recommended that you follow this convention in case the <application>PL/pgSQL</application> parser becomes stricter in future versions.
ru: Предложение INTO может появиться практически в любом месте SQL-команды. Обычно его записывают непосредственно перед или сразу после списка <replaceable>select_expressions</replaceable> в <command>SELECT</command> или в конце команды для команд других типов. Рекомендуется следовать этому соглашению на случай, если правила разбора <application>PL/pgSQL</application> ужесточатся в будущих версиях.

source: SELECT * INTO myrec FROM emp WHERE empname = myname; IF NOT FOUND THEN RAISE EXCEPTION 'employee % not found', myname; END IF;
ru: SELECT * INTO myrec FROM emp WHERE empname = myname; IF NOT FOUND THEN RAISE EXCEPTION 'Сотрудник % не найден', myname; END IF;

source: BEGIN SELECT * INTO STRICT myrec FROM emp WHERE empname = myname; EXCEPTION WHEN NO_DATA_FOUND THEN RAISE EXCEPTION 'employee % not found', myname; WHEN TOO_MANY_ROWS THEN RAISE EXCEPTION 'employee % not unique', myname; END;
ru: BEGIN SELECT * INTO STRICT myrec FROM emp WHERE empname = myname; EXCEPTION WHEN NO_DATA_FOUND THEN RAISE EXCEPTION 'Сотрудник % не найден', myname; WHEN TOO_MANY_ROWS THEN RAISE EXCEPTION 'Сотрудник % уже существует', myname; END;

source: If <literal>STRICT</literal> is not specified in the <literal>INTO</literal> clause, then <replaceable>target</replaceable> will be set to the first row returned by the query, or to nulls if the query returned no rows. (Note that <quote>the first row</quote> is not well-defined unless you've used <literal>ORDER BY</literal>.) Any result rows after the first row are discarded. You can check the special <literal>FOUND</literal> variable (see <xref linkend="plpgsql-statements-diagnostics"/>) to determine whether a row was returned: <placeholder-1/> If the <literal>STRICT</literal> option is specified, the query must return exactly one row or a run-time error will be reported, either <literal>NO_DATA_FOUND</literal> (no rows) or <literal>TOO_MANY_ROWS</literal> (more than one row). You can use an exception block if you wish to catch the error, for example: <placeholder-2/> Successful execution of a command with <literal>STRICT</literal> always sets <literal>FOUND</literal> to true.
ru: Если указание <literal>STRICT</literal> отсутствует в предложении <literal>INTO</literal>, то в <replaceable>target</replaceable> присваивается первая строка, возвращённая запросом; или NULL, если запрос не вернул строк. (Заметим, что понятие <quote>первая строка</quote> определяется неоднозначно без <literal>ORDER BY</literal>.) Все остальные строки результата после первой отбрасываются. Можно проверить специальную переменную <literal>FOUND</literal> (см. <xref remap="4" linkend="plpgsql-statements-diagnostics"/>), чтобы определить, была ли возвращена запись: <placeholder-1/> Если добавлено указание <literal>STRICT</literal>, то запрос должен вернуть ровно одну строку или произойдёт ошибка во время выполнения: либо <literal>NO_DATA_FOUND</literal> (нет строк), либо <literal>TOO_MANY_ROWS</literal> (более одной строки). Можно использовать секцию исключений в блоке для обработки ошибок, например: <placeholder-2/> После успешного выполнения команды с указанием <literal>STRICT</literal>, значение переменной <literal>FOUND</literal> всегда устанавливается в истину.

source: For <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> with <literal>RETURNING</literal>, <application>PL/pgSQL</application> reports an error for more than one returned row, even when <literal>STRICT</literal> is not specified. This is because there is no option such as <literal>ORDER BY</literal> with which to determine which affected row should be returned.
ru: Для <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> с <literal>RETURNING</literal>, <application>PL/pgSQL</application> возвращает ошибку, если выбрано более одной строки, даже в том случае, когда указание <literal>STRICT</literal> отсутствует. Так происходит потому, что у этих команд нет возможности, типа <literal>ORDER BY</literal>, указать какая из задействованных строк должна быть возвращена.

source: If <literal>print_strict_params</literal> is enabled for the function, then when an error is thrown because the requirements of <literal>STRICT</literal> are not met, the <literal>DETAIL</literal> part of the error message will include information about the parameters passed to the query. You can change the <literal>print_strict_params</literal> setting for all functions by setting <varname>plpgsql.print_strict_params</varname>, though only subsequent function compilations will be affected. You can also enable it on a per-function basis by using a compiler option, for example: <placeholder-1/> On failure, this function might produce an error message such as <placeholder-2/>
ru: Если для функции включён режим <literal>print_strict_params</literal>, то при возникновении ошибки, связанной с нарушением условия <literal>STRICT</literal>, в детальную (<literal>DETAIL</literal>) часть сообщения об ошибке будет включена информация о параметрах, переданных запросу. Изменить значение <literal>print_strict_params</literal> можно установкой параметра <varname>plpgsql.print_strict_params</varname>. Но это повлияет только на функции, скомпилированные после изменения. Для конкретной функции можно использовать указание компилятора, например: <placeholder-1/> В случае сбоя будет сформировано примерно такое сообщение об ошибке <placeholder-2/>

source: The <literal>STRICT</literal> option matches the behavior of Oracle PL/SQL's <command>SELECT INTO</command> and related statements.
ru: С указанием <literal>STRICT</literal> поведение <command>SELECT INTO</command> и связанных операторов соответствует принятому в Oracle PL/SQL.

source: To handle cases where you need to process multiple result rows from a SQL query, see <xref linkend="plpgsql-records-iterating"/>.
ru: Как действовать в случаях, когда требуется обработать несколько строк результата, описано в <xref remap="6" linkend="plpgsql-records-iterating"/>.

source: Executing Dynamic Commands
ru: Выполнение динамически формируемых команд
