Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpgsql.po
Languages: ru

source: An example: <placeholder-1/> In this example, the table name is inserted into the query via <function>format()</function>. The comparison value for <literal>col1</literal> is inserted via a <literal>USING</literal> parameter, so it needs no quoting.
ru: Пример: <placeholder-1/> В этом примере в текст запроса вставляется имя таблицы с применением <function>format()</function>. Значение, сравниваемое с <literal>col1</literal>, вставляется посредством параметра <literal>USING</literal>, так что заключать его в апострофы не нужно.

source: Opening a Bound Cursor
ru: Открытие связанного курсора

source: This form of <command>OPEN</command> is used to open a cursor variable whose query was bound to it when it was declared. The cursor cannot be open already. A list of actual argument value expressions must appear if and only if the cursor was declared to take arguments. These values will be substituted in the query.
ru: Эта форма <command>OPEN</command> используется для открытия курсорной переменной, которая была связана с запросом при объявлении. Курсор не может уже быть открытым. Список фактических значений аргументов должен присутствовать только в том случае, если курсор объявлялся с параметрами. Эти значения будут подставлены в запрос.

source: The query plan for a bound cursor is always considered cacheable; there is no equivalent of <command>EXECUTE</command> in this case. Notice that <literal>SCROLL</literal> and <literal>NO SCROLL</literal> cannot be specified in <command>OPEN</command>, as the cursor's scrolling behavior was already determined.
ru: План запроса для связанного курсора всегда считается кешируемым. В этом случае, нет эквивалента <command>EXECUTE</command>. Обратите внимание, что <literal>SCROLL</literal> и <literal>NO SCROLL</literal> не могут быть указаны в этой форме <command>OPEN</command>, возможность прокрутки назад была определена при объявлении курсора.

source: Argument values can be passed using either <firstterm>positional</firstterm> or <firstterm>named</firstterm> notation. In positional notation, all arguments are specified in order. In named notation, each argument's name is specified using <literal>:=</literal> to separate it from the argument expression. Similar to calling functions, described in <xref linkend="sql-syntax-calling-funcs"/>, it is also allowed to mix positional and named notation.
ru: При передаче значений аргументов можно использовать позиционную или именную нотацию. В позиционной нотации все аргументы указываются по порядку. В именной нотации имя каждого аргумента отделяется от выражения аргумента с помощью <literal>:=</literal>. Это подобно вызову функций, описанному в <xref remap="6" linkend="sql-syntax-calling-funcs"/>. Также разрешается смешивать позиционную и именную нотации.

source: Examples (these use the cursor declaration examples above): <placeholder-1/>
ru: Примеры (здесь используются ранее объявленные курсоры): <placeholder-1/>

source: Because variable substitution is done on a bound cursor's query, there are really two ways to pass values into the cursor: either with an explicit argument to <command>OPEN</command>, or implicitly by referencing a <application>PL/pgSQL</application> variable in the query. However, only variables declared before the bound cursor was declared will be substituted into it. In either case the value to be passed is determined at the time of the <command>OPEN</command>. For example, another way to get the same effect as the <literal>curs3</literal> example above is <placeholder-1/>
ru: Так как для связанного курсора выполняется подстановка значений переменных, то, на самом деле, существует два способа передать значения в курсор. Либо использовать явные аргументы в <command>OPEN</command>, либо неявно, ссылаясь на переменные <application>PL/pgSQL</application> в запросе. В связанном курсоре можно ссылаться только на те переменные, которые были объявлены до самого курсора. В любом случае, значение переменной для подстановки в запрос будет определяться на момент выполнения <command>OPEN</command>. Вот ещё один способ получить тот же результат с <literal>curs3</literal>, как в примере выше: <placeholder-1/>

source: Using Cursors
ru: Использование курсоров

source: Once a cursor has been opened, it can be manipulated with the statements described here.
ru: После того, как курсор был открыт, с ним можно работать при помощи описанных здесь операторов.

source: These manipulations need not occur in the same function that opened the cursor to begin with. You can return a <type>refcursor</type> value out of a function and let the caller operate on the cursor. (Internally, a <type>refcursor</type> value is simply the string name of a so-called portal containing the active query for the cursor. This name can be passed around, assigned to other <type>refcursor</type> variables, and so on, without disturbing the portal.)
ru: Работать с курсором необязательно в той же функции, где он был открыт. Из функции можно вернуть значение с типом <type>refcursor</type>, что позволит вызывающему продолжить работу с курсором. (Внутри <type>refcursor</type> представляет собой обычное строковое имя так называемого портала, содержащего активный запрос курсора. Это имя можно передавать, присваивать другим переменным с типом <type>refcursor</type> и так далее, при этом портал не нарушается.)

source: All portals are implicitly closed at transaction end. Therefore a <type>refcursor</type> value is usable to reference an open cursor only until the end of the transaction.
ru: Все порталы неявно закрываются в конце транзакции. Поэтому значение <type>refcursor</type> можно использовать для ссылки на открытый курсор только до конца транзакции.

source: target
ru: цель

source: <command>FETCH</command> retrieves the next row from the cursor into a target, which might be a row variable, a record variable, or a comma-separated list of simple variables, just like <command>SELECT INTO</command>. If there is no next row, the target is set to NULL(s). As with <command>SELECT INTO</command>, the special variable <literal>FOUND</literal> can be checked to see whether a row was obtained or not.
ru: <command>FETCH</command> извлекает следующую строку из курсора в <replaceable>target</replaceable>. В качестве <replaceable>target</replaceable> может быть строковая переменная, переменная типа <type>record</type>, или разделённый запятыми список простых переменных, как и в <command>SELECT INTO</command>. Если следующей строки нет, в <replaceable>target</replaceable> присваивается NULL. Как и в <command>SELECT INTO</command>, проверить была ли получена запись можно при помощи специальной переменной <literal>FOUND</literal>.

source: The <replaceable>direction</replaceable> clause can be any of the variants allowed in the SQL <xref linkend="sql-fetch"/> command except the ones that can fetch more than one row; namely, it can be <literal>NEXT</literal>, <literal>PRIOR</literal>, <literal>FIRST</literal>, <literal>LAST</literal>, <literal>ABSOLUTE</literal> <replaceable>count</replaceable>, <literal>RELATIVE</literal> <replaceable>count</replaceable>, <literal>FORWARD</literal>, or <literal>BACKWARD</literal>. Omitting <replaceable>direction</replaceable> is the same as specifying <literal>NEXT</literal>. <replaceable>direction</replaceable> values that require moving backward are likely to fail unless the cursor was declared or opened with the <literal>SCROLL</literal> option.
ru: Значение <replaceable>direction</replaceable> может быть любым допустимым в SQL-команде <xref linkend="sql-fetch"/> вариантом, кроме тех, что извлекают более одной строки. А именно: <literal>NEXT</literal>, <literal>PRIOR</literal>, <literal>FIRST</literal>, <literal>LAST</literal>, <literal>ABSOLUTE</literal> <replaceable>count</replaceable>, <literal>RELATIVE</literal> <replaceable>count</replaceable>, <literal>FORWARD</literal> или <literal>BACKWARD</literal>. Без указания <replaceable>direction</replaceable> используется значение <literal>NEXT</literal>. Значения <replaceable>direction</replaceable>, которые требуют перемещения назад, приведут к ошибке, если курсор не был объявлен или открыт с указанием <literal>SCROLL</literal>.

source: <replaceable>cursor</replaceable> must be the name of a <type>refcursor</type> variable that references an open cursor portal.
ru: <replaceable>cursor</replaceable> это переменная с типом <type>refcursor</type>, которая ссылается на открытый портал курсора.

source: <command>MOVE</command> repositions a cursor without retrieving any data. <command>MOVE</command> works exactly like the <command>FETCH</command> command, except it only repositions the cursor and does not return the row moved to. As with <command>SELECT INTO</command>, the special variable <literal>FOUND</literal> can be checked to see whether there was a next row to move to.
ru: <command>MOVE</command> перемещает курсор без извлечения данных. <command>MOVE</command> работает точно также как и <command>FETCH</command>, но при этом только перемещает курсор и не извлекает строку, к которой переместился. Как и в <command>SELECT INTO</command>, проверить успешность перемещения можно с помощью специальной переменной <literal>FOUND</literal>.

source: The <replaceable>direction</replaceable> clause can be any of the variants allowed in the SQL <xref linkend="sql-fetch"/> command, namely <literal>NEXT</literal>, <literal>PRIOR</literal>, <literal>FIRST</literal>, <literal>LAST</literal>, <literal>ABSOLUTE</literal> <replaceable>count</replaceable>, <literal>RELATIVE</literal> <replaceable>count</replaceable>, <literal>ALL</literal>, <literal>FORWARD</literal> <optional><replaceable>count</replaceable> | <literal>ALL</literal></optional>, or <literal>BACKWARD</literal> <optional><replaceable>count</replaceable> | <literal>ALL</literal></optional>. Omitting <replaceable>direction</replaceable> is the same as specifying <literal>NEXT</literal>. <replaceable>direction</replaceable> values that require moving backward are likely to fail unless the cursor was declared or opened with the <literal>SCROLL</literal> option.
ru: Значение <replaceable>direction</replaceable> может быть любым допустимым в SQL-команде <xref linkend="sql-fetch"/> вариантом, а именно: <literal>NEXT</literal>, <literal>PRIOR</literal>, <literal>FIRST</literal>, <literal>LAST</literal>, <literal>ABSOLUTE</literal> <replaceable>count</replaceable>, <literal>RELATIVE</literal> <replaceable>count</replaceable>, <literal>ALL</literal>, <literal>FORWARD</literal> <optional><replaceable>count</replaceable> | <literal>ALL</literal></optional> или <literal>BACKWARD</literal> <optional><replaceable>count</replaceable> | <literal>ALL</literal></optional>. Без указания <replaceable>direction</replaceable> используется значение <literal>NEXT</literal>. Значения <replaceable>direction</replaceable>, которые требуют перемещения назад, приведут к ошибке, если курсор не был объявлен или открыт с указанием <literal>SCROLL</literal>.

source: table
ru: таблица

source: When a cursor is positioned on a table row, that row can be updated or deleted using the cursor to identify the row. There are restrictions on what the cursor's query can be (in particular, no grouping) and it's best to use <literal>FOR UPDATE</literal> in the cursor. For more information see the <xref linkend="sql-declare"/> reference page.
ru: Когда курсор позиционирован на строку таблицы, эту строку можно изменить или удалить при помощи курсора. Есть ограничения на то, каким может быть запрос курсора (в частности, не должно быть группировок), и крайне желательно использовать указание <literal>FOR UPDATE</literal>. За дополнительными сведениями обратитесь к странице справки <xref remap="1" linkend="sql-declare"/>.

source: <command>CLOSE</command> closes the portal underlying an open cursor. This can be used to release resources earlier than end of transaction, or to free up the cursor variable to be opened again.
ru: <command>CLOSE</command> закрывает связанный с курсором портал. Используется для того, чтобы освободить ресурсы раньше, чем закончится транзакция, или чтобы освободить курсорную переменную для повторного открытия.

source: Returning Cursors
ru: Возврат курсора из функции

source: <application>PL/pgSQL</application> functions can return cursors to the caller. This is useful to return multiple rows or columns, especially with very large result sets. To do this, the function opens the cursor and returns the cursor name to the caller (or simply opens the cursor using a portal name specified by or otherwise known to the caller). The caller can then fetch rows from the cursor. The cursor can be closed by the caller, or it will be closed automatically when the transaction closes.
ru: Курсоры можно возвращать из функции на <application>PL/pgSQL</application>. Это полезно, когда нужно вернуть множество строк и столбцов, особенно если выборки очень большие. Для этого, в функции открывается курсор и его имя возвращается вызывающему (или просто открывается курсор, используя указанное имя портала, каким-либо образом известное вызывающему). Вызывающий затем может извлекать строки из курсора. Курсор может быть закрыт вызывающим или он будет автоматически закрыт при завершении транзакции.

source: The portal name used for a cursor can be specified by the programmer or automatically generated. To specify a portal name, simply assign a string to the <type>refcursor</type> variable before opening it. The string value of the <type>refcursor</type> variable will be used by <command>OPEN</command> as the name of the underlying portal. However, if the <type>refcursor</type> variable is null, <command>OPEN</command> automatically generates a name that does not conflict with any existing portal, and assigns it to the <type>refcursor</type> variable.
ru: Имя портала, используемое для курсора, может быть указано разработчиком или будет генерироваться автоматически. Чтобы указать имя портала, нужно просто присвоить строку в переменную <type>refcursor</type> перед его открытием. Значение строки переменной <type>refcursor</type> будет использоваться командой <command>OPEN</command> как имя портала. Однако, если переменная <type>refcursor</type> имеет значение NULL, <command>OPEN</command> автоматически генерирует имя, которое не конфликтует с любым существующим порталом и присваивает его переменной <type>refcursor</type>.

source: A bound cursor variable is initialized to the string value representing its name, so that the portal name is the same as the cursor variable name, unless the programmer overrides it by assignment before opening the cursor. But an unbound cursor variable defaults to the null value initially, so it will receive an automatically-generated unique name, unless overridden.
ru: Связанная курсорная переменная инициализируется в строковое значение, представляющее собой имя самой переменной. Таким образом, имя портала совпадает с именем курсорной переменной, кроме случаев, когда разработчик переопределил имя, присвоив новое значение перед открытием курсора. Несвязанная курсорная переменная инициализируется в NULL и получит автоматически сгенерированное уникальное имя, если не будет переопределена.

source: The following example shows one way a cursor name can be supplied by the caller: <placeholder-1/>
ru: Следующий пример показывает один из способов передачи имени курсора вызывающему: <placeholder-1/>

source: CREATE FUNCTION reffunc2() RETURNS refcursor AS ' DECLARE ref refcursor; BEGIN OPEN ref FOR SELECT col FROM test; RETURN ref; END; ' LANGUAGE plpgsql; -- need to be in a transaction to use cursors. BEGIN; SELECT reffunc2(); reffunc2 -------------------- &lt;unnamed cursor 1&gt; (1 row) FETCH ALL IN "&lt;unnamed cursor 1&gt;"; COMMIT;
ru: CREATE FUNCTION reffunc2() RETURNS refcursor AS ' DECLARE ref refcursor; BEGIN OPEN ref FOR SELECT col FROM test; RETURN ref; END; ' LANGUAGE plpgsql; -- для использования курсоров, необходимо начать транзакцию BEGIN; SELECT reffunc2(); reffunc2 -------------------- &lt;unnamed cursor 1&gt; (1 row) FETCH ALL IN "&lt;unnamed cursor 1&gt;"; COMMIT;

source: The following example uses automatic cursor name generation: <placeholder-1/>
ru: В следующем примере используется автоматическая генерация имени курсора: <placeholder-1/>

source: CREATE FUNCTION myfunc(refcursor, refcursor) RETURNS SETOF refcursor AS $$ BEGIN OPEN $1 FOR SELECT * FROM table_1; RETURN NEXT $1; OPEN $2 FOR SELECT * FROM table_2; RETURN NEXT $2; END; $$ LANGUAGE plpgsql; -- need to be in a transaction to use cursors. BEGIN; SELECT * FROM myfunc('a', 'b'); FETCH ALL FROM a; FETCH ALL FROM b; COMMIT;
ru: CREATE FUNCTION myfunc(refcursor, refcursor) RETURNS SETOF refcursor AS $$ BEGIN OPEN $1 FOR SELECT * FROM table_1; RETURN NEXT $1; OPEN $2 FOR SELECT * FROM table_2; RETURN NEXT $2; END; $$ LANGUAGE plpgsql; -- для использования курсоров необходимо начать транзакцию BEGIN; SELECT * FROM myfunc('a', 'b'); FETCH ALL FROM a; FETCH ALL FROM b; COMMIT;

source: The following example shows one way to return multiple cursors from a single function: <placeholder-1/>
ru: В следующем примере показан один из способов вернуть несколько курсоров из одной функции: <placeholder-1/>

source: Looping Through a Cursor's Result
ru: Обработка курсора в цикле

source: There is a variant of the <command>FOR</command> statement that allows iterating through the rows returned by a cursor. The syntax is: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOR <replaceable>recordvar</replaceable> IN <replaceable>bound_cursorvar</replaceable> <optional> ( <optional> <replaceable>argument_name</replaceable> := </optional> <replaceable>argument_value</replaceable> <optional>, ...</optional> ) </optional> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis> The cursor variable must have been bound to some query when it was declared, and it <emphasis>cannot</emphasis> be open already. The <command>FOR</command> statement automatically opens the cursor, and it closes the cursor again when the loop exits. A list of actual argument value expressions must appear if and only if the cursor was declared to take arguments. These values will be substituted in the query, in just the same way as during an <command>OPEN</command> (see <xref linkend="plpgsql-open-bound-cursor"/>).
ru: Один из вариантов цикла <command>FOR</command> позволяет перебирать строки, возвращённые курсором. Вот его синтаксис: <synopsis><optional> &lt;&lt;<replaceable>label</replaceable>&gt;&gt; </optional> FOR <replaceable>recordvar</replaceable> IN <replaceable>bound_cursorvar</replaceable> <optional> ( <optional> <replaceable>argument_name</replaceable> := </optional> <replaceable>argument_value</replaceable> <optional>, ...</optional> ) </optional> LOOP <replaceable>statements</replaceable> END LOOP <optional> <replaceable>label</replaceable> </optional>;</synopsis> Курсорная переменная должна быть связана с запросом при объявлении. Курсор <emphasis>не может</emphasis> быть открытым. Команда <command>FOR</command> автоматически открывает курсор и автоматически закрывает при завершении цикла. Список фактических значений аргументов должен присутствовать только в том случае, если курсор объявлялся с параметрами. Эти значения будут подставлены в запрос, также как и при выполнении <command>OPEN</command> (см. <xref remap="4" linkend="plpgsql-open-bound-cursor"/>).

source: The variable <replaceable>recordvar</replaceable> is automatically defined as type <type>record</type> and exists only inside the loop (any existing definition of the variable name is ignored within the loop). Each row returned by the cursor is successively assigned to this record variable and the loop body is executed.
ru: Переменная <replaceable>recordvar</replaceable> автоматически определяется как переменная типа <type>record</type> и существует только внутри цикла (другие объявленные переменные с таким именем игнорируется в цикле). Каждая возвращаемая курсором строка последовательно присваивается этой переменной и выполняется тело цикла.

source: Errors and Messages
ru: Сообщения и ошибки

source: Reporting Errors and Messages
ru: Вывод сообщений и ошибок

source: <primary>RAISE</primary><secondary>in PL/pgSQL</secondary>
ru: <primary>RAISE</primary><secondary>в PL/pgSQL</secondary>

source: <primary>reporting errors</primary><secondary>in PL/pgSQL</secondary>
ru: <primary>вывод ошибок</primary><secondary>в PL/pgSQL</secondary>
