Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpython.po
Languages: ru

source: The cursor object provides a <literal>fetch</literal> method that accepts an integer parameter and returns a result object. Each time you call <literal>fetch</literal>, the returned object will contain the next batch of rows, never larger than the parameter value. Once all rows are exhausted, <literal>fetch</literal> starts returning an empty result object. Cursor objects also provide an <ulink url="http://docs.python.org/library/stdtypes.html#iterator-types">iterator interface</ulink>, yielding one row at a time until all rows are exhausted. Data fetched that way is not returned as result objects, but rather as dictionaries, each dictionary corresponding to a single result row.
ru: Объект курсора реализует метод <literal>fetch</literal>, который принимает целочисленный параметр и возвращает объект результата. При каждом следующем вызове <literal>fetch</literal> возвращаемый объект будет содержать следующий набор строк, в количестве, не превышающем значение параметра. Когда строки закончатся, <literal>fetch</literal> начнёт возвращать пустой объект результата. Объекты курсора также предоставляют <ulink url="http://docs.python.org/library/stdtypes.html#iterator-types">интерфейс итератора</ulink>, выдающий по строке за один раз, пока не будут выданы все строки. Данные, выбираемые таким образом, возвращаются не как объекты результата, а как словари (одной строке результата соответствует один словарь).

source: An example of two ways of processing data from a large table is: <placeholder-1/>
ru: Следующий пример демонстрирует обработку содержимого большой таблицы двумя способами: <placeholder-1/>

source: Cursors are automatically disposed of. But if you want to explicitly release all resources held by a cursor, use the <literal>close</literal> method. Once closed, a cursor cannot be fetched from anymore.
ru: Курсоры ликвидируются автоматически. Но если вы хотите явно освободить все ресурсы, занятые курсором, вызовите метод <literal>close</literal>. Продолжать получать данные через курсор, который был закрыт, нельзя.

source: Do not confuse objects created by <literal>plpy.cursor</literal> with DB-API cursors as defined by the <ulink url="http://www.python.org/dev/peps/pep-0249/">Python Database API specification</ulink>. They don't have anything in common except for the name.
ru: Не путайте объекты, создаваемые функцией <literal>plpy.cursor</literal>, с курсорами DB-API, определёнными в <ulink url="http://www.python.org/dev/peps/pep-0249/">спецификации API для работы с базами данных в Python</ulink>. Они не имеют ничего общего, кроме имени.

source: Trapping Errors
ru: Обработка ошибок

source: Functions accessing the database might encounter errors, which will cause them to abort and raise an exception. Both <function>plpy.execute</function> and <function>plpy.prepare</function> can raise an instance of a subclass of <literal>plpy.SPIError</literal>, which by default will terminate the function. This error can be handled just like any other Python exception, by using the <literal>try/except</literal> construct. For example: <placeholder-1/>
ru: Функции, обращающиеся к базе данных, могут сталкиваться с ошибками, в результате которых они будут прерываться и вызывать исключение. Обе функции <function>plpy.execute</function> и <function>plpy.prepare</function> могут вызывать экземпляр подкласса исключения <literal>plpy.SPIError</literal>, которое по умолчание прекращает выполнение функции. Эту ошибку можно обработать, как и любое другое исключение в Python, применив конструкцию <literal>try/except</literal>. Например: <placeholder-1/>

source: The actual class of the exception being raised corresponds to the specific condition that caused the error. Refer to <xref linkend="errcodes-table"/> for a list of possible conditions. The module <literal>plpy.spiexceptions</literal> defines an exception class for each <productname>PostgreSQL</productname> condition, deriving their names from the condition name. For instance, <literal>division_by_zero</literal> becomes <literal>DivisionByZero</literal>, <literal>unique_violation</literal> becomes <literal>UniqueViolation</literal>, <literal>fdw_error</literal> becomes <literal>FdwError</literal>, and so on. Each of these exception classes inherits from <literal>SPIError</literal>. This separation makes it easier to handle specific errors, for instance: <placeholder-1/> Note that because all exceptions from the <literal>plpy.spiexceptions</literal> module inherit from <literal>SPIError</literal>, an <literal>except</literal> clause handling it will catch any database access error.
ru: Фактический класс вызываемого исключения соответствует определённому условию возникновения ошибки. Список всех возможных условий приведён в <xref remap="6" linkend="errcodes-table"/>. В модуле <literal>plpy.spiexceptions</literal> определяются классы исключений для каждого условия <productname>PostgreSQL</productname>, с именами, производными от имён условий. Например, имя <literal>division_by_zero</literal> становится именем <literal>DivisionByZero</literal>, <literal>unique_violation</literal> — именем <literal>UniqueViolation</literal>, <literal>fdw_error</literal> — именем <literal>FdwError</literal> и т. д. Все эти классы исключений наследуются от <literal>SPIError</literal>. Такое разделение на классы упрощает обработку определённых ошибок, например: <placeholder-1/> Заметьте, что так как все исключения из модуля <literal>plpy.spiexceptions</literal> наследуются от исключения <literal>SPIError</literal>, команда <literal>except</literal>, обрабатывающая это исключение, будет перехватывать все ошибки при обращении к базе данных.

source: As an alternative way of handling different error conditions, you can catch the <literal>SPIError</literal> exception and determine the specific error condition inside the <literal>except</literal> block by looking at the <literal>sqlstate</literal> attribute of the exception object. This attribute is a string value containing the <quote>SQLSTATE</quote> error code. This approach provides approximately the same functionality
ru: В качестве другого варианта обработки различных условий ошибок, вы можете перехватывать исключение <literal>SPIError</literal> и определять конкретное условие ошибки внутри блока <literal>except</literal> по значению атрибута <literal>sqlstate</literal> объекта исключения. Этот атрибут содержит строку с кодом ошибки <quote>SQLSTATE</quote>. Конечный результат при таком подходе примерно тот же.

source: Explicit Subtransactions
ru: Неявные подтранзакции

source: Recovering from errors caused by database access as described in <xref linkend="plpython-trapping"/> can lead to an undesirable situation where some operations succeed before one of them fails, and after recovering from that error the data is left in an inconsistent state. PL/Python offers a solution to this problem in the form of explicit subtransactions.
ru: Перехват ошибок, произошедших при обращении к базе данных, как описано в <xref remap="6" linkend="plpython-trapping"/>, может привести к нежелательной ситуации, когда часть операций будет успешно выполнена, прежде чем произойдёт сбой. Данные останутся в несогласованном состоянии после обработки такой ошибки. PL/Python предлагает решение этой проблемы в форме неявных подтранзакций.

source: Subtransaction Context Managers
ru: Менеджеры контекста подтранзакций

source: Consider a function that implements a transfer between two accounts: <placeholder-1/> If the second <literal>UPDATE</literal> statement results in an exception being raised, this function will report the error, but the result of the first <literal>UPDATE</literal> will nevertheless be committed. In other words, the funds will be withdrawn from Joe's account, but will not be transferred to Mary's account.
ru: Рассмотрим функцию, осуществляющую перевод средств между двумя счетами: <placeholder-1/> Если при выполнении второго оператора <literal>UPDATE</literal> произойдёт исключение, эта функция сообщит об ошибке, но результат первого <literal>UPDATE</literal> будет, тем не менее, зафиксирован. Другими словами, средства будут списаны со счёта Джо, но не зачислятся на счёт Мэри.

source: To avoid such issues, you can wrap your <literal>plpy.execute</literal> calls in an explicit subtransaction. The <literal>plpy</literal> module provides a helper object to manage explicit subtransactions that gets created with the <literal>plpy.subtransaction()</literal> function. Objects created by this function implement the <ulink url="http://docs.python.org/library/stdtypes.html#context-manager-types"> context manager interface</ulink>. Using explicit subtransactions we can rewrite our function as: <placeholder-1/> Note that the use of <literal>try/catch</literal> is still required. Otherwise the exception would propagate to the top of the Python stack and would cause the whole function to abort with a <productname>PostgreSQL</productname> error, so that the <literal>operations</literal> table would not have any row inserted into it. The subtransaction context manager does not trap errors, it only assures that all database operations executed inside its scope will be atomically committed or rolled back. A rollback of the subtransaction block occurs on any kind of exception exit, not only ones caused by errors originating from database access. A regular Python exception raised inside an explicit subtransaction block would also cause the subtransaction to be rolled back.
ru: Во избежание таких проблем, вы можете завернуть вызовы <literal>plpy.execute</literal> в явную подтранзакцию. Модуль <literal>plpy</literal> предоставляет вспомогательный объект для управления явными подтранзакциями, создаваемый функцией <literal>plpy.subtransaction()</literal>. Объекты, созданные этой функцией, реализуют <ulink url="http://docs.python.org/library/stdtypes.html#context-manager-types">интерфейс менеджера контекста</ulink>. Используя явные подтранзакции, мы можем переписать нашу функцию так: <placeholder-1/> Заметьте, что конструкция <literal>try/catch</literal> по-прежнему нужна. Без неё исключение распространится вверх по стеку Python и приведёт к прерыванию всей функции с ошибкой <productname>PostgreSQL</productname>, так что в таблицу <literal>operations</literal> запись не добавится. Менеджер контекста подтранзакции не перехватывает ошибки, он только гарантирует, что все операции с базой данных в его области действия будут атомарно зафиксированы или отменены. Откат блока подтранзакции происходит при исключении любого вида, а не только исключения, вызванного ошибками при обращении к базе данных. Обычное исключение Python, вызванное внутри блока явной подтранзакции, также приведёт к откату этой подтранзакции.

source: Older Python Versions
ru: Старые версии Python

source: Context managers syntax using the <literal>with</literal> keyword is available by default in Python 2.6. If using PL/Python with an older Python version, it is still possible to use explicit subtransactions, although not as transparently. You can call the subtransaction manager's <literal>__enter__</literal> and <literal>__exit__</literal> functions using the <literal>enter</literal> and <literal>exit</literal> convenience aliases. The example function that transfers funds could be written as: <placeholder-1/>
ru: Синтаксис использования менеджеров контекста с ключевым словом <literal>with</literal> по умолчанию поддерживается в Python 2.6. В PL/Python с более старой версией Python тоже возможно использовать явные подтранзакции, хотя и не так прозрачно. При этом вы можете вызывать методы <literal>__enter__</literal> и <literal>__exit__</literal> менеджера контекста по удобным псевдонимам <literal>enter</literal> и <literal>exit</literal>. Для такого случая функцию перечисления средств можно переписать так: <placeholder-1/>

source: Although context managers were implemented in Python 2.5, to use the <literal>with</literal> syntax in that version you need to use a <ulink url="http://docs.python.org/release/2.5/ref/future.html">future statement</ulink>. Because of implementation details, however, you cannot use future statements in PL/Python functions.
ru: Хотя менеджеры контекста были реализованы в 2.5, для использования синтаксиса <literal>with</literal> в этой версии нужно применить <ulink url="http://docs.python.org/release/2.5/ref/future.html">&laquo;будущий оператор&raquo;</ulink>. Однако по техническим причинам &laquo;будущие операторы&raquo; в функциях PL/Python использовать нельзя.

source: Utility Functions
ru: Вспомогательные функции

source: The <replaceable>msg</replaceable> argument is given as a positional argument. For backward compatibility, more than one positional argument can be given. In that case, the string representation of the tuple of positional arguments becomes the message reported to the client.
ru: Аргумент <replaceable>msg</replaceable> задаётся как позиционный. Для обратной совместимости может быть передано несколько позиционных аргументов. В этом случае сообщением для клиента становится строковое представление кортежа позиционных аргументов.

source: The following keyword-only arguments are accepted: <placeholder-1/> The string representation of the objects passed as keyword-only arguments is used to enrich the messages reported to the client. For example: <placeholder-2/>
ru: Дополнительно только по ключам принимаются следующие аргументы: <placeholder-1/> Строковое представление объектов, передаваемых в аргументах по ключам, позволяет выдать клиенту более богатую информацию. Например: <placeholder-2/>

source: Another set of utility functions are <literal>plpy.quote_literal(<replaceable>string</replaceable>)</literal>, <literal>plpy.quote_nullable(<replaceable>string</replaceable>)</literal>, and <literal>plpy.quote_ident(<replaceable>string</replaceable>)</literal>. They are equivalent to the built-in quoting functions described in <xref linkend="functions-string"/>. They are useful when constructing ad-hoc queries. A PL/Python equivalent of dynamic SQL from <xref linkend="plpgsql-quote-literal-example"/> would be: <placeholder-1/>
ru: Ещё один набор вспомогательных функций образуют <literal>plpy.quote_literal(<replaceable>строка</replaceable>)</literal>, <literal>plpy.quote_nullable(<replaceable>строка</replaceable>)</literal> и <literal>plpy.quote_ident(<replaceable>строка</replaceable>)</literal>. Они равнозначны встроенным функциям заключения в кавычки, описанным в <xref remap="6" linkend="functions-string"/>. Они полезны при конструировании свободно составляемых запросов. На PL/Python динамический SQL, показанный в <xref remap="6" linkend="plpgsql-quote-literal-example"/>, формируется так: <placeholder-1/>

source: Environment Variables
ru: Переменные окружения

source: Some of the environment variables that are accepted by the Python interpreter can also be used to affect PL/Python behavior. They would need to be set in the environment of the main PostgreSQL server process, for example in a start script. The available environment variables depend on the version of Python; see the Python documentation for details. At the time of this writing, the following environment variables have an affect on PL/Python, assuming an adequate Python version: <placeholder-1/> (It appears to be a Python implementation detail beyond the control of PL/Python that some of the environment variables listed on the <command>python</command> man page are only effective in a command-line interpreter and not an embedded Python interpreter.)
ru: Некоторые переменные окружения, воспринимаемые интерпретатором Python, тоже могут влиять на поведение PL/Python. При необходимости их нужно установить в среде основного серверного процесса PostgreSQL, например, в скрипте запуска. Множество доступных переменных окружения зависит от версии Python; за подробностями обратитесь к документации Python. На момент написания этой документации, на поведение PL/Python влияли следующие переменные окружения, при наличии подходящей версии Python: <placeholder-1/> (Похоже, что вследствие тонкостей реализации Python, не зависящих от исполнителя PL/Python, некоторые переменные окружения, перечисленные на странице руководства man <command>python</command>, действуют только в интерпретаторе для командной строки, но не во встраиваемом интерпретаторе Python.)
