Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpython.po
Languages: ru

source: PL/Python - Python Procedural Language
ru: PL/Python — процедурный язык Python

source: The <application>PL/Python</application> procedural language allows <productname>PostgreSQL</productname> functions to be written in the <ulink url="http://www.python.org">Python language</ulink>.
ru: Процедурный язык <application>PL/Python</application> позволяет писать функции <productname>PostgreSQL</productname> на <ulink url="http://www.python.org">языке Python</ulink>.

source: To install PL/Python in a particular database, use <literal>CREATE EXTENSION plpythonu</literal>, or from the shell command line use <literal>createlang plpythonu <replaceable>dbname</replaceable></literal> (but see also <xref linkend="plpython-python23"/>).
ru: Чтобы установить PL/Python в определённую базу данных, выполните команду <literal>CREATE EXTENSION plpythonu</literal>, либо запустите в оболочке системы <literal>createlang plpythonu <replaceable>имя_данных</replaceable></literal> (но смотрите также <xref remap="4" linkend="plpython-python23"/>).

source: If a language is installed into <literal>template1</literal>, all subsequently created databases will have the language installed automatically.
ru: Если язык устанавливается в <literal>template1</literal>, он будет автоматически установлен во все создаваемые впоследствии базы данных.

source: PL/Python is only available as an <quote>untrusted</quote> language, meaning it does not offer any way of restricting what users can do in it and is therefore named <literal>plpythonu</literal>. A trusted variant <literal>plpython</literal> might become available in the future if a secure execution mechanism is developed in Python. The writer of a function in untrusted PL/Python must take care that the function cannot be used to do anything unwanted, since it will be able to do anything that could be done by a user logged in as the database administrator. Only superusers can create functions in untrusted languages such as <literal>plpythonu</literal>.
ru: PL/Python представлен только в виде <quote>недоверенного</quote> языка, что означает, что он никаким способом не ограничивает действия пользователей, и поэтому он называется <literal>plpythonu</literal>. Доверенная вариация <literal>plpython</literal> может появиться в будущем, если в Python будет разработан безопасный механизм выполнения. Автор функции на недоверенном языке PL/Python должен позаботиться о том, чтобы эту функцию нельзя было использовать не по назначению, так как она может делать всё, что может пользователь с правами администратора баз данных. Создавать функции на недоверенных языках, таких как <literal>plpythonu</literal>, разрешено только суперпользователям.

source: Users of source packages must specially enable the build of PL/Python during the installation process. (Refer to the installation instructions for more information.) Users of binary packages might find PL/Python in a separate subpackage.
ru: Пользователи, имеющие дело с исходным кодом, должны явно включить сборку PL/Python в процессе установки. (За дополнительными сведениями обратитесь к инструкциям по установке.) Пользователи двоичных пакетов могут найти PL/Python в отдельном модуле.

source: Python 2 vs. Python 3
ru: Python 2 и Python 3

source: The PostgreSQL language named <literal>plpython2u</literal> implements PL/Python based on the Python 2 language variant.
ru: Язык PostgreSQL с именем <literal>plpython2u</literal> представляет реализацию PL/Python, основанную на вариации языка Python 2.

source: The PostgreSQL language named <literal>plpython3u</literal> implements PL/Python based on the Python 3 language variant.
ru: Язык PostgreSQL с именем <literal>plpython3u</literal> представляет реализацию PL/Python, основанную на вариации языка Python 3.

source: The language named <literal>plpythonu</literal> implements PL/Python based on the default Python language variant, which is currently Python 2. (This default is independent of what any local Python installations might consider to be their <quote>default</quote>, for example, what <filename>/usr/bin/python</filename> might be.) The default will probably be changed to Python 3 in a distant future release of PostgreSQL, depending on the progress of the migration to Python 3 in the Python community.
ru: Язык с именем <literal>plpythonu</literal> представляет реализацию PL/Python, основанную на версии Python по умолчанию, в данный момент это Python 2. (Этот выбор по умолчанию не зависит от того, какая версия считается локальной версией <quote>по умолчанию</quote>, например, на какую версию указывает <filename>/usr/bin/python</filename>.) Выбор по умолчанию в отдалённом будущем выпуске PostgreSQL может быть сменён на Python 3, в зависимости от того, как будет происходить переход на Python 3 в сообществе Python.

source: PL/Python supports both the Python 2 and Python 3 language variants. (The PostgreSQL installation instructions might contain more precise information about the exact supported minor versions of Python.) Because the Python 2 and Python 3 language variants are incompatible in some important aspects, the following naming and transitioning scheme is used by PL/Python to avoid mixing them: <placeholder-1/> This scheme is analogous to the recommendations in <ulink url="http://www.python.org/dev/peps/pep-0394/">PEP 394</ulink> regarding the naming and transitioning of the <command>python</command> command.
ru: PL/Python поддерживает две вариации языка: Python 2 и Python 3. (Более точная информация о поддерживаемых второстепенных версиях Python может содержаться в инструкциях по установке PostgreSQL.) Так как языки Python 2 и Python 3 несовместимы в некоторых важных аспектах, во избежание смешения их в PL/Python применяется следующая схема именования: <placeholder-1/> Эта схема аналогична рекомендациям, данным в <ulink url="http://www.python.org/dev/peps/pep-0394/">PEP 394</ulink>, по выбору имени команды <command>python</command> и переходу с версии на версию.

source: It depends on the build configuration or the installed packages whether PL/Python for Python 2 or Python 3 or both are available.
ru: Будет ли доступен PL/Python для Python 2 или для Python 3, либо сразу для обеих версий, зависит от конфигурации сборки или установленных пакетов.

source: The built variant depends on which Python version was found during the installation or which version was explicitly set using the <envar>PYTHON</envar> environment variable; see <xref linkend="install-procedure"/>. To make both variants of PL/Python available in one installation, the source tree has to be configured and built twice.
ru: Какая вариация будет собрана, зависит от того, как версия Python будет найдена при установке или будет задана в переменной окружения <envar>PYTHON</envar>; см. <xref remap="4" linkend="install-procedure"/>. Чтобы в одной инсталляции присутствовали обе вариации PL/Python, необходимо сконфигурировать и настроить дерево исходного кода дважды.

source: Existing users and users who are currently not interested in Python 3 use the language name <literal>plpythonu</literal> and don't have to change anything for the foreseeable future. It is recommended to gradually <quote>future-proof</quote> the code via migration to Python 2.6/2.7 to simplify the eventual migration to Python 3.
ru: Существующие пользователи и пользователи, которым в настоящее время неинтересен Python 3, могут выбрать имя языка <literal>plpythonu</literal> и им не придётся ничего менять в обозримом будущем. Чтобы упростить миграцию на Python 3, которая произойдёт в конце концов, рекомендуется постепенно проверять <quote>готовность к будущему</quote> кода, обновляя его до версий Python 2.6/2.7.

source: In practice, many PL/Python functions will migrate to Python 3 with few or no changes.
ru: На практике многие функции PL/Python можно мигрировать на Python 3 с минимальными изменениями или вовсе без изменений.

source: Users who know that they have heavily Python 2 dependent code and don't plan to ever change it can make use of the <literal>plpython2u</literal> language name. This will continue to work into the very distant future, until Python 2 support might be completely dropped by PostgreSQL.
ru: Пользователи, знающие, что их код очень сильно зависит от Python 2, и не планирующие когда-либо менять его, могут использовать имя языка <literal>plpython2u</literal>. Это будет работать ещё очень и очень долго, пока в PostgreSQL не будет полностью ликвидирована поддержка Python 2.

source: Users who want to dive into Python 3 can use the <literal>plpython3u</literal> language name, which will keep working forever by today's standards. In the distant future, when Python 3 might become the default, they might like to remove the <quote>3</quote> for aesthetic reasons.
ru: Пользователи, желающие погрузиться в Python 3, могут выбрать имя языка <literal>plpython3u</literal>, и их код будет работать всегда, по сегодняшним стандартам. В отдалённом будущем, когда версией по умолчанию может стать Python 3, цифру <quote>3</quote> из имени языка можно будет убрать из эстетических соображений.

source: Daredevils, who want to build a Python-3-only operating system environment, can change the contents of <link linkend="catalog-pg-pltemplate"><structname>pg_pltemplate</structname></link> to make <literal>plpythonu</literal> be equivalent to <literal>plpython3u</literal>, keeping in mind that this would make their installation incompatible with most of the rest of the world.
ru: Смельчаки, желающие уже сегодня получить операционное окружение только с Python 3, могут модифицировать <link linkend="catalog-pg-pltemplate"><structname>pg_pltemplate</structname></link>, чтобы имя <literal>plpythonu</literal> было равнозначно <literal>plpython3u</literal>, отдавая себе отчёт в том, что такая инсталляция будет несовместима с остальным миром.

source: This results in the following usage and migration strategy: <placeholder-1/>
ru: В результате формируется такая стратегия использования и смены определённой версии: <placeholder-1/>

source: See also the document <ulink url="http://docs.python.org/py3k/whatsnew/3.0.html">What's New In Python 3.0</ulink> for more information about porting to Python 3.
ru: Дополнительную информацию о переходе на Python 3 можно также найти в описании <ulink url="http://docs.python.org/py3k/whatsnew/3.0.html">Что нового в Python 3.0</ulink>.

source: It is not allowed to use PL/Python based on Python 2 and PL/Python based on Python 3 in the same session, because the symbols in the dynamic modules would clash, which could result in crashes of the PostgreSQL server process. There is a check that prevents mixing Python major versions in a session, which will abort the session if a mismatch is detected. It is possible, however, to use both PL/Python variants in the same database, from separate sessions.
ru: Использовать PL/Python на базе Python 2 и PL/Python на базе Python 3 в одном сеансе нельзя, так как это приведёт к конфликту символов в динамических модулях, что может повлечь сбой серверного процесса PostgreSQL. В системе есть проверка, предотвращающая смешение основных версий Python в одном сеансе, которая прервёт сеанс при выявлении расхождения. Однако использовать обе вариации в одной базе данных всё же возможно, обращаясь к ним в разных сеансах.

source: PL/Python Functions
ru: Функции на PL/Python

source: CREATE FUNCTION <replaceable>funcname</replaceable> (<replaceable>argument-list</replaceable>) RETURNS <replaceable>return-type</replaceable> AS $$ # PL/Python function body $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION <replaceable>funcname</replaceable> (<replaceable>argument-list</replaceable>) RETURNS <replaceable>return-type</replaceable> AS $$ # Тело функции на PL/Python $$ LANGUAGE plpythonu;

source: Functions in PL/Python are declared via the standard <xref linkend="sql-createfunction"/> syntax: <placeholder-1/>
ru: Функции на PL/Python объявляются стандартным образом с помощью команды <xref linkend="sql-createfunction"/>: <placeholder-1/>

source: The body of a function is simply a Python script. When the function is called, its arguments are passed as elements of the list <varname>args</varname>; named arguments are also passed as ordinary variables to the Python script. Use of named arguments is usually more readable. The result is returned from the Python code in the usual way, with <literal>return</literal> or <literal>yield</literal> (in case of a result-set statement). If you do not provide a return value, Python returns the default <symbol>None</symbol>. <application>PL/Python</application> translates Python's <symbol>None</symbol> into the SQL null value.
ru: Тело функции содержит просто скрипт на языке Python. Когда вызывается функция, её аргументы передаются в виде элементов списка <varname>args</varname>; именованные аргументы также передаются скрипту Python как обычные переменные. С применением именованных аргументов скрипт обычно лучше читается. Результат из кода Python возвращается обычным способом, командой <literal>return</literal> или <literal>yield</literal> (в случае функции, возвращающей множество). Если возвращаемое значение не определено, Python возвращает <symbol>None</symbol>. Исполнитель <application>PL/Python</application> преобразует <symbol>None</symbol> языка Python в значение NULL языка SQL.

source: For example, a function to return the greater of two integers can be defined as: <placeholder-1/> The Python code that is given as the body of the function definition is transformed into a Python function. For example, the above results in: <placeholder-2/> assuming that 23456 is the OID assigned to the function by <productname>PostgreSQL</productname>.
ru: Например, функцию, возвращающее большее из двух целых чисел, можно определить так: <placeholder-1/> Код на Python, заданный в качестве тела объявляемой функции, становится телом функции Python. Например, для показанного выше объявления получается функция: <placeholder-2/> Здесь 23456 — это OID, который <productname>PostgreSQL</productname> присвоил данной функции.

source: CREATE FUNCTION pystrip(x text) RETURNS text AS $$ x = x.strip() # error return x $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION pystrip(x text) RETURNS text AS $$ x = x.strip() # ошибка return x $$ LANGUAGE plpythonu;

source: CREATE FUNCTION pystrip(x text) RETURNS text AS $$ global x x = x.strip() # ok now return x $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION pystrip(x text) RETURNS text AS $$ global x x = x.strip() # теперь всё в порядке return x $$ LANGUAGE plpythonu;

source: The arguments are set as global variables. Because of the scoping rules of Python, this has the subtle consequence that an argument variable cannot be reassigned inside the function to the value of an expression that involves the variable name itself, unless the variable is redeclared as global in the block. For example, the following won't work: <placeholder-1/> because assigning to <varname>x</varname> makes <varname>x</varname> a local variable for the entire block, and so the <varname>x</varname> on the right-hand side of the assignment refers to a not-yet-assigned local variable <varname>x</varname>, not the PL/Python function parameter. Using the <literal>global</literal> statement, this can be made to work: <placeholder-2/> But it is advisable not to rely on this implementation detail of PL/Python. It is better to treat the function parameters as read-only.
ru: Значения аргументов задаются в глобальных переменных. Согласно правилам видимости в Python, тонким следствием этого является то, что переменной аргумента нельзя присвоить внутри функции выражение, включающее имя самой этой переменной, если только эта переменная не объявлена глобальной в текущем блоке. Например, следующий код не будет работать: <placeholder-1/> так как присвоение <varname>x</varname> значения делает <varname>x</varname> локальной переменной для всего блока, и при этом <varname>x</varname> в правой части присваивания оказывается ещё не определённой локальной переменной <varname>x</varname>, а не параметром функции PL/Python. Добавив оператор <literal>global</literal>, это можно исправить: <placeholder-2/> Однако рекомендуется не полагаться на такие особенности реализации PL/Python, а принять, что параметры функции предназначены только для чтения.

source: Data Values
ru: Значения данных

source: Generally speaking, the aim of PL/Python is to provide a <quote>natural</quote> mapping between the PostgreSQL and the Python worlds. This informs the data mapping rules described below.
ru: Вообще говоря, цель исполнителя PL/Python — обеспечить <quote>естественное</quote> соответствие между мирами PostgreSQL и Python. Этим объясняется выбор правил сопоставления данных, описанных ниже.

source: Data Type Mapping
ru: Сопоставление типов данных

source: PostgreSQL <type>boolean</type> is converted to Python <type>bool</type>.
ru: Тип PostgreSQL <type>boolean</type> преобразуется в <type>bool</type> языка Python.

source: PostgreSQL <type>smallint</type> and <type>int</type> are converted to Python <type>int</type>. PostgreSQL <type>bigint</type> and <type>oid</type> are converted to <type>long</type> in Python 2 and to <type>int</type> in Python 3.
ru: Типы PostgreSQL <type>smallint</type> и <type>int</type> преобразуются в тип <type>int</type> языка Python. Типы PostgreSQL <type>bigint</type> и <type>oid</type> становятся типами <type>long</type> в Python 2 и <type>int</type> в Python 3.

source: PostgreSQL <type>real</type> and <type>double</type> are converted to Python <type>float</type>.
ru: Типы PostgreSQL <type>real</type> и <type>double</type> преобразуются в тип <type>float</type> языка Python.

source: PostgreSQL <type>numeric</type> is converted to Python <type>Decimal</type>. This type is imported from the <literal>cdecimal</literal> package if that is available. Otherwise, <literal>decimal.Decimal</literal> from the standard library will be used. <literal>cdecimal</literal> is significantly faster than <literal>decimal</literal>. In Python 3.3 and up, however, <literal>cdecimal</literal> has been integrated into the standard library under the name <literal>decimal</literal>, so there is no longer any difference.
ru: Тип PostgreSQL <type>numeric</type> преобразуется в <type>Decimal</type> среды Python. Этот тип импортируется из пакета <literal>cdecimal</literal>, при его наличии. В противном случае используется <literal>decimal.Decimal</literal> из стандартной библиотеки. Тип <literal>cdecimal</literal> работает значительно быстрее, чем <literal>decimal</literal>. Однако в Python версии 3.3 и выше тип <literal>cdecimal</literal> включается в стандартную библиотеку под именем <literal>decimal</literal>, так что теперь этого различия нет.

source: PostgreSQL <type>bytea</type> is converted to Python <type>str</type> in Python 2 and to <type>bytes</type> in Python 3. In Python 2, the string should be treated as a byte sequence without any character encoding.
ru: Тип PostgreSQL <type>bytea</type> становится типом <type>str</type> в Python 2 и <type>bytes</type> в Python 3. В Python 2 такую строку следует воспринимать как последовательность байт без какой-либо определённой кодировки символов.

source: All other data types, including the PostgreSQL character string types, are converted to a Python <type>str</type>. In Python 2, this string will be in the PostgreSQL server encoding; in Python 3, it will be a Unicode string like all strings.
ru: Все другие типы данных, включая типы символьных строк PostgreSQL, преобразуются в тип <type>str</type> языка Python. В Python 2 эта строка будет передаваться в кодировке сервера PostgreSQL; в Python 3 это будет строка в Unicode, как и все строки.

source: For nonscalar data types, see below.
ru: Информация о нескалярных типах данных приведена ниже.

source: When a PL/Python function is called, its arguments are converted from their PostgreSQL data type to a corresponding Python type: <placeholder-1/>
ru: Когда вызывается функция PL/Python, её аргументы преобразуются из типа PostgreSQL в соответствующий тип Python по таким правилам: <placeholder-1/>

source: When the PostgreSQL return type is <type>boolean</type>, the return value will be evaluated for truth according to the <emphasis>Python</emphasis> rules. That is, 0 and empty string are false, but notably <literal>'f'</literal> is true.
ru: Когда тип результата функции в PostgreSQL — <type>boolean</type>, возвращаемое значение приводится к логическому типу по правилам, принятым в <emphasis>Python</emphasis>. То есть false будет возвращено для 0 и пустой строки, но, обратите внимание, для <literal>'f'</literal> будет возвращено true.

source: When the PostgreSQL return type is <type>bytea</type>, the return value will be converted to a string (Python 2) or bytes (Python 3) using the respective Python built-ins, with the result being converted to <type>bytea</type>.
ru: Когда тип результата функции PostgreSQL — <type>bytea</type>, возвращаемое значение будет преобразовано в строку (Python 2) или набор байт (Python 3), используя встроенные средства Python, а затем будет приведено к типу <type>bytea</type>.

source: For all other PostgreSQL return types, the return value is converted to a string using the Python built-in <literal>str</literal>, and the result is passed to the input function of the PostgreSQL data type. (If the Python value is a <type>float</type>, it is converted using the <literal>repr</literal> built-in instead of <literal>str</literal>, to avoid loss of precision.)
ru: Для всех других типов результата PostgreSQL возвращаемое значение преобразуется в строку с помощью встроенной в Python функции <literal>str</literal>, и полученная строка передаётся функции ввода типа данных PostgreSQL. (Если значение в Python имеет тип <type>float</type>, оно преобразуется встроенной функцией <literal>repr</literal>, а не <literal>str</literal>, для недопущения потери точности.)

source: Strings in Python 2 are required to be in the PostgreSQL server encoding when they are passed to PostgreSQL. Strings that are not valid in the current server encoding will raise an error, but not all encoding mismatches can be detected, so garbage data can still result when this is not done correctly. Unicode strings are converted to the correct encoding automatically, so it can be safer and more convenient to use those. In Python 3, all strings are Unicode strings.
ru: Из кода Python 2 строки должны передаваться в PostgreSQL в кодировке сервера PostgreSQL. При передаче строки, неприемлемой для текущей кодировки сервера, возникает ошибка, но не все несоответствия кодировки могут быть выявлены, так что с некорректной кодировкой всё же могут быть получены нечитаемые строки. Строки Unicode переводятся в нужную кодировку автоматически, так что использовать их может быть безопаснее и удобнее. В Python 3 все строки имеют кодировку Unicode.

source: When a PL/Python function returns, its return value is converted to the function's declared PostgreSQL return data type as follows: <placeholder-1/> Note that logical mismatches between the declared PostgreSQL return type and the Python data type of the actual return object are not flagged; the value will be converted in any case.
ru: При завершении функции PL/Python её значение результата преобразуется в тип данных, объявленный как тип результата в PostgreSQL, следующим образом: <placeholder-1/> Заметьте, что логические несоответствия между объявленным в PostgreSQL типом результата и типом фактически возвращаемого объекта Python игнорируются — значение преобразуется в любом случае.
