Repository: pluzanov/pg-doc-ru
Catalog: 9.6/plpython.po
Languages: ru

source: If an SQL null value<placeholder-1/> is passed to a function, the argument value will appear as <symbol>None</symbol> in Python. For example, the function definition of <function>pymax</function> shown in <xref linkend="plpython-funcs"/> will return the wrong answer for null inputs. We could add <literal>STRICT</literal> to the function definition to make <productname>PostgreSQL</productname> do something more reasonable: if a null value is passed, the function will not be called at all, but will just return a null result automatically. Alternatively, we could check for null inputs in the function body: <placeholder-2/> As shown above, to return an SQL null value from a PL/Python function, return the value <symbol>None</symbol>. This can be done whether the function is strict or not.
ru: Если функции передаётся значение SQL NULL<placeholder-1/>, в Python значением этого аргумента будет <symbol>None</symbol>. Например, функция <function>pymax</function>, определённая как показано в <xref linkend="plpython-funcs"/>, возвратит неверный ответ, получив аргументы NULL. Мы могли бы добавить указание <literal>STRICT</literal> в определение функции, чтобы <productname>PostgreSQL</productname> поступал немного разумнее: при передаче значения NULL функция вовсе не будет вызываться, будет сразу возвращён результат NULL. С другой стороны, мы могли бы проверить аргументы на NULL в теле функции: <placeholder-2/> Как показано выше, чтобы выдать из функции PL/Python значение SQL NULL, нужно вернуть значение <symbol>None</symbol>. Это можно сделать и в строгой, и в нестрогой функции.

source: Arrays, Lists
ru: Массивы, списки

source: SQL array values are passed into PL/Python as a Python list. To return an SQL array value out of a PL/Python function, return a Python sequence, for example a list or tuple: <placeholder-1/> Note that in Python, strings are sequences, which can have undesirable effects that might be familiar to Python programmers: <placeholder-2/>
ru: Значения массивов SQL передаются в PL/Python в виде списка Python. Чтобы вернуть массив SQL из функции PL/Python, возвратите последовательность Python, например, список или кортеж: <placeholder-1/> Учтите, что в Python и строки являются последовательностями, что может давать неожиданные эффекты, хорошо знакомые тем, кто программирует на Python: <placeholder-2/>

source: Composite Types
ru: Составные типы

source: Composite-type arguments are passed to the function as Python mappings. The element names of the mapping are the attribute names of the composite type. If an attribute in the passed row has the null value, it has the value <symbol>None</symbol> in the mapping. Here is an example: <placeholder-1/>
ru: Аргументы составного типа передаются функции в виде сопоставлений Python. Именами элементов сопоставления являются атрибуты составного типа. Если атрибут в переданной строке имеет значение NULL, он передаётся в сопоставлении значением <symbol>None</symbol>. Пример работы с составным типом: <placeholder-1/>

source: Sequence type (a tuple or list, but not a set because it is not indexable)
ru: Последовательность (кортеж или список, но не множество, так как оно не индексируется)

source: CREATE FUNCTION make_pair (name text, value integer) RETURNS named_value AS $$ return [ name, value ] # or alternatively, as tuple: return ( name, value ) $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION make_pair (name text, value integer) RETURNS named_value AS $$ return [ name, value ] # или в виде кортежа: return ( name, value ) $$ LANGUAGE plpythonu;

source: Returned sequence objects must have the same number of items as the composite result type has fields. The item with index 0 is assigned to the first field of the composite type, 1 to the second and so on. For example: <placeholder-1/> To return a SQL null for any column, insert <symbol>None</symbol> at the corresponding position.
ru: В возвращаемых объектах последовательностей должно быть столько элементов, сколько полей в составном типе результата. Элемент с индексом 0 присваивается первому полю составного типа, с индексом 1 — второму и т. д. Например: <placeholder-1/> Чтобы выдать SQL NULL для какого-нибудь столбца, вставьте в соответствующую позицию <symbol>None</symbol>.

source: Mapping (dictionary)
ru: Сопоставление (словарь)

source: The value for each result type column is retrieved from the mapping with the column name as key. Example: <placeholder-1/> Any extra dictionary key/value pairs are ignored. Missing keys are treated as errors. To return a SQL null value for any column, insert <symbol>None</symbol> with the corresponding column name as the key.
ru: Значение столбца результата получается из сопоставления, в котором ключом является имя столбца. Например: <placeholder-1/> Любые дополнительные пары ключ/значение в словаре игнорируются, а отсутствие нужных ключей считается ошибкой. Чтобы выдать SQL NULL для какого-нибудь столбца, вставьте <symbol>None</symbol> с именем соответствующего столбца в качестве ключа.

source: Object (any object providing method <literal>__getattr__</literal>)
ru: Объект (любой объект с методом <literal>__getattr__</literal>)

source: CREATE FUNCTION make_pair (name text, value integer) RETURNS named_value AS $$ class named_value: def __init__ (self, n, v): self.name = n self.value = v return named_value(name, value) # or simply class nv: pass nv.name = name nv.value = value return nv $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION make_pair (name text, value integer) RETURNS named_value AS $$ class named_value: def __init__ (self, n, v): self.name = n self.value = v return named_value(name, value) # или просто class nv: pass nv.name = name nv.value = value return nv $$ LANGUAGE plpythonu;

source: This works the same as a mapping. Example: <placeholder-1/>
ru: Объект передаётся аналогично сопоставлению. Пример: <placeholder-1/>

source: There are multiple ways to return row or composite types from a Python function. The following examples assume we have: <placeholder-1/> A composite result can be returned as a: <placeholder-2/>
ru: Возвратить составной тип или строку таблицы из функции Python можно несколькими способами. В следующих примерах предполагается, что у нас объявлен тип: <placeholder-1/> Результат этого типа можно вернуть как: <placeholder-2/>

source: Functions with <literal>OUT</literal> parameters are also supported. For example: <placeholder-1/>
ru: Также поддерживаются функции с параметрами <literal>OUT</literal> (выходными). Например: <placeholder-1/>

source: Set-returning Functions
ru: Функции, возвращающие множества

source: Sequence type (tuple, list, set)
ru: Последовательность (кортеж, список, множество)

source: CREATE FUNCTION greet (how text) RETURNS SETOF greeting AS $$ # return tuple containing lists as composite types # all other combinations work also return ( [ how, "World" ], [ how, "PostgreSQL" ], [ how, "PL/Python" ] ) $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION greet (how text) RETURNS SETOF greeting AS $$ # возвращает кортеж, содержащий списки в качестве составных типов # также будут работать и остальные комбинации return ( [ how, "World" ], [ how, "PostgreSQL" ], [ how, "PL/Python" ] ) $$ LANGUAGE plpythonu;

source: Iterator (any object providing <symbol>__iter__</symbol> and <symbol>next</symbol> methods)
ru: Итератор (любой объект, реализующий методы <symbol>__iter__</symbol> и <symbol>next</symbol>)

source: Generator (<literal>yield</literal>)
ru: Генератор (<literal>yield</literal>)

source: Due to Python <ulink url="http://bugs.python.org/issue1483133">bug #1483133</ulink>, some debug versions of Python 2.4 (configured and compiled with option <literal>--with-pydebug</literal>) are known to crash the <productname>PostgreSQL</productname> server when using an iterator to return a set result. Unpatched versions of Fedora 4 contain this bug. It does not happen in production versions of Python or on patched versions of Fedora 4.
ru: Из-за <ulink url="http://bugs.python.org/issue1483133">ошибки 1483133</ulink> в Python, некоторые отладочные версии Python 2.4 (сконфигурированные и скомпилированные с ключом <literal>--with-pydebug</literal>) выводят из строя сервер <productname>PostgreSQL</productname>, когда итератор возвращает набор результатов. Эта ошибка проявляется в неисправленных версиях Fedora 4, но не в выпускаемых версиях Python и в исправленной Fedora 4.

source: A <application>PL/Python</application> function can also return sets of scalar or composite types. There are several ways to achieve this because the returned object is internally turned into an iterator. The following examples assume we have composite type: <placeholder-1/> A set result can be returned from a: <placeholder-2/>
ru: Функция <application>PL/Python</application> также может возвращать множества, содержащие скалярные и составные типы. Это можно осуществить разными способами, так как возвращаемый объект внутри превращается в итератор. В следующих примерах предполагается, что у нас есть составной тип: <placeholder-1/> Множество в качестве результата можно возвратить, применив: <placeholder-2/>

source: Set-returning functions with <literal>OUT</literal> parameters (using <literal>RETURNS SETOF record</literal>) are also supported. For example: <placeholder-1/>
ru: Также поддерживаются функции, возвращающие множества, с параметрами <literal>OUT</literal> (объявленные с <literal>RETURNS SETOF record</literal>). Например: <placeholder-1/>

source: Sharing Data
ru: Совместное использование данных

source: <primary>global data</primary> <secondary>in PL/Python</secondary>
ru: <primary>глобальные данные</primary> <secondary>в PL/Python</secondary>

source: The global dictionary <varname>SD</varname> is available to store data between function calls. This variable is private static data. The global dictionary <varname>GD</varname> is public data, available to all Python functions within a session. Use with care.<placeholder-1/>
ru: Для хранения данных между вызовами функции предусмотрен глобальный словарь <varname>SD</varname>, объявленный как частный статический. Для размещения публичных данных предназначен глобальный словарь <varname>GD</varname>, доступный всем функциями на Python в сеансе. Обращайтесь с ними осторожно.<placeholder-1/>

source: Each function gets its own execution environment in the Python interpreter, so that global data and function arguments from <function>myfunc</function> are not available to <function>myfunc2</function>. The exception is the data in the <varname>GD</varname> dictionary, as mentioned above.
ru: Каждая функция получает собственную среду выполнения в интерпретаторе Python, так что глобальные данные и аргументы функции, например <function>myfunc</function>, не будут доступны в <function>myfunc2</function>. Исключение составляют данные в словаре <varname>GD</varname>, как сказано выше.

source: Anonymous Code Blocks
ru: Анонимные блоки кода

source: DO $$ # PL/Python code $$ LANGUAGE plpythonu;
ru: DO $$ # Код на PL/Python $$ LANGUAGE plpythonu;

source: PL/Python also supports anonymous code blocks called with the <xref linkend="sql-do"/> statement: <placeholder-1/> An anonymous code block receives no arguments, and whatever value it might return is discarded. Otherwise it behaves just like a function.
ru: PL/Python также поддерживает анонимные блоки кода, которые выполняются оператором <xref linkend="sql-do"/>: <placeholder-1/> Анонимный блок кода не принимает аргументы, а любое значение, которое он мог бы вернуть, отбрасывается. В остальном он работает подобно коду функции.

source: Trigger Functions
ru: Триггерные функции

source: <primary>trigger</primary> <secondary>in PL/Python</secondary>
ru: <primary>триггер</primary> <secondary>в PL/Python</secondary>

source: contains the event as a string: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, or <literal>TRUNCATE</literal>.
ru: содержит название события в виде строки: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> или <literal>TRUNCATE</literal>.

source: contains one of <literal>BEFORE</literal>, <literal>AFTER</literal>, or <literal>INSTEAD OF</literal>.
ru: содержит одну из строк: <literal>BEFORE</literal>, <literal>AFTER</literal> или <literal>INSTEAD OF</literal>.

source: contains <literal>ROW</literal> or <literal>STATEMENT</literal>.
ru: содержит <literal>ROW</literal> или <literal>STATEMENT</literal>.

source: For a row-level trigger, one or both of these fields contain the respective trigger rows, depending on the trigger event.
ru: Для триггера уровня строки одно или оба этих поля содержат соответствующие строки триггера, в зависимости от события триггера.

source: contains the trigger name.
ru: содержит имя триггера.

source: contains the name of the table on which the trigger occurred.
ru: содержит имя таблицы, для которой сработал триггер.

source: contains the schema of the table on which the trigger occurred.
ru: содержит схему таблицы, для которой сработал триггер.

source: contains the OID of the table on which the trigger occurred.
ru: содержит OID таблицы, для которой сработал триггер.

source: If the <command>CREATE TRIGGER</command> command included arguments, they are available in <literal>TD["args"][0]</literal> to <literal>TD["args"][<replaceable>n</replaceable>-1]</literal>.
ru: Если в команде <command>CREATE TRIGGER</command> задавались аргументы, их можно получить как элементы массива с <literal>TD["args"][0]</literal> по <literal>TD["args"][<replaceable>n</replaceable>-1]</literal>.

source: When a function is used as a trigger, the dictionary <literal>TD</literal> contains trigger-related values: <placeholder-1/>
ru: Когда функция используется как триггер, словарь <literal>TD</literal> содержит значения, связанные с работой триггера: <placeholder-1/>

source: If <literal>TD["when"]</literal> is <literal>BEFORE</literal> or <literal>INSTEAD OF</literal> and <literal>TD["level"]</literal> is <literal>ROW</literal>, you can return <literal>None</literal> or <literal>"OK"</literal> from the Python function to indicate the row is unmodified, <literal>"SKIP"</literal> to abort the event, or if <literal>TD["event"]</literal> is <command>INSERT</command> or <command>UPDATE</command> you can return <literal>"MODIFY"</literal> to indicate you've modified the new row. Otherwise the return value is ignored.
ru: Если в <literal>TD["when"]</literal> передано <literal>BEFORE</literal> или <literal>INSTEAD OF</literal>, а в <literal>TD["level"]</literal> — <literal>ROW</literal>, вы можете вернуть значение <literal>None</literal> или <literal>"OK"</literal> из функции Python, чтобы показать, что строка не была изменена, значение <literal>"SKIP"</literal>, чтобы прервать событие, либо, если в <literal>TD["event"]</literal> передана команда <command>INSERT</command> или <command>UPDATE</command>, вы можете вернуть <literal>"MODIFY"</literal>, чтобы показать, что новая строка была изменена. Во всех других случаях возвращаемое значение игнорируется.

source: Database Access
ru: Обращение к базе данных

source: The PL/Python language module automatically imports a Python module called <literal>plpy</literal>. The functions and constants in this module are available to you in the Python code as <literal>plpy.<replaceable>foo</replaceable></literal>.
ru: Исполнитель языка PL/Python автоматически импортирует модуль Python с именем <literal>plpy</literal>. Вы в своём коде можете использовать функции и константы, объявленные в этом модуле, обращаясь к ним по именам вида <literal>plpy.<replaceable>имя</replaceable></literal>.

source: Database Access Functions
ru: Функции обращения к базе данных

source: The <literal>plpy</literal> module provides several functions to execute database commands:
ru: Модуль <literal>plpy</literal> содержит различные функции для выполнения команд в базе данных:

source: query
ru: запрос

source: max-rows
ru: макс-строк

source: Calling <function>plpy.execute</function> with a query string and an optional row limit argument causes that query to be run and the result to be returned in a result object.
ru: При вызове <function>plpy.execute</function> со строкой запроса и необязательным аргументом, ограничивающим число строк, выполняется заданный запрос, а то, что он выдаёт, возвращается в виде объекта результата.

source: The result object emulates a list or dictionary object. The result object can be accessed by row number and column name. For example: <placeholder-1/> returns up to 5 rows from <literal>my_table</literal>. If <literal>my_table</literal> has a column <literal>my_column</literal>, it would be accessed as: <placeholder-2/> The number of rows returned can be obtained using the built-in <function>len</function> function.
ru: Объект результата имитирует список или словарь. Получить из него данные можно по номеру строки и имени столбца. Например, команда: <placeholder-1/> вернёт не более 5 строк из отношения <literal>my_table</literal>. Если в <literal>my_table</literal> есть столбец <literal>my_column</literal>, к нему можно обратиться так: <placeholder-2/> Число возвращённых в этом объекте строк можно получить, воспользовавшись встроенной функцией <function>len</function>.

source: Returns the number of rows processed by the command. Note that this is not necessarily the same as the number of rows returned. For example, an <command>UPDATE</command> command will set this value but won't return any rows (unless <literal>RETURNING</literal> is used).
ru: Возвращает число строк, обработанных командой. Заметьте, что это число не обязательно будет равно числу возвращённых строк. Например, команда <command>UPDATE</command> устанавливает это значение, но не возвращает строк (без указания <literal>RETURNING</literal>).

source: The <function>SPI_execute()</function> return value.
ru: Значение состояния, возвращённое <function>SPI_execute()</function>.

source: Return a list of column names, list of column type OIDs, and list of type-specific type modifiers for the columns, respectively.
ru: Возвращают список имён столбцов, список OID типов столбцов и список модификаторов типа этих столбцов, соответственно.

source: These methods raise an exception when called on a result object from a command that did not produce a result set, e.g., <command>UPDATE</command> without <literal>RETURNING</literal>, or <command>DROP TABLE</command>. But it is OK to use these methods on a result set containing zero rows.
ru: Эти методы вызывают исключение, когда им передаётся объект, полученный от команды, не возвращающей результирующий набор, например, <command>UPDATE</command> без <literal>RETURNING</literal>, либо <command>DROP TABLE</command>. Но эти методы вполне можно использовать с результатом, содержащим ноль строк.

source: The standard <literal>__str__</literal> method is defined so that it is possible for example to debug query execution results using <literal>plpy.debug(rv)</literal>.
ru: Стандартный метод <literal>__str__</literal> определён так, чтобы можно было, например, вывести отладочное сообщение с результатами запроса, вызвав <literal>plpy.debug(rv)</literal>.

source: The result object has these additional methods: <placeholder-1/>
ru: Для объекта результата определены следующие дополнительные методы: <placeholder-1/>

source: The result object can be modified.
ru: Объект результата может быть изменён.

source: Note that calling <literal>plpy.execute</literal> will cause the entire result set to be read into memory. Only use that function when you are sure that the result set will be relatively small. If you don't want to risk excessive memory usage when fetching large results, use <literal>plpy.cursor</literal> rather than <literal>plpy.execute</literal>.
ru: Заметьте, что при вызове <literal>plpy.execute</literal> весь набор результатов будет прочитан в память. Эту функцию следует использовать, только если вы знаете, что набор будет относительно небольшим. Если вы хотите исключить риск переполнения памяти при выборке результатов большого объёма, используйте <literal>plpy.cursor</literal> вместо <literal>plpy.execute</literal>.

source: argtypes
ru: типы_аргументов

source: plan
ru: план

source: arguments
ru: аргументы

source: After preparing a statement, you use a variant of the function <function>plpy.execute</function> to run it: <placeholder-1/> Pass the plan as the first argument (instead of the query string), and a list of values to substitute into the query as the second argument. The second argument is optional if the query does not expect any parameters. The third argument is the optional row limit as before.
ru: Чтобы запустить подготовленный оператор на выполнение, используйте вариацию функции <function>plpy.execute</function>: <placeholder-1/> Передайте план в первом аргументе (вместо строки запроса), а список значений, которые будут подставлены в запрос, — во втором. Второй аргумент можно опустить, если запрос не принимает никакие параметры. Третий аргумент, как и раньше, задаёт необязательное ограничение максимального числа строк.

source: Query parameters and result row fields are converted between PostgreSQL and Python data types as described in <xref linkend="plpython-data"/>.
ru: Параметры запросов и поля строк результата преобразуются между типами данных PostgreSQL и Python как описано в <xref remap="6" linkend="plpython-data"/>.

source: CREATE FUNCTION usesavedplan() RETURNS trigger AS $$ if "plan" in SD: plan = SD["plan"] else: plan = plpy.prepare("SELECT 1") SD["plan"] = plan # rest of function $$ LANGUAGE plpythonu;
ru: CREATE FUNCTION usesavedplan() RETURNS trigger AS $$ if "plan" in SD: plan = SD["plan"] else: plan = plpy.prepare("SELECT 1") SD["plan"] = plan # остальной код функции $$ LANGUAGE plpythonu;

source: When you prepare a plan using the PL/Python module it is automatically saved. Read the SPI documentation (<xref linkend="spi"/>) for a description of what this means. In order to make effective use of this across function calls one needs to use one of the persistent storage dictionaries <literal>SD</literal> or <literal>GD</literal> (see <xref linkend="plpython-sharing"/>). For example: <placeholder-1/>
ru: Когда вы подготавливаете план, используя модуль PL/Python, он сохраняется автоматически. Что это означает, вы можете узнать в документации SPI (<xref linkend="spi"/>). Чтобы эффективно использовать это в нескольких вызовах функции, может потребоваться применить словарь постоянного хранения <literal>SD</literal> или <literal>GD</literal> (см. <xref remap="4" linkend="plpython-sharing"/>). Например: <placeholder-1/>

source: The <literal>plpy.cursor</literal> function accepts the same arguments as <literal>plpy.execute</literal> (except for the row limit) and returns a cursor object, which allows you to process large result sets in smaller chunks. As with <literal>plpy.execute</literal>, either a query string or a plan object along with a list of arguments can be used.
ru: Функция <literal>plpy.cursor</literal> принимает те же аргументы, что и <literal>plpy.execute</literal> (кроме ограничения строк) и возвращает объект курсора, который позволяет обрабатывать объёмные наборы результатов небольшими порциями. Как и <literal>plpy.execute</literal>, этой функции можно передать строку запроса или объекта плана, вместе со списком аргументов.
