Repository: pluzanov/pg-doc-ru
Catalog: 9.6/postgres.po
Languages: ru

source: PostgreSQL &version; Documentation
ru: Документация по PostgreSQL &version;

source: Tutorial
ru: Введение

source: Welcome to the <productname>PostgreSQL</productname> Tutorial. The following few chapters are intended to give a simple introduction to <productname>PostgreSQL</productname>, relational database concepts, and the SQL language to those who are new to any one of these aspects. We only assume some general knowledge about how to use computers. No particular Unix or programming experience is required. This part is mainly intended to give you some hands-on experience with important aspects of the <productname>PostgreSQL</productname> system. It makes no attempt to be a complete or thorough treatment of the topics it covers.
ru: Добро пожаловать на встречу с <productname>PostgreSQL</productname>. В следующих главах вы сможете получить общее представление о <productname>PostgreSQL</productname>, реляционных базах данных и языке SQL, если вы ещё не знакомы с этими темами. Этот материал будет понятен даже тем, кто обладает только общими знаниями о компьютерах. Ни опыт программирования, ни навыки использования Unix-систем не требуются. Основная цель этой части &mdash; познакомить вас на практике с ключевыми аспектами системы <productname>PostgreSQL</productname>, поэтому затрагиваемые в ней темы не будут рассматриваться максимально глубоко и полно.

source: After you have worked through this tutorial you might want to move on to reading <xref linkend="sql"/> to gain a more formal knowledge of the SQL language, or <xref linkend="client-interfaces"/> for information about developing applications for <productname>PostgreSQL</productname>. Those who set up and manage their own server should also read <xref linkend="admin"/>.
ru: Прочитав это введение, вы, возможно, захотите перейти к <xref remap="3" linkend="sql"/>, чтобы получить более формализованное знание языка SQL, или к <xref remap="3" linkend="client-interfaces"/>, посвящённой разработке приложений для <productname>PostgreSQL</productname>. Тем же, кто устанавливает и администрирует сервер самостоятельно, следует также прочитать <xref linkend="admin"/>.

source: The SQL Language
ru: Язык SQL

source: This part describes the use of the <acronym>SQL</acronym> language in <productname>PostgreSQL</productname>. We start with describing the general syntax of <acronym>SQL</acronym>, then explain how to create the structures to hold data, how to populate the database, and how to query it. The middle part lists the available data types and functions for use in <acronym>SQL</acronym> commands. The rest treats several aspects that are important for tuning a database for optimal performance.
ru: В этой части книги описывается использование языка <acronym>SQL</acronym> в <productname>PostgreSQL</productname>. Мы начнём с описания общего синтаксиса <acronym>SQL</acronym>, затем расскажем, как создавать структуры для хранения данных, как наполнять базу данных и как выполнять запросы к ней. В продолжении будут перечислены существующие типы данных и функции, применяемые с командами <acronym>SQL</acronym>. И наконец, закончится эта часть рассмотрением важных аспектов настройки базы данных для оптимальной производительности.

source: The information in this part is arranged so that a novice user can follow it start to end to gain a full understanding of the topics without having to refer forward too many times. The chapters are intended to be self-contained, so that advanced users can read the chapters individually as they choose. The information in this part is presented in a narrative fashion in topical units. Readers looking for a complete description of a particular command should see <xref linkend="reference"/>.
ru: Материал этой части упорядочен так, чтобы новичок мог прочитать её от начала до конца и полностью понять все темы, не забегая вперёд. При этом главы сделаны самодостаточными, так что опытные пользователи могут читать главы по отдельности. Информация в этой части книги представлена в повествовательном стиле и разделена по темам. Если же вас интересует формальное и полное описание определённой команды, см. <xref remap="4" linkend="reference"/>.

source: Readers of this part should know how to connect to a <productname>PostgreSQL</productname> database and issue <acronym>SQL</acronym> commands. Readers that are unfamiliar with these issues are encouraged to read <xref linkend="tutorial"/> first. <acronym>SQL</acronym> commands are typically entered using the <productname>PostgreSQL</productname> interactive terminal <application>psql</application>, but other programs that have similar functionality can be used as well.
ru: Читатели этой части книги должны уже знать, как подключаться к базе данных <productname>PostgreSQL</productname> и выполнять команды <acronym>SQL</acronym>. Если вы ещё не знаете этого, рекомендуется сначала прочитать <xref remap="4" linkend="tutorial"/>. Команды <acronym>SQL</acronym> обычно вводятся в <application>psql</application> &mdash; интерактивном терминальном приложении <productname>PostgreSQL</productname>, но можно воспользоваться и другими программами с подобными функциями.

source: Server Administration
ru: Администрирование сервера

source: This part covers topics that are of interest to a <productname>PostgreSQL</productname> database administrator. This includes installation of the software, set up and configuration of the server, management of users and databases, and maintenance tasks. Anyone who runs a <productname>PostgreSQL</productname> server, even for personal use, but especially in production, should be familiar with the topics covered in this part.
ru: В этой части документации освещаются темы, представляющие интерес для администратора баз данных <productname>PostgreSQL</productname>. В частности, здесь рассматривается установка программного обеспечения, установка и настройка сервера, управление пользователями и базами данных, а также задачи обслуживания. С этими темами следует ознакомиться всем, кто эксплуатирует сервер <productname>PostgreSQL</productname> (даже для личных целей, а тем более в производственной среде).

source: The information in this part is arranged approximately in the order in which a new user should read it. But the chapters are self-contained and can be read individually as desired. The information in this part is presented in a narrative fashion in topical units. Readers looking for a complete description of a particular command should see <xref linkend="reference"/>.
ru: Материал этой части даётся примерно в том порядке, в каком его следует читать начинающему пользователю. При этом её главы самодостаточны и при желании могут быть прочитаны по отдельности. Информация в этой части книги представлена в повествовательном стиле и разделена по темам. Если же вас интересует формальное и полное описание определённой команды, см. <xref remap="4" linkend="reference"/>.

source: The first few chapters are written so they can be understood without prerequisite knowledge, so new users who need to set up their own server can begin their exploration with this part. The rest of this part is about tuning and management; that material assumes that the reader is familiar with the general use of the <productname>PostgreSQL</productname> database system. Readers are encouraged to look at <xref linkend="tutorial"/> and <xref linkend="sql"/> for additional information.
ru: Первые несколько глав написаны так, чтобы их можно было понять без предварительных знаний, так что начинающие пользователи, которым нужно установить свой собственный сервер, могут начать свой путь с них. Остальные главы части посвящены настройке сервера и управлению им; в этом материале подразумевается, что читатель знаком с основными принципами использования СУБД <productname>PostgreSQL</productname>. За дополнительной информацией мы рекомендуем читателям обратиться к <xref remap="3" linkend="tutorial"/> и <xref remap="3" linkend="sql"/>.

source: Client Interfaces
ru: Клиентские интерфейсы

source: This part describes the client programming interfaces distributed with <productname>PostgreSQL</productname>. Each of these chapters can be read independently. Note that there are many other programming interfaces for client programs that are distributed separately and contain their own documentation (<xref linkend="external-projects"/> lists some of the more popular ones). Readers of this part should be familiar with using <acronym>SQL</acronym> commands to manipulate and query the database (see <xref linkend="sql"/>) and of course with the programming language that the interface uses.
ru: В этой части документации описываются клиентские программные интерфейсы, включённые в дистрибутив <productname>PostgreSQL</productname>. Все включённые в неё главы можно читать по отдельности. Заметьте, что существует множество других программных интерфейсов, со своей документацией (некоторые наиболее популярные перечислены в <xref remap="6" linkend="external-projects"/>). Для изучения этой части нужно уметь работать с базой данных, используя команды <acronym>SQL</acronym> (см. <xref remap="4" linkend="sql"/>), и, конечно же, знать язык программирования, на который ориентирован определённый интерфейс.

source: Server Programming
ru: Серверное программирование

source: This part is about extending the server functionality with user-defined functions, data types, triggers, etc. These are advanced topics which should probably be approached only after all the other user documentation about <productname>PostgreSQL</productname> has been understood. Later chapters in this part describe the server-side programming languages available in the <productname>PostgreSQL</productname> distribution as well as general issues concerning server-side programming languages. It is essential to read at least the earlier sections of <xref linkend="extend"/> (covering functions) before diving into the material about server-side programming languages.
ru: Эта часть документации посвящена расширению функциональности сервера путём реализации собственных функций, типов данных, триггеров и т. д. Это довольно сложные темы, для освоения которых рекомендуется предварительно изучить и понять всю остальную документацию для пользователей <productname>PostgreSQL</productname>. В последних главах этой части описываются языки программирования на стороне сервера, поддерживаемые дистрибутивом <productname>PostgreSQL</productname>, и рассматриваются общие вопросы, связанные с программированием на стороне сервера. Но прежде чем погружаться в этот материал, важно изучить предыдущие разделы <xref remap="2" linkend="extend"/> (где освещаются функции).

source: Internals
ru: Внутреннее устройство

source: This part contains assorted information that might be of use to <productname>PostgreSQL</productname> developers.
ru: Содержит разнообразную информацию, полезную для разработчиков <productname>PostgreSQL</productname>.

source: Appendixes
ru: Приложения
