Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rangetypes.po
Languages: ru

source: If the subtype is considered to have discrete rather than continuous values, the <command>CREATE TYPE</command> command should specify a <literal>canonical</literal> function. The canonicalization function takes an input range value, and must return an equivalent range value that may have different bounds and formatting. The canonical output for two ranges that represent the same set of values, for example the integer ranges <literal>[1, 7]</literal> and <literal>[1, 8)</literal>, must be identical. It doesn't matter which representation you choose to be the canonical one, so long as two equivalent values with different formattings are always mapped to the same value with the same formatting. In addition to adjusting the inclusive/exclusive bounds format, a canonicalization function might round off boundary values, in case the desired step size is larger than what the subtype is capable of storing. For instance, a range type over <type>timestamp</type> could be defined to have a step size of an hour, in which case the canonicalization function would need to round off bounds that weren't a multiple of an hour, or perhaps throw an error instead.
ru: Если подтип можно рассматривать как дискретный, а не непрерывный, в команде <command>CREATE TYPE</command> следует также задать функцию <literal>канонизации</literal>. Этой функции будет передаваться значение диапазона, а она должна вернуть равнозначное значение, но, возможно, с другими границами и форматированием. Для двух диапазонов, представляющих одно множество значений, например, целочисленные диапазоны <literal>[1, 7]</literal> и <literal>[1, 8)</literal>, функция канонизации должна выдавать один результат. Какое именно представление будет считаться каноническим, не имеет значения &mdash; главное, чтобы два равнозначных диапазона, отформатированных по-разному, всегда преобразовывались в одно значение с одинаковым форматированием. Помимо исправления формата включаемых/исключаемых границ, функция канонизации может округлять значения границ, если размер шага превышает точность хранения подтипа. Например, в типе диапазона для подтипа <type>timestamp</type> можно определить размер шага, равный часу, тогда функция канонизации должна будет округлить границы, заданные, например с точностью до минут, либо вместо этого выдать ошибку.

source: In addition, any range type that is meant to be used with GiST or SP-GiST indexes should define a subtype difference, or <literal>subtype_diff</literal>, function. (The index will still work without <literal>subtype_diff</literal>, but it is likely to be considerably less efficient than if a difference function is provided.) The subtype difference function takes two input values of the subtype, and returns their difference (i.e., <replaceable>X</replaceable> minus <replaceable>Y</replaceable>) represented as a <type>float8</type> value. In our example above, the function <function>float8mi</function> that underlies the regular <type>float8</type> minus operator can be used; but for any other subtype, some type conversion would be necessary. Some creative thought about how to represent differences as numbers might be needed, too. To the greatest extent possible, the <literal>subtype_diff</literal> function should agree with the sort ordering implied by the selected operator class and collation; that is, its result should be positive whenever its first argument is greater than its second according to the sort ordering.
ru: Помимо этого, для любого диапазонного типа, ориентированного на использование с индексами GiST или SP-GiST, должна быть определена разница значений подтипов, функция <literal>subtype_diff</literal>. (Индекс сможет работать и без <literal>subtype_diff</literal>, но в большинстве случае это будет не так эффективно.) Эта функция принимает на вход два значения подтипа и возвращает их разницу (т. е. <replaceable>X</replaceable> минус <replaceable>Y</replaceable>) в значении типа <type>float8</type>. В показанном выше примере может использоваться функция <function>float8mi</function>, определяющая нижележащую реализацию обычного оператора <quote>минус</quote> для типа <type>float8</type>, но для другого подтипа могут потребоваться дополнительные преобразования. Иногда для представления разницы в числовом виде требуется ещё и творческий подход. Функция <literal>subtype_diff</literal>, насколько это возможно, должна быть согласована с порядком сортировки, вытекающим из выбранных правил сортировки и класса оператора; то есть, её результат должен быть положительным, если согласно порядку сортировки первый её аргумент больше второго.

source: A less-oversimplified example of a <literal>subtype_diff</literal> function is:
ru: Ещё один, не столь тривиальный пример функции <literal>subtype_diff</literal>:

source: See <xref linkend="sql-createtype"/> for more information about creating range types.
ru: Дополнительные сведения о создании диапазонных типов можно найти в описании <xref linkend="sql-createtype"/>.

source: Indexing
ru: Индексация

source: <primary>range type</primary><secondary>indexes on</secondary>
ru: <primary>диапазонный тип</primary><secondary>индексы</secondary>

source: GiST and SP-GiST indexes can be created for table columns of range types. For instance, to create a GiST index: <placeholder-1/> A GiST or SP-GiST index can accelerate queries involving these range operators: <literal>=</literal>, <literal>&amp;&amp;</literal>, <literal>&lt;@</literal>, <literal>@&gt;</literal>, <literal>&lt;&lt;</literal>, <literal>&gt;&gt;</literal>, <literal>-|-</literal>, <literal>&amp;&lt;</literal>, and <literal>&amp;&gt;</literal> (see <xref linkend="range-operators-table"/> for more information).
ru: Для столбцов, имеющих диапазонный тип, можно создать индексы GiST и SP-GiST. Например, так создаётся индекс GiST: <placeholder-1/> Индекс GiST или SP-GiST помогает ускорить запросы со следующими операторами: <literal>=</literal>, <literal>&amp;&amp;</literal>, <literal>&lt;@</literal>, <literal>@&gt;</literal>, <literal>&lt;&lt;</literal>, <literal>&gt;&gt;</literal>, <literal>-|-</literal>, <literal>&amp;&lt;</literal> и <literal>&amp;&gt;</literal> (дополнительно о них можно узнать в <xref remap="6" linkend="range-operators-table"/>.

source: In addition, B-tree and hash indexes can be created for table columns of range types. For these index types, basically the only useful range operation is equality. There is a B-tree sort ordering defined for range values, with corresponding <literal>&lt;</literal> and <literal>&gt;</literal> operators, but the ordering is rather arbitrary and not usually useful in the real world. Range types' B-tree and hash support is primarily meant to allow sorting and hashing internally in queries, rather than creation of actual indexes.
ru: Кроме того, для таких столбцов можно создать индексы на основе хеша и B-деревьев. Для индексов таких типов полезен по сути только один оператор диапазона &mdash; равно. Порядок сортировки B-дерева определяется для значений диапазона соответствующими операторами <literal>&lt;</literal> и <literal>&gt;</literal>, но этот порядок может быть произвольным и он не очень важен в реальном мире. Поддержка B-деревьев и хешей диапазонными типами нужна в основном для сортировки и хеширования при выполнении запросов, но не для создания самих индексов.

source: Constraints on Ranges
ru: Ограничения для диапазонов

source: <primary>range type</primary><secondary>exclude</secondary>
ru: <primary>диапазонный тип</primary><secondary>исключение</secondary>

source: INSERT INTO reservation VALUES ('[2010-01-01 11:30, 2010-01-01 15:00)'); INSERT 0 1 INSERT INTO reservation VALUES ('[2010-01-01 14:45, 2010-01-01 15:45)'); ERROR: conflicting key value violates exclusion constraint "reservation_during_excl" DETAIL: Key (during)=(["2010-01-01 14:45:00","2010-01-01 15:45:00")) conflicts with existing key (during)=(["2010-01-01 11:30:00","2010-01-01 15:00:00")).
ru: INSERT INTO reservation VALUES ('[2010-01-01 11:30, 2010-01-01 15:00)'); INSERT 0 1 INSERT INTO reservation VALUES ('[2010-01-01 14:45, 2010-01-01 15:45)'); ОШИБКА: конфликтующее значение ключа нарушает ограничение-исключение "reservation_during_excl" ПОДРОБНОСТИ: Ключ (during)=(["2010-01-01 14:45:00","2010-01-01 15:45:00")) конфликтует с существующим ключом (during)=(["2010-01-01 11:30:00","2010-01-01 15:00:00"))

source: While <literal>UNIQUE</literal> is a natural constraint for scalar values, it is usually unsuitable for range types. Instead, an exclusion constraint is often more appropriate (see <link linkend="sql-createtable-exclude">CREATE TABLE ... CONSTRAINT ... EXCLUDE</link>). Exclusion constraints allow the specification of constraints such as <quote>non-overlapping</quote> on a range type. For example: <placeholder-1/> That constraint will prevent any overlapping values from existing in the table at the same time: <placeholder-2/>
ru: Тогда как для скалярных значений естественным ограничением является <literal>UNIQUE</literal>, оно обычно не подходит для диапазонных типов. Вместо этого чаще оказываются полезнее ограничения-исключения (см. <link linkend="sql-createtable-exclude">CREATE TABLE ... CONSTRAINT ... EXCLUDE</link>). Такие ограничения позволяют, например определить условие <quote>непересечения</quote> диапазонов. Например: <placeholder-1/> Это ограничение не позволит одновременно сохранить в таблице несколько диапазонов, которые накладываются друг на друга: <placeholder-2/>

source: CREATE EXTENSION btree_gist; CREATE TABLE room_reservation ( room text, during tsrange, EXCLUDE USING GIST (room WITH =, during WITH &amp;&amp;) ); INSERT INTO room_reservation VALUES ('123A', '[2010-01-01 14:00, 2010-01-01 15:00)'); INSERT 0 1 INSERT INTO room_reservation VALUES ('123A', '[2010-01-01 14:30, 2010-01-01 15:30)'); ERROR: conflicting key value violates exclusion constraint "room_reservation_room_during_excl" DETAIL: Key (room, during)=(123A, ["2010-01-01 14:30:00","2010-01-01 15:30:00")) conflicts with existing key (room, during)=(123A, ["2010-01-01 14:00:00","2010-01-01 15:00:00")). INSERT INTO room_reservation VALUES ('123B', '[2010-01-01 14:30, 2010-01-01 15:30)'); INSERT 0 1
ru: CREATE EXTENSION btree_gist; CREATE TABLE room_reservation ( room text, during tsrange, EXCLUDE USING GIST (room WITH =, during WITH &amp;&amp;) ); INSERT INTO room_reservation VALUES ('123A', '[2010-01-01 14:00, 2010-01-01 15:00)'); INSERT 0 1 INSERT INTO room_reservation VALUES ('123A', '[2010-01-01 14:30, 2010-01-01 15:30)'); ОШИБКА: конфликтующее значение ключа нарушает ограничение-исключение "room_reservation_room_during_excl" ПОДРОБНОСТИ: Ключ (room, during)=(123A, [ 2010-01-01 14:30:00, 2010-01-01 15:30:00 )) конфликтует с существующим ключом (room, during)=(123A, ["2010-01-01 14:00:00","2010-01-01 15:00:00")). INSERT INTO room_reservation VALUES ('123B', '[2010-01-01 14:30, 2010-01-01 15:30)'); INSERT 0 1

source: You can use the <link linkend="btree-gist"><literal>btree_gist</literal></link> extension to define exclusion constraints on plain scalar data types, which can then be combined with range exclusions for maximum flexibility. For example, after <literal>btree_gist</literal> is installed, the following constraint will reject overlapping ranges only if the meeting room numbers are equal: <placeholder-1/>
ru: Для максимальной гибкости в ограничении-исключении можно сочетать простые скалярные типы данных с диапазонами, используя расширение <link linkend="btree-gist"><literal>btree_gist</literal></link>. Например, если <literal>btree_gist</literal> установлено, следующее ограничение не будет допускать пересекающиеся диапазоны, только если совпадают также и номера комнат: <placeholder-1/>
