Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rangetypes.po
Languages: ru

source: Range Types
ru: Диапазонные типы

source: <primary>range type</primary>
ru: <primary>диапазонный тип</primary>

source: Range types are data types representing a range of values of some element type (called the range's <firstterm>subtype</firstterm>). For instance, ranges of <type>timestamp</type> might be used to represent the ranges of time that a meeting room is reserved. In this case the data type is <type>tsrange</type> (short for <quote>timestamp range</quote>), and <type>timestamp</type> is the subtype. The subtype must have a total order so that it is well-defined whether element values are within, before, or after a range of values.
ru: Диапазонные типы представляют диапазоны значений некоторого типа данных (он также называется <firstterm>подтипом</firstterm> диапазона). Например, диапазон типа <type>timestamp</type> может представлять временной интервал, когда зарезервирован зал заседаний. В данном случае типом данных будет <type>tsrange</type> (сокращение от <quote>timestamp range</quote>), а подтипом &mdash; <type>timestamp</type>. Подтип должен быть полностью упорядочиваемым, чтобы можно было однозначно определить, где находится значение по отношению к диапазону: внутри, до или после него.

source: Range types are useful because they represent many element values in a single range value, and because concepts such as overlapping ranges can be expressed clearly. The use of time and date ranges for scheduling purposes is the clearest example; but price ranges, measurement ranges from an instrument, and so forth can also be useful.
ru: Диапазонные типы полезны тем, что позволяют представить множество возможных значений в одной структуре данных и чётко выразить такие понятия, как пересечение диапазонов. Наиболее очевидный вариант их использования &mdash; применять диапазоны даты и времени для составления расписания, но также полезными могут оказаться диапазоны цен, интервалы измерений и т. д.

source: Built-in Range Types
ru: Встроенные диапазонные типы

source: <type>int4range</type> &mdash; Range of <type>integer</type>
ru: <type>int4range</type> &mdash; диапазон подтипа <type>integer</type>

source: <type>int8range</type> &mdash; Range of <type>bigint</type>
ru: <type>int8range</type> &mdash; диапазон подтипа <type>bigint</type>

source: <type>numrange</type> &mdash; Range of <type>numeric</type>
ru: <type>numrange</type> &mdash; диапазон подтипа <type>numeric</type>

source: <type>tsrange</type> &mdash; Range of <type>timestamp without time zone</type>
ru: <type>tsrange</type> &mdash; диапазон подтипа <type>timestamp without time zone</type>

source: <type>tstzrange</type> &mdash; Range of <type>timestamp with time zone</type>
ru: <type>tstzrange</type> &mdash; диапазон подтипа <type>timestamp with time zone</type>

source: <type>daterange</type> &mdash; Range of <type>date</type>
ru: <type>daterange</type> &mdash; диапазон подтипа <type>date</type>

source: PostgreSQL comes with the following built-in range types: <placeholder-1/> In addition, you can define your own range types; see <xref linkend="sql-createtype"/> for more information.
ru: PostgreSQL имеет следующие встроенные диапазонные типы: <placeholder-1/> Помимо этого, вы можете определять собственные типы; подробнее это описано в <xref remap="6" linkend="sql-createtype"/>.

source: Examples
ru: Примеры

source: CREATE TABLE reservation (room int, during tsrange); INSERT INTO reservation VALUES (1108, '[2010-01-01 14:30, 2010-01-01 15:30)'); -- Containment SELECT int4range(10, 20) @&gt; 3; -- Overlaps SELECT numrange(11.1, 22.2) &amp;&amp; numrange(20.0, 30.0); -- Extract the upper bound SELECT upper(int8range(15, 25)); -- Compute the intersection SELECT int4range(10, 20) * int4range(15, 25); -- Is the range empty? SELECT isempty(numrange(1, 5));
ru: CREATE TABLE reservation (room int, during tsrange); INSERT INTO reservation VALUES (1108, '[2010-01-01 14:30, 2010-01-01 15:30)'); -- Вхождение SELECT int4range(10, 20) @&gt; 3; -- Перекрытие SELECT numrange(11.1, 22.2) &amp;&amp; numrange(20.0, 30.0); -- Получение верхней границы SELECT upper(int8range(15, 25)); -- Вычисление пересечения SELECT int4range(10, 20) * int4range(15, 25); -- Является ли диапазон пустым? SELECT isempty(numrange(1, 5));

source: <placeholder-1/> See <xref linkend="range-operators-table"/> and <xref linkend="range-functions-table"/> for complete lists of operators and functions on range types.
ru: <placeholder-1/> Полный список операторов и функций, предназначенных для диапазонных типов, приведён в <xref remap="6" linkend="range-operators-table"/> и <xref remap="6" linkend="range-functions-table"/>.

source: Inclusive and Exclusive Bounds
ru: Включение и исключение границ

source: Every non-empty range has two bounds, the lower bound and the upper bound. All points between these values are included in the range. An inclusive bound means that the boundary point itself is included in the range as well, while an exclusive bound means that the boundary point is not included in the range.
ru: Любой непустой диапазон имеет две границы, верхнюю и нижнюю, и включает все точки между этими значениями. В него также может входить точка, лежащая на границе, если диапазон включает эту границу. И наоборот, если диапазон не включает границу, считается, что точка, лежащая на этой границе, в него не входит.

source: In the text form of a range, an inclusive lower bound is represented by <quote><literal>[</literal></quote> while an exclusive lower bound is represented by <quote><literal>(</literal></quote>. Likewise, an inclusive upper bound is represented by <quote><literal>]</literal></quote>, while an exclusive upper bound is represented by <quote><literal>)</literal></quote>. (See <xref linkend="rangetypes-io"/> for more details.)
ru: В текстовой записи диапазона включение нижней границы обозначается символом <quote><literal>[</literal></quote>, а исключением &mdash; символом <quote><literal>(</literal></quote>. Для верхней границы включение обозначается аналогично, символом <quote><literal>]</literal></quote>, а исключение &mdash; символом <quote><literal>)</literal></quote>. (Подробнее это описано в <xref remap="6" linkend="rangetypes-io"/>.)

source: The functions <literal>lower_inc</literal> and <literal>upper_inc</literal> test the inclusivity of the lower and upper bounds of a range value, respectively.
ru: Для проверки, включается ли нижняя или верхняя граница в диапазон, предназначены функции <literal>lower_inc</literal> и <literal>upper_inc</literal>, соответственно.

source: Infinite (Unbounded) Ranges
ru: Неограниченные (бесконечные) диапазоны

source: The lower bound of a range can be omitted, meaning that all points less than the upper bound are included in the range. Likewise, if the upper bound of the range is omitted, then all points greater than the lower bound are included in the range. If both lower and upper bounds are omitted, all values of the element type are considered to be in the range.
ru: Нижнюю границу диапазона можно опустить и определить тем самым диапазон, включающий все точки, лежащие ниже верхней границы. Подобным образом, если не определить верхнюю границу, в диапазон войдут все точки, лежащие выше нижней границы. Если же опущена и нижняя, и правая границы, такой диапазон будет включать все возможные значения своего подтипа.

source: This is equivalent to considering that the lower bound is <quote>minus infinity</quote>, or the upper bound is <quote>plus infinity</quote>, respectively. But note that these infinite values are never values of the range's element type, and can never be part of the range. (So there is no such thing as an inclusive infinite bound &mdash; if you try to write one, it will automatically be converted to an exclusive bound.)
ru: Это равнозначно тому, что нижней границей будет считаться <quote>минус бесконечность</quote>, а верхней &mdash; <quote>плюс бесконечность</quote>. Но заметьте, что эти бесконечные значения не являются значениями подтипа диапазона и поэтому также не могут входить в диапазон. (Как следствие, нет такого понятия, как включаемая нижняя бесконечная граница &mdash; если попытаться записать такой диапазон, она будет автоматически преобразована в исключаемую.)

source: Also, some element types have a notion of <quote>infinity</quote>, but that is just another value so far as the range type mechanisms are concerned. For example, in timestamp ranges, <literal>[today,]</literal> means the same thing as <literal>[today,)</literal>. But <literal>[today,infinity]</literal> means something different from <literal>[today,infinity)</literal> &mdash; the latter excludes the special <type>timestamp</type> value <literal>infinity</literal>.
ru: Кроме этого, в некоторых типах есть понятие <quote>бесконечность</quote>, но в данном контексте оно считается просто одним из значений. Например, во временных диапазонах <literal>[today,]</literal> означает то же самое, что и <literal>[today,)</literal>. Но диапазон <literal>[today,infinity]</literal> отличается от <literal>[today,infinity)</literal> &mdash; в последнем специальное значение <literal>infinity</literal> типа <type>timestamp</type> не входит в диапазон.

source: The functions <literal>lower_inf</literal> and <literal>upper_inf</literal> test for infinite lower and upper bounds of a range, respectively.
ru: Проверить, определена ли верхняя или нижняя граница, можно с помощью функций <literal>lower_inf</literal> и <literal>upper_inf</literal>, соответственно.

source: Range Input/Output
ru: Ввод/вывод диапазонов

source: The input for a range value must follow one of the following patterns: <synopsis> (<replaceable>lower-bound</replaceable>,<replaceable>upper-bound</replaceable>) (<replaceable>lower-bound</replaceable>,<replaceable>upper-bound</replaceable>] [<replaceable>lower-bound</replaceable>,<replaceable>upper-bound</replaceable>) [<replaceable>lower-bound</replaceable>,<replaceable>upper-bound</replaceable>] empty </synopsis> The parentheses or brackets indicate whether the lower and upper bounds are exclusive or inclusive, as described previously. Notice that the final pattern is <literal>empty</literal>, which represents an empty range (a range that contains no points).
ru: Вводимое значение диапазона должно записываться в одной из следующих форм: <synopsis> (<replaceable>нижняя-граница</replaceable>,<replaceable>верхняя-граница</replaceable>) (<replaceable>нижняя-граница</replaceable>,<replaceable>верхняя-граница</replaceable>] [<replaceable>нижняя-граница</replaceable>,<replaceable>верхняя-граница</replaceable>) [<replaceable>нижняя-граница</replaceable>,<replaceable>верхняя-граница</replaceable>] empty </synopsis> Тип скобок (квадратные или круглые) определяет, включаются ли в диапазон соответствующие границы, как описано выше. Заметьте, что последняя форма содержит только слово <literal>empty</literal> и определяет пустой диапазон (диапазон, не содержащий точек).

source: The <replaceable>lower-bound</replaceable> may be either a string that is valid input for the subtype, or empty to indicate no lower bound. Likewise, <replaceable>upper-bound</replaceable> may be either a string that is valid input for the subtype, or empty to indicate no upper bound.
ru: Здесь <replaceable>нижняя-граница</replaceable> может быть строкой с допустимым значением подтипа или быть пустой (тогда диапазон будет без нижней границы). Аналогично, <replaceable>верхняя-граница</replaceable> может задаваться одним из значений подтипа или быть неопределённой (пустой).

source: Each bound value can be quoted using <literal>"</literal> (double quote) characters. This is necessary if the bound value contains parentheses, brackets, commas, double quotes, or backslashes, since these characters would otherwise be taken as part of the range syntax. To put a double quote or backslash in a quoted bound value, precede it with a backslash. (Also, a pair of double quotes within a double-quoted bound value is taken to represent a double quote character, analogously to the rules for single quotes in SQL literal strings.) Alternatively, you can avoid quoting and use backslash-escaping to protect all data characters that would otherwise be taken as range syntax. Also, to write a bound value that is an empty string, write <literal>""</literal>, since writing nothing means an infinite bound.
ru: Любое значение диапазона можно заключить в кавычки (<literal>"</literal>). А если значение содержит круглые или квадратные скобки, запятые, кавычки или обратную косую черту, использовать кавычки необходимо, чтобы эти символы не рассматривались как часть синтаксиса диапазона. Чтобы включить в значение диапазона, заключённое в кавычки, такие символы, как кавычки или обратная косая черта, перед ними нужно добавить обратную косую черту. (Кроме того, продублированные кавычки в значении диапазона, заключённого в кавычки, воспринимаются как одинарные, подобно апострофам в строках SQL.) С другой стороны, можно обойтись без кавычек, защитив все символы в данных, которые могут быть восприняты как часть синтаксиса диапазона, с помощью спецпоследовательностей. Чтобы задать в качестве границы пустую строку, нужно ввести <literal>""</literal>, так как пустая строка без кавычек будет означать отсутствие границы.

source: Whitespace is allowed before and after the range value, but any whitespace between the parentheses or brackets is taken as part of the lower or upper bound value. (Depending on the element type, it might or might not be significant.)
ru: Пробельные символы до и после определения диапазона игнорируются, но когда они присутствуют внутри скобок, они воспринимаются как часть значения верхней или нижней границы. (Хотя они могут также игнорироваться в зависимости от подтипа диапазона.)

source: These rules are very similar to those for writing field values in composite-type literals. See <xref linkend="rowtypes-io-syntax"/> for additional commentary.
ru: Эти правила очень похожи на правила записи значений для полей составных типов. Дополнительные замечания приведены в <xref remap="6" linkend="rowtypes-io-syntax"/>.

source: -- includes 3, does not include 7, and does include all points in between SELECT '[3,7)'::int4range; -- does not include either 3 or 7, but includes all points in between SELECT '(3,7)'::int4range; -- includes only the single point 4 SELECT '[4,4]'::int4range; -- includes no points (and will be normalized to 'empty') SELECT '[4,4)'::int4range;
ru: -- в диапазон включается 3, не включается 7 и включаются все точки между ними SELECT '[3,7)'::int4range; -- в диапазон не включаются 3 и 7, но включаются все точки между ними SELECT '(3,7)'::int4range; -- в диапазон включается только одно значение 4 SELECT '[4,4]'::int4range; -- диапазон не включает никаких точек (нормализация заменит его определение -- на 'empty') SELECT '[4,4)'::int4range;

source: Examples: <placeholder-1/>
ru: Примеры: <placeholder-1/>

source: Constructing Ranges
ru: Конструирование диапазонов

source: -- The full form is: lower bound, upper bound, and text argument indicating -- inclusivity/exclusivity of bounds. SELECT numrange(1.0, 14.0, '(]'); -- If the third argument is omitted, '[)' is assumed. SELECT numrange(1.0, 14.0); -- Although '(]' is specified here, on display the value will be converted to -- canonical form, since int8range is a discrete range type (see below). SELECT int8range(1, 14, '(]'); -- Using NULL for either bound causes the range to be unbounded on that side. SELECT numrange(NULL, 2.2);
ru: -- Полная форма: нижняя граница, верхняя граница и текстовая строка, определяющая -- включение/исключение границ. SELECT numrange(1.0, 14.0, '(]'); -- Если третий аргумент опущен, подразумевается '[)'. SELECT numrange(1.0, 14.0); -- Хотя здесь указывается '(]', при выводе значение будет приведено к -- каноническому виду, так как int8range &mdash; тип дискретного диапазона (см. ниже). SELECT int8range(1, 14, '(]'); -- Когда вместо любой границы указывается NULL, соответствующей границы -- у диапазона не будет. SELECT numrange(NULL, 2.2);

source: Each range type has a constructor function with the same name as the range type. Using the constructor function is frequently more convenient than writing a range literal constant, since it avoids the need for extra quoting of the bound values. The constructor function accepts two or three arguments. The two-argument form constructs a range in standard form (lower bound inclusive, upper bound exclusive), while the three-argument form constructs a range with bounds of the form specified by the third argument. The third argument must be one of the strings <quote><literal>()</literal></quote>, <quote><literal>(]</literal></quote>, <quote><literal>[)</literal></quote>, or <quote><literal>[]</literal></quote>. For example: <placeholder-1/>
ru: Для каждого диапазонного типа определена функция конструктора, имеющая то же имя, что и данный тип. Использовать этот конструктор обычно удобнее, чем записывать текстовую константу диапазона, так как это избавляет от потребности в дополнительных кавычках. Функция конструктора может принимать два или три параметра. Вариант с двумя параметрами создаёт диапазон в стандартной форме (нижняя граница включается, верхняя исключается), тогда как для варианта с тремя параметрами включение границ определяется третьим параметром. Третий параметр должен содержать одну из строк: <quote><literal>()</literal></quote>, <quote><literal>(]</literal></quote>, <quote><literal>[)</literal></quote> или <quote><literal>[]</literal></quote>. Например: <placeholder-1/>

source: Discrete Range Types
ru: Типы дискретных диапазонов

source: A discrete range is one whose element type has a well-defined <quote>step</quote>, such as <type>integer</type> or <type>date</type>. In these types two elements can be said to be adjacent, when there are no valid values between them. This contrasts with continuous ranges, where it's always (or almost always) possible to identify other element values between two given values. For example, a range over the <type>numeric</type> type is continuous, as is a range over <type>timestamp</type>. (Even though <type>timestamp</type> has limited precision, and so could theoretically be treated as discrete, it's better to consider it continuous since the step size is normally not of interest.)
ru: Дискретным диапазоном считается диапазон, для подтипа которого однозначно определён <quote>шаг</quote>, как например для типов <type>integer</type> и <type>date</type>. Значения этих двух типов можно назвать соседними, когда между ними нет никаких других значений. В непрерывных диапазонах, напротив, всегда (или почти всегда) можно найти ещё одно значение между двумя данными. Например, непрерывным диапазоном будет диапазон с подтипами <type>numeric</type> и <type>timestamp</type>. (Хотя <type>timestamp</type> имеет ограниченную точность, то есть теоретически он является дискретным, но всё же лучше считать его непрерывным, так как шаг его обычно не определён.)

source: Another way to think about a discrete range type is that there is a clear idea of a <quote>next</quote> or <quote>previous</quote> value for each element value. Knowing that, it is possible to convert between inclusive and exclusive representations of a range's bounds, by choosing the next or previous element value instead of the one originally given. For example, in an integer range type <literal>[4,8]</literal> and <literal>(3,9)</literal> denote the same set of values; but this would not be so for a range over numeric.
ru: Можно также считать дискретным подтип диапазона, в котором чётко определены понятия <quote>следующего</quote> и <quote>предыдущего</quote> элемента для каждого значения. Такие определения позволяют преобразовывать границы диапазона из включаемых в исключаемые, выбирая следующий или предыдущий элемент вместо заданного значения. Например, диапазоны целочисленного типа <literal>[4,8]</literal> и <literal>(3,9)</literal> описывают одно и то же множество значений; но для диапазона подтипа numeric это не так.

source: A discrete range type should have a <firstterm>canonicalization</firstterm> function that is aware of the desired step size for the element type. The canonicalization function is charged with converting equivalent values of the range type to have identical representations, in particular consistently inclusive or exclusive bounds. If a canonicalization function is not specified, then ranges with different formatting will always be treated as unequal, even though they might represent the same set of values in reality.
ru: Для типа дискретного диапазона определяется функция <firstterm>канонизации</firstterm>, учитывающая размер шага для данного подтипа. Задача этой функции &mdash; преобразовать равнозначные диапазоны к единственному представлению, в частности нормализовать включаемые и исключаемые границы. Если функция канонизации не определена, диапазоны с различным определением будут всегда считаться разными, даже когда они на самом деле представляют одно множество значений.

source: The built-in range types <type>int4range</type>, <type>int8range</type>, and <type>daterange</type> all use a canonical form that includes the lower bound and excludes the upper bound; that is, <literal>[)</literal>. User-defined range types can use other conventions, however.
ru: Для встроенных типов <type>int4range</type>, <type>int8range</type> и <type>daterange</type> каноническое представление включает нижнюю границу и не включает верхнюю; то есть диапазон приводится к виду <literal>[)</literal>. Однако для нестандартных типов можно использовать и другие соглашения.

source: Defining New Range Types
ru: Определение новых диапазонных типов

source: Users can define their own range types. The most common reason to do this is to use ranges over subtypes not provided among the built-in range types. For example, to define a new range type of subtype <type>float8</type>: <placeholder-1/> Because <type>float8</type> has no meaningful <quote>step</quote>, we do not define a canonicalization function in this example.
ru: Пользователи могут определять собственные диапазонные типы. Это может быть полезно, когда нужно использовать диапазоны с подтипами, для которых нет встроенных диапазонных типов. Например, можно определить новый тип диапазона для подтипа <type>float8</type>: <placeholder-1/> Так как для <type>float8</type> осмысленное значение <quote>шага</quote> не определено, функция канонизации в данном примере не задаётся.

source: Defining your own range type also allows you to specify a different subtype B-tree operator class or collation to use, so as to change the sort ordering that determines which values fall into a given range.
ru: Определяя собственный диапазонный тип, вы также можете выбрать другие правила сортировки или класс оператора B-дерева для его подтипа, что позволит изменить порядок значений, от которого зависит, какие значения попадают в заданный диапазон.
