Repository: pluzanov/pg-doc-ru
Catalog: 9.6/recovery-config.po
Languages: ru

source: This setting has no effect if <varname>standby_mode</varname> is <literal>off</literal>.
ru: Этот параметр не действует, если <varname>standby_mode</varname> имеет значение <literal>off</literal>.

source: <primary><varname>primary_slot_name</varname> recovery parameter</primary>
ru: <primary><varname>primary_slot_name</varname> параметр восстановления</primary>

source: Optionally specifies an existing replication slot to be used when connecting to the primary via streaming replication to control resource removal on the upstream node (see <xref linkend="streaming-replication-slots"/>). This setting has no effect if <varname>primary_conninfo</varname> is not set.
ru: Дополнительно указывает заранее созданный слот при потоковой репликации для контроля очистки ресурсов подключённого узла (см. <xref remap="4" linkend="streaming-replication-slots"/>). Этот параметр не действует, если не указана строка подключения <varname>primary_conninfo</varname>.

source: <primary><varname>trigger_file</varname> recovery parameter</primary>
ru: <primary><varname>trigger_file</varname> параметр восстановления</primary>

source: Specifies a trigger file whose presence ends recovery in the standby. Even if this value is not set, you can still promote the standby using <command>pg_ctl promote</command>. This setting has no effect if <varname>standby_mode</varname> is <literal>off</literal>.
ru: Указывает триггерный файл, наличие которого завершает работу в режиме резервирования. Даже если это значение не установлено, существует возможность назначить резервный сервер основным с помощью команды <command>pg_ctl promote</command>. Этот параметр не действует, если параметр <varname>standby_mode</varname> имеет значение <literal>off</literal>.

source: <primary><varname>recovery_min_apply_delay</varname> recovery parameter</primary>
ru: <primary><varname>recovery_min_apply_delay</varname> параметр восстановления</primary>

source: By default, a standby server restores WAL records from the primary as soon as possible. It may be useful to have a time-delayed copy of the data, offering opportunities to correct data loss errors. This parameter allows you to delay recovery by a fixed period of time, measured in milliseconds if no unit is specified. For example, if you set this parameter to <literal>5min</literal>, the standby will replay each transaction commit only when the system time on the standby is at least five minutes past the commit time reported by the master.
ru: По умолчанию резервный сервер восстанавливает записи WAL ведущего настолько быстро, насколько это возможно. Иногда полезно иметь возможность задать задержку при копировании данных, например, для устранения ошибок, связанных с потерей данных. Параметр позволяет задать эту задержку, указав период времени в миллисекундах (по умолчанию) или иных единицах измерения. Например, если установить значение <literal>5min</literal>, резервный сервер будет воспроизводить фиксацию транзакции не раньше, чем через 5 минут (судя по его системным часам) после времени фиксации, сообщённого главным.

source: It is possible that the replication delay between servers exceeds the value of this parameter, in which case no delay is added. Note that the delay is calculated between the WAL time stamp as written on master and the current time on the standby. Delays in transfer because of network lag or cascading replication configurations may reduce the actual wait time significantly. If the system clocks on master and standby are not synchronized, this may lead to recovery applying records earlier than expected; but that is not a major issue because useful settings of this parameter are much larger than typical time deviations between servers.
ru: Возможна ситуация, когда задержка репликации между серверами превышает значение этого параметра. В этом случае дополнительная задержка не добавляется. Заметьте, что задержка вычисляется как разница между меткой времени, записанной в WAL на ведущем сервере, и текущим временем на резервном. Запаздывание передачи, связанное с задержками в сети или каскадной репликацией, может существенно сократить реальное время ожидания. Если время на главном и резервном сервере не синхронизировано, это может приводить к применению записей ранее ожидаемого, однако это не очень важно, потому что полезные значения этого параметра намного превышают типичное расхождение во времени между двумя серверами.

source: The delay occurs only on WAL records for transaction commits. Other records are replayed as quickly as possible, which is not a problem because MVCC visibility rules ensure their effects are not visible until the corresponding commit record is applied.
ru: Задержка применяется лишь для записей WAL, относящимся к зафиксированным транзакциям. Остальные записи проигрываются незамедлительно, так как их эффект не будет заметен до применения соответствующей записи о фиксации транзакции, благодаря правилам видимости MVCC.

source: The delay occurs once the database in recovery has reached a consistent state, until the standby is promoted or triggered. After that the standby will end recovery without further waiting.
ru: Задержка добавляется, как только восстанавливаемая база данных достигает согласованного состояния, и исключается, когда резервный сервер переключается в режим основного. С момента переключения резервный сервер завершает восстановление незамедлительно.

source: This parameter is intended for use with streaming replication deployments; however, if the parameter is specified it will be honored in all cases. Synchronous replication is not affected by this setting because there is not yet any setting to request synchronous apply of transaction commits. <varname>hot_standby_feedback</varname> will be delayed by use of this feature which could lead to bloat on the master; use both together with care.
ru: Данный параметр предназначен для применения в конфигурациях с потоковой репликацией; однако, если он задан, он будет учитываться в любых случаях. На синхронную репликацию этот параметр не влияет, пока нет никакого параметра для запроса синхронного применения фиксирования транзакций. Задержка, устанавливаемая этим параметром, распространяется и на сообщения <varname>hot_standby_feedback</varname>, что может привести к раздуванию базы на главном сервере; сочетание этих параметров требует осторожности.
