Repository: pluzanov/pg-doc-ru
Catalog: 9.6/recovery-config.po
Languages: ru

source: Recovery Configuration
ru: Конфигурация восстановления

source: <primary>configuration</primary><secondary>of recovery</secondary><tertiary>of a standby server</tertiary>
ru: <primary>конфигурация</primary><secondary>восстановления</secondary><tertiary>резервного сервера</tertiary>

source: This chapter describes the settings available in the <filename>recovery.conf</filename><placeholder-1/> file. They apply only for the duration of the recovery. They must be reset for any subsequent recovery you wish to perform. They cannot be changed once recovery has begun.
ru: Глава описывает параметры, задаваемые в файле <filename>recovery.conf</filename><placeholder-1/>. Они применяются лишь во время восстановления и должны заново устанавливаться перед каждым последующим восстановлением. После начала процесса они не могут быть изменены.

source: Settings in <filename>recovery.conf</filename> are specified in the format <literal>name = 'value'</literal>. One parameter is specified per line. Hash marks (<literal>#</literal>) designate the rest of the line as a comment. To embed a single quote in a parameter value, write two quotes (<literal>''</literal>).
ru: Параметры в файле <filename>recovery.conf</filename> указываются в формате <literal>name = 'value'</literal>. Каждый параметр должен располагаться на отдельной строке. Для строчного комментария используется хеш (<literal>#</literal>). Чтобы включить апостроф в значение параметра, продублируйте его (<literal>''</literal>).

source: A sample file, <filename>share/recovery.conf.sample</filename>, is provided in the installation's <filename>share/</filename> directory.
ru: Пример файла <filename>share/recovery.conf.sample</filename>, поставляемый в рамках дистрибутива, размещён в каталоге <filename>share/</filename>.

source: Archive Recovery Settings
ru: Параметры восстановления из архива

source: <primary><varname>restore_command</varname> recovery parameter</primary>
ru: <primary><varname>restore_command</varname> параметр восстановления</primary>

source: The local shell command to execute to retrieve an archived segment of the WAL file series. This parameter is required for archive recovery, but optional for streaming replication. Any <literal>%f</literal> in the string is replaced by the name of the file to retrieve from the archive, and any <literal>%p</literal> is replaced by the copy destination path name on the server. (The path name is relative to the current working directory, i.e., the cluster's data directory.) Any <literal>%r</literal> is replaced by the name of the file containing the last valid restart point. That is the earliest file that must be kept to allow a restore to be restartable, so this information can be used to truncate the archive to just the minimum required to support restarting from the current restore. <literal>%r</literal> is typically only used by warm-standby configurations (see <xref linkend="warm-standby"/>). Write <literal>%%</literal> to embed an actual <literal>%</literal> character.
ru: Это команда оболочки ОС, которая выполняется для извлечения архивного сегмента файлов WAL. Этот параметр требуется для восстановления из архива, но необязателен для потоковой репликации. Любое вхождение <literal>%f</literal> в строке заменяется именем извлекаемого из архива файла, а <literal>%p</literal> заменяется на путь назначения при копировании на сервере. (Путь указывается относительно текущего рабочего каталога, т. е. относительно каталога хранения данных кластера.) Любое вхождение <literal>%r</literal> заменяется на имя файла, в котором содержится последняя действительная точка восстановления. Это самый ранний файл, который необходимо хранить для возможности восстановления, и эту информацию можно использовать для усечения архива в целях его минимизации. <literal>%r</literal> обычно используется при организации тёплого резерва (см. <xref remap="4" linkend="warm-standby"/>). Для того чтобы указать символ <literal>%</literal>, продублируйте его (<literal>%%</literal>).

source: It is important for the command to return a zero exit status only if it succeeds. The command <emphasis>will</emphasis> be asked for file names that are not present in the archive; it must return nonzero when so asked. Examples: <placeholder-1/> An exception is that if the command was terminated by a signal (other than <systemitem>SIGTERM</systemitem>, which is used as part of a database server shutdown) or an error by the shell (such as command not found), then recovery will abort and the server will not start up.
ru: Обратите внимание, что команда должна возвращать ноль на выходе лишь в случае успешного выполнения. У команды <emphasis>будет</emphasis> запрошен список имён файлов, которые отсутствуют в архиве; в этом случае она должна возвращать ненулевой статус. Примеры: <placeholder-1/> В случае прерывания команды сигналом (отличным от <systemitem>SIGTERM</systemitem>, который используется для остановки сервера баз данных) или при возникновении ошибки оболочки (например, если команда не найдена), процесс восстановления будет остановлен и сервер не запустится.

source: <primary><varname>archive_cleanup_command</varname> recovery parameter</primary>
ru: <primary><varname>archive_cleanup_command</varname> параметр восстановления</primary>

source: This optional parameter specifies a shell command that will be executed at every restartpoint. The purpose of <varname>archive_cleanup_command</varname> is to provide a mechanism for cleaning up old archived WAL files that are no longer needed by the standby server. Any <literal>%r</literal> is replaced by the name of the file containing the last valid restart point. That is the earliest file that must be <emphasis>kept</emphasis> to allow a restore to be restartable, and so all files earlier than <literal>%r</literal> may be safely removed. This information can be used to truncate the archive to just the minimum required to support restart from the current restore. The <xref linkend="pgarchivecleanup"/> module is often used in <varname>archive_cleanup_command</varname> for single-standby configurations, for example: <placeholder-1/> Note however that if multiple standby servers are restoring from the same archive directory, you will need to ensure that you do not delete WAL files until they are no longer needed by any of the servers. <varname>archive_cleanup_command</varname> would typically be used in a warm-standby configuration (see <xref linkend="warm-standby"/>). Write <literal>%%</literal> to embed an actual <literal>%</literal> character in the command.
ru: Этот необязательный параметр указывает команду оболочки ОС, которая будет вызываться при каждой точке перезапуска. Назначение команды <varname>archive_cleanup_command</varname> в том, чтобы предоставить механизм очистки от старых архивных файлов WAL, которые более не нужны на резервном сервере. Любое вхождение <literal>%r</literal> заменяется на имя файла, содержащего последнюю действительную точку восстановления. Это самый ранний файл, который необходимо <emphasis>хранить</emphasis> для возможности восстановления, а более старые файлы, чем <literal>%r</literal>, могут быть безболезненно удалены. Эта информация может быть использована для усечения архива с целью его минимизации при сохранении возможности последующего восстановления из заданной точки. Модуль <xref linkend="pgarchivecleanup"/> часто используется в качестве значения параметра <varname>archive_cleanup_command</varname> в конфигурациях с одним резервным сервером, например: <placeholder-1/> Стоит обратить внимание, что в конфигурациях с множеством резервных серверов, использующих общий архивный каталог для восстановления, необходимо контролировать удаление файлов WAL, так как для некоторых они ещё могут требоваться. Поэтому <varname>archive_cleanup_command</varname> обычно используется при организации тёплого резерва (см. <xref remap="4" linkend="warm-standby"/>). Для того чтобы указать символ <literal>%</literal> в команде, он пишется дважды <literal>%%</literal>.

source: If the command returns a nonzero exit status then a warning log message will be written. An exception is that if the command was terminated by a signal or an error by the shell (such as command not found), a fatal error will be raised.
ru: Если команда вернёт ненулевой статус завершения, то в журнал будет записано предупреждающее сообщение. В ситуации когда команда прерывается сигналом или в случае ошибки оболочки ОС (например, команда не найдена), будет вызвана фатальная ошибка.

source: <primary><varname>recovery_end_command</varname> recovery parameter</primary>
ru: <primary><varname>recovery_end_command</varname> параметр восстановления</primary>

source: This parameter specifies a shell command that will be executed once only at the end of recovery. This parameter is optional. The purpose of the <varname>recovery_end_command</varname> is to provide a mechanism for cleanup following replication or recovery. Any <literal>%r</literal> is replaced by the name of the file containing the last valid restart point, like in <xref linkend="archive-cleanup-command"/>.
ru: Этот необязательный параметр указывает команду оболочки, которая будет выполнена единожды в конце процесса восстановления. Назначение параметра <varname>recovery_end_command</varname> в предоставлении механизма очистки, следующего за репликацией или восстановлением. Любое вхождение <literal>%r</literal> заменяется именем файла, содержащим последнюю действительную точку восстановления, например, как в <xref linkend="archive-cleanup-command"/>.

source: If the command returns a nonzero exit status then a warning log message will be written and the database will proceed to start up anyway. An exception is that if the command was terminated by a signal or an error by the shell (such as command not found), the database will not proceed with startup.
ru: Если команда вернёт ненулевой статус завершения, то в журнал будет записано предупреждающее сообщение, но при этом запуск сервера будет продолжен. За исключением случаев, когда команда прервана сигналом или при возникновения ошибки оболочки ОС (например, команда не найдена). В таких случаях база данных не будет запускаться.

source: Recovery Target Settings
ru: Параметры управления восстановлением

source: By default, recovery will recover to the end of the WAL log. The following parameters can be used to specify an earlier stopping point. At most one of <varname>recovery_target</varname>, <varname>recovery_target_name</varname>, <varname>recovery_target_time</varname>, or <varname>recovery_target_xid</varname> can be used; if more than one of these is specified in the configuration file, the last entry will be used.
ru: По умолчанию процесс восстановления производится вплоть до окончания журналов WAL. Нижеуказанные параметры могут использоваться, чтобы остановить процесс восстановления в более ранней точке. Лишь один из параметров <varname>recovery_target</varname>, <varname>recovery_target_name</varname>, <varname>recovery_target_time</varname>, или <varname>recovery_target_xid</varname> может быть использован; если в конфигурационном файле их несколько, то будет использоваться последний.

source: <primary><varname>recovery_target</varname> recovery parameter</primary>
ru: <primary><varname>recovery_target</varname> параметр восстановления</primary>

source: This parameter specifies that recovery should end as soon as a consistent state is reached, i.e. as early as possible. When restoring from an online backup, this means the point where taking the backup ended.
ru: Данный параметр указывает, что процесс восстановления должен завершиться, как только будет достигнуто целостное состояние, т. е. как можно раньше. При восстановлении из оперативной резервной копии, это будет точкой, в которой завершился процесс резервного копирования.

source: Technically, this is a string parameter, but <literal>'immediate'</literal> is currently the only allowed value.
ru: Технически, это строковый параметр, но значение <literal>'immediate'</literal> единственно допустимое в данный момент.

source: <primary><varname>recovery_target_name</varname> recovery parameter</primary>
ru: <primary><varname>recovery_target_name</varname> параметр восстановления</primary>

source: This parameter specifies the named restore point (created with <function>pg_create_restore_point()</function>) to which recovery will proceed.
ru: Этот параметр указывает именованную точку восстановления (созданную с помощью <function>pg_create_restore_point()</function>), до которой будет производиться восстановление.

source: <primary><varname>recovery_target_time</varname> recovery parameter</primary>
ru: <primary><varname>recovery_target_time</varname> параметр восстановления</primary>

source: This parameter specifies the time stamp up to which recovery will proceed. The precise stopping point is also influenced by <xref linkend="recovery-target-inclusive"/>.
ru: Данный параметр указывает точку времени, вплоть до которой будет производиться восстановление. Точность этой точки останова также зависит от <xref linkend="recovery-target-inclusive"/>.

source: <primary><varname>recovery_target_xid</varname> recovery parameter</primary>
ru: <primary><varname>recovery_target_xid</varname> параметр восстановления</primary>

source: This parameter specifies the transaction ID up to which recovery will proceed. Keep in mind that while transaction IDs are assigned sequentially at transaction start, transactions can complete in a different numeric order. The transactions that will be recovered are those that committed before (and optionally including) the specified one. The precise stopping point is also influenced by <xref linkend="recovery-target-inclusive"/>.
ru: Параметр указывает идентификатор транзакции, вплоть до которой необходимо произвести процедуру восстановления. Имейте в виду, что несмотря на то, что при старте идентификаторы транзакций назначаются последовательно, завершаться они могут в ином порядке. Восстанавливаемые транзакции это те, что были зафиксированы до указанной (и, возможно, включая её). Точность точки останова также зависит от <xref linkend="recovery-target-inclusive"/>.

source: The following options further specify the recovery target, and affect what happens when the target is reached:
ru: Следующие параметры уточняют целевую точку восстановления и оказывают влияние на процесс при её достижении:

source: <primary><varname>recovery_target_inclusive</varname> recovery parameter</primary>
ru: <primary><varname>recovery_target_inclusive</varname> параметр восстановления</primary>

source: Specifies whether to stop just after the specified recovery target (<literal>true</literal>), or just before the recovery target (<literal>false</literal>). Applies when either <xref linkend="recovery-target-time"/> or <xref linkend="recovery-target-xid"/> is specified. This setting controls whether transactions having exactly the target commit time or ID, respectively, will be included in the recovery. Default is <literal>true</literal>.
ru: Указывает на необходимость остановки сразу после (<literal>true</literal>), либо до (<literal>false</literal>) достижения целевой точки. Применяется одновременно с <xref linkend="recovery-target-time"/>, либо <xref linkend="recovery-target-xid"/>. Этот параметр управляет тем, нужно ли восстанавливать транзакции, у которых время фиксации либо идентификатор в точности совпадает со значением соответствующего параметра. Значение по умолчанию — <literal>true</literal>.

source: <primary><varname>recovery_target_timeline</varname> recovery parameter</primary>
ru: <primary><varname>recovery_target_timeline</varname> параметр восстановления</primary>

source: Specifies recovering into a particular timeline. The default is to recover along the same timeline that was current when the base backup was taken. Setting this to <literal>latest</literal> recovers to the latest timeline found in the archive, which is useful in a standby server. Other than that you only need to set this parameter in complex re-recovery situations, where you need to return to a state that itself was reached after a point-in-time recovery. See <xref linkend="backup-timelines"/> for discussion.
ru: Указывает линию времени для восстановления. По умолчанию производится восстановление той же линии времени, которая была текущей в момент создания базовой резервной копии. Со значением <literal>latest</literal> восстанавливаться будет последняя линия времени, найденная в архиве, что полезно для резервного сервера. Иное значение параметра может потребоваться в более сложной ситуации повторного восстановления, когда необходимо вернуться к состоянию, которое само было достигнуто после восстановления на момент времени. Это обсуждается в <xref remap="6" linkend="backup-timelines"/>.

source: <primary><varname>recovery_target_action</varname> recovery parameter</primary>
ru: <primary>параметр восстановления <varname>recovery_target_action</varname></primary>

source: Specifies what action the server should take once the recovery target is reached. The default is <literal>pause</literal>, which means recovery will be paused. <literal>promote</literal> means the recovery process will finish and the server will start to accept connections. Finally <literal>shutdown</literal> will stop the server after reaching the recovery target.
ru: Указывает, какое действие должен предпринять сервер после достижения цели восстановления. Вариант по умолчанию — <literal>pause</literal>, что означает приостановку восстановления. Второй вариант, <literal>promote</literal>, означает, что процесс восстановления завершится и сервер начнёт принимать подключения. Наконец, с вариантом <literal>shutdown</literal> сервер остановится, как только цель восстановления будет достигнута.

source: The intended use of the <literal>pause</literal> setting is to allow queries to be executed against the database to check if this recovery target is the most desirable point for recovery. The paused state can be resumed by using <function>pg_xlog_replay_resume()</function> (see <xref linkend="functions-recovery-control-table"/>), which then causes recovery to end. If this recovery target is not the desired stopping point, then shut down the server, change the recovery target settings to a later target and restart to continue recovery.
ru: Вариант <literal>pause</literal> позволяет выполнить запросы к базе данных и убедиться в том, что достигнутая цель оказалась желаемой точкой восстановления. Для снятия с паузы нужно вызвать <function>pg_xlog_replay_resume()</function> (см. <xref remap="4" linkend="functions-recovery-control-table"/>), что в итоге приведёт к завершению восстановления. Если же окажется, что мы ещё не достигли желаемой точки восстановления, нужно остановить сервер, установить более позднюю цель и перезапустить сервер для продолжения восстановления.

source: The <literal>shutdown</literal> setting is useful to have the instance ready at the exact replay point desired. The instance will still be able to replay more WAL records (and in fact will have to replay WAL records since the last checkpoint next time it is started).
ru: Вариант <literal>shutdown</literal> полезен для получения готового экземпляра сервера в желаемой точке. При этом данный экземпляр сможет воспроизводить дополнительные записи WAL (и на самом деле ему придётся воспроизводить записи WAL после последней контрольной точки при следующем перезапуске).

source: Note that because <filename>recovery.conf</filename> will not be renamed when <varname>recovery_target_action</varname> is set to <literal>shutdown</literal>, any subsequent start will end with immediate shutdown unless the configuration is changed or the <filename>recovery.conf</filename> file is removed manually.
ru: Заметьте, что так как <filename>recovery.conf</filename> не переименовывается, когда в <varname>recovery_target_action</varname> выбран вариант <literal>shutdown</literal>, при последующем запуске будет происходить немедленная остановка, пока вы не измените конфигурацию или не удалите файл <filename>recovery.conf</filename> вручную.

source: This setting has no effect if no recovery target is set. If <xref linkend="guc-hot-standby"/> is not enabled, a setting of <literal>pause</literal> will act the same as <literal>shutdown</literal>.
ru: Этот параметр не действует, если цель восстановления не установлена. Если не включён режим <xref linkend="guc-hot-standby"/>, значение <literal>pause</literal> действует так же, как и <literal>shutdown</literal>.

source: Standby Server Settings
ru: Параметры резервного сервера

source: <primary><varname>standby_mode</varname> recovery parameter</primary>
ru: <primary><varname>standby_mode</varname> параметр восстановления</primary>

source: Specifies whether to start the <productname>PostgreSQL</productname> server as a standby. If this parameter is <literal>on</literal>, the server will not stop recovery when the end of archived WAL is reached, but will keep trying to continue recovery by fetching new WAL segments using <varname>restore_command</varname> and/or by connecting to the primary server as specified by the <varname>primary_conninfo</varname> setting.
ru: Указывает, является ли сервер <productname>PostgreSQL</productname> резервным или нет. Если параметр установлен в <literal>on</literal>, то сервер не прекратит восстановление по окончании последнего архивного файла WAL, а продолжит попытки извлечения новых сегментов WAL посредством команды <varname>restore_command</varname> и/или через подключение к ведущему, как указано в параметре <varname>primary_conninfo</varname>.

source: <primary><varname>primary_conninfo</varname> recovery parameter</primary>
ru: <primary><varname>primary_conninfo</varname> параметр восстановления</primary>

source: Specifies a connection string to be used for the standby server to connect with the primary. This string is in the format described in <xref linkend="libpq-connstring"/>. If any option is unspecified in this string, then the corresponding environment variable (see <xref linkend="libpq-envars"/>) is checked. If the environment variable is not set either, then defaults are used.
ru: Указывает строку подключения резервного сервера к ведущему. Строка описана в формате согласно <xref linkend="libpq-connstring"/>. Вместо опущенных параметров подключения используются соответствующие переменные окружения (см. <xref remap="4" linkend="libpq-envars"/>). Если же какие-то переменные не установлены, то используются значения по умолчанию.

source: The connection string should specify the host name (or address) of the primary server, as well as the port number if it is not the same as the standby server's default. Also specify a user name corresponding to a suitably-privileged role on the primary (see <xref linkend="streaming-replication-authentication"/>). A password needs to be provided too, if the primary demands password authentication. It can be provided in the <varname>primary_conninfo</varname> string, or in a separate <filename>~/.pgpass</filename> file on the standby server (use <literal>replication</literal> as the database name). Do not specify a database name in the <varname>primary_conninfo</varname> string.
ru: Строка может содержать имя (или адрес) основного сервера и порт подключения. Также можно указать необходимого пользователя на ведущем сервере с требуемыми привилегиями (см. <xref remap="4" linkend="streaming-replication-authentication"/>). Если настроена аутентификация по паролю, то его также необходимо указать. Пароль можно указать как в строке подключения <varname>primary_conninfo</varname>, так и в файле <filename>~/.pgpass</filename> резервного сервера (в качестве имени базы данных используйте <literal>replication</literal>). Не указывайте имя базы данных среди параметров подключения <varname>primary_conninfo</varname>.
