Repository: pluzanov/pg-doc-ru
Catalog: 9.6/regress.po
Languages: ru

source: If you don't like the <command>diff</command> options that are used by default, set the environment variable <envar>PG_REGRESS_DIFF_OPTS</envar>, for instance <literal>PG_REGRESS_DIFF_OPTS='-u'</literal>. (Or you can run <command>diff</command> yourself, if you prefer.)
ru: Если вам не нравится используемая по умолчанию команда <command>diff</command>, установите переменную среды <envar>PG_REGRESS_DIFF_OPTS</envar>, например <literal>PG_REGRESS_DIFF_OPTS='-u'</literal>. (Или, если хотите, запустите <command>diff</command> самостоятельно.)

source: If for some reason a particular platform generates a <quote>failure</quote> for a given test, but inspection of the output convinces you that the result is valid, you can add a new comparison file to silence the failure report in future test runs. See <xref linkend="regress-variant"/> for details.
ru: Если по какой-то причине какая-то конкретная платформа генерирует <quote>сбой</quote> для отдельного теста, но изучение его результата убеждает вас, что результат правильный, вы можете добавить новый файл сравнения, чтобы замаскировать отчёт об ошибке для последующего прохождения теста. За подробностями обратитесь к <xref remap="3" linkend="regress-variant"/>.

source: Error Message Differences
ru: Различия в сообщениях об ошибке

source: Some of the regression tests involve intentional invalid input values. Error messages can come from either the <productname>PostgreSQL</productname> code or from the host platform system routines. In the latter case, the messages can vary between platforms, but should reflect similar information. These differences in messages will result in a <quote>failed</quote> regression test that can be validated by inspection.
ru: Некоторые регрессионные тесты подставляют заведомо неверные входные значения. Сообщения об ошибке могут выдаваться как <productname>PostgreSQL</productname>, так и самой операционной системой. В последнем случае, форма сообщений может отличаться в зависимости от платформы, но отражают они одну и ту же информацию. Вот эта разница в сообщениях и приводит к <quote>сбоям</quote> регрессионного теста, которые можно устранить при проверке.

source: Locale Differences
ru: Разница локалей

source: If you run the tests against a server that was initialized with a collation-order locale other than C, then there might be differences due to sort order and subsequent failures. The regression test suite is set up to handle this problem by providing alternate result files that together are known to handle a large number of locales.
ru: Если вы проводите тестирование на сервере, который был установлен с локалью, имеющей порядок сопоставления, отличный от С, вы можете столкнуться с различиями в порядке сортировки и, как следствие, с последующими сбоями. Пакет регрессионных тестов решает эту проблему путём наличия альтернативных файлов результата, которые способны справиться с большим количеством локалей.

source: To run the tests in a different locale when using the temporary-installation method, pass the appropriate locale-related environment variables on the <command>make</command> command line, for example: <placeholder-1/> (The regression test driver unsets <envar>LC_ALL</envar>, so it does not work to choose the locale using that variable.) To use no locale, either unset all locale-related environment variables (or set them to <literal>C</literal>) or use the following special invocation: <placeholder-2/> When running the tests against an existing installation, the locale setup is determined by the existing installation. To change it, initialize the database cluster with a different locale by passing the appropriate options to <command>initdb</command>.
ru: Если вы используете метод тестирования на временной инсталляции, то чтобы запустить тестирование на другой локали, используйте подходящую переменную среды, относящуюся к локали, в командной строке <command>make</command>, например: <placeholder-1/> (Драйвер регрессионного теста обнуляет <envar>LC_ALL</envar>, поэтому выбор локали посредством данной переменной не работает.) Чтобы не использовать локаль, либо обнулите все переменные среды, относящиеся к локали, либо установите их в <literal>C</literal>) или используйте следующую специальную команду: <placeholder-2/> Когда тест проходит на существующей инсталляции, установки локали определяются этой инсталляцией. Чтобы это изменить, инициализируйте кластер базы данных с иной локалью, передав соответствующие параметры <command>initdb</command>.

source: In general, it is advisable to try to run the regression tests in the locale setup that is wanted for production use, as this will exercise the locale- and encoding-related code portions that will actually be used in production. Depending on the operating system environment, you might get failures, but then you will at least know what locale-specific behaviors to expect when running real applications.
ru: В целом, рекомендуется по возможности проводить регрессионные тесты при таких установках локали, которые будут использованы в работе, тогда в результате тестирования будут проверены актуальные участки кода, относящиеся к локали и кодировке. В зависимости от окружения операционной системы, вы можете столкнуться со сбоями, но вы хотя бы будете знать, какого поведения локали можно ожидать при работе с реальными приложениями.

source: Date and Time Differences
ru: Разница в дате и времени

source: Most of the date and time results are dependent on the time zone environment. The reference files are generated for time zone <literal>PST8PDT</literal> (Berkeley, California), and there will be apparent failures if the tests are not run with that time zone setting. The regression test driver sets environment variable <envar>PGTZ</envar> to <literal>PST8PDT</literal>, which normally ensures proper results.
ru: Большая часть результатов проверки даты и времени зависит от часового пояса окружения. Эталонные файлы созданы для пояса <literal>PST8PDT</literal> (Беркли, Калифорния), поэтому если проводить тесты не с этим часовым поясом, проявятся мнимые ошибки. Драйвер регрессионного теста задаёт переменную среды <envar>PGTZ</envar> как <literal>PST8PDT</literal>, что позволяет получить корректный результат.

source: Floating-Point Differences
ru: Разница в числах с плавающей запятой

source: Some of the tests involve computing 64-bit floating-point numbers (<type>double precision</type>) from table columns. Differences in results involving mathematical functions of <type>double precision</type> columns have been observed. The <literal>float8</literal> and <literal>geometry</literal> tests are particularly prone to small differences across platforms, or even with different compiler optimization settings. Human eyeball comparison is needed to determine the real significance of these differences which are usually 10 places to the right of the decimal point.
ru: Некоторые тесты применяют 64-битное вычисление чисел с плавающей запятой (<type>double precision</type>) из столбцов таблицы. Наблюдаются различия в результатах при использовании математических функций для столбцов <type>double precision</type>. Тесты <literal>float8</literal> и <literal>geometry</literal> особенно чувствительны к небольшим различиям между платформами и даже режимами оптимизации компилятора. Чтобы понять реальную значимость этих различий, нужно сравнить их глазами, поскольку обычно они располагаются с десятого разряда справа от десятичной точки.

source: Some systems display minus zero as <literal>-0</literal>, while others just show <literal>0</literal>.
ru: Некоторые системы показывают минус ноль как <literal>-0</literal>, тогда как другие показывают просто <literal>0</literal>.

source: Some systems signal errors from <function>pow()</function> and <function>exp()</function> differently from the mechanism expected by the current <productname>PostgreSQL</productname> code.
ru: Некоторые системы сигнализируют об ошибках в <function>pow()</function> и <function>exp()</function> не так, как ожидает текущий код <productname>PostgreSQL</productname>.

source: Row Ordering Differences
ru: Разница в сортировке строк

source: You might see differences in which the same rows are output in a different order than what appears in the expected file. In most cases this is not, strictly speaking, a bug. Most of the regression test scripts are not so pedantic as to use an <literal>ORDER BY</literal> for every single <literal>SELECT</literal>, and so their result row orderings are not well-defined according to the SQL specification. In practice, since we are looking at the same queries being executed on the same data by the same software, we usually get the same result ordering on all platforms, so the lack of <literal>ORDER BY</literal> is not a problem. Some queries do exhibit cross-platform ordering differences, however. When testing against an already-installed server, ordering differences can also be caused by non-C locale settings or non-default parameter settings, such as custom values of <varname>work_mem</varname> or the planner cost parameters.
ru: Иногда наблюдаются различия в том, что одни и те же строки выводятся в ином порядке, нежели в контрольном файле. В большинстве случаев это не является, строго говоря, ошибкой. Основная часть скриптов регрессионных тестов не столь педантична, чтобы использовать <literal>ORDER BY</literal> для каждого <literal>SELECT</literal>, и поэтому в результате порядок строк не гарантирован согласно спецификации SQL. На практике мы видим, как одинаковые запросы, выполняемые для одних и тех же данных на одном и том же программном обеспечении, выдают результаты в одинаковом порядке для всех платформ, в связи с чем отсутствие <literal>ORDER BY</literal> не является проблемой. Однако некоторые запросы выявляют межплатформенные различия в сортировке. Когда тестирование идет на уже установленном сервере, различия в сортировке могут быть следствием того, что локаль установлена в отличное от С значение, или некоторые параметры заданы не по умолчанию, такие как <varname>work_mem</varname> или стоимостные параметры планировщика.

source: Therefore, if you see an ordering difference, it's not something to worry about, unless the query does have an <literal>ORDER BY</literal> that your result is violating. However, please report it anyway, so that we can add an <literal>ORDER BY</literal> to that particular query to eliminate the bogus <quote>failure</quote> in future releases.
ru: Поэтому, если вы видите различия в сортировке строк, не стоит волноваться, если только запрос не использует <literal>ORDER BY</literal>. Тем не менее, сообщайте нам о таких случаях, чтобы мы могли добавить <literal>ORDER BY</literal> в конкретный запрос, чтобы исключить возможность ошибки в будущих релизах.

source: You might wonder why we don't order all the regression test queries explicitly to get rid of this issue once and for all. The reason is that that would make the regression tests less useful, not more, since they'd tend to exercise query plan types that produce ordered results to the exclusion of those that don't.
ru: Вы можете задать вопрос, почему мы явно не добавили <literal>ORDER BY</literal> во все запросы регрессионных тестов, чтобы избавиться от таких ошибок раз и навсегда. Причина в том, что это снизит полезность регрессионных тестов, поскольку они будут иметь тенденцию к проверке планов запросов использующих сортировку, за счёт исключения запросов без сортировки.

source: Insufficient Stack Depth
ru: Недостаточная глубина стека

source: If the <literal>errors</literal> test results in a server crash at the <literal>select infinite_recurse()</literal> command, it means that the platform's limit on process stack size is smaller than the <xref linkend="guc-max-stack-depth"/> parameter indicates. This can be fixed by running the server under a higher stack size limit (4MB is recommended with the default value of <varname>max_stack_depth</varname>). If you are unable to do that, an alternative is to reduce the value of <varname>max_stack_depth</varname>.
ru: Если <literal>ошибки </literal> теста приводят к поломке сервера при выполнении команды <literal>select infinite_recurse()</literal>, это означает, что предел платформы для размера стека меньше, чем показывает параметр <xref linkend="guc-max-stack-depth"/>. Проблема может быть решена запуском сервера с большим размером стека (рекомендованное значение <varname>max_stack_depth</varname> по умолчанию - 4 Мб). Если вы не можете этого сделать, в качестве альтернативы уменьшите значение <varname>max_stack_depth</varname>.

source: On platforms supporting <function>getrlimit()</function>, the server should automatically choose a safe value of <varname>max_stack_depth</varname>; so unless you've manually overridden this setting, a failure of this kind is a reportable bug.
ru: На платформах, поддерживающих функцию <function>getrlimit()</function>, сервер должен автоматически выбирать значение переменной <varname>max_stack_depth</varname>; поэтому, если вы не переписывали это значение вручную, сбой такого типа — просто дефект, который нужно зарегистрировать.

source: The <quote>random</quote> Test
ru: Тест <quote>случайных значений</quote>

source: The <literal>random</literal> test script is intended to produce random results. In very rare cases, this causes that regression test to fail. Typing: <placeholder-1/> should produce only one or a few lines of differences. You need not worry unless the random test fails repeatedly.
ru: Тестовый скрипт <literal>random</literal> подразумевает получение случайных значений. В очень редких случаях это приводит к сбоям в регрессионном тестировании. Выполнение <placeholder-1/> должно выводить одну или несколько строк различий. Нет причин для беспокойства, до тех пор пока сбои в этом тесте не повторяются постоянно.

source: Configuration Parameters
ru: Параметры конфигурации

source: When running the tests against an existing installation, some non-default parameter settings could cause the tests to fail. For example, changing parameters such as <varname>enable_seqscan</varname> or <varname>enable_indexscan</varname> could cause plan changes that would affect the results of tests that use <command>EXPLAIN</command>.
ru: Когда тестирование проходит на существующей инсталляции, некоторые нестандартные значения параметров могут привести к сбоям в тесте. Например, изменение таких параметров конфигурации, как <varname>enable_seqscan</varname> или <varname>enable_indexscan</varname> могут привести к такому изменению системы, которое сможет воздействовать на результаты тестов, использующих <command>EXPLAIN</command>.

source: Variant Comparison Files
ru: Вариативные сравнительные файлы

source: Since some of the tests inherently produce environment-dependent results, we have provided ways to specify alternate <quote>expected</quote> result files. Each regression test can have several comparison files showing possible results on different platforms. There are two independent mechanisms for determining which comparison file is used for each test.
ru: Поскольку некоторые тесты по сути выдают результаты, зависящие от окружения, мы предлагаем несколько вариантов <quote>ожидаемых</quote> файлов результата. Каждый регрессионный тест может иметь несколько сравнительных файлов, показывающих возможные результаты на разных платформах. Существует два независимых механизма для определения, какой именно сравнительный файл будет выбран для каждого теста.

source: The first mechanism allows comparison files to be selected for specific platforms. There is a mapping file, <filename>src/test/regress/resultmap</filename>, that defines which comparison file to use for each platform. To eliminate bogus test <quote>failures</quote> for a particular platform, you first choose or make a variant result file, and then add a line to the <filename>resultmap</filename> file.
ru: Первый механизм позволяет выбирать сравнительный файл для конкретной платформы. Есть файл сопоставления <filename>src/test/regress/resultmap</filename>, в котором определяется, какой сравнительный файл выбирать для каждой платформы. Чтобы устранить ложные <quote>сбои</quote> тестирования для конкретной платформы, для начала вы должны выбрать или создать вариант сравнительного файла, а потом добавить строку в файл <filename>resultmap</filename>.

source: Each line in the mapping file is of the form <synopsis> testname:output:platformpattern=comparisonfilename </synopsis> The test name is just the name of the particular regression test module. The output value indicates which output file to check. For the standard regression tests, this is always <literal>out</literal>. The value corresponds to the file extension of the output file. The platform pattern is a pattern in the style of the Unix tool <command>expr</command> (that is, a regular expression with an implicit <literal>^</literal> anchor at the start). It is matched against the platform name as printed by <command>config.guess</command>. The comparison file name is the base name of the substitute result comparison file.
ru: Каждая строка в файле сопоставления выглядит как <synopsis> testname:output:platformpattern=comparisonfilename </synopsis> Имя теста (<literal>testname</literal>) здесь - просто название конкретного модуля регрессионного теста. Значение <literal>output</literal> показывает, вывод какого файла проверять. Для стандартного регрессионного теста это всегда <literal>out</literal>. Значение соответствует расширению выходного файла. <literal>platformpattern</literal> представляет собой шаблон в стиле Unix-утилиты <command>expr</command> (т. е. регулярное выражение с неявным <literal>^</literal> якорем в начале). Этот шаблон сравнивается с именем платформы, которое выводится из <command>config.guess</command>. <literal>comparisonfilename</literal> это имя сравнительного файла, который будет использован.

source: For example: some systems interpret very small floating-point values as zero, rather than reporting an underflow error. This causes a few differences in the <filename>float8</filename> regression test. Therefore, we provide a variant comparison file, <filename>float8-small-is-zero.out</filename>, which includes the results to be expected on these systems. To silence the bogus <quote>failure</quote> message on <systemitem>OpenBSD</systemitem> platforms, <filename>resultmap</filename> includes: <placeholder-1/> which will trigger on any machine where the output of <command>config.guess</command> matches <literal>i.86-.*-openbsd</literal>. Other lines in <filename>resultmap</filename> select the variant comparison file for other platforms where it's appropriate.
ru: Например: некоторые системы интерпретируют очень маленькие числа с плавающей запятой как ноль, а не как ошибку потери значимости. Это приводит к разночтениям в регрессионных тестах для <filename>float8</filename>. Поэтому мы предлагаем вариант сравнительного файла <filename>float8-small-is-zero.out</filename>, который включает в себя результат, ожидаемый для таких систем. Чтобы замаскировать сообщение о ложном <quote>сбое</quote> на платформе <systemitem>OpenBSD</systemitem>, файл <filename>resultmap</filename> включает в себя: <placeholder-1/> который сработает на любой машине, где выходное значение <command>config.guess</command> соответствует <literal>i.86-.*-openbsd</literal>. Другие строки в <filename>resultmap</filename> выбирают вариант сравнительного файла для других платформ, если это целесообразно.

source: The second selection mechanism for variant comparison files is much more automatic: it simply uses the <quote>best match</quote> among several supplied comparison files. The regression test driver script considers both the standard comparison file for a test, <literal><replaceable>testname</replaceable>.out</literal>, and variant files named <literal><replaceable>testname</replaceable>_<replaceable>digit</replaceable>.out</literal> (where the <replaceable>digit</replaceable> is any single digit <literal>0</literal>-<literal>9</literal>). If any such file is an exact match, the test is considered to pass; otherwise, the one that generates the shortest diff is used to create the failure report. (If <filename>resultmap</filename> includes an entry for the particular test, then the base <replaceable>testname</replaceable> is the substitute name given in <filename>resultmap</filename>.)
ru: Второй механизм выбора более автоматический: он просто выбирает <quote>подходящую пару</quote> из нескольких предлагаемых сравнительных файлов. Драйвер скрипта регрессионного теста рассматривает стандартный сравнительный файл для теста, <literal><replaceable>testname</replaceable>.out</literal>, вариативный файл <literal><replaceable>testname</replaceable>_<replaceable>digit</replaceable>.out</literal> (где <replaceable>digit</replaceable> любое одиночное число от <literal>0</literal> до <literal>9</literal>). Если какой-нибудь из этих файлов полностью совпадает, тест считается пройденным. В противном случае, для отчёта об ошибке выбирается файл с наименьшим различием. (Если <filename>resultmap</filename> включает вводные для конкретного теста, то в этом случае <replaceable>testname</replaceable> подменное имя, взятое из файла <filename>resultmap</filename>.)

source: For example, for the <literal>char</literal> test, the comparison file <filename>char.out</filename> contains results that are expected in the <literal>C</literal> and <literal>POSIX</literal> locales, while the file <filename>char_1.out</filename> contains results sorted as they appear in many other locales.
ru: Например, для теста <literal>char</literal> сравнительный файл <filename>char.out</filename> содержит результаты, ожидаемые для локалей <literal>C</literal> и <literal>POSIX</literal>, тогда как файл <filename>char_1.out</filename> содержит результаты, характерные для многих других локалей.

source: The best-match mechanism was devised to cope with locale-dependent results, but it can be used in any situation where the test results cannot be predicted easily from the platform name alone. A limitation of this mechanism is that the test driver cannot tell which variant is actually <quote>correct</quote> for the current environment; it will just pick the variant that seems to work best. Therefore it is safest to use this mechanism only for variant results that you are willing to consider equally valid in all contexts.
ru: Механизм "лучшей пары" был разработан, чтобы справляться с результатами, зависящими от локали, но он может применяться в любой ситуации, когда сложно предсказать результаты, исходя только из названия платформы. Ограниченность этого метода проявляется лишь в том, что драйвер теста не может сказать, какой вариант правилен для данного окружения; просто выбирается вариант, который кажется наиболее подходящим. Поэтому безопаснее всего использовать этот метод только для вариативных результатов, которые вы хотели бы видеть одинаково надёжными для любого контекста.

source: TAP Tests
ru: Тесты TAP
