Repository: pluzanov/pg-doc-ru
Catalog: 9.6/regress.po
Languages: ru

source: Regression Tests
ru: Регрессионные тесты

source: <primary>regression tests</primary>
ru: <primary>Регрессионное тестирование</primary>

source: <primary>test</primary>
ru: <primary>тест</primary>

source: The regression tests are a comprehensive set of tests for the SQL implementation in <productname>PostgreSQL</productname>. They test standard SQL operations as well as the extended capabilities of <productname>PostgreSQL</productname>.
ru: Регрессионные тесты представляют собой полный набор проверок реализации SQL в <productname>PostgreSQL</productname>. Они тестируют как стандартные SQL-операции, так и расширенные возможности <productname>PostgreSQL</productname>

source: Running the Tests
ru: Выполнение тестов

source: The regression tests can be run against an already installed and running server, or using a temporary installation within the build tree. Furthermore, there is a <quote>parallel</quote> and a <quote>sequential</quote> mode for running the tests. The sequential method runs each test script alone, while the parallel method starts up multiple server processes to run groups of tests in parallel. Parallel testing adds confidence that interprocess communication and locking are working correctly.
ru: Регрессионное тестирование можно выполнять как на уже установленном и работающем сервере, так и используя временную инсталляцию внутри дерева сборки. Более того, существуют <quote>параллельный</quote> и <quote>последовательный </quote> режимы тестирования. Последовательный метод выполняет каждый сценарий теста отдельно, тогда как параллельный метод запускает несколько процессов на сервере с тем, чтобы выполнить определённый набор тестов параллельно. Параллельное тестирование позволяет с уверенностью утверждать, что межпроцессное взаимодействие и блокировки работают корректно.

source: Running the Tests Against a Temporary Installation
ru: Запуск тестов на временной инсталляции

source: To run the parallel regression tests after building but before installation, type: <screen> make check </screen> in the top-level directory. (Or you can change to <filename>src/test/regress</filename> and run the command there.) At the end you should see something like: <screen> <computeroutput> ======================= All 115 tests passed. ======================= </computeroutput> </screen> or otherwise a note about which tests failed. See <xref linkend="regress-evaluation"/> below before assuming that a <quote>failure</quote> represents a serious problem.
ru: Чтобы запустить параллельное регрессионное тестирование после сборки, но до инсталляции, наберите: <screen> make check </screen> в каталоге верхнего уровня. (Или, как вариант, вы можете перейти в <filename>src/test/regress</filename> и выполнить команду там.) По завершении процесса вы должны увидеть нечто вроде: <screen> <computeroutput> ======================= All 115 tests passed. ======================= </computeroutput> </screen> или список тестов, не пройденных успешно. Прочитайте <xref linkend="regress-evaluation"/>, прежде чем делать вывод о серьёзности выявленных <quote>проблем</quote>.

source: Because this test method runs a temporary server, it will not work if you did the build as the root user, since the server will not start as root. Recommended procedure is not to do the build as root, or else to perform testing after completing the installation.
ru: Поскольку данный метод тестирования выполняется на временном сервере, он не будет работать, если вы выполняете сборку под пользователем root, сервер просто не запустится из под root. Рекомендуется не делать сборку под пользователем root, если только вы не собираетесь проводить тестирование после завершения инсталляции.

source: If you have configured <productname>PostgreSQL</productname> to install into a location where an older <productname>PostgreSQL</productname> installation already exists, and you perform <literal>make check</literal> before installing the new version, you might find that the tests fail because the new programs try to use the already-installed shared libraries. (Typical symptoms are complaints about undefined symbols.) If you wish to run the tests before overwriting the old installation, you'll need to build with <literal>configure --disable-rpath</literal>. It is not recommended that you use this option for the final installation, however.
ru: Если вы сконфигурировали <productname>PostgreSQL</productname> для инсталляции в месте, где уже установлена предыдущая версия <productname>PostgreSQL</productname>, и вы выполняете <literal>make check</literal> до инсталляции новой версии, вы можете столкнуться с тем, что тестирование завершится со сбоем, поскольку новая программа будет пытаться использовать уже установленные общие библиотеки. (Типичные симптомы - жалобы на неопределённые символы.) Если вы хотите провести тестирование до перезаписи старой инсталляции, вам необходимо проводить построение с <literal>configure --disable-rpath</literal>. Однако этот вариант не рекомендуется для окончательной инсталляции.

source: The parallel regression test starts quite a few processes under your user ID. Presently, the maximum concurrency is twenty parallel test scripts, which means forty processes: there's a server process and a <application>psql</application> process for each test script. So if your system enforces a per-user limit on the number of processes, make sure this limit is at least fifty or so, else you might get random-seeming failures in the parallel test. If you are not in a position to raise the limit, you can cut down the degree of parallelism by setting the <literal>MAX_CONNECTIONS</literal> parameter. For example: <screen> make MAX_CONNECTIONS=10 check </screen> runs no more than ten tests concurrently.
ru: Параллельное регрессионное тестирование запускает довольно много процессов под вашим именем пользователя. В настоящее время возможный максимум параллельной обработки составляет двадцать параллельных тестовых сценариев, а это означает сорок процессов: это и серверный процесс, и <application>psql</application> процесс для каждого тестового сценария. Поэтому если ваша система устанавливает ограничения на количество процессов для каждого пользователя, имеет смысл уточнить, что ваш лимит составляет не меньше пятидесяти процессов, или около того. В противном случае вы столкнетесь с кажущимися случайными сбоями в параллельном тестировании. Если же вы не имеете права увеличить свой лимит процессов, вы можете снизить степень параллелизма установкой параметра <literal>MAX_CONNECTIONS</literal>. Например: <screen> make MAX_CONNECTIONS=10 check </screen> выполняет не больше десяти тестов параллельно.

source: Running the Tests Against an Existing Installation
ru: Запуск тестов для существующей инсталляции

source: To run the tests after installation (see <xref linkend="installation"/>), initialize a data area and start the server as explained in <xref linkend="runtime"/>, then type: <screen> make installcheck </screen> or for a parallel test: <screen> make installcheck-parallel </screen> The tests will expect to contact the server at the local host and the default port number, unless directed otherwise by <envar>PGHOST</envar> and <envar>PGPORT</envar> environment variables. The tests will be run in a database named <literal>regression</literal>; any existing database by this name will be dropped.
ru: Чтобы запустить тестирование после инсталляции (см. <xref remap="4" linkend="installation"/>), инициализируйте кластер баз данных и запустите сервер, как показано в <xref remap="6" linkend="runtime"/>, потом введите: <screen> make installcheck </screen>, или для параллельного тестирования: <screen> make installcheck-parallel </screen>. Тестовые сценарии будут соединяться с сервером на локальном компьютере с номером порта по умолчанию, если иное не задано переменными среды <envar>PGHOST</envar> и <envar>PGPORT</envar>. Тестирование будет проведено в базе данных <literal>regression</literal>; любая существующая база с таким именем будет удалена.

source: The tests will also transiently create some cluster-wide objects, such as roles and tablespaces. These objects will have names beginning with <literal>regress_</literal>. Beware of using <literal>installcheck</literal> mode in installations that have any actual users or tablespaces named that way.
ru: Также тесты будут создавать случайные объекты общие для кластера, такие как роли и пользователи. Имена этих объектов будут начинаться с <literal>regress_</literal>. Опасайтесь использования режима <literal>installcheck</literal> там, где пользователи или табличные пространства могут иметь такие имена.

source: Additional Test Suites
ru: Дополнительные пакеты тестов

source: The <literal>make check</literal> and <literal>make installcheck</literal> commands run only the <quote>core</quote> regression tests, which test built-in functionality of the <productname>PostgreSQL</productname> server. The source distribution also contains additional test suites, most of them having to do with add-on functionality such as optional procedural languages.
ru: Команды <literal>make check</literal> и <literal>make installcheck</literal> запускают только <quote>основные</quote> регрессионные тесты, которые проверяют встроенную функциональность сервера <productname>PostgreSQL</productname>. Исходный дистрибутив также содержит дополнительные возможности тестирования, большая часть которых имеет дело с дополнительной функциональностью, такой, как, например, дополнительные процедурные языки.

source: To run all test suites applicable to the modules that have been selected to be built, including the core tests, type one of these commands at the top of the build tree: <screen> make check-world make installcheck-world </screen> These commands run the tests using temporary servers or an already-installed server, respectively, just as previously explained for <literal>make check</literal> and <literal>make installcheck</literal>. Other considerations are the same as previously explained for each method. Note that <literal>make check-world</literal> builds a separate temporary installation tree for each tested module, so it requires a great deal more time and disk space than <literal>make installcheck-world</literal>.
ru: Чтобы запустить пакет тестов (включая основные) применительно к модулям, выбранным для построения, наберите одну из этих команд в каталоге верхнего уровня дерева сборки: <screen> make check-world make installcheck-world </screen> Эти команды запускают тестирование используя временный сервер или уже установленный сервер, в соответствии с данным выше описанием для команд <literal>make check</literal> и <literal>make installcheck</literal>. Остальные детали соответствуют ранее изложенным объяснениям для каждого метода. Необходимо иметь в виду, что команда <literal>make check-world</literal> выстраивает отдельное дерево временной инсталляции для каждого тестируемого модуля, а это требует гораздо больше времени и дискового пространства, нежели команда <literal>make installcheck-world</literal>.

source: Alternatively, you can run individual test suites by typing <literal>make check</literal> or <literal>make installcheck</literal> in the appropriate subdirectory of the build tree. Keep in mind that <literal>make installcheck</literal> assumes you've installed the relevant module(s), not only the core server.
ru: В качестве альтернативного пути можно запустить индивидуальный набор тестов, набрав <literal>make check</literal> или <literal>make installcheck</literal> в подходящем подкаталоге дерева сборки. Имейте в виду, что <literal>make installcheck</literal> предполагает, что вы уже установили соответствующие модули, а не только основной сервер.

source: The additional tests that can be invoked this way include:
ru: Дополнительные тесты, которые можно активизировать таким способом:

source: Regression tests for optional procedural languages (other than <application>PL/pgSQL</application>, which is tested by the core tests). These are located under <filename>src/pl</filename>.
ru: Регрессионные тесты для дополнительных процедурных языков (отличных от <application>PL/pgSQL</application>, который тестируется в рамках основного тестирования). Эти тесты расположены в каталоге <filename>src/pl</filename>.

source: Regression tests for <filename>contrib</filename> modules, located under <filename>contrib</filename>. Not all <filename>contrib</filename> modules have tests.
ru: Регрессионные тесты для модулей <filename>contrib</filename>, расположенные в каталоге <filename>contrib</filename>. Не для всех модулей из <filename> contrib</filename> существуют тесты.

source: Regression tests for the ECPG interface library, located in <filename>src/interfaces/ecpg/test</filename>.
ru: Регрессионные тесты для библиотеки ECPG, расположенные в <filename>src/interfaces/ecpg/test</filename>.

source: Tests stressing behavior of concurrent sessions, located in <filename>src/test/isolation</filename>.
ru: Тесты, для проверки работы одновременного доступа параллельными сессиями, расположенные в <filename>src/test/isolation</filename>.

source: Tests of client programs under <filename>src/bin</filename>. See also <xref linkend="regress-tap"/>.
ru: Тесты клиентских программ из <filename>src/bin</filename>. См. также <xref remap="4" linkend="regress-tap"/>.

source: When using <literal>installcheck</literal> mode, these tests will destroy any existing databases named <literal>pl_regression</literal>, <literal>contrib_regression</literal>, <literal>isolation_regression</literal>, <literal>ecpg1_regression</literal>, or <literal>ecpg2_regression</literal>, as well as <literal>regression</literal>.
ru: При использовании режима <literal>installcheck</literal> эти тесты удалят все существующие базы данных с именами <literal>pl_regression</literal>, <literal>contrib_regression</literal>, <literal>isolation_regression</literal>, <literal>ecpg1_regression</literal>, <literal>ecpg2_regression</literal>, а также <literal>regression</literal>.

source: Locale and Encoding
ru: Локаль и кодировка

source: By default, tests using a temporary installation use the locale defined in the current environment and the corresponding database encoding as determined by <command>initdb</command>. It can be useful to test different locales by setting the appropriate environment variables, for example: <screen> make check LANG=C make check LC_COLLATE=en_US.utf8 LC_CTYPE=fr_CA.utf8 </screen> For implementation reasons, setting <envar>LC_ALL</envar> does not work for this purpose; all the other locale-related environment variables do work.
ru: По умолчанию, тесты, работающие на временной инсталляции, используют локаль, определённую в текущей среде и кодировку базы данных, заданную при выполнении <command>initdb</command>. Для тестирования различных локалей может оказаться полезным установить подходящие переменные среды, например: <screen> make check LANG=C make check LC_COLLATE=en_US.utf8 LC_CTYPE=ru_RU.utf8 </screen> Поддержка переменной <envar>LC_ALL</envar> в этом случае не реализована; все остальные переменные среды, относящиеся к локали, работают.

source: When testing against an existing installation, the locale is determined by the existing database cluster and cannot be set separately for the test run.
ru: При тестировании на существующей инсталляции, локаль определяется имеющимся кластером базы данных и не может быть изменена для выполнения теста.

source: You can also choose the database encoding explicitly by setting the variable <envar>ENCODING</envar>, for example: <screen> make check LANG=C ENCODING=EUC_JP </screen> Setting the database encoding this way typically only makes sense if the locale is C; otherwise the encoding is chosen automatically from the locale, and specifying an encoding that does not match the locale will result in an error.
ru: Вы можете задать кодировку базы данных в переменной <envar>ENCODING</envar>, например: <screen> make check LANG=C ENCODING=EUC_JP </screen> Установка кодировки базы данных таким образом имеет смысл только для локали C; в противном случае кодировка определяется автоматически из локали, и установка кодировки, не соответствующей локали, приведёт к ошибке.

source: The database encoding can be set for tests against either a temporary or an existing installation, though in the latter case it must be compatible with the installation's locale.
ru: Кодировка базы данных может быть установлена как для тестирования на временной, так и на существующей инсталляции, хотя в последнем случае она должна быть совместимой с локалью этой инсталляции.

source: Extra Tests
ru: Специальные тесты

source: The core regression test suite contains a few test files that are not run by default, because they might be platform-dependent or take a very long time to run. You can run these or other extra test files by setting the variable <envar>EXTRA_TESTS</envar>. For example, to run the <literal>numeric_big</literal> test: <screen> make check EXTRA_TESTS=numeric_big </screen> To run the collation tests: <screen> make check EXTRA_TESTS=collate.linux.utf8 LANG=en_US.utf8 </screen> The <literal>collate.linux.utf8</literal> test works only on Linux/glibc platforms, and only when run in a database that uses UTF-8 encoding.
ru: Пакет основных регрессионных тестов содержит несколько тестовых файлов, которые не запускаются по умолчанию, поскольку они могут зависеть от платформы или выполняться слишком долго. Вы можете запустить те или иные дополнительные тесты, задав переменную <envar>EXTRA_TESTS</envar>. Например, запустить тест <literal>numeric_big</literal>: <screen> make check EXTRA_TESTS=numeric_big </screen> Запустить тест сортировки: <screen> make check EXTRA_TESTS=collate.linux.utf8 LANG=en_US.utf8 </screen> Тест <literal>collate.linux.utf8</literal> работает только на платформе Linux/glibc и выполняется только для баз данных с кодировкой UTF-8.

source: Testing Hot Standby
ru: Тестирование сервера горячего резерва

source: The source distribution also contains regression tests for the static behavior of Hot Standby. These tests require a running primary server and a running standby server that is accepting new WAL changes from the primary (using either file-based log shipping or streaming replication). Those servers are not automatically created for you, nor is replication setup documented here. Please check the various sections of the documentation devoted to the required commands and related issues.
ru: Исходный дистрибутив также содержит регрессионные тесты для статического поведения сервера горячего резерва. Для выполнения тестов требуется работающий ведущий сервер и работающий резервный, принимающий новые записи WAL от ведущего (с использованием либо трансляции файлов журналов, либо потоковой репликации). Эти серверы не создаются автоматически, также как и настройка репликации здесь не описана. Пожалуйста, сверьтесь с соответствующими разделами документации.

source: To run the Hot Standby tests, first create a database called <literal>regression</literal> on the primary: <screen> psql -h primary -c "CREATE DATABASE regression" </screen> Next, run the preparatory script <filename>src/test/regress/sql/hs_primary_setup.sql</filename> on the primary in the regression database, for example: <screen> psql -h primary -f src/test/regress/sql/hs_primary_setup.sql regression </screen> Allow these changes to propagate to the standby.
ru: Для запуска тестов сервера горячего резерва необходимо создать базу данных <literal>regression</literal> на ведущем сервере: <screen> psql -h primary -c "CREATE DATABASE regression" </screen> Затем, на ведущем сервере в базе данных regression запустите предварительный скрипт <filename>src/test/regress/sql/hs_primary_setup.sql</filename> Например: <screen> psql -h primary -f src/test/regress/sql/hs_primary_setup.sql regression </screen> Убедитесь, что эти изменения распространились на резервный сервер.

source: Now arrange for the default database connection to be to the standby server under test (for example, by setting the <envar>PGHOST</envar> and <envar>PGPORT</envar> environment variables). Finally, run <literal>make standbycheck</literal> in the regression directory: <screen> cd src/test/regress make standbycheck </screen>
ru: Теперь, для выполнения теста, настройте, чтобы подключение по умолчанию выполнялось к резервному серверу (например, задав переменные среды <envar>PGHOST</envar> и <envar>PGPORT</envar>). И, наконец, запустите <literal>make standbycheck</literal> в каталоге регрессионных тестов: <screen> cd src/test/regress make standbycheck </screen>

source: Some extreme behaviors can also be generated on the primary using the script <filename>src/test/regress/sql/hs_primary_extremes.sql</filename> to allow the behavior of the standby to be tested.
ru: Чтобы протестировать работу резервного сервера в некоторых экстремальных условиях, эти условия можно получить на главном, воспользовавшись скриптом <filename>src/test/regress/sql/hs_primary_extremes.sql</filename>.

source: Test Evaluation
ru: Оценка результатов тестирования

source: Some properly installed and fully functional <productname>PostgreSQL</productname> installations can <quote>fail</quote> some of these regression tests due to platform-specific artifacts such as varying floating-point representation and message wording. The tests are currently evaluated using a simple <command>diff</command> comparison against the outputs generated on a reference system, so the results are sensitive to small system differences. When a test is reported as <quote>failed</quote>, always examine the differences between expected and actual results; you might find that the differences are not significant. Nonetheless, we still strive to maintain accurate reference files across all supported platforms, so it can be expected that all tests pass.
ru: Некоторые правильно установленные и полностью функциональные <productname>PostgreSQL</productname> инсталляции могут <quote>давать сбой</quote> при прохождении некоторых регрессионных тестов из-за особенностей, присущих той или иной платформе, таких как различное представление чисел с плавающей запятой и формулировкой сообщений. В настоящее время результаты тестов оцениваются простым <command>diff</command> сравнением с выводом, сделанным в эталонной системе, поэтому результаты чувствительны к небольшим отличиям между системами. Когда тест завершается со <quote>сбоем</quote>, всегда исследуйте разницу между ожидаемым и полученным результатом; возможно, вы обнаружите, что разница не столь уж существенна. Тем не менее, мы стремимся поддерживать эталонные файлы на всех поддерживаемых платформах, чтобы можно было ожидать прохождения всех тестов.

source: The actual outputs of the regression tests are in files in the <filename>src/test/regress/results</filename> directory. The test script uses <command>diff</command> to compare each output file against the reference outputs stored in the <filename>src/test/regress/expected</filename> directory. Any differences are saved for your inspection in <filename>src/test/regress/regression.diffs</filename>. (When running a test suite other than the core tests, these files of course appear in the relevant subdirectory, not <filename>src/test/regress</filename>.)
ru: Актуальные итоговые результаты регрессионного тестирования хранятся в каталоге <filename>src/test/regress/results</filename>. Тестовый скрипт использует команду <command>diff</command>, чтобы сравнить каждый итоговый файл с ожидаемыми результатами, которые хранятся в каталоге <filename>src/test/regress/expected</filename>. Все различия сохраняются в <filename>src/test/regress/regression.diffs</filename> для последующей проверки. (Если проводился тест не из основного пакета, то его результаты появятся в соответствующем подкаталоге, а не в <filename>src/test/regress</filename>.)
