Repository: pluzanov/pg-doc-ru
Catalog: 9.6/regress.po
Languages: ru

source: The client program tests under <filename>src/bin</filename> use the Perl TAP tools and are run by <command>prove</command>. You can pass command-line options to <command>prove</command> by setting the <command>make</command> variable <varname>PROVE_FLAGS</varname>, for example: <placeholder-1/> The default is <literal>--verbose</literal>. See the manual page of <command>prove</command> for more information.
ru: Тесты клиентских программ внутри <filename>src/bin</filename> используют инструменты Perl TAP и запускаются командой <command>prove</command>. Вы можете передать аргументы командной строки команде <command>prove</command>, установив для <command>make</command> переменную <varname>PROVE_FLAGS</varname>, например: <placeholder-1/> Умолчанием в данном случае является <literal>--verbose</literal>. За дополнительными сведениями обратитесь к странице руководства по <command>prove</command>.

source: The tests written in Perl require the Perl module <literal>IPC::Run</literal>. This module is available from CPAN or an operating system package.
ru: Тесты, написанные на Perl, требуют модуля Perl <literal>IPC::Run</literal>. Этот модуль доступен из CPAN или операционной системы.

source: Test Coverage Examination
ru: Проверка покрытия теста

source: The PostgreSQL source code can be compiled with coverage testing instrumentation, so that it becomes possible to examine which parts of the code are covered by the regression tests or any other test suite that is run with the code. This is currently supported when compiling with GCC and requires the <command>gcov</command> and <command>lcov</command> programs.
ru: Исходный код PostgreSQL может быть скомпилирован с инструментарием для теста покрытия, так что можно проверить, какие части кода покрывает регрессионное тестирование, или любое другое тестирование, запускаемое относительно кода. В настоящее время эта возможность поддерживается в сочетании с компиляцией с GCC и требует наличия <command>gcov</command> и <command>lcov</command> программ.

source: A typical workflow would look like this: <screen> ./configure --enable-coverage ... OTHER OPTIONS ... make make check # or other test suite make coverage-html </screen> Then point your HTML browser to <filename>coverage/index.html</filename>. The <command>make</command> commands also work in subdirectories.
ru: Типичный рабочий процесс выглядит так: <screen> ./configure --enable-coverage ... OTHER OPTIONS ... make make check # или другой комплект тестов make coverage-html </screen> Затем откройте в своём HTML-браузере страницу <filename>coverage/index.html</filename>. Команды <command>make</command> работают и в подкаталогах.

source: To reset the execution counts between test runs, run: <screen> make coverage-clean </screen>
ru: Чтобы обнулить подсчёт выполнений между тестами, запустите: <screen> make coverage-clean </screen>
