Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rules.po
Languages: ru

source: The views are created as: <placeholder-1/> The <command>CREATE VIEW</command> command for the <literal>shoelace</literal> view (which is the simplest one we have) will create a relation <literal>shoelace</literal> and an entry in <structname>pg_rewrite</structname> that tells that there is a rewrite rule that must be applied whenever the relation <literal>shoelace</literal> is referenced in a query's range table. The rule has no rule qualification (discussed later, with the non-<command>SELECT</command> rules, since <command>SELECT</command> rules currently cannot have them) and it is <literal>INSTEAD</literal>. Note that rule qualifications are not the same as query qualifications. The action of our rule has a query qualification. The action of the rule is one query tree that is a copy of the <command>SELECT</command> statement in the view creation command.
ru: Представления создаются так: <placeholder-1/> Команда <command>CREATE VIEW</command> для представления <literal>shoelace</literal> (самого простого из имеющихся) создаёт отношение <literal>shoelace</literal> и запись в <structname>pg_rewrite</structname> о правиле перезаписи, которое должно применяться, когда в запросе на выборку задействуется отношение <literal>shoelace</literal>. Для этого правила не задаются условия применения (о них рассказывается ниже, в описании правил не для <command>SELECT</command>, так как правила <command>SELECT</command> в настоящее бывают только безусловными) и оно действует в режиме <literal>INSTEAD</literal>. Заметьте, что условия применения отличаются от условий фильтра запроса, например, действие для нашего правила содержит условие фильтра. Действие правила выражается одним деревом запроса, которое является копией оператора <command>SELECT</command> в команде, создающей представление.

source: The two extra range table entries for <literal>NEW</literal> and <literal>OLD</literal> that you can see in the <structname>pg_rewrite</structname> entry aren't of interest for <command>SELECT</command> rules.
ru: Два дополнительных элемента списка отношений <literal>NEW</literal> и <literal>OLD</literal>, которые можно увидеть в соответствующей строке <structname>pg_rewrite</structname>, не представляют интереса для правил <command>SELECT</command>.

source: Now we populate <literal>unit</literal>, <literal>shoe_data</literal> and <literal>shoelace_data</literal> and run a simple query on a view: <placeholder-1/>
ru: Сейчас мы наполним таблицы <literal>unit</literal> (единицы измерения), <literal>shoe_data</literal> (данные о туфлях) и <literal>shoelace_data</literal> (данные о шнурках) и выполним простой запрос к представлению: <placeholder-1/>

source: This is the simplest <command>SELECT</command> you can do on our views, so we take this opportunity to explain the basics of view rules. The <literal>SELECT * FROM shoelace</literal> was interpreted by the parser and produced the query tree: <placeholder-1/> and this is given to the rule system. The rule system walks through the range table and checks if there are rules for any relation. When processing the range table entry for <literal>shoelace</literal> (the only one up to now) it finds the <literal>_RETURN</literal> rule with the query tree: <placeholder-2/>
ru: Это самый простой запрос <command>SELECT</command>, который можно выполнить с нашими представлениями, и мы воспользуемся этим, чтобы объяснить азы правил представлений. Запрос <literal>SELECT * FROM shoelace</literal> интерпретируется анализатором запросов и преобразуется в дерево запроса: <placeholder-1/> Это дерево передаётся в систему правил, которая проходит по списку отношений и проверяет, есть ли какие-либо правила для этих отношений. Обрабатывая элемент отношения <literal>shoelace</literal> (сейчас он единственный), система правил находит правило <literal>_RETURN</literal> с деревом запроса: <placeholder-2/>

source: To expand the view, the rewriter simply creates a subquery range-table entry containing the rule's action query tree, and substitutes this range table entry for the original one that referenced the view. The resulting rewritten query tree is almost the same as if you had typed: <placeholder-1/> There is one difference however: the subquery's range table has two extra entries <literal>shoelace old</literal> and <literal>shoelace new</literal>. These entries don't participate directly in the query, since they aren't referenced by the subquery's join tree or target list. The rewriter uses them to store the access privilege check information that was originally present in the range-table entry that referenced the view. In this way, the executor will still check that the user has proper privileges to access the view, even though there's no direct use of the view in the rewritten query.
ru: Чтобы развернуть представление, механизм перезаписи просто формирует новый элемент для списка отношений — подзапрос, содержащий дерево действия правила, и подставляет этот элемент вместо исходного, на который ссылалось представление. Получившееся перезаписанное дерево запроса будет почти таким как дерево запроса: <placeholder-1/> Однако есть одно различие: в списке отношений подзапроса будут содержаться два дополнительных элемента: <literal>shoelace old</literal> и <literal>shoelace new</literal>. Эти элементы не принимают непосредственного участия в запросе, так как они не задействованы в дереве соединения подзапроса и в целевом списке. Механизм перезаписи использует их для хранения информации о проверке прав доступа, которая изначально хранилась в элементе, указывающем на представление. Таким образом, исполнитель будет по-прежнему проверять, имеет ли пользователь необходимые права для доступа к представлению, хотя в перезаписанном запросе это представление не фигурирует непосредственно.

source: That was the first rule applied. The rule system will continue checking the remaining range-table entries in the top query (in this example there are no more), and it will recursively check the range-table entries in the added subquery to see if any of them reference views. (But it won't expand <literal>old</literal> or <literal>new</literal> &mdash; otherwise we'd have infinite recursion!) In this example, there are no rewrite rules for <literal>shoelace_data</literal> or <literal>unit</literal>, so rewriting is complete and the above is the final result given to the planner.
ru: Так было применено первое правило. Система правил продолжит проверку оставшихся элементов списка отношений на верхнем уровне запроса (в данном случае таких элементов нет) и рекурсивно проверит элементы списка отношений в добавленном подзапросе, не ссылаются ли они на представления. (Но <literal>old</literal> и <literal>new</literal> разворачиваться не будут &mdash; иначе мы получили бы бесконечную рекурсию!) В этом примере для <literal>shoelace_data</literal> и <literal>unit</literal> нет правил перезаписи, так что перезапись завершается и результат, полученный выше, передаётся планировщику.

source: Now we want to write a query that finds out for which shoes currently in the store we have the matching shoelaces (color and length) and where the total number of exactly matching pairs is greater or equal to two. <placeholder-1/>
ru: Сейчас мы хотим написать запрос, который выбирает туфли из имеющихся в данный момент, для которых есть подходящие шнурки (по цвету и длине) и число готовых пар больше или равно двум. <placeholder-1/>

source: The output of the parser this time is the query tree: <placeholder-1/> The first rule applied will be the one for the <literal>shoe_ready</literal> view and it results in the query tree: <placeholder-2/> Similarly, the rules for <literal>shoe</literal> and <literal>shoelace</literal> are substituted into the range table of the subquery, leading to a three-level final query tree: <placeholder-3/>
ru: На этот раз анализатор запроса выводит такое дерево: <placeholder-1/> Первое правило применяется к представлению <literal>shoe_ready</literal> и в результате получается дерево запроса: <placeholder-2/> Подобным образом, правила для <literal>shoe</literal> и <literal>shoelace</literal> подставляются в список отношений, что даёт окончательное дерево запроса: <placeholder-3/>

source: It turns out that the planner will collapse this tree into a two-level query tree: the bottommost <command>SELECT</command> commands will be <quote>pulled up</quote> into the middle <command>SELECT</command> since there's no need to process them separately. But the middle <command>SELECT</command> will remain separate from the top, because it contains aggregate functions. If we pulled those up it would change the behavior of the topmost <command>SELECT</command>, which we don't want. However, collapsing the query tree is an optimization that the rewrite system doesn't have to concern itself with.
ru: На практике планировщик будет сворачивать это дерево до двух уровней: команды нижнего уровня <command>SELECT</command> будут <quote>подняты</quote> к среднему <command>SELECT</command>, так как обрабатывать их отдельно нет необходимости. Но средний оператор <command>SELECT</command> не будет совмещён с верхним, так как он содержит агрегатные функции. Если поднять его выше, поведение самого верхнего <command>SELECT</command> изменится нежелательным образом. В целом же, сворачивание дерева запросов — это оптимизация, которая не должна затрагивать работу механизма перезаписи.

source: View Rules in Non-<command>SELECT</command> Statements
ru: Правила представлений не для <command>SELECT</command>

source: Two details of the query tree aren't touched in the description of view rules above. These are the command type and the result relation. In fact, the command type is not needed by view rules, but the result relation may affect the way in which the query rewriter works, because special care needs to be taken if the result relation is a view.
ru: До этого в описании правил представлений не затрагивались два компонента дерева запросов — тип команды и результирующее отношение. На самом деле, тип команды не важен для правил представления, но результирующее отношение может повлиять на работу механизма перезаписи, потому что если это представление, требуются дополнительные операции.

source: The range tables contain entries for the tables <literal>t1</literal> and <literal>t2</literal>.
ru: Списки отношений содержат элементы для таблиц <literal>t1</literal> и <literal>t2</literal>.

source: The target lists contain one variable that points to column <literal>b</literal> of the range table entry for table <literal>t2</literal>.
ru: Выходные списки содержат одну переменную, указывающую на столбец <literal>b</literal> элемента-отношения для таблицы <literal>t2</literal>.

source: The qualification expressions compare the columns <literal>a</literal> of both range-table entries for equality.
ru: Выражения условий сравнивают столбцы <literal>a</literal> обоих элементов-отношений на равенство.

source: The join trees show a simple join between <literal>t1</literal> and <literal>t2</literal>.
ru: Деревья соединений показывают простое соединение между <literal>t1</literal> и <literal>t2</literal>.

source: There are only a few differences between a query tree for a <command>SELECT</command> and one for any other command. Obviously, they have a different command type and for a command other than a <command>SELECT</command>, the result relation points to the range-table entry where the result should go. Everything else is absolutely the same. So having two tables <literal>t1</literal> and <literal>t2</literal> with columns <literal>a</literal> and <literal>b</literal>, the query trees for the two statements: <placeholder-1/> are nearly identical. In particular: <placeholder-2/>
ru: Есть только несколько отличий между деревом запроса для <command>SELECT</command> и деревом для другой команды. Очевидно, у них различные типы команд, и для команды, отличной от <command>SELECT</command>, результирующее отношение указывает на элемент в списке отношений, куда должен попасть результат. Все остальные компоненты в точности те же. Поэтому, например, если взять таблицы <literal>t1</literal> и <literal>t2</literal> со столбцами <literal>a</literal> и <literal>b</literal>, деревья запросов для этих операторов: <placeholder-1/> будут практически одинаковыми. В частности: <placeholder-2/>

source: The consequence is, that both query trees result in similar execution plans: They are both joins over the two tables. For the <command>UPDATE</command> the missing columns from <literal>t1</literal> are added to the target list by the planner and the final query tree will read as: <placeholder-1/> and thus the executor run over the join will produce exactly the same result set as: <placeholder-2/> But there is a little problem in <command>UPDATE</command>: the part of the executor plan that does the join does not care what the results from the join are meant for. It just produces a result set of rows. The fact that one is a <command>SELECT</command> command and the other is an <command>UPDATE</command> is handled higher up in the executor, where it knows that this is an <command>UPDATE</command>, and it knows that this result should go into table <literal>t1</literal>. But which of the rows that are there has to be replaced by the new row?
ru: Как следствие, для обоих деревьев строятся похожие планы выполнения, с соединением двух таблиц. Для <command>UPDATE</command> планировщик добавляет в выходной список недостающие столбцы из <literal>t1</literal> и окончательное дерево становится таким: <placeholder-1/> В результате исполнитель, обрабатывающий соединение, выдаёт тот же результат, что и запрос: <placeholder-2/> Но с <command>UPDATE</command> есть маленькая проблема: часть плана исполнителя, в которой выполняется соединение, не представляет, для чего предназначены результаты соединения. Она просто выдаёт результирующий набор строк. Фактически есть одна команда <command>SELECT</command>, а другая, <command>UPDATE</command>, обрабатывается исполнителем выше, где он уже знает, что это команда <command>UPDATE</command> и что результат должен попасть в таблицу <literal>t1</literal>. Но какие из строк таблицы должны заменяться новыми?

source: To resolve this problem, another entry is added to the target list in <command>UPDATE</command> (and also in <command>DELETE</command>) statements: the current tuple ID (<acronym>CTID</acronym>).<placeholder-1/> This is a system column containing the file block number and position in the block for the row. Knowing the table, the <acronym>CTID</acronym> can be used to retrieve the original row of <literal>t1</literal> to be updated. After adding the <acronym>CTID</acronym> to the target list, the query actually looks like: <placeholder-2/> Now another detail of <productname>PostgreSQL</productname> enters the stage. Old table rows aren't overwritten, and this is why <command>ROLLBACK</command> is fast. In an <command>UPDATE</command>, the new result row is inserted into the table (after stripping the <acronym>CTID</acronym>) and in the row header of the old row, which the <acronym>CTID</acronym> pointed to, the <literal>cmax</literal> and <literal>xmax</literal> entries are set to the current command counter and current transaction ID. Thus the old row is hidden, and after the transaction commits the vacuum cleaner can eventually remove the dead row.
ru: Для решения этой проблемы в выходной список операторов <command>UPDATE</command> (и <command>DELETE</command>) добавляется ещё один элемент: идентификатор текущего кортежа (Current Tuple ID, <acronym>CTID</acronym>).<placeholder-1/> Это системный столбец, содержащий номер блока в файле и позицию строки в блоке. Зная таблицу, по <acronym>CTID</acronym> можно получить исходную строку в <literal>t1</literal>, подлежащую изменению. С добавленным в выходной список <acronym>CTID</acronym> запрос фактически выглядит так: <placeholder-2/> Теперь мы перейдём ещё к одной особенности <productname>PostgreSQL</productname>. Старые строки таблицы не переписываются, поэтому <command>ROLLBACK</command> выполняется быстро. С командой <command>UPDATE</command> в таблицу вставляется новая строка результата (без <acronym>CTID</acronym>) и в заголовке старой строки, на которую указывает <acronym>CTID</acronym>, в поля <literal>cmax</literal> и <literal>xmax</literal> записываются текущий счётчик команд и идентификатор текущей транзакции. Таким образом, старая строка оказывается скрытой и после фиксирования транзакции процесс очистки может окончательно удалить неактуальную версию строки.

source: Knowing all that, we can simply apply view rules in absolutely the same way to any command. There is no difference.
ru: Зная всё это, мы можем применять правила представлений абсолютно таким же образом к любой команде — никаких различий нет.

source: The Power of Views in <productname>PostgreSQL</productname>
ru: Преимущества представлений в <productname>PostgreSQL</productname>

source: The above demonstrates how the rule system incorporates view definitions into the original query tree. In the second example, a simple <command>SELECT</command> from one view created a final query tree that is a join of 4 tables (<literal>unit</literal> was used twice with different names).
ru: Выше было показано, как система правил внедряет определения представлений в исходное дерево запроса. Во втором примере простой запрос <command>SELECT</command> к одному представлению создал окончательное дерево запроса, соединяющее 4 таблицы (таблица <literal>unit</literal> использовалась дважды с разными именами).

source: The benefit of implementing views with the rule system is, that the planner has all the information about which tables have to be scanned plus the relationships between these tables plus the restrictive qualifications from the views plus the qualifications from the original query in one single query tree. And this is still the situation when the original query is already a join over views. The planner has to decide which is the best path to execute the query, and the more information the planner has, the better this decision can be. And the rule system as implemented in <productname>PostgreSQL</productname> ensures, that this is all information available about the query up to that point.
ru: Преимущество реализации представлений через систему правил заключается в том, что планировщик получает в одном дереве запроса всю информацию о таблицах, которые нужно прочитать, о том, как связаны эти таблицы, об условиях в представлениях, а также об условиях, заданных в исходном запросе. И всё это имеет место, когда сам исходный запрос представляет собой соединение представлений. Планировщик должен выбрать лучший способ выполнения запроса и чем больше информации он получит, тем лучше может быть его выбор. И то, как в <productname>PostgreSQL</productname> реализована система правил, гарантирует, что ему поступает вся информация, собранная о запросе на данный момент.

source: Updating a View
ru: Изменение представления

source: What happens if a view is named as the target relation for an <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>? Doing the substitutions described above would give a query tree in which the result relation points at a subquery range-table entry, which will not work. There are several ways in which <productname>PostgreSQL</productname> can support the appearance of updating a view, however.
ru: Но что произойдёт, если записать имя представления в качестве целевого отношения команды <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>? Если проделать подстановки, описанные выше, будет получено дерево запроса, в котором результирующее отношение указывает на элемент-подзапрос, что не будет работать. Однако <productname>PostgreSQL</productname> даёт ряд возможностей, чтобы сделать представления изменяемыми.

source: If the subquery selects from a single base relation and is simple enough, the rewriter can automatically replace the subquery with the underlying base relation so that the <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> is applied to the base relation in the appropriate way. Views that are <quote>simple enough</quote> for this are called <firstterm>automatically updatable</firstterm>. For detailed information on the kinds of view that can be automatically updated, see <xref linkend="sql-createview"/>.
ru: Если подзапрос выбирает данные из одного базового отношения и он достаточно прост, механизм перезаписи может автоматически заменить его нижележащим базовым отношением, чтобы команды <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command> обращались к базовому отношению. Представления, <quote>достаточно простые</quote> для этого, называются <firstterm>автоматически изменяемыми</firstterm>. Подробнее виды представлений, которые могут изменяться автоматически, описаны в <xref remap="6" linkend="sql-createview"/>.

source: Alternatively, the operation may be handled by a user-provided <literal>INSTEAD OF</literal> trigger on the view. Rewriting works slightly differently in this case. For <command>INSERT</command>, the rewriter does nothing at all with the view, leaving it as the result relation for the query. For <command>UPDATE</command> and <command>DELETE</command>, it's still necessary to expand the view query to produce the <quote>old</quote> rows that the command will attempt to update or delete. So the view is expanded as normal, but another unexpanded range-table entry is added to the query to represent the view in its capacity as the result relation.
ru: Эту задачу также можно решить, создав триггер <literal>INSTEAD OF</literal> для представления. В этом случае перезапись будет работать немного по-другому. Для <command>INSERT</command> механизм перезаписи не делает с представлением ничего, оставляя его результирующим отношением запроса. Для <command>UPDATE</command> и <command>DELETE</command> ему по-прежнему придётся разворачивать запрос представления, чтобы получить <quote>старые</quote> строки, которые эта команда попытается изменить или удалить. Поэтому представление разворачивается как обычно, но в запрос добавляется ещё один элемент списка отношений, указывающий на представление в роли результирующего отношения.
