Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rules.po
Languages: ru

source: The problem that now arises is how to identify the rows to be updated in the view. Recall that when the result relation is a table, a special <acronym>CTID</acronym> entry is added to the target list to identify the physical locations of the rows to be updated. This does not work if the result relation is a view, because a view does not have any <acronym>CTID</acronym>, since its rows do not have actual physical locations. Instead, for an <command>UPDATE</command> or <command>DELETE</command> operation, a special <literal>wholerow</literal> entry is added to the target list, which expands to include all columns from the view. The executor uses this value to supply the <quote>old</quote> row to the <literal>INSTEAD OF</literal> trigger. It is up to the trigger to work out what to update based on the old and new row values.
ru: При этом возникает проблема идентификации строк в представлении, подлежащих изменению. Вспомните, что когда результирующее отношение является таблицей, в выходной список добавляется специальное поле <acronym>CTID</acronym>, указывающее на физическое расположение изменяемых строк. Но это не будет работать, когда результирующее отношение — представление, так как в представлениях нет <acronym>CTID</acronym>, потому что их строки физически нигде не находятся. Вместо этого, для операций <command>UPDATE</command> или <command>DELETE</command> в выходной список добавляется специальный элемент <literal>wholerow</literal> (вся строка), который разворачивается в содержимое всех столбцов представления. Используя этот элемент, исполнитель передаёт строку <quote>old</quote> в триггер <literal>INSTEAD OF</literal>. Какие именно строки должны изменяться фактически, будет решать сам триггер, исходя из полученных значений старых и новых строк.

source: Another possibility is for the user to define <literal>INSTEAD</literal> rules that specify substitute actions for <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> commands on a view. These rules will rewrite the command, typically into a command that updates one or more tables, rather than views. That is the topic of the next section.
ru: Кроме того, пользователь может определить правила <literal>INSTEAD</literal>, в которых задать действия замены для команд <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> с представлением. Эти правила обычно преобразуют команду в другую команду, изменяющую одну или несколько таблиц, а не представление. Это тема следующего раздела.

source: Note that rules are evaluated first, rewriting the original query before it is planned and executed. Therefore, if a view has <literal>INSTEAD OF</literal> triggers as well as rules on <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>, then the rules will be evaluated first, and depending on the result, the triggers may not be used at all.
ru: Заметьте, что такие правила вычисляются сначала, перезаписывая исходный запрос до того, как он будет планироваться и выполняться. Поэтому, если для представления определены и триггеры <literal>INSTEAD OF</literal>, и правила для <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>, сначала вычисляются правила, а в зависимости от их действия, триггеры могут не вызываться вовсе.

source: Automatic rewriting of an <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> query on a simple view is always tried last. Therefore, if a view has rules or triggers, they will override the default behavior of automatically updatable views.
ru: Автоматическая перезапись запросов <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command> с простыми представлениями всегда производится в последнюю очередь. Таким образом, если у представления есть правила или триггеры, они переопределяют поведение автоматически изменяемых представлений.

source: If there are no <literal>INSTEAD</literal> rules or <literal>INSTEAD OF</literal> triggers for the view, and the rewriter cannot automatically rewrite the query as an update on the underlying base relation, an error will be thrown because the executor cannot update a view as such.
ru: Если для представления не определены правила <literal>INSTEAD</literal> или триггеры <literal>INSTEAD OF</literal>, и запрос не удаётся автоматически переписать в виде обращения к нижележащему базовому отношению, возникает ошибка, потому что исполнитель не сможет изменить такое представление.

source: Materialized Views
ru: Материализованные представления

source: <primary>rule</primary><secondary>and materialized views</secondary>
ru: <primary>правило</primary><secondary>и материализованные представления</secondary>

source: <primary>materialized view</primary><secondary>implementation through rules</secondary>
ru: <primary>материализованные представления</primary><secondary>реализация через правила</secondary>

source: <primary>view</primary><secondary>materialized</secondary>
ru: <primary>представление</primary><secondary>материализованное</secondary>

source: Materialized views in <productname>PostgreSQL</productname> use the rule system like views do, but persist the results in a table-like form. The main differences between: <placeholder-1/> and: <placeholder-2/> are that the materialized view cannot subsequently be directly updated and that the query used to create the materialized view is stored in exactly the same way that a view's query is stored, so that fresh data can be generated for the materialized view with: <placeholder-3/> The information about a materialized view in the <productname>PostgreSQL</productname> system catalogs is exactly the same as it is for a table or view. So for the parser, a materialized view is a relation, just like a table or a view. When a materialized view is referenced in a query, the data is returned directly from the materialized view, like from a table; the rule is only used for populating the materialized view.
ru: Материализованные представления в <productname>PostgreSQL</productname> основаны на системе правил, как и представления, но их содержимое сохраняется как таблица. Основное отличие между: <placeholder-1/> и этой командой: <placeholder-2/> состоит в том, что материализованное представление впоследствии нельзя будет изменить непосредственно, а запрос, создающий материализованное представление, сохраняется точно так же, как запрос представления, и получить актуальные данные в материализованном представлении можно так: <placeholder-3/> Информация о материализованном представлении в системных каталогах <productname>PostgreSQL</productname> ничем не отличается от информации о таблице или представлении. Поэтому для анализатора запроса материализованное представление является просто отношением, как таблица или представление. Когда запрос обращается к материализованному представлению, данные возвращаются непосредственно из него, как из таблицы; правило применяется, только чтобы его наполнить.

source: CREATE TABLE invoice ( invoice_no integer PRIMARY KEY, seller_no integer, -- ID of salesperson invoice_date date, -- date of sale invoice_amt numeric(13,2) -- amount of sale );
ru: CREATE TABLE invoice ( invoice_no integer PRIMARY KEY, seller_no integer, -- идентификатор продавца invoice_date date, -- дата продажи invoice_amt numeric(13,2) -- сумма продажи );

source: While access to the data stored in a materialized view is often much faster than accessing the underlying tables directly or through a view, the data is not always current; yet sometimes current data is not needed. Consider a table which records sales: <placeholder-1/> If people want to be able to quickly graph historical sales data, they might want to summarize, and they may not care about the incomplete data for the current date: <placeholder-2/> This materialized view might be useful for displaying a graph in the dashboard created for salespeople. A job could be scheduled to update the statistics each night using this SQL statement: <placeholder-3/>
ru: Хотя обращение к данным в материализованном представлении часто выполняется гораздо быстрее, чем обращение к нижележащим таблицам напрямую или через представление, данные в нём не всегда актуальные (но иногда это вполне приемлемо). Рассмотрим таблицу с данными продаж: <placeholder-1/> Если пользователям нужно быстро обработать исторические данные, возможно их интересуют только общие показатели, а полнота данных на текущий момент не важна: <placeholder-2/> Это материализованное представление может быть полезно для построения графика в информационной панели менеджеров по продажам. Для ежесуточного обновления статистики можно запланировать задание по расписанию, которое будет выполнять этот оператор: <placeholder-3/>

source: Another use for a materialized view is to allow faster access to data brought across from a remote system through a foreign data wrapper. A simple example using <literal>file_fdw</literal> is below, with timings, but since this is using cache on the local system the performance difference compared to access to a remote system would usually be greater than shown here. Notice we are also exploiting the ability to put an index on the materialized view, whereas <literal>file_fdw</literal> does not support indexes; this advantage might not apply for other sorts of foreign data access.
ru: Ещё одно применение материализованного представления — предоставить быстрый доступ к данным, получаемым с удалённой системы через обёртку сторонних данных. Ниже приведён простой пример с обёрткой <literal>file_fdw</literal>, с замерами времени, но так как при этом использовался кеш локальной системы, выигрыш в производительности при обращении к удалённой системе обычно будет гораздо больше, чем показано здесь. Заметьте, что мы также использовали возможность добавить индекс в материализованное представление, тогда как <literal>file_fdw</literal> индексы не поддерживает; при других видах доступа к сторонним данным такого преимущества может не быть.

source: Setup: <placeholder-1/> Now let's spell-check a word. Using <literal>file_fdw</literal> directly: <placeholder-2/> With <command>EXPLAIN ANALYZE</command>, we see: <placeholder-3/> If the materialized view is used instead, the query is much faster: <placeholder-4/> Either way, the word is spelled wrong, so let's look for what we might have wanted. Again using <literal>file_fdw</literal>: <placeholder-5/> <placeholder-6/> Using the materialized view: <placeholder-7/> If you can tolerate periodic update of the remote data to the local database, the performance benefit can be substantial.
ru: Подготовка: <placeholder-1/> Теперь давайте проверим написание слова. Сначала непосредственно через обёртку <literal>file_fdw</literal>: <placeholder-2/> Выполнив <command>EXPLAIN ANALYZE</command>, мы получаем: <placeholder-3/> Если же теперь обратиться к материализованному представлению, запрос выполнится гораздо быстрее: <placeholder-4/> В любом случае слово записано неправильно, поэтому давайте попробуем найти то, что имелось в виду. Сначала опять через <literal>file_fdw</literal>: <placeholder-5/> <placeholder-6/> Затем через материализованное представление: <placeholder-7/> Если периодическое обновление данных из другого источника в локальной базе данных вас устраивает, этот подход может дать значительный выигрыш в скорости.

source: Rules on <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command>
ru: Правила для <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>

source: <primary>rule</primary><secondary sortas="INSERT">for INSERT</secondary>
ru: <primary>правило</primary><secondary sortas="INSERT">для INSERT</secondary>

source: <primary>rule</primary><secondary sortas="UPDATE">for UPDATE</secondary>
ru: <primary>правило</primary><secondary sortas="UPDATE">для UPDATE</secondary>

source: <primary>rule</primary><secondary sortas="DELETE">for DELETE</secondary>
ru: <primary>правило</primary><secondary sortas="DELETE">для DELETE</secondary>

source: They are allowed to have no action.
ru: Они могут не определять действия.

source: They can have multiple actions.
ru: Они могут определять несколько действий.

source: They can be <literal>INSTEAD</literal> or <literal>ALSO</literal> (the default).
ru: Они могут действовать в режиме <literal>INSTEAD</literal> или <literal>ALSO</literal> (по умолчанию).

source: The pseudorelations <literal>NEW</literal> and <literal>OLD</literal> become useful.
ru: Становятся полезными псевдоотношения <literal>NEW</literal> и <literal>OLD</literal>.

source: They can have rule qualifications.
ru: Они могут иметь условия применения.

source: Rules that are defined on <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> are significantly different from the view rules described in the previous section. First, their <command>CREATE RULE</command> command allows more: <placeholder-1/> Second, they don't modify the query tree in place. Instead they create zero or more new query trees and can throw away the original one.
ru: Правила, определяемые для команд <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>, значительно отличаются от правил представлений, описанных в предыдущем разделе. Во-первых, команда <command>CREATE RULE</command> позволяет создавать правила со следующими особенностями: <placeholder-1/> Во-вторых, они не модифицируют само исходное дерево запроса. Вместо этого они создают несколько новых деревьев запросов и могут заменить исходное.

source: In many cases, tasks that could be performed by rules on <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command> are better done with triggers. Triggers are notationally a bit more complicated, but their semantics are much simpler to understand. Rules tend to have surprising results when the original query contains volatile functions: volatile functions may get executed more times than expected in the process of carrying out the rules.
ru: Во многих случаях для задач, выполнимых с использованием правил для <command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command>, лучше применять триггеры. Оформляются триггеры чуть сложнее, но понять их смысл гораздо проще. К тому же с правилами могут быть получены неожиданные результаты, когда исходный запрос содержит изменчивые функции: в процессе исполнения правил эти функции могут вызываться больше раз, чем ожидается.

source: Also, there are some cases that are not supported by these types of rules at all, notably including <literal>WITH</literal> clauses in the original query and multiple-assignment sub-<literal>SELECT</literal>s in the <literal>SET</literal> list of <command>UPDATE</command> queries. This is because copying these constructs into a rule query would result in multiple evaluations of the sub-query, contrary to the express intent of the query's author.
ru: Кроме того, в некоторых случаях эти типы правил вообще нельзя применять; а именно, с предложениями <literal>WITH</literal> в исходном запросе и с вложенными подзапросами <literal>SELECT</literal> с множественным присваиванием в списке <literal>SET</literal> запросов <command>UPDATE</command>. Это объясняется тем, что копирование этих конструкций в запрос правила привело бы к многократному вычислению вложенного запроса, что пошло бы в разрез с выраженными намерениями автора запроса.

source: How Update Rules Work
ru: Как работают правила для изменения

source: CREATE [ OR REPLACE ] RULE <replaceable class="parameter">name</replaceable> AS ON <replaceable class="parameter">event</replaceable> TO <replaceable class="parameter">table</replaceable> [ WHERE <replaceable class="parameter">condition</replaceable> ] DO [ ALSO | INSTEAD ] { NOTHING | <replaceable class="parameter">command</replaceable> | ( <replaceable class="parameter">command</replaceable> ; <replaceable class="parameter">command</replaceable> ... ) }
ru: CREATE [ OR REPLACE ] RULE <replaceable class="parameter">имя</replaceable> AS ON <replaceable class="parameter">событие</replaceable> TO <replaceable class="parameter">table</replaceable> [ WHERE <replaceable class="parameter">условие</replaceable> ] DO [ ALSO | INSTEAD ] { NOTHING | <replaceable class="parameter">команда</replaceable> | ( <replaceable class="parameter">команда</replaceable> ; <replaceable class="parameter">команда</replaceable> ... ) }

source: Keep the syntax: <placeholder-1/> in mind. In the following, <firstterm>update rules</firstterm> means rules that are defined on <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>.
ru: Запомните синтаксис: <placeholder-1/> В дальнейшем, под <firstterm>правилами для изменения</firstterm> подразумеваются правила, определяемые для команд <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>.

source: Update rules get applied by the rule system when the result relation and the command type of a query tree are equal to the object and event given in the <command>CREATE RULE</command> command. For update rules, the rule system creates a list of query trees. Initially the query-tree list is empty. There can be zero (<literal>NOTHING</literal> key word), one, or multiple actions. To simplify, we will look at a rule with one action. This rule can have a qualification or not and it can be <literal>INSTEAD</literal> or <literal>ALSO</literal> (the default).
ru: Правила для изменения применяются системой правил, когда результирующее отношение и тип команды в дереве запроса совпадает с объектом и событием, заданным в команде <command>CREATE RULE</command>. Для такого правила система правил создаёт список деревьев запросов. Изначально этот список пуст. С правилом может быть связано ноль (ключевое слово <literal>NOTHING</literal>), одно или несколько действий. Простоты ради мы рассмотрим правило с одним действием. Правило может иметь, а может не иметь условия применения, и действует в режиме <literal>INSTEAD</literal> или <literal>ALSO</literal> (по умолчанию).

source: What is a rule qualification? It is a restriction that tells when the actions of the rule should be done and when not. This qualification can only reference the pseudorelations <literal>NEW</literal> and/or <literal>OLD</literal>, which basically represent the relation that was given as object (but with a special meaning).
ru: Что такое условие применения правила? Это условие, которое говорит, когда нужно, а когда не нужно применять действия правила. В этом условии можно обращаться к псевдоотношениям <literal>NEW</literal> и/или <literal>OLD</literal>, которые представляют целевое отношение (но с особым значением).

source: No qualification, with either <literal>ALSO</literal> or <literal>INSTEAD</literal>
ru: Без условия применения в режиме <literal>ALSO</literal> или <literal>INSTEAD</literal>

source: the query tree from the rule action with the original query tree's qualification added
ru: дерево запроса из действия правила с добавленным условием исходного дерева

source: Qualification given and <literal>ALSO</literal>
ru: С условием применения в режиме <literal>ALSO</literal>

source: the query tree from the rule action with the rule qualification and the original query tree's qualification added
ru: дерево запроса из действия правила с условием применения правила и условием, добавленным из исходного дерева

source: Qualification given and <literal>INSTEAD</literal>
ru: С условием применения в режиме <literal>INSTEAD</literal>

source: the query tree from the rule action with the rule qualification and the original query tree's qualification; and the original query tree with the negated rule qualification added
ru: дерево запроса из действия правила с условием применения правила и условием из исходного дерева; также добавляется исходное дерево запроса с условием, обратным условию применения правила

source: So we have three cases that produce the following query trees for a one-action rule. <placeholder-1/> Finally, if the rule is <literal>ALSO</literal>, the unchanged original query tree is added to the list. Since only qualified <literal>INSTEAD</literal> rules already add the original query tree, we end up with either one or two output query trees for a rule with one action.
ru: Всего есть три варианта формирования деревьев запросов для правила с одним действием. <placeholder-1/> Наконец, для правил <literal>ALSO</literal> в список добавляется исходное дерево запроса без изменений. Так как исходное дерево запроса также добавляют только правила <literal>INSTEAD</literal> с условиями применения, в итоге для правила с одним действием мы можем получить только одно или два дерева запросов.

source: For <literal>ON INSERT</literal> rules, the original query (if not suppressed by <literal>INSTEAD</literal>) is done before any actions added by rules. This allows the actions to see the inserted row(s). But for <literal>ON UPDATE</literal> and <literal>ON DELETE</literal> rules, the original query is done after the actions added by rules. This ensures that the actions can see the to-be-updated or to-be-deleted rows; otherwise, the actions might do nothing because they find no rows matching their qualifications.
ru: Для правил <literal>ON INSERT</literal> исходный запрос (если он не перекрывается режимом <literal>INSTEAD</literal>) выполняется перед действиями, добавленными правилами. Поэтому эти действия могут видеть вставленные строки. Но для правил <literal>ON UPDATE</literal> и <literal>ON DELETE</literal> исходный запрос выполняется после действий, добавленных правилами. При таком порядке эти действия будут видеть строки, подлежащие изменению или удалению; иначе бы действия не работали, не найдя строк, соответствующих их условиям применения (эти строки уже будут изменены или удалены).

source: The query trees generated from rule actions are thrown into the rewrite system again, and maybe more rules get applied resulting in more or less query trees. So a rule's actions must have either a different command type or a different result relation than the rule itself is on, otherwise this recursive process will end up in an infinite loop. (Recursive expansion of a rule will be detected and reported as an error.)
ru: Деревья запросов, полученные из действий правил, снова попадают в систему перезаписи, где могут примениться дополнительные правила, добавляющие или убирающие деревья запроса. Поэтому действия правила должны выполнять команды другого типа или работать с другим результирующим отношением, иначе возникнет бесконечная рекурсия. (Система выявляет подобное рекурсивное разворачивание правил и выдаёт ошибку.)
