Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rules.po
Languages: ru

source: Here we show an example of how the choice of rules versus triggers plays out in one situation. There are two tables: <placeholder-1/> Both tables have many thousands of rows and the indexes on <structfield>hostname</structfield> are unique. The rule or trigger should implement a constraint that deletes rows from <literal>software</literal> that reference a deleted computer. The trigger would use this command: <placeholder-2/> Since the trigger is called for each individual row deleted from <literal>computer</literal>, it can prepare and save the plan for this command and pass the <structfield>hostname</structfield> value in the parameter. The rule would be written as: <placeholder-3/>
ru: Давайте рассмотрим пример, показывающий, как выбор в пользу правил вместо триггеров оказывается выигрышным в определённой ситуации. Пусть у нас есть две таблицы: <placeholder-1/> Обе таблицы содержат несколько тысяч строк, а индексы по полю <structfield>hostname</structfield> являются уникальными. Правило или триггер должны реализовать ограничение, которое удалит строки из таблицы <literal>software</literal>, ссылающиеся на удаляемый компьютер. Триггер выполнял бы такую команду: <placeholder-2/> Так как триггер вызывается для каждой отдельной строки, удаляемой из таблицы <literal>computer</literal>, он может подготовить и сохранить план этой команды, а затем передавать значение <structfield>hostname</structfield> подготовленному запросу в параметрах. Правило же можно записать так: <placeholder-3/>

source: Now we look at different types of deletes. In the case of a: <placeholder-1/> the table <literal>computer</literal> is scanned by index (fast), and the command issued by the trigger would also use an index scan (also fast). The extra command from the rule would be: <placeholder-2/> Since there are appropriate indexes set up, the planner will create a plan of <literallayout class="monospaced"> Nestloop -&gt; Index Scan using comp_hostidx on computer -&gt; Index Scan using soft_hostidx on software </literallayout> So there would be not that much difference in speed between the trigger and the rule implementation.
ru: Теперь давайте взглянем на разные варианты удаления. В этом случае: <placeholder-1/> таблица <literal>computer</literal> сканируется по индексу (быстро), и команда, выполняемая триггером, так же будет применять сканирование по индексу (тоже быстро). Дополнительной командой правила будет: <placeholder-2/> Так как созданы все необходимые индексы, планировщик создаст план <literallayout class="monospaced"> Nestloop -&gt; Index Scan using comp_hostidx on computer -&gt; Index Scan using soft_hostidx on software </literallayout> Таким образом, большого различия в скорости между реализациями с триггером и с правилом не будет.

source: With the next delete we want to get rid of all the 2000 computers where the <structfield>hostname</structfield> starts with <literal>old</literal>. There are two possible commands to do that. One is: <placeholder-1/> The command added by the rule will be: <placeholder-2/> with the plan <literallayout class="monospaced"> Hash Join -&gt; Seq Scan on software -&gt; Hash -&gt; Index Scan using comp_hostidx on computer </literallayout> The other possible command is: <placeholder-3/> which results in the following executing plan for the command added by the rule: <literallayout class="monospaced"> Nestloop -&gt; Index Scan using comp_hostidx on computer -&gt; Index Scan using soft_hostidx on software </literallayout> This shows, that the planner does not realize that the qualification for <structfield>hostname</structfield> in <literal>computer</literal> could also be used for an index scan on <literal>software</literal> when there are multiple qualification expressions combined with <literal>AND</literal>, which is what it does in the regular-expression version of the command. The trigger will get invoked once for each of the 2000 old computers that have to be deleted, and that will result in one index scan over <literal>computer</literal> and 2000 index scans over <literal>software</literal>. The rule implementation will do it with two commands that use indexes. And it depends on the overall size of the table <literal>software</literal> whether the rule will still be faster in the sequential scan situation. 2000 command executions from the trigger over the SPI manager take some time, even if all the index blocks will soon be in the cache.
ru: Теперь мы хотим избавиться от 2000 компьютеров, у которых <structfield>hostname</structfield> начинается с <literal>old</literal>. Это можно сделать двумя командами. Первая: <placeholder-1/> Правило преобразует её в: <placeholder-2/> с планом: <literallayout class="monospaced"> Hash Join -&gt; Seq Scan on software -&gt; Hash -&gt; Index Scan using comp_hostidx on computer </literallayout> С другой возможной командой: <placeholder-3/> для запроса, преобразованного правилом, получается следующий план: <literallayout class="monospaced"> Nestloop -&gt; Index Scan using comp_hostidx on computer -&gt; Index Scan using soft_hostidx on software </literallayout> Это показывает, что планировщик не понимает, что ограничение по <structfield>hostname</structfield> в <literal>computer</literal> можно также использовать для сканирования по индексу в <literal>software</literal>, когда несколько условий объединяются с помощью <literal>AND</literal>, что он успешно делает для варианта команды с регулярным выражением. Триггер будет вызываться для каждой из 2000 удаляемых записей о старых компьютерах, и это приведёт к одному сканированию индекса в таблице <literal>computer</literal> и 2000 сканированиям индекса в таблице <literal>software</literal>. Реализация с правилом делает это двумя командами, применяющими индексы. Будет ли правило быстрее при последовательном сканировании, зависит от общего размера таблицы <literal>software</literal>. С другой стороны, выполнение 2000 команд из триггера через менеджер SPI всё равно займёт время, даже если все блоки индекса вскоре окажутся в кеше.

source: The last command we look at is: <placeholder-1/> Again this could result in many rows to be deleted from <literal>computer</literal>. So the trigger will again run many commands through the executor. The command generated by the rule will be: <placeholder-2/> The plan for that command will again be the nested loop over two index scans, only using a different index on <literal>computer</literal>: <placeholder-3/> In any of these cases, the extra commands from the rule system will be more or less independent from the number of affected rows in a command.
ru: В завершение взгляните на эту команду: <placeholder-1/> Она также может привести к удалению множества строк из таблицы <literal>computer</literal>. Поэтому триггер снова пропустит через исполнитель такое же множество команд. Правило же выдаст следующую команду: <placeholder-2/> План для этой команды снова будет содержать вложенный цикл по двум сканированиям индекса, но на этот раз с другим индексом таблицы <literal>computer</literal>: <placeholder-3/> Во всех этих случаях дополнительные команды будут более-менее независимыми от числа затрагиваемых строк.

source: The summary is, rules will only be significantly slower than triggers if their actions result in large and badly qualified joins, a situation where the planner fails.
ru: Таким образом, правила будут значительно медленнее триггеров, только если их действия приводят к образованию больших и плохо связанных соединений, когда планировщик оказывается бессилен.
