Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rules.po
Languages: ru

source: The Rule System
ru: Система правил

source: <primary>rule</primary>
ru: <primary>правило</primary>

source: This chapter discusses the rule system in <productname>PostgreSQL</productname>. Production rule systems are conceptually simple, but there are many subtle points involved in actually using them.
ru: В этой главе обсуждается система правил, реализованная в <productname>PostgreSQL</productname>. Промышленные системы правил по сути довольно простые, но при их использовании приходится сталкиваться с множеством неочевидных вещей.

source: Some other database systems define active database rules, which are usually stored procedures and triggers. In <productname>PostgreSQL</productname>, these can be implemented using functions and triggers as well.
ru: В некоторых других базах данных определяются активные правила баз данных, которые обычно реализуются в виде процедур и триггеров. Так же их можно реализовать и в <productname>PostgreSQL</productname>.

source: The rule system (more precisely speaking, the query rewrite rule system) is totally different from stored procedures and triggers. It modifies queries to take rules into consideration, and then passes the modified query to the query planner for planning and execution. It is very powerful, and can be used for many things such as query language procedures, views, and versions. The theoretical foundations and the power of this rule system are also discussed in <xref linkend="ston90b"/> and <xref linkend="ong90"/>.
ru: Система правил (точнее говоря, система правил перезаписи запросов) полностью отличается от механизма хранимых процедур и триггеров. Она изменяет запросы по заданным правилам, а затем передаёт модифицированный запрос планировщику для планирования и выполнения. Это очень мощное средство, подходящее для решения множества задач, например, для определения представлений и процедур на языке запросов или реализации версионности. Теоретические основы и преимущества этой системы правил также описаны в <xref remap="6" linkend="ston90b"/> и <xref remap="6" linkend="ong90"/> (на английском языке).

source: The Query Tree
ru: Дерево запроса

source: <primary>query tree</primary>
ru: <primary>дерево запроса</primary>

source: To understand how the rule system works it is necessary to know when it is invoked and what its input and results are.
ru: Чтобы понять, как работает система правил, нужно знать, когда она вызывается, что принимает на вход и какой результат выдаёт.

source: The rule system is located between the parser and the planner. It takes the output of the parser, one query tree, and the user-defined rewrite rules, which are also query trees with some extra information, and creates zero or more query trees as result. So its input and output are always things the parser itself could have produced and thus, anything it sees is basically representable as an <acronym>SQL</acronym> statement.
ru: Система правил внедрена между анализатором запросов и планировщиком. Она принимает разобранный запрос, одно дерево запроса, и определённые пользователем правила перезаписи, тоже представленные деревьями с некоторой дополнительной информацией, и создаёт некоторое количество деревьев запросов в результате. Таким образом, на входе и выходе этой системы оказывается то, что может сформировать анализатор запросов, и как следствие, всё, с чем работает эта система, представимо в виде операторов <acronym>SQL</acronym>.

source: Now what is a query tree? It is an internal representation of an <acronym>SQL</acronym> statement where the single parts that it is built from are stored separately. These query trees can be shown in the server log if you set the configuration parameters <varname>debug_print_parse</varname>, <varname>debug_print_rewritten</varname>, or <varname>debug_print_plan</varname>. The rule actions are also stored as query trees, in the system catalog <structname>pg_rewrite</structname>. They are not formatted like the log output, but they contain exactly the same information.
ru: Так что же такое дерево запроса? Это внутреннее представление оператора <acronym>SQL</acronym>, в котором все образующие его части хранятся отдельно. Эти деревья можно увидеть в журнале сервера, если установить параметры конфигурации <varname>debug_print_parse</varname>, <varname>debug_print_rewritten</varname> или <varname>debug_print_plan</varname>. Действия правил также хранятся в виде деревьев запросов, в системном каталоге <structname>pg_rewrite</structname>. Они не форматируются как при выводе в журнал, но содержат точно такую же информацию.

source: Reading a raw query tree requires some experience. But since <acronym>SQL</acronym> representations of query trees are sufficient to understand the rule system, this chapter will not teach how to read them.
ru: Для прочтения неформатированного дерева требуется некоторый навык. Но так как представления дерева запросов в виде <acronym>SQL</acronym> достаточно, чтобы понять систему правил, в этой главе не будет рассказываться, как их читать.

source: the command type
ru: тип команды

source: This is a simple value telling which command (<command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>) produced the query tree.
ru: Это простое значение, говорящее, какая команда (<command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>) сгенерировала дерево запросов.

source: <primary>range table</primary>
ru: <primary>список отношений</primary>

source: the range table <placeholder-1/>
ru: список отношений <placeholder-1/>

source: The range table is a list of relations that are used in the query. In a <command>SELECT</command> statement these are the relations given after the <literal>FROM</literal> key word.
ru: Список отношений представляет собой массив отношений, используемых в запросе. В запросе <command>SELECT</command> он включает отношения, указанные после ключевого слова <literal>FROM</literal>.

source: Every range table entry identifies a table or view and tells by which name it is called in the other parts of the query. In the query tree, the range table entries are referenced by number rather than by name, so here it doesn't matter if there are duplicate names as it would in an <acronym>SQL</acronym> statement. This can happen after the range tables of rules have been merged in. The examples in this chapter will not have this situation.
ru: Каждый элемент списка отношений представляет таблицу или представление и говорит, с каким именем они упоминаются в других частях запроса. В дереве запросов записываются номера элементов списка отношений, а не их имена, поэтому для него неактуальна проблема дублирования имён, как для оператора <acronym>SQL</acronym>. Такая проблема может возникнуть при объединении списков отношений, образованных разными правилами. В этой главе данная ситуация рассматриваться не будет.

source: the result relation
ru: результирующее отношение

source: This is an index into the range table that identifies the relation where the results of the query go.
ru: Индекс в списке отношений, указывающий на отношение, которое будет получать результаты запроса.

source: <command>SELECT</command> queries don't have a result relation. (The special case of <command>SELECT INTO</command> is mostly identical to <command>CREATE TABLE</command> followed by <literal>INSERT ... SELECT</literal>, and is not discussed separately here.)
ru: В запросах <command>SELECT</command> результирующее отношение отсутствует. (Особый случай <command>SELECT INTO</command> практически равнозначен <command>CREATE TABLE</command> с последующим <literal>INSERT ... SELECT</literal> и здесь отдельно не рассматривается.)

source: For <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> commands, the result relation is the table (or view!) where the changes are to take effect.
ru: Для команд <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> результирующим отношением будет таблица (или представление!), в которой будут происходить изменения.

source: <primary>target list</primary>
ru: <primary>выходной список</primary>

source: the target list <placeholder-1/>
ru: выходной список <placeholder-1/>

source: The target list is a list of expressions that define the result of the query. In the case of a <command>SELECT</command>, these expressions are the ones that build the final output of the query. They correspond to the expressions between the key words <command>SELECT</command> and <command>FROM</command>. (<literal>*</literal> is just an abbreviation for all the column names of a relation. It is expanded by the parser into the individual columns, so the rule system never sees it.)
ru: Выходной список — это список выражений, определяющих результат запроса. В случае <command>SELECT</command>, это выражения, которые образуют окончательный набор выходных данных. Они соответствуют выражениям, записанным между ключевыми словами <command>SELECT</command> и <command>FROM</command>. (Указание <literal>*</literal> — это просто краткое обозначение имён всех столбцов отношения. Анализатор разворачивает его в список отдельных столбцов, так что система правил никогда не видит его.)

source: <command>DELETE</command> commands don't need a normal target list because they don't produce any result. Instead, the rule system adds a special <acronym>CTID</acronym> entry to the empty target list, to allow the executor to find the row to be deleted. (<acronym>CTID</acronym> is added when the result relation is an ordinary table. If it is a view, a whole-row variable is added instead, as described in <xref linkend="rules-views-update"/>.)
ru: Командам <command>DELETE</command> не нужен обычный выходной список, так как они не выдают никакие результаты. Вместо этого, система правил добавляет в пустой выходной список специальную запись <acronym>CTID</acronym>, чтобы исполнитель мог найти удаляемую строку. (<acronym>CTID</acronym> добавляется, когда результирующее отношение — обычная таблица. Если это представление, добавляется переменная, содержащая всю строку, как рассказывается в <xref remap="6" linkend="rules-views-update"/>.)

source: For <command>INSERT</command> commands, the target list describes the new rows that should go into the result relation. It consists of the expressions in the <literal>VALUES</literal> clause or the ones from the <command>SELECT</command> clause in <literal>INSERT ... SELECT</literal>. The first step of the rewrite process adds target list entries for any columns that were not assigned to by the original command but have defaults. Any remaining columns (with neither a given value nor a default) will be filled in by the planner with a constant null expression.
ru: Для команд <command>INSERT</command> выходной список описывает новые строки, которые должны попасть в результирующее отношение. Он включает выражения в предложении <literal>VALUES</literal> или предложении <command>SELECT</command> в <literal>INSERT ... SELECT</literal>. На первом этапе процесс перезаписи добавляет элементы выходного списка для столбцов, которым ничего не присвоила исходная команда, но имеющих значения по умолчанию. Все остальные столбцы (без заданного значения и значения по умолчанию) планировщик заполняет константой NULL.

source: For <command>UPDATE</command> commands, the target list describes the new rows that should replace the old ones. In the rule system, it contains just the expressions from the <literal>SET column = expression</literal> part of the command. The planner will handle missing columns by inserting expressions that copy the values from the old row into the new one. Just as for <command>DELETE</command>, the rule system adds a <acronym>CTID</acronym> or whole-row variable so that the executor can identify the old row to be updated.
ru: Для команд <command>UPDATE</command> выходной список описывает новые строки, которые должны заменить старые. В системе правил он содержит только выражения из части <literal>SET столбец = выражение</literal>. Для пропущенных столбцов планировщик вставляет выражения, копирующие значения из старой строки в новую. Так же, как и с командой <command>DELETE</command>, система правил добавляет ещё <acronym>CTID</acronym> или переменную со всей строкой, чтобы исполнитель мог найти изменяемую старую строку.

source: Every entry in the target list contains an expression that can be a constant value, a variable pointing to a column of one of the relations in the range table, a parameter, or an expression tree made of function calls, constants, variables, operators, etc.
ru: Каждая запись в выходном списке содержит выражение, которое может быть константой, переменной, указывающей на столбец отношения в таблице отношений, параметром или деревом выражений, образованным из констант, переменных, операторов, вызовов функций и т. д.

source: the qualification
ru: условие фильтра

source: The query's qualification is an expression much like one of those contained in the target list entries. The result value of this expression is a Boolean that tells whether the operation (<command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, or <command>SELECT</command>) for the final result row should be executed or not. It corresponds to the <literal>WHERE</literal> clause of an <acronym>SQL</acronym> statement.
ru: Условие фильтра запроса — это выражение, во многом похожее на те, что содержатся в выходном списке. Результат этого выражения — логический, он говорит, должна ли выполняться операция (<command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command> или <command>SELECT</command>) для данной строки в результате. Оно соответствует предложению <literal>WHERE</literal> <acronym>SQL</acronym>-оператора.

source: the join tree
ru: дерево соединения

source: The query's join tree shows the structure of the <literal>FROM</literal> clause. For a simple query like <literal>SELECT ... FROM a, b, c</literal>, the join tree is just a list of the <literal>FROM</literal> items, because we are allowed to join them in any order. But when <literal>JOIN</literal> expressions, particularly outer joins, are used, we have to join in the order shown by the joins. In that case, the join tree shows the structure of the <literal>JOIN</literal> expressions. The restrictions associated with particular <literal>JOIN</literal> clauses (from <literal>ON</literal> or <literal>USING</literal> expressions) are stored as qualification expressions attached to those join-tree nodes. It turns out to be convenient to store the top-level <literal>WHERE</literal> expression as a qualification attached to the top-level join-tree item, too. So really the join tree represents both the <literal>FROM</literal> and <literal>WHERE</literal> clauses of a <command>SELECT</command>.
ru: Дерево соединения запроса показывает структуру предложения <literal>FROM</literal>. Для простых запросов вида <literal>SELECT ... FROM a, b, c</literal>, дерево соединения — это просто список элементов <literal>FROM</literal>, так как они могут соединяться в любом порядке. Но с выражениями <literal>JOIN</literal>, особенно с внешними соединениями, приходится соединять отношения именно в заданном порядке. В этом случае дерево соединения отражает структуру выражений <literal>JOIN</literal>. Ограничения, связанные с конкретными предложениями <literal>JOIN</literal> (из выражений <literal>ON</literal> или <literal>USING</literal>), тоже сохраняются в виде условных выражений, добавленных к соответствующим узлам дерева соединения. Как оказалось, выражение <literal>WHERE</literal> верхнего уровня тоже удобно хранить как условие, добавленное к элементу верхнего уровня дерева соединения. Поэтому в дереве соединения на самом деле представляются оба предложения оператора <command>SELECT</command> — <literal>FROM</literal> и <literal>WHERE</literal>.

source: the others
ru: другие

source: The other parts of the query tree like the <literal>ORDER BY</literal> clause aren't of interest here. The rule system substitutes some entries there while applying rules, but that doesn't have much to do with the fundamentals of the rule system.
ru: Другие части дерева запроса, например, предложение <literal>ORDER BY</literal>, в данном контексте не представляют интереса. Система правил выполняет в них некоторые подстановки, применяя правила, но это не имеет непосредственного отношения к основам системы правил.

source: When reading the <acronym>SQL</acronym> representations of the query trees in this chapter it is necessary to be able to identify the parts the statement is broken into when it is in the query tree structure. The parts of a query tree are <placeholder-1/>
ru: Читая <acronym>SQL</acronym>-представления деревьев запросов в этой главе, необходимо понимать, на какие части разбивается оператор, когда он преобразуется в структуру дерева запроса. Дерево запроса состоит из следующих частей: <placeholder-1/>

source: Views and the Rule System
ru: Система правил и представления

source: <primary>rule</primary><secondary>and views</secondary>
ru: <primary>правила</primary><secondary>и представления</secondary>

source: <primary>view</primary><secondary>implementation through rules</secondary>
ru: <primary>представление</primary><secondary>реализация через правила</secondary>

source: Views in <productname>PostgreSQL</productname> are implemented using the rule system. In fact, there is essentially no difference between: <placeholder-1/> compared against the two commands: <placeholder-2/> because this is exactly what the <command>CREATE VIEW</command> command does internally. This has some side effects. One of them is that the information about a view in the <productname>PostgreSQL</productname> system catalogs is exactly the same as it is for a table. So for the parser, there is absolutely no difference between a table and a view. They are the same thing: relations.
ru: Представления в <productname>PostgreSQL</productname> реализованы на основе системы правил. Фактически по сути нет никакого отличия <placeholder-1/> от следующих двух команд: <placeholder-2/> так как именно эти действия <command>CREATE VIEW</command> выполняет внутри. Это имеет некоторые побочные эффекты. В частности, информация о представлениях в системных каталогах <productname>PostgreSQL</productname> ничем не отличается от информации о таблицах. Поэтому при анализе запроса нет абсолютно никакой разницы между таблицами и представлениями. Они представляют собой одно и то же — отношения.

source: How <command>SELECT</command> Rules Work
ru: Как работают правила <command>SELECT</command>

source: <primary>rule</primary><secondary sortas="SELECT">for SELECT</secondary>
ru: <primary>правило</primary><secondary sortas="SELECT">для SELECT</secondary>

source: Rules <literal>ON SELECT</literal> are applied to all queries as the last step, even if the command given is an <command>INSERT</command>, <command>UPDATE</command> or <command>DELETE</command>. And they have different semantics from rules on the other command types in that they modify the query tree in place instead of creating a new one. So <command>SELECT</command> rules are described first.
ru: Правила <literal>ON SELECT</literal> применяются ко всем запросам на последнем этапе, даже если это команда <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>. Эти правила отличаются от правил других видов тем, что они модифицируют непосредственно дерево запросов, а не создают новое. Поэтому мы начнём описание с правил <command>SELECT</command>.

source: Currently, there can be only one action in an <literal>ON SELECT</literal> rule, and it must be an unconditional <command>SELECT</command> action that is <literal>INSTEAD</literal>. This restriction was required to make rules safe enough to open them for ordinary users, and it restricts <literal>ON SELECT</literal> rules to act like views.
ru: В настоящее время возможно только одно действие в правиле <literal>ON SELECT</literal> и это должно быть безусловное действие <command>SELECT</command>, выполняемое в режиме <literal>INSTEAD</literal>. Это ограничение было введено, чтобы сделать правила достаточно безопасными для применения обычными пользователями, так что действие правил <literal>ON SELECT</literal> сводится к реализации представлений.

source: The examples for this chapter are two join views that do some calculations and some more views using them in turn. One of the two first views is customized later by adding rules for <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> operations so that the final result will be a view that behaves like a real table with some magic functionality. This is not such a simple example to start from and this makes things harder to get into. But it's better to have one example that covers all the points discussed step by step rather than having many different ones that might mix up in mind.
ru: В примерах этой главы рассматриваются два представления с соединением, которые выполняют некоторые вычисления, и которые, в свою очередь, используются другими представлениями. Первое из этих двух представлений затем модифицируется, к нему добавляются правила для операций <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>, так что в итоге получается представление, которое работает как обычная таблица с некоторыми необычными функциями. Это не самый простой пример для начала, поэтому понять некоторые вещи будет сложнее. Но лучше иметь один пример, поэтапно охватывающий все обсуждаемые здесь темы, чем несколько различных, при восприятии которых в итоге может возникнуть путаница.

source: For the example, we need a little <literal>min</literal> function that returns the lower of 2 integer values. We create that as: <placeholder-1/>
ru: Например, нам нужна простейшая функция <literal>min</literal>, которая возвратит минимальное из двух целых чисел. Её можно создать так: <placeholder-1/>

source: CREATE TABLE shoe_data ( shoename text, -- primary key sh_avail integer, -- available number of pairs slcolor text, -- preferred shoelace color slminlen real, -- minimum shoelace length slmaxlen real, -- maximum shoelace length slunit text -- length unit ); CREATE TABLE shoelace_data ( sl_name text, -- primary key sl_avail integer, -- available number of pairs sl_color text, -- shoelace color sl_len real, -- shoelace length sl_unit text -- length unit ); CREATE TABLE unit ( un_name text, -- primary key un_fact real -- factor to transform to cm );
ru: CREATE TABLE shoe_data ( shoename text, -- первичный ключ sh_avail integer, -- число имеющихся пар slcolor text, -- предпочитаемый цвет шнурков slminlen real, -- минимальная длина шнурков slmaxlen real, -- максимальная длина шнурков slunit text -- единица длины ); CREATE TABLE shoelace_data ( sl_name text, -- первичный ключ sl_avail integer, -- число имеющихся пар sl_color text, -- цвет шнурков sl_len real, -- длина шнурков sl_unit text -- единица длины ); CREATE TABLE unit ( un_name text, -- первичный ключ un_fact real -- коэффициент для перевода в см );

source: The real tables we need in the first two rule system descriptions are these: <placeholder-1/> As you can see, they represent shoe-store data.
ru: Таблицы, которые понадобятся нам для описания системы правил, выглядят так: <placeholder-1/> Как можно догадаться, в них хранятся данные обувной фабрики.
