Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rules.po
Languages: ru

source: The query trees found in the actions of the <structname>pg_rewrite</structname> system catalog are only templates. Since they can reference the range-table entries for <literal>NEW</literal> and <literal>OLD</literal>, some substitutions have to be made before they can be used. For any reference to <literal>NEW</literal>, the target list of the original query is searched for a corresponding entry. If found, that entry's expression replaces the reference. Otherwise, <literal>NEW</literal> means the same as <literal>OLD</literal> (for an <command>UPDATE</command>) or is replaced by a null value (for an <command>INSERT</command>). Any reference to <literal>OLD</literal> is replaced by a reference to the range-table entry that is the result relation.
ru: Деревья запросов, заданные для действий в системном каталоге <structname>pg_rewrite</structname>, представляют собой только шаблоны. Так как они могут обращаться к элементам <literal>NEW</literal> и <literal>OLD</literal> в списке отношений, их можно будет использовать только после некоторых подстановок. В случае ссылки на <literal>NEW</literal> соответствующий элемент ищется в целевом списке исходного запроса. Если он найден, ссылка заменяется выражением этого элемента. В противном случае <literal>NEW</literal> означает то же самое, что и <literal>OLD</literal> (для команды <command>UPDATE</command>) или заменяется значением NULL (для команды <command>INSERT</command>). Любые ссылки на <literal>OLD</literal> заменяются ссылкой на элемент результирующего отношения в списке отношений.

source: After the system is done applying update rules, it applies view rules to the produced query tree(s). Views cannot insert new update actions so there is no need to apply update rules to the output of view rewriting.
ru: После того как система применит все правила для изменения, она применяет правила представления к полученному дереву (или деревьям) запроса. Представления не могут добавлять новые действия для изменения, поэтому нет необходимости применять такие правила к результату перезаписи представления.

source: A First Rule Step by Step
ru: Пошаговый разбор первого правила

source: CREATE TABLE shoelace_log ( sl_name text, -- shoelace changed sl_avail integer, -- new available value log_who text, -- who did it log_when timestamp -- when ); CREATE RULE log_shoelace AS ON UPDATE TO shoelace_data WHERE NEW.sl_avail &lt;&gt; OLD.sl_avail DO INSERT INTO shoelace_log VALUES ( NEW.sl_name, NEW.sl_avail, current_user, current_timestamp );
ru: CREATE TABLE shoelace_log ( sl_name text, -- шнурки, количество которых изменилось sl_avail integer, -- новое количество log_who text, -- кто изменил log_when timestamp -- когда ); CREATE RULE log_shoelace AS ON UPDATE TO shoelace_data WHERE NEW.sl_avail &lt;&gt; OLD.sl_avail DO INSERT INTO shoelace_log VALUES ( NEW.sl_name, NEW.sl_avail, current_user, current_timestamp );

source: Say we want to trace changes to the <literal>sl_avail</literal> column in the <literal>shoelace_data</literal> relation. So we set up a log table and a rule that conditionally writes a log entry when an <command>UPDATE</command> is performed on <literal>shoelace_data</literal>. <placeholder-1/>
ru: Предположим, что нам нужно отслеживать изменения в столбце <literal>sl_avail</literal> таблицы <literal>shoelace_data</literal>. Мы можем создать таблицу для ведения журнала и правило, которое будет добавлять в неё записи по условию, когда для <literal>shoelace_data</literal> выполняется <command>UPDATE</command>. <placeholder-1/>

source: Now someone does: <placeholder-1/> and we look at the log table: <placeholder-2/>
ru: Теперь, если кто-то выполнит: <placeholder-1/> мы увидим в таблице журнала: <placeholder-2/>

source: That's what we expected. What happened in the background is the following. The parser created the query tree: <placeholder-1/> There is a rule <literal>log_shoelace</literal> that is <literal>ON UPDATE</literal> with the rule qualification expression: <placeholder-2/> and the action: <placeholder-3/> (This looks a little strange since you cannot normally write <literal>INSERT ... VALUES ... FROM</literal>. The <literal>FROM</literal> clause here is just to indicate that there are range-table entries in the query tree for <literal>new</literal> and <literal>old</literal>. These are needed so that they can be referenced by variables in the <command>INSERT</command> command's query tree.)
ru: Именно это нам и нужно. При этом внутри происходит следующее. Анализатор запроса создаёт дерево: <placeholder-1/> В системном каталоге находится правило <literal>log_shoelace</literal>, настроенное на изменение (<literal>ON UPDATE</literal>) с условием применения: <placeholder-2/> и действием: <placeholder-3/> (Это выглядит несколько странно, так как обычно нельзя написать <literal>INSERT ... VALUES ... FROM</literal>. Предложение <literal>FROM</literal> здесь добавлено, просто чтобы показать, что в дереве запроса для ссылок <literal>new</literal> и <literal>old</literal> есть элементы в списке отношений. Они необходимы для того, чтобы к ним могли обращаться переменные в дереве запроса команды <command>INSERT</command>.)

source: The rule is a qualified <literal>ALSO</literal> rule, so the rule system has to return two query trees: the modified rule action and the original query tree. In step 1, the range table of the original query is incorporated into the rule's action query tree. This results in: <placeholder-1/> In step 2, the rule qualification is added to it, so the result set is restricted to rows where <literal>sl_avail</literal> changes: <placeholder-2/> (This looks even stranger, since <literal>INSERT ... VALUES</literal> doesn't have a <literal>WHERE</literal> clause either, but the planner and executor will have no difficulty with it. They need to support this same functionality anyway for <literal>INSERT ... SELECT</literal>.)
ru: Так как это правило <literal>ALSO</literal> с условием применения, система правил должна выдать два дерева запросов: изменённое действие правила и исходное дерево запроса. На первом шаге список отношений исходного запроса вставляется в дерево действия правила и получается: <placeholder-1/> На втором шаге в это дерево добавляется условие применения правила, так что результирующий набор ограничивается строками, в которых меняется <literal>sl_avail</literal>: <placeholder-2/> (Это выглядит ещё более странно, ведь в <literal>INSERT ... VALUES</literal> не записывается и предложение <literal>WHERE</literal>, но планировщик и исполнитель не испытывают затруднений с этим. Они всё равно должны поддерживать эту функциональность для <literal>INSERT ... SELECT</literal>.)

source: In step 3, the original query tree's qualification is added, restricting the result set further to only the rows that would have been touched by the original query: <placeholder-1/>
ru: На третьем шаге добавляется условие исходного дерева, что ещё больше ограничивает результирующий набор, оставляя в нём только строки, которые затронул бы исходный запрос: <placeholder-1/>

source: Step 4 replaces references to <literal>NEW</literal> by the target list entries from the original query tree or by the matching variable references from the result relation: <placeholder-1/>
ru: На четвёртом шаге ссылки на <literal>NEW</literal> заменяются элементами выходного списка из исходного дерева запроса или переменными из результирующего отношения: <placeholder-1/>

source: Step 5 changes <literal>OLD</literal> references into result relation references: <placeholder-1/>
ru: На последнем, пятом шаге ссылки на <literal>OLD</literal> заменяются ссылками на результирующее отношение: <placeholder-1/>

source: That's it. Since the rule is <literal>ALSO</literal>, we also output the original query tree. In short, the output from the rule system is a list of two query trees that correspond to these statements: <placeholder-1/> These are executed in this order, and that is exactly what the rule was meant to do.
ru: Вот и всё. Так как правило действует в режиме <literal>ALSO</literal>, мы также выводим исходное дерево запроса. Таким образом, система правил выдаёт список с двумя деревьями запросов, соответствующими этим операторам: <placeholder-1/> Они выполняются в показанном порядке и именно это должно делать данное правило.

source: The substitutions and the added qualifications ensure that, if the original query would be, say: <placeholder-1/> no log entry would get written. In that case, the original query tree does not contain a target list entry for <literal>sl_avail</literal>, so <literal>NEW.sl_avail</literal> will get replaced by <literal>shoelace_data.sl_avail</literal>. Thus, the extra command generated by the rule is: <placeholder-2/> and that qualification will never be true.
ru: Благодаря заменам и добавленным условиям в журнал не добавится запись, например, при таком исходном запросе: <placeholder-1/> В этом случае исходное дерево запроса не содержит элемент выходного списка для <literal>sl_avail</literal>, так что <literal>NEW.sl_avail</literal> будет заменено переменной <literal>shoelace_data.sl_avail</literal>. Таким образом, дополнительная команда, созданная правилом, будет такой: <placeholder-2/> Это условие применения не будет выполняться никогда.

source: It will also work if the original query modifies multiple rows. So if someone issued the command: <placeholder-1/> four rows in fact get updated (<literal>sl1</literal>, <literal>sl2</literal>, <literal>sl3</literal>, and <literal>sl4</literal>). But <literal>sl3</literal> already has <literal>sl_avail = 0</literal>. In this case, the original query trees qualification is different and that results in the extra query tree: <placeholder-2/> being generated by the rule. This query tree will surely insert three new log entries. And that's absolutely correct.
ru: Это также будет работать, если исходный запрос изменяет несколько строк. Так, если кто-то выполнит команду: <placeholder-1/> фактически будут изменены четыре строки (<literal>sl1</literal>, <literal>sl2</literal>, <literal>sl3</literal> и <literal>sl4</literal>). Но для <literal>sl3</literal> значение <literal>sl_avail = 0</literal>. В этом случае условие исходного дерева другое, так что это правило выдаёт такое дополнительное дерево запроса: <placeholder-2/>. С таким деревом запроса в журнал определённо будут добавлены три записи. И это абсолютно правильно.

source: Here we can see why it is important that the original query tree is executed last. If the <command>UPDATE</command> had been executed first, all the rows would have already been set to zero, so the logging <command>INSERT</command> would not find any row where <literal>0 &lt;&gt; shoelace_data.sl_avail</literal>.
ru: Здесь мы видим, почему важно, чтобы исходное дерево запроса выполнялось в конце. Если бы оператор <command>UPDATE</command> выполнился сначала, все строки уже получили бы нулевые значения, так что записывающий в журнал <command>INSERT</command> не нашёл бы строк, в которых <literal>0 &lt;&gt; shoelace_data.sl_avail</literal>.

source: Cooperation with Views
ru: Сочетание с представлениями

source: <primary>view</primary><secondary>updating</secondary>
ru: <primary>представление</primary><secondary>изменение</secondary>

source: A simple way to protect view relations from the mentioned possibility that someone can try to run <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> on them is to let those query trees get thrown away. So we could create the rules: <placeholder-1/> If someone now tries to do any of these operations on the view relation <literal>shoe</literal>, the rule system will apply these rules. Since the rules have no actions and are <literal>INSTEAD</literal>, the resulting list of query trees will be empty and the whole query will become nothing because there is nothing left to be optimized or executed after the rule system is done with it.
ru: Есть один простой вариант защититься от ранее упомянутой возможности выполнять <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command> для представлений, когда это нежелательно — создать правила, просто отбрасывающие деревья этих запросов. В нашем случае они будут выглядеть так: <placeholder-1/> Если теперь кто-то попытается выполнить одну из этих операций с представлением <literal>shoe</literal>, система правил применит эти правила. Так как это правила без действий в режиме <literal>INSTEAD</literal>, результирующий список деревьев запроса будет пуст и весь запрос аннулируется, так что после работы системы правил будет нечего оптимизировать и выполнять.

source: A more sophisticated way to use the rule system is to create rules that rewrite the query tree into one that does the right operation on the real tables. To do that on the <literal>shoelace</literal> view, we create the following rules: <placeholder-1/>
ru: Более сложный вариант — использовать систему правил для создания правил, преобразующих дерево запроса в выполняющее нужную операцию с реальными таблицами. Чтобы реализовать это с представлением <literal>shoelace</literal>, мы создадим следующие правила: <placeholder-1/>

source: If you want to support <literal>RETURNING</literal> queries on the view, you need to make the rules include <literal>RETURNING</literal> clauses that compute the view rows. This is usually pretty trivial for views on a single table, but it's a bit tedious for join views such as <literal>shoelace</literal>. An example for the insert case is: <placeholder-1/> Note that this one rule supports both <command>INSERT</command> and <command>INSERT RETURNING</command> queries on the view &mdash; the <literal>RETURNING</literal> clause is simply ignored for <command>INSERT</command>.
ru: Если вы хотите поддерживать также запросы к представлению с <literal>RETURNING</literal>, вам надо создать правила с предложениями <literal>RETURNING</literal>, которые будут вычислять строки представления. Это обычно довольно тривиально для представлений с одной нижележащей таблицей, но несколько затруднительно для представлений с соединением, таких как <literal>shoelace</literal>. Например, для <command>INSERT</command> это будет выглядеть так: <placeholder-1/> Заметьте, что это одно правило поддерживает запросы и <command>INSERT</command>, и <command>INSERT RETURNING</command> к этому представлению &mdash; предложение <literal>RETURNING</literal> просто игнорируется при обычном <command>INSERT</command>.

source: Now assume that once in a while, a pack of shoelaces arrives at the shop and a big parts list along with it. But you don't want to manually update the <literal>shoelace</literal> view every time. Instead we set up two little tables: one where you can insert the items from the part list, and one with a special trick. The creation commands for these are: <placeholder-1/> Now you can fill the table <literal>shoelace_arrive</literal> with the data from the parts list: <placeholder-2/> Take a quick look at the current data: <placeholder-3/> Now move the arrived shoelaces in: <placeholder-4/> and check the results: <placeholder-5/>
ru: Теперь предположим, что на фабрику прибывает партия шнурков с объёмной сопроводительной накладной. Но вы не хотите вручную вносить по одной записи в представление <literal>shoelace</literal>. Вместо этого можно создать две маленькие таблицы: в первую вы будете вставлять записи из накладной, а вторая пригодится для специального приёма. Для этого мы выполним следующие команды: <placeholder-1/> Теперь вы можете наполнить таблицу <literal>shoelace_arrive</literal> данными о поступивших шнурках из накладной: <placeholder-2/> Взгляните на текущие данные: <placeholder-3/> Теперь переместите прибывшие шнурки во вторую таблицу: <placeholder-4/> Проверьте, что получилось: <placeholder-5/>

source: It's a long way from the one <literal>INSERT ... SELECT</literal> to these results. And the description of the query-tree transformation will be the last in this chapter. First, there is the parser's output: <placeholder-1/> Now the first rule <literal>shoelace_ok_ins</literal> is applied and turns this into: <placeholder-2/> and throws away the original <command>INSERT</command> on <literal>shoelace_ok</literal>. This rewritten query is passed to the rule system again, and the second applied rule <literal>shoelace_upd</literal> produces: <placeholder-3/> Again it's an <literal>INSTEAD</literal> rule and the previous query tree is trashed. Note that this query still uses the view <literal>shoelace</literal>. But the rule system isn't finished with this step, so it continues and applies the <literal>_RETURN</literal> rule on it, and we get: <placeholder-4/> Finally, the rule <literal>log_shoelace</literal> gets applied, producing the extra query tree: <placeholder-5/> After that the rule system runs out of rules and returns the generated query trees.
ru: Чтобы получить эти результаты из одного <literal>INSERT ... SELECT</literal>, была проделана большая работа. Мы подробно опишем всё преобразование дерева запросов в продолжении этой главы. Начнём с дерева, выданного анализатором запроса: <placeholder-1/> Теперь применяется первое правило <literal>shoelace_ok_ins</literal>, создающее такое дерево: <placeholder-2/> и отбрасывающее исходный <command>INSERT</command> в <literal>shoelace_ok</literal>. Этот переписанный запрос снова поступает в систему правил и второе применяемое правило <literal>shoelace_upd</literal> выдаёт: <placeholder-3/> Это тоже правило <literal>INSTEAD</literal>, так что предыдущее дерево запроса отбрасывается. Заметьте, что этот запрос по-прежнему использует представление <literal>shoelace</literal>. Но система правил ещё не закончила свою работу, она продолжает и применяет правило <literal>_RETURN</literal>, так что мы получаем: <placeholder-4/> Наконец, применяется правило <literal>log_shoelace</literal> и выдаётся дополнительное дерево запроса: <placeholder-5/> Теперь, обработав все правила, система правил выдаёт построенные деревья запросов.

source: So we end up with two final query trees that are equivalent to the <acronym>SQL</acronym> statements: <placeholder-1/> The result is that data coming from one relation inserted into another, changed into updates on a third, changed into updating a fourth plus logging that final update in a fifth gets reduced into two queries.
ru: В итоге мы получаем два дерева запросов, равнозначные следующим операторам <acronym>SQL</acronym>: <placeholder-1/> В результате вся операция, в ходе которой данные, поступающие из одного отношения, вставляются в другое, вставка преобразуется в изменение третьего, что затем становится изменением четвёртого, и запись об этом изменении добавляется в пятое, сводится к двум запросам.

source: There is a little detail that's a bit ugly. Looking at the two queries, it turns out that the <literal>shoelace_data</literal> relation appears twice in the range table where it could definitely be reduced to one. The planner does not handle it and so the execution plan for the rule systems output of the <command>INSERT</command> will be <literallayout class="monospaced"> Nested Loop -&gt; Merge Join -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on s -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on shoelace_arrive -&gt; Seq Scan on shoelace_data </literallayout> while omitting the extra range table entry would result in a <literallayout class="monospaced"> Merge Join -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on s -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on shoelace_arrive </literallayout> which produces exactly the same entries in the log table. Thus, the rule system caused one extra scan on the table <literal>shoelace_data</literal> that is absolutely not necessary. And the same redundant scan is done once more in the <command>UPDATE</command>. But it was a really hard job to make that all possible at all.
ru: Здесь можно заметить маленькую не очень красивую деталь. Как видно, в этих двух запросах таблица <literal>shoelace_data</literal> фигурирует в списке отношений дважды, тогда как определённо достаточно и одного вхождения. Планировщик не понимает этого и поэтому для дерева запроса <command>INSERT</command>, выданного системой правил, будет получен такой план: <literallayout class="monospaced"> Nested Loop -&gt; Merge Join -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on s -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on shoelace_arrive -&gt; Seq Scan on shoelace_data </literallayout> Тогда как без лишнего элемента в списке отношений мы получили бы: <literallayout class="monospaced"> Merge Join -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on s -&gt; Seq Scan -&gt; Sort -&gt; Seq Scan on shoelace_arrive </literallayout> При этом в журнале оказались бы точно такие же записи. Таким образом, применение правил повлекло дополнительное сканирование таблицы <literal>shoelace_data</literal>, в котором не было никакой необходимости. И такое же избыточное сканирование выполняется ещё раз в <command>UPDATE</command>. Отнеситесь к этому с пониманием, ведь сделать всё это возможным в принципе было действительно сложно.

source: Now we make a final demonstration of the <productname>PostgreSQL</productname> rule system and its power. Say you add some shoelaces with extraordinary colors to your database: <placeholder-1/> We would like to make a view to check which <literal>shoelace</literal> entries do not fit any shoe in color. The view for this is: <placeholder-2/> Its output is: <placeholder-3/>
ru: И наконец, ещё одна, завершающая демонстрация системы правил <productname>PostgreSQL</productname> и всей её мощи. Предположим, что вы добавили в базу данных шнурки с экстраординарными цветами: <placeholder-1/> Давайте создадим представление, чтобы убедиться, что шнурки (записи в <literal>shoelace</literal>) не подходят ни к каким туфлям. Оно будет определено так: <placeholder-2/> Через него мы получаем наши записи: <placeholder-3/>

source: Now we want to set it up so that mismatching shoelaces that are not in stock are deleted from the database. To make it a little harder for <productname>PostgreSQL</productname>, we don't delete it directly. Instead we create one more view: <placeholder-1/> and do it this way: <placeholder-2/> <foreignphrase>Voil&agrave;</foreignphrase>: <placeholder-3/>
ru: Теперь мы хотим, чтобы шнурки, которые ни к чему не подходят, удалялись из базы данных. Чтобы немного усложнить задачу для <productname>PostgreSQL</productname>, мы не будем удалять их непосредственно из таблицы. Вместо этого мы создадим ещё одно представление: <placeholder-1/> И удалим их так: <placeholder-2/> Вуаля: <placeholder-3/>

source: A <command>DELETE</command> on a view, with a subquery qualification that in total uses 4 nesting/joined views, where one of them itself has a subquery qualification containing a view and where calculated view columns are used, gets rewritten into one single query tree that deletes the requested data from a real table.
ru: Так запрос <command>DELETE</command> для представления с ограничивающим условием-подзапросом, использующим в совокупности 4 вложенных/соединённых представления, с одним из которых тоже связано условие с подзапросом, задействующим представление, и где используются вычисляемые столбцы представлений, переписывается и преобразуется в одно дерево запроса, которое удаляет требуемые данные из реальной таблицы.

source: There are probably only a few situations out in the real world where such a construct is necessary. But it makes you feel comfortable that it works.
ru: На практике ситуации, когда необходима такая сложная конструкция, встречаются довольно редко, но, тем не менее, приятно осознавать, что всё это возможно и работает.

source: Rules and Privileges
ru: Правила и права

source: <primary>privilege</primary><secondary sortas="Regeln">with rules</secondary>
ru: <primary>права</primary><secondary sortas="Regeln">с правилами</secondary>
