Repository: pluzanov/pg-doc-ru
Catalog: 9.6/rules.po
Languages: ru

source: <primary>privilege</primary><secondary sortas="Sichten">with views</secondary>
ru: <primary>права</primary><secondary sortas="Sichten">с представлениями</secondary>

source: Due to rewriting of queries by the <productname>PostgreSQL</productname> rule system, other tables/views than those used in the original query get accessed. When update rules are used, this can include write access to tables.
ru: В результате переписывания запросов системой правил <productname>PostgreSQL</productname> обращение может происходить не к тем таблицам/представлениям, к которым обращался исходный запрос. С правилами для изменения возможна так же и запись в другие таблицы.

source: Rewrite rules don't have a separate owner. The owner of a relation (table or view) is automatically the owner of the rewrite rules that are defined for it. The <productname>PostgreSQL</productname> rule system changes the behavior of the default access control system. Relations that are used due to rules get checked against the privileges of the rule owner, not the user invoking the rule. This means that users only need the required privileges for the tables/views that are explicitly named in their queries.
ru: Правила перезаписи не имеют отдельного владельца — владельцем правил перезаписи, определённых для отношения (таблицы или представления), автоматически считается владелец этого отношения. Система правил <productname>PostgreSQL</productname> меняет поведение стандартного механизма управления доступом. К отношениям, используемым вследствие применения правил, проверяется доступ владельца правила, но не пользователя, выполняющего запрос. Это значит, что пользователь должен иметь права, необходимые только для обращения к таблицам/представлениям, которые он явно упоминает в своих запросах.

source: For example: A user has a list of phone numbers where some of them are private, the others are of interest for the assistant of the office. The user can construct the following: <placeholder-1/> Nobody except that user (and the database superusers) can access the <literal>phone_data</literal> table. But because of the <command>GRANT</command>, the assistant can run a <command>SELECT</command> on the <literal>phone_number</literal> view. The rule system will rewrite the <command>SELECT</command> from <literal>phone_number</literal> into a <command>SELECT</command> from <literal>phone_data</literal>. Since the user is the owner of <literal>phone_number</literal> and therefore the owner of the rule, the read access to <literal>phone_data</literal> is now checked against the user's privileges and the query is permitted. The check for accessing <literal>phone_number</literal> is also performed, but this is done against the invoking user, so nobody but the user and the assistant can use it.
ru: Например, представим, что у пользователя есть список телефонных номеров, некоторые из которых личные, а некоторые должна знать его ассистентка. Он может построить следующую конструкцию: <placeholder-1/> Никто, кроме него (и суперпользователей базы данных) не сможет обратиться к таблице <literal>phone_data</literal>. Но так как ассистентке было дано (<command>GRANT</command>) соответствующее право, она сможет выполнить <command>SELECT</command> для представления <literal>phone_number</literal>. Система правил преобразует <command>SELECT</command> из <literal>phone_number</literal> в <command>SELECT</command> из таблицы <literal>phone_data</literal>. Так как пользователь является владельцем <literal>phone_number</literal>, он же считается владельцем правила, доступ на чтение <literal>phone_data</literal> проверяется для него, и выполнение запроса разрешается. Проверка прав доступа к <literal>phone_number</literal> тоже выполняется, но при этом проверяется пользователь, выполняющий запрос, так что обращаться к этому представлению смогут только сам пользователь и его ассистентка.

source: The privileges are checked rule by rule. So the assistant is for now the only one who can see the public phone numbers. But the assistant can set up another view and grant access to that to the public. Then, anyone can see the <literal>phone_number</literal> data through the assistant's view. What the assistant cannot do is to create a view that directly accesses <literal>phone_data</literal>. (Actually the assistant can, but it will not work since every access will be denied during the permission checks.) And as soon as the user notices that the assistant opened their <literal>phone_number</literal> view, the user can revoke the assistant's access. Immediately, any access to the assistant's view would fail.
ru: Права проверяются правило за правилом. То есть, в данный момент только ассистентка может видеть открытые телефонные номера. Но она может создать другое представление и дать доступ к нему всем (роли <literal>public</literal>), после чего все смогут видеть данные <literal>phone_number</literal> через представление ассистентки. Что она не может сделать, так это создать представление, которое обращается к <literal>phone_data</literal> напрямую. (Вообще она может это сделать, но такое представление не будет работать, так как при любой попытке прочитать его доступ к таблице будет запрещён.) И как только пользователь заметит, что ассистентка открыла доступ к своему представлению <literal>phone_number</literal>, он может лишить её права чтения этого представления. В результате все сразу потеряют доступ и к представлению ассистентки.

source: One might think that this rule-by-rule checking is a security hole, but in fact it isn't. But if it did not work this way, the assistant could set up a table with the same columns as <literal>phone_number</literal> and copy the data to there once per day. Then it's the assistant's own data and the assistant can grant access to everyone they want. A <command>GRANT</command> command means, <quote>I trust you</quote>. If someone you trust does the thing above, it's time to think it over and then use <command>REVOKE</command>.
ru: Может показаться, что такая проверка <quote>правило-за-правилом</quote> представляет уязвимость, но это не так. Если бы даже этот механизм не работал, ассистентка могла бы создать таблицу со столбцами как в <literal>phone_number</literal> и регулярно копировать туда данные. Тогда это были бы её собственные данные и она могла бы открывать доступ к ним кому угодно. Другими словами, команда <command>GRANT</command> означает <quote>Я доверяю тебе</quote>. Если кто-то, кому вы доверяете, проделывает такие операции, стоит задуматься и, возможно, лишить его доступа к данным, применив <command>REVOKE</command>.

source: Note that while views can be used to hide the contents of certain columns using the technique shown above, they cannot be used to reliably conceal the data in unseen rows unless the <literal>security_barrier</literal> flag has been set. For example, the following view is insecure: <placeholder-1/> This view might seem secure, since the rule system will rewrite any <command>SELECT</command> from <literal>phone_number</literal> into a <command>SELECT</command> from <literal>phone_data</literal> and add the qualification that only entries where <literal>phone</literal> does not begin with 412 are wanted. But if the user can create their own functions, it is not difficult to convince the planner to execute the user-defined function prior to the <function>NOT LIKE</function> expression. For example: <placeholder-2/> Every person and phone number in the <literal>phone_data</literal> table will be printed as a <literal>NOTICE</literal>, because the planner will choose to execute the inexpensive <function>tricky</function> function before the more expensive <function>NOT LIKE</function>. Even if the user is prevented from defining new functions, built-in functions can be used in similar attacks. (For example, most casting functions include their input values in the error messages they produce.)
ru: Хотя представления могут применяться для скрытия содержимого определённых столбцов, как описано выше, с их помощью нельзя надёжно скрыть данные в невидимых строках, если только не установлен флаг <literal>security_barrier</literal>. Например, следующее представление небезопасно: <placeholder-1/> Может показаться, что всё в порядке, ведь система правил преобразует <command>SELECT</command> из <literal>phone_number</literal> в <command>SELECT</command> из <literal>phone_data</literal> и добавит ограничивающее условие, чтобы выдавались только строки с полем <literal>phone</literal>, начинающимся не с 412. Но если пользователь может создавать собственные функции, ему будет не сложно заставить планировщик выполнять функцию пользователя перед выражением <function>NOT LIKE</function>. Например: <placeholder-2/> Так он сможет получить все имена и номера телефонов из таблицы <literal>phone_data</literal> через сообщения <literal>NOTICE</literal>, так как планировщик решит, что лучше выполнить недорогую функцию <function>tricky</function> перед более дорогой операцией <function>NOT LIKE</function>. И даже если пользователь не имеет права создавать новые функции, он может использовать для подобных атак встроенные функции. (Например, многие функции приведения показывают входные значения в сообщениях об ошибках.)

source: Similar considerations apply to update rules. In the examples of the previous section, the owner of the tables in the example database could grant the privileges <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, and <literal>DELETE</literal> on the <literal>shoelace</literal> view to someone else, but only <literal>SELECT</literal> on <literal>shoelace_log</literal>. The rule action to write log entries will still be executed successfully, and that other user could see the log entries. But they could not create fake entries, nor could they manipulate or remove existing ones. In this case, there is no possibility of subverting the rules by convincing the planner to alter the order of operations, because the only rule which references <literal>shoelace_log</literal> is an unqualified <literal>INSERT</literal>. This might not be true in more complex scenarios.
ru: Подобные соображения распространяются и на правила для изменения. Применительно к примерам предыдущего раздела, владелец таблиц в базе данных может дать кому-нибудь другому для представления <literal>shoelace</literal> права <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal> и <literal>DELETE</literal>, а для <literal>shoelace_log</literal> только <literal>SELECT</literal>. Действие правила, добавляющее записи в журнал, всё равно будет выполняться успешно, а этот другой пользователь сможет видеть записи в журнале. Но он не сможет создавать поддельные записи, равно как и модифицировать или удалять существующие. В этом случае нет никакой возможности заставить планировщик изменить порядок операций, так как единственное правило, которое обращается к <literal>shoelace_log</literal> — это безусловный <literal>INSERT</literal>. В более сложных сценариях это может быть не так.

source: When it is necessary for a view to provide row level security, the <literal>security_barrier</literal> attribute should be applied to the view. This prevents maliciously-chosen functions and operators from being passed values from rows until after the view has done its work. For example, if the view shown above had been created like this, it would be secure: <placeholder-1/> Views created with the <literal>security_barrier</literal> may perform far worse than views created without this option. In general, there is no way to avoid this: the fastest possible plan must be rejected if it may compromise security. For this reason, this option is not enabled by default.
ru: Когда требуется, чтобы представление обеспечивало защиту на уровне строк, к нему нужно применить атрибут <literal>security_barrier</literal>. Это предотвратит утечку содержимого строк из злонамеренно выбранных функций и операторов до того, как строки будут отфильтрованы представлением. Например, показанное выше представление будет безопасным, если создать его так: <placeholder-1/> Представления, созданные с атрибутом <literal>security_barrier</literal>, могут работать гораздо медленнее, чем обычные. И вообще говоря, это неизбежно: самый быстрый план должен быть отвергнут, если он может скомпрометировать защиту. Поэтому данный атрибут по умолчанию не устанавливается.

source: The query planner has more flexibility when dealing with functions that have no side effects. Such functions are referred to as <literal>LEAKPROOF</literal>, and include many simple, commonly used operators, such as many equality operators. The query planner can safely allow such functions to be evaluated at any point in the query execution process, since invoking them on rows invisible to the user will not leak any information about the unseen rows. Further, functions which do not take arguments or which are not passed any arguments from the security barrier view do not have to be marked as <literal>LEAKPROOF</literal> to be pushed down, as they never receive data from the view. In contrast, a function that might throw an error depending on the values received as arguments (such as one that throws an error in the event of overflow or division by zero) is not leak-proof, and could provide significant information about the unseen rows if applied before the security view's row filters.
ru: Планировщик запросов имеет больше свободы, работая с функциями, лишёнными побочных эффектов. Такие функции называются герметичными (<literal>LEAKPROOF</literal>) и включают только простые часто используемые операторы, например, операторы равенства. Планировщик запросов может безопасно вычислять такие функции в любой момент выполнения запроса, так как при вызове их для строк, невидимых пользователю, не просочится никакая информация об этих строках. Более того, функции, которые не принимают аргументы или которым не передаются аргументы из представления с барьером безопасности, можно не помечать как <literal>LEAKPROOF</literal>, чтобы они вышли наружу, так как они никогда не получат данные из представления. И напротив, функции, которые могут вызвать ошибку в зависимости от значений аргументов (например, в случае переполнения или деления на ноль), герметичными не являются, и могут выдать существенную информацию о невидимых строках, если будут выполнены перед фильтрами строк.

source: It is important to understand that even a view created with the <literal>security_barrier</literal> option is intended to be secure only in the limited sense that the contents of the invisible tuples will not be passed to possibly-insecure functions. The user may well have other means of making inferences about the unseen data; for example, they can see the query plan using <command>EXPLAIN</command>, or measure the run time of queries against the view. A malicious attacker might be able to infer something about the amount of unseen data, or even gain some information about the data distribution or most common values (since these things may affect the run time of the plan; or even, since they are also reflected in the optimizer statistics, the choice of plan). If these types of "covert channel" attacks are of concern, it is probably unwise to grant any access to the data at all.
ru: Важно понимать, что даже представление, созданное с атрибутом <literal>security_barrier</literal>, остаётся безопасным только в том смысле, что содержимое невидимых строк не будет передаваться потенциально небезопасным функциям. Но пользователь может собрать некоторые сведения о невидимых данных и другими способами; например, он может проанализировать план запроса, полученный с <command>EXPLAIN</command>, или замерить время выполнения запросов с этим представлением. Злоумышленник может сделать определённые выводы об объёме невидимых данных или даже получить некоторую информацию о распределении данных или наиболее частых значениях (так как всё это отражается в статистике для оптимизатора и, как следствие, влияет на время выполнения плана или даже на выбор плана). Если возможность атаки через скрытые каналы вызывает опасения, вероятно, будет разумным не предоставлять никакой доступ к этим данным.

source: Rules and Command Status
ru: Правила и статус команд

source: The <productname>PostgreSQL</productname> server returns a command status string, such as <literal>INSERT 149592 1</literal>, for each command it receives. This is simple enough when there are no rules involved, but what happens when the query is rewritten by rules?
ru: Сервер <productname>PostgreSQL</productname> возвращает строку состояния команды, например, <literal>INSERT 149592 1</literal>, для каждой получаемой команды. Это довольно прозрачно, когда не задействуются правила, но что произойдёт, если правила перезапишут запрос?

source: If there is no unconditional <literal>INSTEAD</literal> rule for the query, then the originally given query will be executed, and its command status will be returned as usual. (But note that if there were any conditional <literal>INSTEAD</literal> rules, the negation of their qualifications will have been added to the original query. This might reduce the number of rows it processes, and if so the reported status will be affected.)
ru: Если с запросом не связано безусловное правило <literal>INSTEAD</literal>, то выполняется заданный исходный запрос и его статус выдаётся как обычно. (Но если определены какие-то условные правила <literal>INSTEAD</literal>, к исходному запросу добавляется условие, обратное их условиям применения. Это может повлиять на число обрабатываемых строк и выводимый статус команды.)

source: If there is any unconditional <literal>INSTEAD</literal> rule for the query, then the original query will not be executed at all. In this case, the server will return the command status for the last query that was inserted by an <literal>INSTEAD</literal> rule (conditional or unconditional) and is of the same command type (<command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>) as the original query. If no query meeting those requirements is added by any rule, then the returned command status shows the original query type and zeroes for the row-count and OID fields.
ru: Если с запросом связано безусловное правило <literal>INSTEAD</literal>, исходный запрос не выполняется вовсе. В этом случае сервер возвратит статус команды от последнего запроса, вставленного правилом <literal>INSTEAD</literal> (условным или безусловным), и тип команды исходного запроса (<command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>). Если правила не добавили подходящего запроса, в возвращённом статусе команды показывается исходный тип запроса и нули вместо количества строк и OID.

source: Rules affect the command status as follows: <placeholder-1/>
ru: Правила влияют на состояния команды следующим образом: <placeholder-1/>

source: The programmer can ensure that any desired <literal>INSTEAD</literal> rule is the one that sets the command status in the second case, by giving it the alphabetically last rule name among the active rules, so that it gets applied last.
ru: Программист может добиться, чтобы статус команды во втором случае устанавливало нужное правило <literal>INSTEAD</literal>, назначив ему имя, стоящее по алфавиту после других активных правил, чтобы это правило применялось последним.

source: Rules Versus Triggers
ru: Сравнение правил и триггеров

source: <primary>rule</primary><secondary sortas="Trigger">compared with triggers</secondary>
ru: <primary>правила</primary><secondary sortas="Trigger">в сравнении с триггерами</secondary>

source: <primary>trigger</primary><secondary sortas="Regeln">compared with rules</secondary>
ru: <primary>триггеры</primary><secondary sortas="Regeln">в сравнении с правилами</secondary>

source: Many things that can be done using triggers can also be implemented using the <productname>PostgreSQL</productname> rule system. One of the things that cannot be implemented by rules are some kinds of constraints, especially foreign keys. It is possible to place a qualified rule that rewrites a command to <literal>NOTHING</literal> if the value of a column does not appear in another table. But then the data is silently thrown away and that's not a good idea. If checks for valid values are required, and in the case of an invalid value an error message should be generated, it must be done by a trigger.
ru: Многие вещи, которые можно сделать с помощью триггеров, можно также реализовать, используя систему правил <productname>PostgreSQL</productname>. Однако, используя правила, нельзя реализовать, например, некоторые типы ограничений, в частности, внешние ключи. Хотя можно определить правило с ограничивающим условием, которое будет преобразовать команду в <literal>NOTHING</literal>, если значение ключа не находится в другой таблице, но при этом неподходящие данные будут отбрасываться молча, а это не самый лучший вариант. Также, если требуется проверить правильность значений и, обнаружив неверное значение, выдать ошибку, это нужно делать в триггере.

source: In this chapter, we focused on using rules to update views. All of the update rule examples in this chapter can also be implemented using <literal>INSTEAD OF</literal> triggers on the views. Writing such triggers is often easier than writing rules, particularly if complex logic is required to perform the update.
ru: В этой главе мы разберём использование правил для изменения представлений. Все правила, приведённые в примерах этой главы, можно также заменить триггерами <literal>INSTEAD OF</literal> для представлений. Написать такие триггеры часто бывает проще, чем разработать правила, особенно если для изменений применяется сложная логика.

source: For the things that can be implemented by both, which is best depends on the usage of the database. A trigger is fired once for each affected row. A rule modifies the query or generates an additional query. So if many rows are affected in one statement, a rule issuing one extra command is likely to be faster than a trigger that is called for every single row and must re-determine what to do many times. However, the trigger approach is conceptually far simpler than the rule approach, and is easier for novices to get right.
ru: Для тех задач, которые можно решить обоими способами, лучший выбирается в зависимости от характера использования базы данных. Следует учитывать, что триггер срабатывает для каждой обрабатываемой строки, а правило изменяет существующий запрос или создаёт ещё один. Поэтому, если один оператор обрабатывает сразу много строк, правило, добавляющее дополнительную команду, скорее всего, будет работать быстрее, чем триггер, который вызывается для каждой очередной строки и должен каждый раз определять, что с ней делать. Однако триггеры концептуально гораздо проще правил, и использовать их правильно новичкам гораздо проще.

source: CREATE TABLE computer ( hostname text, -- indexed manufacturer text -- indexed ); CREATE TABLE software ( software text, -- indexed hostname text -- indexed );
ru: CREATE TABLE computer ( hostname text, -- индексированное manufacturer text -- индексированное ); CREATE TABLE software ( software text, -- индексированное hostname text -- индексированное );
