Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: This shell syntax can get tedious quickly. Therefore the wrapper program <xref linkend="app-pg-ctl"/><placeholder-1/> is provided to simplify some tasks. For example: <placeholder-2/> will start the server in the background and put the output into the named log file. The <option>-D</option> option has the same meaning here as for <command>postgres</command>. <command>pg_ctl</command> is also capable of stopping the server.
ru: Такой вариант запуска довольно быстро может оказаться неудобным. Поэтому для упрощения подобных задач предлагается вспомогательная программа <xref linkend="app-pg-ctl"/><placeholder-1/>. Например: <placeholder-2/> запустит сервер в фоновом режиме и направит выводимые сообщения сервера в указанный файл журнала. Параметр <option>-D</option> для неё имеет то же значение, что и для программы <command>postgres</command>. С помощью <command>pg_ctl</command> также можно остановить сервер.

source: <primary>booting</primary> <secondary>starting the server during</secondary>
ru: <primary>загрузка системы</primary> <secondary>запуск сервера</secondary>

source: Normally, you will want to start the database server when the computer boots.<placeholder-1/> Autostart scripts are operating-system-specific. There are a few distributed with <productname>PostgreSQL</productname> in the <filename>contrib/start-scripts</filename> directory. Installing one will require root privileges.
ru: Обычно возникает желание, чтобы сервер баз данных сам запускался при загрузке операционной системы.<placeholder-1/> Скрипты автозапуска для разных систем разные, но в составе <productname>PostgreSQL</productname> предлагается несколько типовых скриптов в каталоге <filename>contrib/start-scripts</filename>. Для установки такого скрипта в систему требуются права root.

source: Different systems have different conventions for starting up daemons at boot time. Many systems have a file <filename>/etc/rc.local</filename> or <filename>/etc/rc.d/rc.local</filename>. Others use <filename>init.d</filename> or <filename>rc.d</filename> directories. Whatever you do, the server must be run by the <productname>PostgreSQL</productname> user account <emphasis>and not by root</emphasis> or any other user. Therefore you probably should form your commands using <literal>su postgres -c '...'</literal>. For example: <placeholder-1/>
ru: В различных системах приняты разные соглашения о порядке запуска служб в процессе загрузки. Во многих системах для этого используется файл <filename>/etc/rc.local</filename> или <filename>/etc/rc.d/rc.local</filename>. В других применяются каталоги <filename>init.d</filename> или <filename>rc.d</filename>. Однако при любом варианте запускаться сервер должен от имени пользователя <productname>PostgreSQL</productname>, но <emphasis>не root</emphasis> или какого-либо другого пользователя. Поэтому команду запуска обычно следует записывать в форме <literal>su postgres -c '...'</literal>. Например: <placeholder-1/>

source: <primary>FreeBSD</primary><secondary>start script</secondary>
ru: <primary>FreeBSD</primary> <secondary>скрипт запуска</secondary>

source: For <productname>FreeBSD</productname>, look at the file <filename>contrib/start-scripts/freebsd</filename> in the <productname>PostgreSQL</productname> source distribution. <placeholder-1/>
ru: Для запуска во <productname>FreeBSD</productname> воспользуйтесь файлом <filename>contrib/start-scripts/freebsd</filename> в дереве исходного кода <productname>PostgreSQL</productname>. <placeholder-1/>

source: <primary>OpenBSD</primary><secondary>start script</secondary>
ru: <primary>OpenBSD</primary> <secondary>скрипт запуска</secondary>

source: On <productname>OpenBSD</productname>, add the following lines to the file <filename>/etc/rc.local</filename>: <placeholder-1/> <placeholder-2/>
ru: В <productname>OpenBSD</productname>, добавьте в файл <filename>/etc/rc.local</filename> следующие строки: <placeholder-1/> <placeholder-2/>

source: <primary>Linux</primary><secondary>start script</secondary>
ru: <primary>Linux</primary> <secondary>скрипт запуска</secondary>

source: On <productname>Linux</productname> systems either add <placeholder-1/> <placeholder-2/> to <filename>/etc/rc.d/rc.local</filename> or <filename>/etc/rc.local</filename> or look at the file <filename>contrib/start-scripts/linux</filename> in the <productname>PostgreSQL</productname> source distribution.
ru: В системах <productname>Linux</productname> вы можете либо добавить <placeholder-1/> <placeholder-2/> в <filename>/etc/rc.d/rc.local</filename> или в <filename>/etc/rc.local</filename>, либо воспользоваться файлом <filename>contrib/start-scripts/linux</filename> в дереве исходного кода <productname>PostgreSQL</productname>.

source: When using <application>systemd</application>, you can use the following service unit file (e.g., at <filename>/etc/systemd/system/postgresql.service</filename>):<placeholder-1/> <placeholder-2/> Using <literal>Type=notify</literal> requires that the server binary was built with <literal>configure --with-systemd</literal>.
ru: Используя <application>systemd</application>, вы можете применить следующий файл описания службы (например, <filename>/etc/systemd/system/postgresql.service</filename>):<placeholder-1/> <placeholder-2/> Для использования <literal>Type=notify</literal> требуется, чтобы сервер был скомпилирован с указанием <literal>configure --with-systemd</literal>.

source: Consider carefully the timeout setting. <application>systemd</application> has a default timeout of 90 seconds as of this writing and will kill a process that does not notify readiness within that time. But a <productname>PostgreSQL</productname> server that might have to perform crash recovery at startup could take much longer to become ready. The suggested value of 0 disables the timeout logic.
ru: Особого внимания заслуживает значение тайм-аута. На момент написания этой документации по умолчанию в <application>systemd</application> принят тайм-аут 90 секунд, так что процесс, не сообщивший о своей готовности за это время, будет уничтожен. Но серверу <productname>PostgreSQL</productname> при запуске может потребоваться выполнить восстановление после сбоя, так что переход в состояние готовности может занять гораздо больше времени. Предлагаемое значение 0 отключает логику тайм-аута.

source: <primary>NetBSD</primary><secondary>start script</secondary>
ru: <primary>NetBSD</primary> <secondary>скрипт запуска</secondary>

source: On <productname>NetBSD</productname>, use either the <productname>FreeBSD</productname> or <productname>Linux</productname> start scripts, depending on preference. <placeholder-1/>
ru: В <productname>NetBSD</productname> можно использовать скрипт запуска для <productname>FreeBSD</productname> или для <productname>Linux</productname>, в зависимости от предпочтений. <placeholder-1/>

source: <primary>Solaris</primary><secondary>start script</secondary>
ru: <primary>Solaris</primary> <secondary>скрипт запуска</secondary>

source: On <productname>Solaris</productname>, create a file called <filename>/etc/init.d/postgresql</filename> that contains the following line: <placeholder-1/> <placeholder-2/> Then, create a symbolic link to it in <filename>/etc/rc3.d</filename> as <filename>S99postgresql</filename>.
ru: В <productname>Solaris</productname>, создайте файл с именем <filename>/etc/init.d/postgresql</filename>, содержащий следующую стоку: <placeholder-1/> <placeholder-2/> Затем создайте символическую ссылку на него в каталоге <filename>/etc/rc3.d</filename> с именем <filename>S99postgresql</filename>.

source: Here are a few more operating-system-specific suggestions. (In each case be sure to use the proper installation directory and user name where we show generic values.) <placeholder-1/>
ru: Ниже приведены более конкретные предложения для нескольких основных ОС. (Вместо указанных нами шаблонных значений необходимо подставить правильный путь к каталогу данных и фактическое имя пользователя.) <placeholder-1/>

source: While the server is running, its <acronym>PID</acronym> is stored in the file <filename>postmaster.pid</filename> in the data directory. This is used to prevent multiple server instances from running in the same data directory and can also be used for shutting down the server.
ru: Когда сервер работает, идентификатор его процесса (<acronym>PID</acronym>) сохраняется в файле <filename>postmaster.pid</filename> в каталоге данных. Это позволяет исключить запуск нескольких экземпляров сервера с одним каталогом данных, а также может быть полезно для выключения сервера.

source: Server Start-up Failures
ru: Сбои при запуске сервера

source: There are several common reasons the server might fail to start. Check the server's log file, or start it by hand (without redirecting standard output or standard error) and see what error messages appear. Below we explain some of the most common error messages in more detail.
ru: Есть несколько распространённых причин, по которым сервер может не запуститься. Чтобы понять, чем вызван сбой, просмотрите файл журнала сервера или запустите сервер вручную (не перенаправляя его потоки стандартного вывода и ошибок) и проанализируйте выводимые сообщения. Ниже мы рассмотрим некоторые из наиболее частых сообщений об ошибках более подробно.

source: <screen> LOG: could not bind IPv4 socket: Address already in use HINT: Is another postmaster already running on port 5432? If not, wait a few seconds and retry. FATAL: could not create TCP/IP listen socket </screen> This usually means just what it suggests: you tried to start another server on the same port where one is already running. However, if the kernel error message is not <computeroutput>Address already in use</computeroutput> or some variant of that, there might be a different problem. For example, trying to start a server on a reserved port number might draw something like: <screen> $ <userinput>postgres -p 666</userinput> LOG: could not bind IPv4 socket: Permission denied HINT: Is another postmaster already running on port 666? If not, wait a few seconds and retry. FATAL: could not create TCP/IP listen socket </screen>
ru: <screen> LOG: could not bind IPv4 socket: Address already in use HINT: Is another postmaster already running on port 5432? If not, wait a few seconds and retry. FATAL: could not create TCP/IP listen socket </screen> Это обычно означает именно то, что написано: вы пытаетесь запустить сервер на том же порту, на котором уже работает другой. Однако, если сообщение ядра не <computeroutput>Адрес уже используется</computeroutput> или подобное, возможна и другая проблема. Например, при попытке запустить сервер с номером зарезервированного порта будут выданы такие сообщения: <screen> $ <userinput>postgres -p 666</userinput> LOG: could not bind IPv4 socket: Permission denied HINT: Is another postmaster already running on port 666? If not, wait a few seconds and retry. FATAL: could not create TCP/IP listen socket </screen>

source: A message like: <screen> FATAL: could not create shared memory segment: Invalid argument DETAIL: Failed system call was shmget(key=5440001, size=4011376640, 03600). </screen> probably means your kernel's limit on the size of shared memory is smaller than the work area <productname>PostgreSQL</productname> is trying to create (4011376640 bytes in this example). Or it could mean that you do not have System-V-style shared memory support configured into your kernel at all. As a temporary workaround, you can try starting the server with a smaller-than-normal number of buffers (<xref linkend="guc-shared-buffers"/>). You will eventually want to reconfigure your kernel to increase the allowed shared memory size. You might also see this message when trying to start multiple servers on the same machine, if their total space requested exceeds the kernel limit.
ru: Следующее сообщение: <screen> FATAL: could not create shared memory segment: Invalid argument DETAIL: Failed system call was shmget(key=5440001, size=4011376640, 03600). </screen> может означать, что установленный для вашего ядра предельный размер разделяемой памяти слишком мал для рабочей области, которую пытается создать <productname>PostgreSQL</productname> (в данном примере 4011376640 байт). Возможно также, что в вашем ядре вообще отсутствует поддержка разделяемой памяти в стиле System-V. В качестве временного решения можно попытаться запустить сервер с меньшим числом буферов (<xref linkend="guc-shared-buffers"/>), но в итоге вам, скорее всего, придётся переконфигурировать ядро и увеличить допустимый размер разделяемой памяти. Вы также можете увидеть это сообщение при попытке запустить несколько серверов на одном компьютере, если запрошенный ими объём разделяемой памяти в сумме превышает этот предел.

source: An error like: <screen> FATAL: could not create semaphores: No space left on device DETAIL: Failed system call was semget(5440126, 17, 03600). </screen> does <emphasis>not</emphasis> mean you've run out of disk space. It means your kernel's limit on the number of <systemitem class="osname">System V</systemitem> semaphores is smaller than the number <productname>PostgreSQL</productname> wants to create. As above, you might be able to work around the problem by starting the server with a reduced number of allowed connections (<xref linkend="guc-max-connections"/>), but you'll eventually want to increase the kernel limit.
ru: Сообщение: <screen> FATAL: could not create semaphores: No space left on device DETAIL: Failed system call was semget(5440126, 17, 03600). </screen> <emphasis>не</emphasis> означает, что у вас закончилось место на диске. Это значит, что установленное в вашем ядре предельное число семафоров <systemitem class="osname">System V</systemitem> меньше, чем количество семафоров, которое пытается создать <productname>PostgreSQL</productname>. Как и в предыдущем случае, можно попытаться обойти эту проблему, запустив сервер с меньшим числом допустимых подключений (<xref linkend="guc-max-connections"/>), но в конце концов вам придётся увеличить этот предел в ядре.

source: If you get an <quote>illegal system call</quote> error, it is likely that shared memory or semaphores are not supported in your kernel at all. In that case your only option is to reconfigure the kernel to enable these features.
ru: Если вы получаете ошибку <quote>illegal system call</quote> (неверный системный вызов), то, вероятнее всего, ваше ядро вовсе не поддерживает разделяемую память или семафоры. В этом случае, вам остаётся только переконфигурировать ядро и включить их поддержку.

source: Details about configuring <systemitem class="osname">System V</systemitem> <acronym>IPC</acronym> facilities are given in <xref linkend="sysvipc"/>.
ru: Настройка средств <acronym>IPC</acronym> в стиле <systemitem class="osname">System V</systemitem> описывается в <xref remap="6" linkend="sysvipc"/>.

source: Client Connection Problems
ru: Проблемы с подключениями клиентов

source: Although the error conditions possible on the client side are quite varied and application-dependent, a few of them might be directly related to how the server was started. Conditions other than those shown below should be documented with the respective client application.
ru: Хотя ошибки подключений, возможные на стороне клиента, довольно разнообразны и зависят от приложений, всё же несколько проблем могут быть связаны непосредственно с тем, как был запущен сервер. Описание ошибок, отличных от описанных ниже, следует искать в документации соответствующего клиентского приложения.

source: <screen> psql: could not connect to server: Connection refused Is the server running on host "server.joe.com" and accepting TCP/IP connections on port 5432? </screen> This is the generic <quote>I couldn't find a server to talk to</quote> failure. It looks like the above when TCP/IP communication is attempted. A common mistake is to forget to configure the server to allow TCP/IP connections.
ru: <screen> psql: could not connect to server: Connection refused Is the server running on host "server.joe.com" and accepting TCP/IP connections on port 5432? </screen> Это общая проблема <quote>я не могу найти сервер и начать взаимодействие с ним</quote>. Показанное выше сообщение говорит о попытке установить подключение по TCP/IP. Очень часто объясняется это тем, что сервер просто забыли настроить для работы по протоколу TCP/IP.

source: Alternatively, you'll get this when attempting Unix-domain socket communication to a local server: <screen> psql: could not connect to server: No such file or directory Is the server running locally and accepting connections on Unix domain socket "/tmp/.s.PGSQL.5432"? </screen>
ru: Кроме того, при попытке установить подключение к локальному серверу через доменный сокет Unix можно получить такое сообщение: <screen> psql: could not connect to server: No such file or directory Is the server running locally and accepting connections on Unix domain socket "/tmp/.s.PGSQL.5432"? </screen>

source: The last line is useful in verifying that the client is trying to connect to the right place. If there is in fact no server running there, the kernel error message will typically be either <computeroutput>Connection refused</computeroutput> or <computeroutput>No such file or directory</computeroutput>, as illustrated. (It is important to realize that <computeroutput>Connection refused</computeroutput> in this context does <emphasis>not</emphasis> mean that the server got your connection request and rejected it. That case will produce a different message, as shown in <xref linkend="client-authentication-problems"/>.) Other error messages such as <computeroutput>Connection timed out</computeroutput> might indicate more fundamental problems, like lack of network connectivity.
ru: Путь в последней строке помогает понять, к правильному ли адресу пытается подключиться клиент. Если сервер на самом деле не принимает подключения по этому адресу, обычно выдаётся сообщение ядра <computeroutput>Connection refused</computeroutput> (В соединении отказано) или <computeroutput>No such file or directory</computeroutput> (Нет такого файла или каталога), приведённое выше. (Важно понимать, что <computeroutput>Connection refused</computeroutput> в данном контексте <emphasis>не</emphasis> означает, что сервер получил запрос на подключение и отверг его. В этом случае были бы выданы другие сообщения, например, показанные в <xref remap="6" linkend="client-authentication-problems"/>.) Другие сообщения об ошибках, например <computeroutput>Connection timed out</computeroutput> (Тайм-аут соединения) могут сигнализировать о более фундаментальных проблемах, например, о нарушениях сетевых соединений.

source: Managing Kernel Resources
ru: Управление ресурсами ядра

source: <productname>PostgreSQL</productname> can sometimes exhaust various operating system resource limits, especially when multiple copies of the server are running on the same system, or in very large installations. This section explains the kernel resources used by <productname>PostgreSQL</productname> and the steps you can take to resolve problems related to kernel resource consumption.
ru: <productname>PostgreSQL</productname> иногда может исчерпывать некоторые ресурсы операционной системы до предела, особенно при запуске нескольких копий сервера в одной системе или при работе с очень большими базами. В этом разделе описываются ресурсы ядра, которые использует <productname>PostgreSQL</productname>, и подходы к решению проблем, связанных с ограниченностью этих ресурсов.

source: Shared Memory and Semaphores
ru: Разделяемая память и семафоры

source: <primary>shared memory</primary>
ru: <primary>разделяемая память</primary>

source: <primary>semaphores</primary>
ru: <primary>семафоры</primary>

source: Shared memory and semaphores are collectively referred to as <quote><systemitem class="osname">System V</systemitem> <acronym>IPC</acronym></quote> (together with message queues, which are not relevant for <productname>PostgreSQL</productname>). Except on <systemitem class="osname">Windows</systemitem>, where <productname>PostgreSQL</productname> provides its own replacement implementation of these facilities, these facilities are required in order to run <productname>PostgreSQL</productname>.
ru: Разделяемая память и семафоры в совокупности называются средствами межпроцессного взаимодействия (<acronym>IPC</acronym>) в стиле <systemitem class="osname">System V</systemitem> (к этим средствам также относятся очереди сообщений, но они не имеют отношения к <productname>PostgreSQL</productname>). За исключением <systemitem class="osname">Windows</systemitem>, где <productname>PostgreSQL</productname> использует собственную замену этих средств, эти средства необходимы для работы <productname>PostgreSQL</productname>.

source: The complete lack of these facilities is usually manifested by an <errorname>Illegal system call</errorname> error upon server start. In that case there is no alternative but to reconfigure your kernel. <productname>PostgreSQL</productname> won't work without them. This situation is rare, however, among modern operating systems.
ru: Если эти механизмы полностью отсутствуют в системе, при запуске сервера обычно выдаётся ошибка <errorname>Illegal system call</errorname> (Неверный системный вызов). В этом случае единственный способ решить проблему — переконфигурировать ядро системы. Без них <productname>PostgreSQL</productname> просто не будет работать. Это довольно редкая ситуация, особенно с современными операционными системами.

source: When <productname>PostgreSQL</productname> exceeds one of the various hard <acronym>IPC</acronym> limits, the server will refuse to start and should leave an instructive error message describing the problem and what to do about it. (See also <xref linkend="server-start-failures"/>.) The relevant kernel parameters are named consistently across different systems; <xref linkend="sysvipc-parameters"/> gives an overview. The methods to set them, however, vary. Suggestions for some platforms are given below.
ru: Когда <productname>PostgreSQL</productname> превышает один из различных жёстких пределов <acronym>IPC</acronym>, сервер отказывается запускаться, но выдаёт полезное сообщение, говорящее об ошибке и о том, что с ней делать. (См. также <xref remap="4" linkend="server-start-failures"/>.) Соответствующие параметры ядра в разных системах называются аналогично (они перечислены в <xref remap="6" linkend="sysvipc-parameters"/>), но устанавливаются они по-разному. Ниже предлагаются способы их изменения для некоторых систем.

source: Prior to <productname>PostgreSQL</productname> 9.3, the amount of System V shared memory required to start the server was much larger. If you are running an older version of the server, please consult the documentation for your server version.
ru: <productname>PostgreSQL</productname> до версии 9.3 требовал для запуска сервера гораздо больший объём разделяемой памяти System V. Если вы используете более раннюю версию сервера, обратитесь к документации по вашей версии.

source: <systemitem class="osname">System V</systemitem> <acronym>IPC</acronym> Parameters
ru: Параметры <acronym>IPC</acronym> в стиле <systemitem class="osname">System V</systemitem>

source: Name
ru: Имя

source: Description
ru: Описание

source: Reasonable values
ru: Разумные значения

source: Maximum size of shared memory segment (bytes)
ru: Максимальный размер сегмента разделяемой памяти (в байтах)

source: at least 1kB (more if running many copies of the server)
ru: не меньше 1 КБ (больше, если запускается много копий сервера)

source: Minimum size of shared memory segment (bytes)
ru: Минимальный размер сегмента разделяемой памяти (в байтах)

source: Total amount of shared memory available (bytes or pages)
ru: Общий объём доступной разделяемой памяти (в байтах или страницах)
