Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: For a detailed description of the <productname>Linux</productname> huge pages feature have a look at <ulink url="https://www.kernel.org/doc/Documentation/vm/hugetlbpage.txt"/>.
ru: Более подробно о механизме огромных страниц в <productname>Linux</productname> можно узнать в документации ядра: <ulink url="https://www.kernel.org/doc/Documentation/vm/hugetlbpage.txt"/>.

source: Shutting Down the Server
ru: Выключение сервера

source: <primary>shutdown</primary>
ru: <primary>выключение</primary>

source: This is the <firstterm>Smart Shutdown</firstterm> mode. After receiving <systemitem>SIGTERM</systemitem>, the server disallows new connections, but lets existing sessions end their work normally. It shuts down only after all of the sessions terminate. If the server is in online backup mode, it additionally waits until online backup mode is no longer active. While backup mode is active, new connections will still be allowed, but only to superusers (this exception allows a superuser to connect to terminate online backup mode). If the server is in recovery when a smart shutdown is requested, recovery and streaming replication will be stopped only after all regular sessions have terminated.
ru: Запускает так называемое <firstterm>умное выключение</firstterm>. Получив <systemitem>SIGTERM</systemitem>, сервер перестаёт принимать новые подключения, но позволяет всем существующим сеансам закончить работу в штатном режиме. Сервер будет отключён только после завершения всех сеансов. Если сервер находится в режиме архивации, сервер дополнительно ожидает выхода из этого режима. При этом в данном случае сервер позволяет устанавливать новые подключения, но только для суперпользователей (это исключение позволяет суперпользователю подключиться и прервать архивацию). Если получая этот сигнал, сервер находится в процессе восстановления, восстановление и потоковая репликация будут прерваны только после завершения всех обычных сеансов.

source: This is the <firstterm>Fast Shutdown</firstterm> mode. The server disallows new connections and sends all existing server processes <systemitem>SIGTERM</systemitem>, which will cause them to abort their current transactions and exit promptly. It then waits for all server processes to exit and finally shuts down. If the server is in online backup mode, backup mode will be terminated, rendering the backup useless.
ru: Запускает <firstterm>быстрое выключение</firstterm>. Сервер запрещает новые подключения и посылает всем работающим серверным процессам сигнал <systemitem>SIGTERM</systemitem>, в результате чего их транзакции прерываются и сами процессы завершаются. Управляющий процесс ждёт, пока будут завершены все эти процессы и затем завершается сам. Если сервер находится в режиме архивации, архивация прерывается, так что архив оказывается неполным.

source: This is the <firstterm>Immediate Shutdown</firstterm> mode. The server will send <systemitem>SIGQUIT</systemitem> to all child processes and wait for them to terminate. If any do not terminate within 5 seconds, they will be sent <systemitem>SIGKILL</systemitem>. The master server process exits as soon as all child processes have exited, without doing normal database shutdown processing. This will lead to recovery (by replaying the WAL log) upon next start-up. This is recommended only in emergencies.
ru: Запускает <firstterm>немедленное выключение</firstterm>. Сервер отправляет всем дочерним процессам сигнал <systemitem>SIGQUIT</systemitem> и ждёт их завершения. Если какие-либо из них не завершаются в течение 5 секунд, им посылается <systemitem>SIGKILL</systemitem>. Главный процесс сервера завершается, как только будут завершены все дочерние процессы, не выполняя обычную процедуру остановки БД. В результате при последующем запуске будет запущен процесс восстановления (воспроизведения изменений из журнала). Такой вариант выключения рекомендуется только в экстренных ситуациях.

source: There are several ways to shut down the database server. You control the type of shutdown by sending different signals to the master <command>postgres</command> process. <placeholder-1/>
ru: Сервер баз данных можно отключить несколькими способами. Вы выбираете тот или иной вариант отключения, посылая разные сигналы главному процессу <command>postgres</command>. <placeholder-1/>

source: The <xref linkend="app-pg-ctl"/> program provides a convenient interface for sending these signals to shut down the server. Alternatively, you can send the signal directly using <command>kill</command> on non-Windows systems. The <acronym>PID</acronym> of the <command>postgres</command> process can be found using the <command>ps</command> program, or from the file <filename>postmaster.pid</filename> in the data directory. For example, to do a fast shutdown: <screen> $ <userinput>kill -INT `head -1 /usr/local/pgsql/data/postmaster.pid`</userinput> </screen>
ru: Удобную возможность отправлять эти сигналы, отключающие сервер, предоставляет программа <xref linkend="app-pg-ctl"/>. Кроме того, в системах, отличных от Windows, соответствующий сигнал можно отправить с помощью команды <command>kill</command>. <acronym>PID</acronym> основного процесса <command>postgres</command> можно узнать, воспользовавшись программой <command>ps</command>, либо прочитав файл <filename>postmaster.pid</filename> в каталоге данных. Например, можно выполнить быстрое выключение так: <screen> $ <userinput>kill -INT `head -1 /usr/local/pgsql/data/postmaster.pid`</userinput> </screen>

source: It is best not to use <systemitem>SIGKILL</systemitem> to shut down the server. Doing so will prevent the server from releasing shared memory and semaphores, which might then have to be done manually before a new server can be started. Furthermore, <systemitem>SIGKILL</systemitem> kills the <command>postgres</command> process without letting it relay the signal to its subprocesses, so it will be necessary to kill the individual subprocesses by hand as well.
ru: Для выключения сервера не следует использовать сигнал <systemitem>SIGKILL</systemitem>. При таком выключении сервер не сможет освободить разделяемую память и семафоры, и, возможно, это придётся делать вручную, чтобы сервер мог запуститься снова. Кроме того, при уничтожении главного процесса <command>postgres</command> сигналом <systemitem>SIGKILL</systemitem>, он не успеет передать этот сигнал своим дочерним процессам, так что может потребоваться завершать их так же вручную.

source: To terminate an individual session while allowing other sessions to continue, use <function>pg_terminate_backend()</function> (see <xref linkend="functions-admin-signal-table"/>) or send a <systemitem>SIGTERM</systemitem> signal to the child process associated with the session.
ru: Чтобы завершить отдельный сеанс, не прерывая работу других сеансов, воспользуйтесь функцией <function>pg_terminate_backend()</function> (см. <xref remap="4" linkend="functions-admin-signal-table"/>) или отправьте сигнал <systemitem>SIGTERM</systemitem> дочернему процессу, обслуживающему этот сеанс.

source: Upgrading a <productname>PostgreSQL</productname> Cluster
ru: Обновление кластера <productname>PostgreSQL</productname>

source: <primary>upgrading</primary>
ru: <primary>обновление</primary>

source: <primary>version</primary> <secondary>compatibility</secondary>
ru: <primary>версия</primary> <secondary>совместимость</secondary>

source: This section discusses how to upgrade your database data from one <productname>PostgreSQL</productname> release to a newer one.
ru: В этом разделе рассказывается, как обновить ваш кластер базы данных с одной версии <productname>PostgreSQL</productname> на другую.

source: <productname>PostgreSQL</productname> major versions are represented by the first two digit groups of the version number, e.g., 8.4. <productname>PostgreSQL</productname> minor versions are represented by the third group of version digits, e.g., 8.4.2 is the second minor release of 8.4. Minor releases never change the internal storage format and are always compatible with earlier and later minor releases of the same major version number, e.g., 8.4.2 is compatible with 8.4, 8.4.1 and 8.4.6. To update between compatible versions, you simply replace the executables while the server is down and restart the server. The data directory remains unchanged &mdash; minor upgrades are that simple.
ru: Основные версии <productname>PostgreSQL</productname> представляются первыми двумя группами цифр в полной версии, например, 8.4. Корректирующие выпуски <productname>PostgreSQL</productname> представляются третьей группой цифр, например, 8.4.2 — второй корректирующий выпуск версии 8.4. В корректирующих выпусках никогда не меняется внутренний формат хранения и они всегда совместимы с предыдущими и последующими выпусками той же основной версии, например выпуск 8.4.2 совместим с 8.4, 8.4.1 и 8.4.6. Для обновления версии на совместимую достаточно просто заменить исполняемые файлы при выключенном сервере и затем запустить сервер. Каталог данных при этом не затрагивается, так что обновить корректирующую версию довольно просто.

source: For <emphasis>major</emphasis> releases of <productname>PostgreSQL</productname>, the internal data storage format is subject to change, thus complicating upgrades. The traditional method for moving data to a new major version is to dump and reload the database, though this can be slow. A faster method is <xref linkend="pgupgrade"/>. Replication methods are also available, as discussed below.
ru: При обновлении <emphasis>основных</emphasis> версий <productname>PostgreSQL</productname> внутренний формат данных может меняться, что усложняет процедуру обновления. Традиционный способ переноса данных в новую основную версию — выгрузить данные из старой версии, а затем загрузить их в новую (это не самый быстрый вариант). Выполнить обновление быстрее позволяет <xref linkend="pgupgrade"/>. Также для обновления можно использовать репликацию, как описано ниже.

source: New major versions also typically introduce some user-visible incompatibilities, so application programming changes might be required. All user-visible changes are listed in the release notes (<xref linkend="release"/>); pay particular attention to the section labeled "Migration". If you are upgrading across several major versions, be sure to read the release notes for each intervening version.
ru: Изменения основной версии обычно приносят какие-либо видимые пользователю несовместимости, которые могут требовать доработки приложений. Все подобные изменения описываются в замечаниях к выпуску (<xref linkend="release"/>); обращайте особое внимание на раздел &laquo;Migration&raquo; (Миграция). Если при обновлении вы пропускаете несколько основных версий, обязательно прочитайте замечания к выпуску, в том числе и для каждой пропускаемой версии.

source: Cautious users will want to test their client applications on the new version before switching over fully; therefore, it's often a good idea to set up concurrent installations of old and new versions. When testing a <productname>PostgreSQL</productname> major upgrade, consider the following categories of possible changes:
ru: Осторожные пользователи обычно тестируют свои клиентские приложения с новой версией, прежде чем переходить на неё полностью; поэтому часто имеет смысл установить рядом старую и новую версии. При тестировании обновления основной версии <productname>PostgreSQL</productname> изучите следующие области возможных изменений:

source: Administration
ru: Администрирование

source: The capabilities available for administrators to monitor and control the server often change and improve in each major release.
ru: Средства и функции, предоставляемые администраторам для наблюдения и управления сервером, часто меняются и совершенствуются в каждой новой версии.

source: Typically this includes new SQL command capabilities and not changes in behavior, unless specifically mentioned in the release notes.
ru: В этой области чаще наблюдается появление новых возможностей команд SQL, чем изменение поведения существующих, если только об этом не говорится в замечаниях к выпуску.

source: Library API
ru: API библиотек

source: Typically libraries like <application>libpq</application> only add new functionality, again unless mentioned in the release notes.
ru: Обычно библиотеки типа <application>libpq</application> только расширяют свою функциональность, если об обратном так же не говорится в замечаниях к выпуску.

source: System Catalogs
ru: Системные каталоги

source: System catalog changes usually only affect database management tools.
ru: Изменения в системных каталогах обычно влияют только на средства управления базами данных.

source: Server C-language API
ru: API сервера для кода на C

source: This involves changes in the backend function API, which is written in the C programming language. Such changes affect code that references backend functions deep inside the server.
ru: Сюда относятся изменения в API серверных функций, которые написаны на языке программирования C. Такие изменения затрагивают код, обращающийся к служебным функциям глубоко внутри сервера.

source: Upgrading Data via <application>pg_dumpall</application>
ru: Обновление данных с применением <application>pg_dumpall</application>

source: One upgrade method is to dump data from one major version of <productname>PostgreSQL</productname> and reload it in another &mdash; to do this, you must use a <emphasis>logical</emphasis> backup tool like <application>pg_dumpall</application>; file system level backup methods will not work. (There are checks in place that prevent you from using a data directory with an incompatible version of <productname>PostgreSQL</productname>, so no great harm can be done by trying to start the wrong server version on a data directory.)
ru: Один из вариантов обновления заключается в выгрузке данных из одной основной версии <productname>PostgreSQL</productname> и загрузке их в другую &mdash; для этого необходимо использовать средство <emphasis>логического</emphasis> копирования, например <application>pg_dumpall</application>; копирование на уровне файловой системы не подходит. (В самом сервере есть проверки, которые не дадут использовать каталог данных от несовместимой версии <productname>PostgreSQL</productname>, так что если попытаться запустить с существующим каталогом данных неправильную версию сервера, никакого вреда не будет.)

source: It is recommended that you use the <application>pg_dump</application> and <application>pg_dumpall</application> programs from the <emphasis>newer</emphasis> version of <productname>PostgreSQL</productname>, to take advantage of enhancements that might have been made in these programs. Current releases of the dump programs can read data from any server version back to 7.0.
ru: Для создания копии рекомендуется применять программы <application>pg_dump</application> и <application>pg_dumpall</application> от <emphasis>новой</emphasis> версии <productname>PostgreSQL</productname>, чтобы воспользоваться улучшенными функциями, которые могли в них появиться. Текущие версии этих программ способны читать данные любой версии сервера, начиная с 7.0.

source: These instructions assume that your existing installation is under the <filename>/usr/local/pgsql</filename> directory, and that the data area is in <filename>/usr/local/pgsql/data</filename>. Substitute your paths appropriately.
ru: В следующих указаниях предполагается, что сервер установлен в каталоге <filename>/usr/local/pgsql</filename>, а данные находятся в <filename>/usr/local/pgsql/data</filename>. Вам нужно подставить свои пути.

source: If making a backup, make sure that your database is not being updated. This does not affect the integrity of the backup, but the changed data would of course not be included. If necessary, edit the permissions in the file <filename>/usr/local/pgsql/data/pg_hba.conf</filename> (or equivalent) to disallow access from everyone except you. See <xref linkend="client-authentication"/> for additional information on access control.
ru: При запуске резервного копирования убедитесь в том, что в базе данных не производятся изменения. Изменения не повлияют на целостность полученной копии, но изменённые данные, само собой, в неё не попадут. Если потребуется, измените разрешения в файле <filename>/usr/local/pgsql/data/pg_hba.conf</filename> (или подобном), чтобы подключиться к серверу могли только вы. За дополнительными сведениями об управлении доступом обратитесь к <xref remap="3" linkend="client-authentication"/>.

source: <primary>pg_dumpall</primary> <secondary>use during upgrade</secondary>
ru: <primary>pg_dumpall</primary> <secondary>использование при обновлении</secondary>

source: <placeholder-1/> To back up your database installation, type: <screen> <userinput>pg_dumpall &gt; <replaceable>outputfile</replaceable></userinput> </screen>
ru: <placeholder-1/> Чтобы получить копию всех ваших данных, введите: <screen> <userinput>pg_dumpall &gt; <replaceable>выходной_файл</replaceable></userinput> </screen>

source: To make the backup, you can use the <application>pg_dumpall</application> command from the version you are currently running; see <xref linkend="backup-dump-all"/> for more details. For best results, however, try to use the <application>pg_dumpall</application> command from <productname>PostgreSQL</productname> &version;, since this version contains bug fixes and improvements over older versions. While this advice might seem idiosyncratic since you haven't installed the new version yet, it is advisable to follow it if you plan to install the new version in parallel with the old version. In that case you can complete the installation normally and transfer the data later. This will also decrease the downtime.
ru: Для создания резервной копии вы можете воспользоваться программой <application>pg_dumpall</application> от текущей версии сервера; за подробностями обратитесь к <xref remap="3" linkend="backup-dump-all"/>. Однако для лучшего результата стоит попробовать <application>pg_dumpall</application> из <productname>PostgreSQL</productname> &version;, так как в эту версию вошли исправления ошибок и усовершенствования, по сравнению с предыдущими версиями. Хотя этот совет может показаться абсурдным, ведь новая версия ещё не установлена, ему стоит последовать, если вы планируете установить новую версию рядом со старой. В этом случае вы сможете выполнить установку как обычно, а перенести данные позже. Это также сократит время обновления.

source: Shut down the old server: <screen> <userinput>pg_ctl stop</userinput> </screen> On systems that have <productname>PostgreSQL</productname> started at boot time, there is probably a start-up file that will accomplish the same thing. For example, on a <systemitem class="osname">Red Hat Linux</systemitem> system one might find that this works: <screen> <userinput>/etc/rc.d/init.d/postgresql stop</userinput> </screen> See <xref linkend="runtime"/> for details about starting and stopping the server.
ru: Остановите старый сервер: <screen> <userinput>pg_ctl stop</userinput> </screen> В системах, где <productname>PostgreSQL</productname> запускается при загрузке, должен быть скрипт запуска, с которым можно сделать то же самое. Например, в <systemitem class="osname">Red Hat Linux</systemitem> может сработать такой вариант: <screen> <userinput>/etc/rc.d/init.d/postgresql stop</userinput> </screen> Подробнее запуск и остановка сервера описаны в <xref remap="6" linkend="runtime"/>.

source: If restoring from backup, rename or delete the old installation directory if it is not version-specific. It is a good idea to rename the directory, rather than delete it, in case you have trouble and need to revert to it. Keep in mind the directory might consume significant disk space. To rename the directory, use a command like this: <screen> <userinput>mv /usr/local/pgsql /usr/local/pgsql.old</userinput> </screen> (Be sure to move the directory as a single unit so relative paths remain unchanged.)
ru: При восстановлении из резервной копии удалите или переименуйте старый каталог, где был установлен сервер, если его имя не привязано к версии. Разумнее будет переименовать каталог, а не удалять его, чтобы его можно было восстановить в случае проблем. Однако учтите, что этот каталог может занимать много места на диске. Переименовать каталог можно, например так: <screen> <userinput>mv /usr/local/pgsql /usr/local/pgsql.old</userinput> </screen> (Этот каталог нужно переименовывать (перемещать) как единое целое, чтобы относительные пути в нём не изменились.)

source: Install the new version of <productname>PostgreSQL</productname> as outlined in <phrase condition="standalone">the next section.</phrase> <phrase condition="default"><xref linkend="install-procedure"/>.</phrase>
ru: Установите новую версию <productname>PostgreSQL</productname> как описано в <phrase condition="standalone">следующем разделе.</phrase> <phrase condition="default"><xref remap="6" linkend="install-procedure"/>.</phrase>

source: Create a new database cluster if needed. Remember that you must execute these commands while logged in to the special database user account (which you already have if you are upgrading). <placeholder-1/>
ru: При необходимости создайте новый кластер баз данных. Помните, что следующие команды нужно выполнять под именем специального пользователя БД (вы уже действуете под этим именем, если производите обновление). <placeholder-1/>

source: Restore your previous <filename>pg_hba.conf</filename> and any <filename>postgresql.conf</filename> modifications.
ru: Перенесите изменения, внесённые в предыдущие версии <filename>pg_hba.conf</filename> и <filename>postgresql.conf</filename>.

source: Start the database server, again using the special database user account: <placeholder-1/>
ru: Запустите сервер баз данных, так же применяя учётную запись специального пользователя БД: <placeholder-1/>

source: Finally, restore your data from backup with: <screen> <userinput>/usr/local/pgsql/bin/psql -d postgres -f <replaceable>outputfile</replaceable></userinput> </screen> using the <emphasis>new</emphasis> <application>psql</application>.
ru: Наконец, восстановите данные из резервной копии, выполнив: <screen> <userinput>/usr/local/pgsql/bin/psql -d postgres -f <replaceable>выходной_файл</replaceable></userinput> </screen> (При этом будет использоваться <emphasis>новый</emphasis> <application>psql</application>.)

source: The least downtime can be achieved by installing the new server in a different directory and running both the old and the new servers in parallel, on different ports. Then you can use something like: <placeholder-1/> to transfer your data.
ru: Минимизировать время отключения сервера можно, установив новый сервер в другой каталог и запустив параллельно оба сервера, старый и новый, с разными портами. Затем можно будет перенести данные примерно так: <placeholder-1/>

source: Upgrading Data via <application>pg_upgrade</application>
ru: Обновление данных с применением <application>pg_upgrade</application>
