Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: if bytes, same as <varname>SHMMAX</varname>; if pages, <literal>ceil(SHMMAX/PAGE_SIZE)</literal>
ru: если в байтах, то же, что и <varname>SHMMAX</varname>; если в страницах, то <literal>ceil(SHMMAX/PAGE_SIZE)</literal>

source: Maximum number of shared memory segments per process
ru: Максимальное число сегментов разделяемой памяти для процесса

source: only 1 segment is needed, but the default is much higher
ru: требуется только 1 сегмент, но значение по умолчанию гораздо больше

source: Maximum number of shared memory segments system-wide
ru: Максимальное число сегментов разделяемой памяти для всей системы

source: like <varname>SHMSEG</varname> plus room for other applications
ru: как <varname>SHMSEG</varname> плюс потребность других приложений

source: Maximum number of semaphore identifiers (i.e., sets)
ru: Максимальное число идентификаторов семафоров (т. е., их наборов)

source: at least <literal>ceil((max_connections + autovacuum_max_workers + max_worker_processes + 5) / 16)</literal>
ru: как минимум <literal>ceil((max_connections + autovacuum_max_workers + max_worker_processes + 5) / 16)</literal>

source: Maximum number of semaphores system-wide
ru: Максимальное число семафоров для всей системы

source: <literal>ceil((max_connections + autovacuum_max_workers + max_worker_processes + 5) / 16) * 17</literal> plus room for other applications
ru: <literal>ceil((max_connections + autovacuum_max_workers + max_worker_processes + 5) / 16) * 17</literal> плюс потребность других приложений

source: Maximum number of semaphores per set
ru: Максимальное число семафоров в наборе

source: at least 17
ru: не меньше 17

source: Number of entries in semaphore map
ru: Число записей в карте семафоров

source: see text
ru: см. текст

source: Maximum value of semaphore
ru: Максимальное значение семафора

source: at least 1000 (The default is often 32767; do not change unless necessary)
ru: не меньше 1000 (по умолчанию оно обычно равно 32767; без необходимости менять его не следует)

source: <productname>PostgreSQL</productname> requires a few bytes of System V shared memory (typically 48 bytes, on 64-bit platforms) for each copy of the server. On most modern operating systems, this amount can easily be allocated. However, if you are running many copies of the server, or if other applications are also using System V shared memory, it may be necessary to increase <varname>SHMMAX</varname>, the maximum size in bytes of a shared memory segment, or <varname>SHMALL</varname>, the total amount of System V shared memory system-wide. Note that <varname>SHMALL</varname> is measured in pages rather than bytes on many systems.
ru: <productname>PostgreSQL</productname> запрашивает небольшой блок разделяемой памяти System V (обычно 48 байт на 64-битной платформе) для каждой копии сервера. В большинстве современных операционных систем такой объём выделяется без проблем. Однако, если запускать много копий сервера, или разделяемую память System V занимают и другие приложения, может понадобиться увеличить значение <varname>SHMMAX</varname>, максимальный размер сегмента разделяемой памяти (в байтах), либо <varname>SHMALL</varname>, общий объём разделяемой памяти System V, доступный для всей системы. Заметьте, что <varname>SHMALL</varname> во многих системах задаётся в страницах, а не в байтах.

source: Less likely to cause problems is the minimum size for shared memory segments (<varname>SHMMIN</varname>), which should be at most approximately 32 bytes for <productname>PostgreSQL</productname> (it is usually just 1). The maximum number of segments system-wide (<varname>SHMMNI</varname>) or per-process (<varname>SHMSEG</varname>) are unlikely to cause a problem unless your system has them set to zero.
ru: Менее вероятны проблемы с минимальным размером сегментов разделяемой памяти (<varname>SHMMIN</varname>), который для <productname>PostgreSQL</productname> не должен превышать примерно 32 байт (обычно это всего 1 байт). Максимальное число сегментов для всей системы (<varname>SHMMNI</varname>) или для одного процесса (<varname>SHMSEG</varname>) тоже обычно не влияет на работоспособность сервера, если только это число не равно нулю.

source: <productname>PostgreSQL</productname> uses one semaphore per allowed connection (<xref linkend="guc-max-connections"/>), allowed autovacuum worker process (<xref linkend="guc-autovacuum-max-workers"/>) and allowed background process (<xref linkend="guc-max-worker-processes"/>), in sets of 16. Each such set will also contain a 17th semaphore which contains a <quote>magic number</quote>, to detect collision with semaphore sets used by other applications. The maximum number of semaphores in the system is set by <varname>SEMMNS</varname>, which consequently must be at least as high as <varname>max_connections</varname> plus <varname>autovacuum_max_workers</varname> plus <varname>max_worker_processes</varname>, plus one extra for each 16 allowed connections plus workers (see the formula in <xref linkend="sysvipc-parameters"/>). The parameter <varname>SEMMNI</varname> determines the limit on the number of semaphore sets that can exist on the system at one time. Hence this parameter must be at least <literal>ceil((max_connections + autovacuum_max_workers + max_worker_processes + 5) / 16)</literal>. Lowering the number of allowed connections is a temporary workaround for failures, which are usually confusingly worded <quote>No space left on device</quote>, from the function <function>semget</function>.
ru: <productname>PostgreSQL</productname> использует по одному семафору на одно разрешённое подключение (<xref linkend="guc-max-connections"/>), на разрешённый рабочий процесс автоочистки (<xref linkend="guc-autovacuum-max-workers"/>) и фоновый процесс (<xref linkend="guc-max-worker-processes"/>), в наборах по 16. В каждом таком наборе есть также 17-ый семафор, содержащий <quote>магическое число</quote>, позволяющий обнаруживать коллизии с наборами семафоров других приложений. Максимальное число семафоров в системе задаётся параметром <varname>SEMMNS</varname>, который, следовательно, должен быть равен как минимум сумме <varname>max_connections</varname>, <varname>autovacuum_max_workers</varname> и <varname>max_worker_processes</varname>, плюс один дополнительный на каждые 16 семафоров подключений и рабочих процессов (см. формулу в <xref remap="6" linkend="sysvipc-parameters"/>). Параметр <varname>SEMMNI</varname> определяет максимальное число наборов семафоров, которые могут существовать в системе в один момент времени. Таким образом, этот параметр должен быть не меньше <literal>ceil((max_connections + autovacuum_max_workers + max_worker_processes + 5) / 16)</literal>. В качестве временного решения проблем, которые вызваны этими ограничениями, но обычно сопровождаются некорректными сообщениями, например, <quote>No space left on device</quote> (На устройстве не осталось места) от функции <function>semget</function>, можно уменьшить число разрешённых соединений.

source: In some cases it might also be necessary to increase <varname>SEMMAP</varname> to be at least on the order of <varname>SEMMNS</varname>. This parameter defines the size of the semaphore resource map, in which each contiguous block of available semaphores needs an entry. When a semaphore set is freed it is either added to an existing entry that is adjacent to the freed block or it is registered under a new map entry. If the map is full, the freed semaphores get lost (until reboot). Fragmentation of the semaphore space could over time lead to fewer available semaphores than there should be.
ru: В некоторых случаях может потребоваться увеличить <varname>SEMMAP</varname> как минимум до уровня <varname>SEMMNS</varname>. Этот параметр определяет размер карты ресурсов семафоров, в которой выделяется запись для каждого непрерывного блока семафоров. Когда набор семафоров освобождается, эта запись либо добавляется к существующей соседней записи, либо регистрируется как новая запись в карте. Если карта переполняется, освобождаемые семафоры теряются (до перезагрузки). Таким образом, фрагментация пространства семафоров может со времени привести к уменьшению числа доступных семафоров.

source: The <varname>SEMMSL</varname> parameter, which determines how many semaphores can be in a set, must be at least 17 for <productname>PostgreSQL</productname>.
ru: Параметр <varname>SEMMSL</varname>, определяющий, сколько семафоров может быть в одном наборе, для <productname>PostgreSQL</productname> должен равняться как минимум 17.

source: Various other settings related to <quote>semaphore undo</quote>, such as <varname>SEMMNU</varname> and <varname>SEMUME</varname>, do not affect <productname>PostgreSQL</productname>.
ru: Другие параметры, связанные с <quote>аннулированием операций</quote> с семафорами, например, <varname>SEMMNU</varname> и <varname>SEMUME</varname>, на работу <productname>PostgreSQL</productname> не влияют.

source: <primary>AIX</primary><secondary>IPC configuration</secondary>
ru: <primary>AIX</primary> <secondary>настройка IPC</secondary>

source: At least as of version 5.1, it should not be necessary to do any special configuration for such parameters as <varname>SHMMAX</varname>, as it appears this is configured to allow all memory to be used as shared memory. That is the sort of configuration commonly used for other databases such as <application>DB/2</application>.
ru: Как минимум с версии 5.1, для таких параметров, как <varname>SHMMAX</varname>, никакая дополнительная настройка не должна требоваться, так как система, похоже, позволяет использовать всю память в качестве разделяемой. Подобная конфигурация требуется обычно и для других баз данных, например, для <application>DB/2</application>.

source: It might, however, be necessary to modify the global <command>ulimit</command> information in <filename>/etc/security/limits</filename>, as the default hard limits for file sizes (<varname>fsize</varname>) and numbers of files (<varname>nofiles</varname>) might be too low.
ru: Однако может понадобиться изменить глобальные параметры <command>ulimit</command> в <filename>/etc/security/limits</filename>, так как стандартные жёсткие ограничения на размер (<varname>fsize</varname>) и количество файлов (<varname>nofiles</varname>) могут быть недостаточно большими.

source: <primary>FreeBSD</primary><secondary>IPC configuration</secondary>
ru: <primary>FreeBSD</primary> <secondary>настройка IPC</secondary>

source: The default settings can be changed using the <command>sysctl</command> or <command>loader</command> interfaces. The following parameters can be set using <command>sysctl</command>: <screen> <prompt>#</prompt> <userinput>sysctl kern.ipc.shmall=32768</userinput> <prompt>#</prompt> <userinput>sysctl kern.ipc.shmmax=134217728</userinput> </screen> To make these settings persist over reboots, modify <filename>/etc/sysctl.conf</filename>.
ru: Значения по умолчанию можно изменить, используя возможности <command>sysctl</command> или <command>loader</command>. С помощью <command>sysctl</command> можно задать следующие параметры: <screen> <prompt>#</prompt> <userinput>sysctl kern.ipc.shmall=32768</userinput> <prompt>#</prompt> <userinput>sysctl kern.ipc.shmmax=134217728</userinput> </screen> Чтобы эти изменения сохранялись после перезагрузки, измените <filename>/etc/sysctl.conf</filename>.

source: These semaphore-related settings are read-only as far as <command>sysctl</command> is concerned, but can be set in <filename>/boot/loader.conf</filename>: <placeholder-1/> After modifying these values a reboot is required for the new settings to take effect. (Note: FreeBSD does not use <varname>SEMMAP</varname>. Older versions would accept but ignore a setting for <literal>kern.ipc.semmap</literal>; newer versions reject it altogether.)
ru: Эти параметры, связанные с семафорами, <command>sysctl</command> менять не позволяет, но их можно задать в <filename>/boot/loader.conf</filename>: <placeholder-1/> Чтобы изменённые таким образом параметры вступили в силу, требуется перезагрузить систему. (Заметьте, что во FreeBSD нет параметра <varname>SEMMAP</varname>. В старых версиях значение для <literal>kern.ipc.semmap</literal> принималось, но игнорировалось; новые версии его не принимают.)

source: You might also want to configure your kernel to lock shared memory into RAM and prevent it from being paged out to swap. This can be accomplished using the <command>sysctl</command> setting <literal>kern.ipc.shm_use_phys</literal>.
ru: Возможно, вы захотите настроить ядро так, чтобы разделяемая память всегда находилась в ОЗУ и никогда не выгружалась в пространство подкачки. Это можно сделать, установив с помощью <command>sysctl</command> параметр <literal>kern.ipc.shm_use_phys</literal>.

source: If running in FreeBSD jails by enabling <application>sysctl</application>'s <literal>security.jail.sysvipc_allowed</literal>, <application>postmaster</application>s running in different jails should be run by different operating system users. This improves security because it prevents non-root users from interfering with shared memory or semaphores in different jails, and it allows the PostgreSQL IPC cleanup code to function properly. (In FreeBSD 6.0 and later the IPC cleanup code does not properly detect processes in other jails, preventing the running of postmasters on the same port in different jails.)
ru: Если вы используете &laquo;камеры&raquo; FreeBSD, включив в <application>sysctl</application> параметр <literal>security.jail.sysvipc_allowed</literal>, главные процессы <application>postmaster</application>, работающие в разных камерах, должны запускаться разными пользователями операционной системы. Это усиливает защиту, так как не позволяет обычным пользователям обращаться к разделяемой памяти или семафорам в разных камерах, и при этом способствует корректной работе кода очистки IPC в PostgreSQL. (Во FreeBSD 6.0 и более поздних версиях код очистки IPC не может корректно выявить процессы в других камерах, что не позволяет запускать процессы postmaster на одном порту в разных камерах.)

source: <systemitem class="osname">FreeBSD</systemitem> versions before 4.0 work like <systemitem class="osname">OpenBSD</systemitem> (see below).
ru: До версии 4.0 система <systemitem class="osname">FreeBSD</systemitem> работала так же, как сейчас <systemitem class="osname">OpenBSD</systemitem> (см. ниже).

source: <primary>NetBSD</primary><secondary>IPC configuration</secondary>
ru: <primary>NetBSD</primary> <secondary>настройка IPC</secondary>

source: In <systemitem class="osname">NetBSD</systemitem> 5.0 and later, IPC parameters can be adjusted using <command>sysctl</command>, for example: <screen> <prompt>$</prompt> <userinput>sysctl -w kern.ipc.shmmax=16777216</userinput> </screen> To have these settings persist over reboots, modify <filename>/etc/sysctl.conf</filename>.
ru: В <systemitem class="osname">NetBSD</systemitem>, начиная с версии 5.0, параметры IPC можно изменить, воспользовавшись командой <command>sysctl</command>, например: <screen> <prompt>$</prompt> <userinput>sysctl -w kern.ipc.shmmax=16777216</userinput> </screen> Чтобы эти параметры сохранялись после перезагрузки, измените <filename>/etc/sysctl.conf</filename>.

source: <systemitem class="osname">NetBSD</systemitem> versions before 5.0 work like <systemitem class="osname">OpenBSD</systemitem> (see below), except that parameters should be set with the keyword <literal>options</literal> not <literal>option</literal>.
ru: До версии 5.0 система <systemitem class="osname">NetBSD</systemitem> работала так же, как сейчас <systemitem class="osname">OpenBSD</systemitem> (см. ниже), за исключением того, что параметры устанавливаются с указанием <literal>options</literal>, а не <literal>option</literal>.

source: <primary>OpenBSD</primary><secondary>IPC configuration</secondary>
ru: <primary>OpenBSD</primary> <secondary>настройка IPC</secondary>

source: The options <varname>SYSVSHM</varname> and <varname>SYSVSEM</varname> need to be enabled when the kernel is compiled. (They are by default.) The maximum size of shared memory is determined by the option <varname>SHMMAXPGS</varname> (in pages). The following shows an example of how to set the various parameters: <placeholder-1/>
ru: При компиляции ядра должны быть включены механизмы <varname>SYSVSHM</varname> и <varname>SYSVSEM</varname>. (По умолчанию они включены.) Максимальный размер разделяемой памяти определяется параметром <varname>SHMMAXPGS</varname> (в страницах). Ниже показан пример, как установить следующие параметры: <placeholder-1/>

source: <primary>HP-UX</primary><secondary>IPC configuration</secondary>
ru: <primary>HP-UX</primary> <secondary>настройка IPC</secondary>

source: The default settings tend to suffice for normal installations. On <productname>HP-UX</productname> 10, the factory default for <varname>SEMMNS</varname> is 128, which might be too low for larger database sites.
ru: Значения по умолчанию обычно вполне удовлетворяют средним потребностям. В <productname>HP-UX</productname> 10 параметр <varname>SEMMNS</varname> по умолчанию имеет значение 128, что может быть недостаточно для больших баз данных.

source: <acronym>IPC</acronym> parameters can be set in the <application>System Administration Manager</application> (<acronym>SAM</acronym>) under <menuchoice><guimenu>Kernel Configuration</guimenu><guimenuitem>Configurable Parameters</guimenuitem></menuchoice>. Choose <guibutton>Create A New Kernel</guibutton> when you're done.
ru: Параметры <acronym>IPC</acronym> можно установить в менеджере системного администрирования (<application>System Administration Manager</application>, <acronym>SAM</acronym>) в разделе <menuchoice><guimenu>Kernel Configuration (Настройка ядра)</guimenu><guimenuitem>Configurable Parameters (Настраиваемые параметры)</guimenuitem></menuchoice>. Установив нужные параметры, выполните операцию <guibutton>Create A New Kernel</guibutton> (Создать ядро).

source: <primary>Linux</primary><secondary>IPC configuration</secondary>
ru: <primary>Linux</primary> <secondary>настройка IPC</secondary>

source: The default maximum segment size is 32 MB, and the default maximum total size is 2097152 pages. A page is almost always 4096 bytes except in unusual kernel configurations with <quote>huge pages</quote> (use <literal>getconf PAGE_SIZE</literal> to verify).
ru: По умолчанию максимальный размер сегмента равен 32 МБ, а максимальный общий размер составляет 2097152 страниц. Страница почти всегда содержит 4096 байт, за исключением нестандартных конфигураций ядра с поддержкой <quote>огромных страниц</quote> (точно узнать размер страницы можно, выполнив <literal>getconf PAGE_SIZE</literal>).

source: The shared memory size settings can be changed via the <command>sysctl</command> interface. For example, to allow 16 GB: <screen> <prompt>$</prompt> <userinput>sysctl -w kernel.shmmax=17179869184</userinput> <prompt>$</prompt> <userinput>sysctl -w kernel.shmall=4194304</userinput> </screen> In addition these settings can be preserved between reboots in the file <filename>/etc/sysctl.conf</filename>. Doing that is highly recommended.
ru: Параметры размера разделяемой памяти можно изменить, воспользовавшись командой <command>sysctl</command>. Например, так можно выделить 16 ГБ для разделяемой памяти: <screen> <prompt>$</prompt> <userinput>sysctl -w kernel.shmmax=17179869184</userinput> <prompt>$</prompt> <userinput>sysctl -w kernel.shmall=4194304</userinput> </screen> Чтобы сохранить эти изменения после перезагрузки, их также можно записать в файл <filename>/etc/sysctl.conf</filename> (это настоятельно рекомендуется).

source: Ancient distributions might not have the <command>sysctl</command> program, but equivalent changes can be made by manipulating the <filename>/proc</filename> file system: <screen> <prompt>$</prompt> <userinput>echo 17179869184 &gt;/proc/sys/kernel/shmmax</userinput> <prompt>$</prompt> <userinput>echo 4194304 &gt;/proc/sys/kernel/shmall</userinput> </screen>
ru: В некоторых старых дистрибутивах может не оказаться программы <command>sysctl</command>, но те же изменения можно произвести, обратившись к файловой системе <filename>/proc</filename>: <screen> <prompt>$</prompt> <userinput>echo 17179869184 &gt;/proc/sys/kernel/shmmax</userinput> <prompt>$</prompt> <userinput>echo 4194304 &gt;/proc/sys/kernel/shmall</userinput> </screen>

source: The remaining defaults are quite generously sized, and usually do not require changes.
ru: Остальные параметры имеют вполне подходящие значения, так что их обычно менять не нужно.

source: <primary>OS X</primary><secondary>IPC configuration</secondary>
ru: <primary>OS X</primary> <secondary>настройка IPC</secondary>

source: The recommended method for configuring shared memory in OS X is to create a file named <filename>/etc/sysctl.conf</filename>, containing variable assignments such as: <placeholder-1/> Note that in some OS X versions, <emphasis>all five</emphasis> shared-memory parameters must be set in <filename>/etc/sysctl.conf</filename>, else the values will be ignored.
ru: Для настройки разделяемой памяти в OS X рекомендуется создать файл <filename>/etc/sysctl.conf</filename> и записать в него присвоения переменных следующим образом: <placeholder-1/> Заметьте, что в некоторых версиях OS X, <emphasis>все пять</emphasis> параметров разделяемой памяти должны быть установлены в <filename>/etc/sysctl.conf</filename>, иначе их значения будут проигнорированы.

source: Beware that recent releases of OS X ignore attempts to set <varname>SHMMAX</varname> to a value that isn't an exact multiple of 4096.
ru: Имейте в виду, что последние версии OS X игнорируют попытки задать для <varname>SHMMAX</varname> значение, не кратное 4096.

source: <varname>SHMALL</varname> is measured in 4 kB pages on this platform.
ru: <varname>SHMALL</varname> на этой платформе измеряется в страницах (по 4 КБ).

source: In older OS X versions, you will need to reboot to have changes in the shared memory parameters take effect. As of 10.5 it is possible to change all but <varname>SHMMNI</varname> on the fly, using <application>sysctl</application>. But it's still best to set up your preferred values via <filename>/etc/sysctl.conf</filename>, so that the values will be kept across reboots.
ru: В старых версиях OS X, чтобы изменения параметров разделяемой памяти вступили в силу, требовалась перезагрузка. Начиная с версии 10.5, все параметры, кроме <varname>SHMMNI</varname> можно изменить &laquo;на лету&raquo;, воспользовавшись командой <application>sysctl</application>. Но, тем не менее, лучше задавать выбранные вами значения в <filename>/etc/sysctl.conf</filename>, чтобы они сохранялись после перезагрузки.

source: The file <filename>/etc/sysctl.conf</filename> is only honored in OS X 10.3.9 and later. If you are running a previous 10.3.x release, you must edit the file <filename>/etc/rc</filename> and change the values in the following commands: <placeholder-1/> Note that <filename>/etc/rc</filename> is usually overwritten by OS X system updates, so you should expect to have to redo these edits after each update.
ru: Файл <filename>/etc/sysctl.conf</filename> обрабатывается, только начиная с OS X версии 10.3.9. Если вы используете предыдущий выпуск 10.3.x, необходимо отредактировать файл <filename>/etc/rc</filename> и задать значения следующими командами: <placeholder-1/> Заметьте, что <filename>/etc/rc</filename> обычно заменяется при обновлении системы OS X, так что следует ожидать, что вам придётся повторять эти изменения после каждого обновления.

source: In OS X 10.2 and earlier, instead edit these commands in the file <filename>/System/Library/StartupItems/SystemTuning/SystemTuning</filename>.
ru: В OS X 10.2 и более ранних версиях вместо этого надо записать эти команды в файле <filename>/System/Library/StartupItems/SystemTuning/SystemTuning</filename>.
