Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: Server Setup and Operation
ru: Подготовка к работе и сопровождение сервера

source: This chapter discusses how to set up and run the database server and its interactions with the operating system.
ru: В этой главе рассказывается, как организовать работу сервера баз данных и его взаимодействие с операционной системой, а также о некоторых задачах сопровождения.

source: The <productname>PostgreSQL</productname> User Account
ru: Учётная запись пользователя <productname>PostgreSQL</productname>

source: <primary>postgres user</primary>
ru: <primary>пользователь postgres</primary>

source: As with any server daemon that is accessible to the outside world, it is advisable to run <productname>PostgreSQL</productname> under a separate user account. This user account should only own the data that is managed by the server, and should not be shared with other daemons. (For example, using the user <literal>nobody</literal> is a bad idea.) It is not advisable to install executables owned by this user because compromised systems could then modify their own binaries.
ru: Как и любую другую службу, доступную для внешнего мира, <productname>PostgreSQL</productname> рекомендуется запускать под именем отдельного пользователя. Эта учётная запись должна владеть только данными, которыми управляет сервер, и разделять её с другими службами не следует. (Например, не стоит использовать для этого пользователя <literal>nobody</literal>.) Также рекомендуется не устанавливать под именем этого пользователя исполняемые файлы, чтобы их нельзя было подменить в случае компрометации системы.

source: To add a Unix user account to your system, look for a command <command>useradd</command> or <command>adduser</command>. The user name <systemitem>postgres</systemitem> is often used, and is assumed throughout this book, but you can use another name if you like.
ru: Для создания пользователя в Unix-подобной системе следует искать команду <command>useradd</command> или <command>adduser</command>. В качестве имени пользователя часто используется <systemitem>postgres</systemitem>, и именно это имя предполагается в данной документации, но вы можете выбрать и другое, если захотите.

source: Creating a Database Cluster
ru: Создание кластера баз данных

source: <primary>database cluster</primary>
ru: <primary>кластер баз данных</primary>

source: <primary>data area</primary> <see>database cluster</see>
ru: <primary>область данных</primary> <see>кластер баз данных</see>

source: Before you can do anything, you must initialize a database storage area on disk. We call this a <firstterm>database cluster</firstterm>. (The <acronym>SQL</acronym> standard uses the term catalog cluster.) A database cluster is a collection of databases that is managed by a single instance of a running database server. After initialization, a database cluster will contain a database named <literal>postgres</literal>, which is meant as a default database for use by utilities, users and third party applications. The database server itself does not require the <literal>postgres</literal> database to exist, but many external utility programs assume it exists. Another database created within each cluster during initialization is called <literal>template1</literal>. As the name suggests, this will be used as a template for subsequently created databases; it should not be used for actual work. (See <xref linkend="managing-databases"/> for information about creating new databases within a cluster.)
ru: Прежде чем вы сможете работать с базами данных, вы должны проинициализировать область хранения баз данных на диске. Мы называем это хранилище <firstterm>кластером баз данных</firstterm>. (В <acronym>SQL</acronym> применяется термин &laquo;кластер каталога&raquo;.) Кластер баз данных представляет собой набор баз, управляемых одним экземпляром работающего сервера. После инициализации кластер будет содержать базу данных с именем <literal>postgres</literal>, предназначенную для использования по умолчанию утилитами, пользователями и сторонними приложениями. Сам сервер баз данных не требует наличия базы <literal>postgres</literal>, но многие внешние вспомогательные программы рассчитывают на её существование. При инициализации в каждом кластере создаётся ещё одна база, с именем <literal>template1</literal>. Как можно понять из имени, она применяется впоследствии в качестве шаблона создаваемых баз данных; использовать её в качестве рабочей не следует. (За информацией о создании новых баз данных в кластере обратитесь к <xref remap="3" linkend="managing-databases"/>.)

source: In file system terms, a database cluster is a single directory under which all data will be stored. We call this the <firstterm>data directory</firstterm> or <firstterm>data area</firstterm>. It is completely up to you where you choose to store your data. There is no default, although locations such as <filename>/usr/local/pgsql/data</filename> or <filename>/var/lib/pgsql/data</filename> are popular. To initialize a database cluster, use the command <xref linkend="app-initdb"/>,<placeholder-1/> which is installed with <productname>PostgreSQL</productname>. The desired file system location of your database cluster is indicated by the <option>-D</option> option, for example: <screen> <prompt>$</prompt> <userinput>initdb -D /usr/local/pgsql/data</userinput> </screen> Note that you must execute this command while logged into the <productname>PostgreSQL</productname> user account, which is described in the previous section.
ru: С точки зрения файловой системы, кластер баз данных представляет собой один каталог, в котором будут храниться все данные. Мы называем его <firstterm>каталогом данных</firstterm> или <firstterm>областью данных</firstterm>. Где именно хранить данные, вы абсолютно свободно можете выбирать сами. Какого-либо стандартного пути не существует, но часто данные размещаются в <filename>/usr/local/pgsql/data</filename> или в <filename>/var/lib/pgsql/data</filename>. Для инициализации кластера баз данных применяется команда <xref linkend="app-initdb"/>,<placeholder-1/> которая устанавливается в составе <productname>PostgreSQL</productname>. Расположение кластера базы данных в файловой системе задаётся параметром <option>-D</option>, например: <screen> <prompt>$</prompt> <userinput>initdb -D /usr/local/pgsql/data</userinput> </screen> Заметьте, что эту команду нужно выполнять от имени учётной записи <productname>PostgreSQL</productname>, о которой говорится в предыдущем разделе.

source: As an alternative to the <option>-D</option> option, you can set the environment variable <envar>PGDATA</envar>. <placeholder-1/>
ru: В качестве альтернативы параметра <option>-D</option> можно установить переменную окружения <envar>PGDATA</envar>. <placeholder-1/>

source: Alternatively, you can run <command>initdb</command> via the <xref linkend="app-pg-ctl"/> program<placeholder-1/> like so: <screen> <prompt>$</prompt> <userinput>pg_ctl -D /usr/local/pgsql/data initdb</userinput> </screen> This may be more intuitive if you are using <command>pg_ctl</command> for starting and stopping the server (see <xref linkend="server-start"/>), so that <command>pg_ctl</command> would be the sole command you use for managing the database server instance.
ru: Также можно запустить команду <command>initdb</command>, воспользовавшись программой <xref linkend="app-pg-ctl"/> <placeholder-1/>, примерно так: <screen> <prompt>$</prompt> <userinput>pg_ctl -D /usr/local/pgsql/data initdb</userinput> </screen> Этот вариант может быть удобнее, если вы используете <command>pg_ctl</command> для запуска и остановки сервера (см. <xref remap="4" linkend="server-start"/>), так как <command>pg_ctl</command> будет единственной командой, с помощью которой вы будете управлять экземпляром сервера баз данных.

source: <command>initdb</command> will attempt to create the directory you specify if it does not already exist. Of course, this will fail if <command>initdb</command> does not have permissions to write in the parent directory. It's generally recommendable that the <productname>PostgreSQL</productname> user own not just the data directory but its parent directory as well, so that this should not be a problem. If the desired parent directory doesn't exist either, you will need to create it first, using root privileges if the grandparent directory isn't writable. So the process might look like this: <screen> root# <userinput>mkdir /usr/local/pgsql</userinput> root# <userinput>chown postgres /usr/local/pgsql</userinput> root# <userinput>su postgres</userinput> postgres$ <userinput>initdb -D /usr/local/pgsql/data</userinput> </screen>
ru: Команда <command>initdb</command> попытается создать указанный вами каталог, если он не существует. Конечно, она не сможет это сделать, если <command>initdb</command> не будет разрешено записывать в родительский каталог. Вообще рекомендуется, чтобы пользователь <productname>PostgreSQL</productname> был владельцем не только каталога данных, но и родительского каталога, так что такой проблемы быть не должно. Если же и нужный родительский каталог не существует, вам нужно будет сначала создать его, используя права root, если вышестоящий каталог защищён от записи. Таким образом, процедура может быть такой: <screen> root# <userinput>mkdir /usr/local/pgsql</userinput> root# <userinput>chown postgres /usr/local/pgsql</userinput> root# <userinput>su postgres</userinput> postgres$ <userinput>initdb -D /usr/local/pgsql/data</userinput> </screen>

source: <command>initdb</command> will refuse to run if the data directory exists and already contains files; this is to prevent accidentally overwriting an existing installation.
ru: Команда <command>initdb</command> не будет работать, если указанный каталог данных уже существует и содержит файлы; это мера предохранения от случайной перезаписи существующей инсталляции.

source: Because the data directory contains all the data stored in the database, it is essential that it be secured from unauthorized access. <command>initdb</command> therefore revokes access permissions from everyone but the <productname>PostgreSQL</productname> user.
ru: Так как каталог данных содержит все данные базы, очень важно защитить его от неавторизованного доступа. Для этого <command>initdb</command> лишает прав доступа к нему всех пользователей, кроме пользователя <productname>PostgreSQL</productname>.

source: <primary>password</primary> <secondary>of the superuser</secondary>
ru: <primary>пароль</primary> <secondary>суперпользователя</secondary>

source: However, while the directory contents are secure, the default client authentication setup allows any local user to connect to the database and even become the database superuser. If you do not trust other local users, we recommend you use one of <command>initdb</command>'s <option>-W</option>, <option>--pwprompt</option> or <option>--pwfile</option> options to assign a password to the database superuser.<placeholder-1/> Also, specify <option>-A md5</option> or <option>-A password</option> so that the default <literal>trust</literal> authentication mode is not used; or modify the generated <filename>pg_hba.conf</filename> file after running <command>initdb</command>, but <emphasis>before</emphasis> you start the server for the first time. (Other reasonable approaches include using <literal>peer</literal> authentication or file system permissions to restrict connections. See <xref linkend="client-authentication"/> for more information.)
ru: Однако, даже когда содержимое каталога защищено, если проверка подлинности клиентов настроена по умолчанию, любой локальный пользователь может подключиться к базе данных и даже стать суперпользователем. Если вы не доверяете другим локальным пользователям, мы рекомендуем использовать один из параметров команды <command>initdb</command>: <option>-W</option>, <option>--pwprompt</option> или <option>--pwfile</option> и назначить пароль суперпользователя баз данных. <placeholder-1/> Кроме того, воспользуйтесь параметром <option>-A md5</option> или <option>-A password</option> и отключите разрешённый по умолчанию режим аутентификации <literal>trust</literal>; либо измените сгенерированный файл <filename>pg_hba.conf</filename> после выполнения <command>initdb</command>, но <emphasis>перед</emphasis> тем, как запустить сервер в первый раз. (Возможны и другие разумные подходы — применить режим проверки подлинности <literal>peer</literal> или ограничить подключения на уровне файловой системы. За дополнительными сведениями обратитесь к <xref remap="3" linkend="client-authentication"/>.)

source: <primary>locale</primary>
ru: <primary>локаль</primary>

source: <command>initdb</command> also initializes the default locale<placeholder-1/> for the database cluster. Normally, it will just take the locale settings in the environment and apply them to the initialized database. It is possible to specify a different locale for the database; more information about that can be found in <xref linkend="locale"/>. The default sort order used within the particular database cluster is set by <command>initdb</command>, and while you can create new databases using different sort order, the order used in the template databases that initdb creates cannot be changed without dropping and recreating them. There is also a performance impact for using locales other than <literal>C</literal> or <literal>POSIX</literal>. Therefore, it is important to make this choice correctly the first time.
ru: Команда <command>initdb</command> также устанавливает для кластера баз данных локаль <placeholder-1/> по умолчанию. Обычно она просто берёт параметры локали из текущего окружения и применяет их к инициализируемой базе данных. Однако можно выбрать и другую локаль для базы данных; за дополнительной информацией обратитесь к <xref remap="3" linkend="locale"/>. Команда <command>initdb</command> задаёт порядок сортировки по умолчанию для применения в определённом кластере баз данных, и хотя новые базы данных могут создаваться с иным порядком сортировки, порядок в базах-шаблонах, создаваемых initdb, можно изменить, только если удалить и пересоздать их. Также учтите, что при использовании локалей, отличных от <literal>C</literal> и <literal>POSIX</literal>, возможно снижение производительности. Поэтому важно правильно выбрать локаль с самого начала.

source: <command>initdb</command> also sets the default character set encoding for the database cluster. Normally this should be chosen to match the locale setting. For details see <xref linkend="multibyte"/>.
ru: Команда <command>initdb</command> также задаёт кодировку символов по умолчанию для кластера баз данных. Обычно она должна соответствовать кодировке локали. За подробностями обратитесь к <xref remap="3" linkend="multibyte"/>.

source: Non-<literal>C</literal> and non-<literal>POSIX</literal> locales rely on the operating system's collation library for character set ordering. This controls the ordering of keys stored in indexes. For this reason, a cluster cannot switch to an incompatible collation library version, either through snapshot restore, binary streaming replication, a different operating system, or an operating system upgrade.
ru: Для локалей, отличных от <literal>C</literal> и <literal>POSIX</literal>, порядок сортировки символов зависит от системной библиотеки локализации, а он, в свою очередь, влияет на порядок ключей в индексах. Поэтому кластер нельзя перевести на несовместимую версию библиотеки ни путём восстановления снимка, ни через двоичную репликацию, ни перейдя на другую операционную систему или обновив её версию.

source: Use of Secondary File Systems
ru: Использование дополнительных файловых систем

source: <primary>file system mount points</primary>
ru: <primary>точки монтирования файловых систем</primary>

source: Many installations create their database clusters on file systems (volumes) other than the machine's <quote>root</quote> volume. If you choose to do this, it is not advisable to try to use the secondary volume's topmost directory (mount point) as the data directory. Best practice is to create a directory within the mount-point directory that is owned by the <productname>PostgreSQL</productname> user, and then create the data directory within that. This avoids permissions problems, particularly for operations such as <application>pg_upgrade</application>, and it also ensures clean failures if the secondary volume is taken offline.
ru: Во многих инсталляциях кластеры баз данных создаются не в <quote>корневом</quote> томе, а в отдельных файловых системах (томах). Если вы решите сделать так же, то не следует выбирать в качестве каталога данных самый верхний каталог дополнительного тома (точку монтирования). Лучше всего создать внутри каталога точки монтирования каталог, принадлежащий пользователю <productname>PostgreSQL</productname>, а затем создать внутри него каталог данных. Это исключит проблемы с разрешениями, особенно для таких операций, как <application>pg_upgrade</application>, и при этом гарантирует чистое поведение в случае, если дополнительный том окажется отключён.

source: Use of Network File Systems
ru: Использование сетевых файловых систем

source: <primary>Network File Systems</primary>
ru: <primary>Сетевые файловые системы</primary>

source: <primary><acronym>NFS</acronym></primary><see>Network File Systems</see>
ru: <primary><acronym>NFS</acronym></primary> <see>Сетевые файловые системы</see>

source: <primary>Network Attached Storage (<acronym>NAS</acronym>)</primary><see>Network File Systems</see>
ru: <primary>Сетевые хранилища (<acronym>NAS</acronym>)</primary> <see>Сетевые файловые системы</see>

source: Many installations create their database clusters on network file systems. Sometimes this is done via <acronym>NFS</acronym>, or by using a Network Attached Storage (<acronym>NAS</acronym>) device that uses <acronym>NFS</acronym> internally. <productname>PostgreSQL</productname> does nothing special for <acronym>NFS</acronym> file systems, meaning it assumes <acronym>NFS</acronym> behaves exactly like locally-connected drives. If the client or server <acronym>NFS</acronym> implementation does not provide standard file system semantics, this can cause reliability problems (see <ulink url="http://www.time-travellers.org/shane/papers/NFS_considered_harmful.html"/>). Specifically, delayed (asynchronous) writes to the <acronym>NFS</acronym> server can cause data corruption problems. If possible, mount the <acronym>NFS</acronym> file system synchronously (without caching) to avoid this hazard. Also, soft-mounting the <acronym>NFS</acronym> file system is not recommended.
ru: Во многих инсталляциях кластеры баз данных создаются в сетевых файловых ресурсах. Иногда это реализуется с применением сетевой файловой системы (<acronym>NFS</acronym>, Network File System) или сетевых хранилищ (<acronym>NAS</acronym>, Network Attached Storage), использующих <acronym>NFS</acronym> внутри. <productname>PostgreSQL</productname> не делает ничего специфического с файловыми системами <acronym>NFS</acronym>, то есть он предполагает, что <acronym>NFS</acronym> работает точно так же, как и локально подключённые диски. Но если реализация клиента или сервера <acronym>NFS</acronym> не обеспечивает стандартное поведение файловой системы, это чревато нестабильной работой (см. <ulink url="http://www.time-travellers.org/shane/papers/NFS_considered_harmful.html"/>). В частности, возможно разрушение данных при отложенной (асинхронной) записи на сервер <acronym>NFS</acronym>. Поэтому, по возможности, во избежание таких проблем монтируйте файловые системы <acronym>NFS</acronym> в синхронном режиме (без кеширования). Кроме того, не рекомендуется применять мягкое монтирование файловой системы <acronym>NFS</acronym>.

source: Storage Area Networks (<acronym>SAN</acronym>) typically use communication protocols other than <acronym>NFS</acronym>, and may or may not be subject to hazards of this sort. It's advisable to consult the vendor's documentation concerning data consistency guarantees. <productname>PostgreSQL</productname> cannot be more reliable than the file system it's using.
ru: В сетях хранения данных (<acronym>SAN</acronym>, Storage Area Networks) обычно используются собственные протоколы, не <acronym>NFS</acronym>, и они могут быть не подвержены (а могут быть и подвержены) этим рискам. По вопросам гарантии согласованности данных обратитесь к документации производителя. <productname>PostgreSQL</productname> не может быть надёжнее файловой системы, которую он использует.

source: Starting the Database Server
ru: Запуск сервера баз данных

source: Before anyone can access the database, you must start the database server. The database server program is called <command>postgres</command>.<placeholder-1/> The <command>postgres</command> program must know where to find the data it is supposed to use. This is done with the <option>-D</option> option. Thus, the simplest way to start the server is: <screen> $ <userinput>postgres -D /usr/local/pgsql/data</userinput> </screen> which will leave the server running in the foreground. This must be done while logged into the <productname>PostgreSQL</productname> user account. Without <option>-D</option>, the server will try to use the data directory named by the environment variable <envar>PGDATA</envar>. If that variable is not provided either, it will fail.
ru: Чтобы кто-либо смог обратиться к базе данных, необходимо сначала запустить сервер баз данных. Программа сервера называется <command>postgres</command>.<placeholder-1/> Для работы программа <command>postgres</command> должна знать, где найти данные, которые она будет использовать. Указать это местоположение позволяет параметр <option>-D</option>. Таким образом, проще всего запустить сервер, выполнив команду: <screen> $ <userinput>postgres -D /usr/local/pgsql/data</userinput> </screen> в результате которой сервер продолжит работу в качестве процесса переднего плана. Запускать эту команду следует под именем учётной записи <productname>PostgreSQL</productname>. Без параметра <option>-D</option> сервер попытается использовать каталог данных, указанный в переменной окружения <envar>PGDATA</envar>. Если и эта переменная не определена, сервер не будет запущен.

source: Normally it is better to start <command>postgres</command> in the background. For this, use the usual Unix shell syntax: <screen> $ <userinput>postgres -D /usr/local/pgsql/data &gt;logfile 2&gt;&amp;1 &amp;</userinput> </screen> It is important to store the server's <systemitem>stdout</systemitem> and <systemitem>stderr</systemitem> output somewhere, as shown above. It will help for auditing purposes and to diagnose problems. (See <xref linkend="logfile-maintenance"/> for a more thorough discussion of log file handling.)
ru: Однако обычно лучше запускать <command>postgres</command> в фоновом режиме. Для этого можно применить обычный синтаксис, принятый в оболочке Unix: <screen> $ <userinput>postgres -D /usr/local/pgsql/data &gt;logfile 2&gt;&amp;1 &amp;</userinput> </screen> Важно где-либо сохранять информацию, которую выводит сервер в каналы <systemitem>stdout</systemitem> и <systemitem>stderr</systemitem>, как показано выше. Это полезно и для целей аудита, и для диагностики проблем. (Более глубоко работа с файлами журналов рассматривается в <xref remap="6" linkend="logfile-maintenance"/>.)

source: The <command>postgres</command> program also takes a number of other command-line options. For more information, see the <xref linkend="app-postgres"/> reference page and <xref linkend="runtime-config"/> below.
ru: Программа <command>postgres</command> также принимает несколько других параметров командной строки. За дополнительными сведениями обратитесь к справочной странице <xref linkend="app-postgres"/> и к следующей <xref remap="3" linkend="runtime-config"/>.
