Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: The <xref linkend="pgupgrade"/> module allows an installation to be migrated in-place from one major <productname>PostgreSQL</productname> version to another. Upgrades can be performed in minutes, particularly with <option>--link</option> mode. It requires steps similar to <application>pg_dumpall</application> above, e.g. starting/stopping the server, running <application>initdb</application>. The <application>pg_upgrade</application> <link linkend="pgupgrade">documentation</link> outlines the necessary steps.
ru: Модуль <xref linkend="pgupgrade"/> позволяет обновить инсталляцию <productname>PostgreSQL</productname> с одной основной версии на другую непосредственно на месте. Такое обновление может выполняться за считанные минуты, особенно в режиме <option>--link</option>. Для него требуются примерно те же подготовительные действия, что и для варианта с <application>pg_dumpall</application>: запустить/остановить сервер, выполнить <application>initdb</application>. Все эти действия описаны в <link linkend="pgupgrade">документации</link> <application>pg_upgrade</application>.

source: Upgrading Data via Replication
ru: Обновление данных с применением репликации

source: It is also possible to use certain replication methods, such as <productname>Slony</productname>, to create a standby server with the updated version of <productname>PostgreSQL</productname>. This is possible because Slony supports replication between different major versions of <productname>PostgreSQL</productname>. The standby can be on the same computer or a different computer. Once it has synced up with the master server (running the older version of <productname>PostgreSQL</productname>), you can switch masters and make the standby the master and shut down the older database instance. Such a switch-over results in only several seconds of downtime for an upgrade.
ru: Также можно использовать некоторые методы репликации, например <productname>Slony</productname>, для создания резервного сервера с обновлённой версией <productname>PostgreSQL</productname>. Это возможно благодаря тому, что Slony поддерживает репликацию между разными основными версиями <productname>PostgreSQL</productname>. Резервный сервер может располагаться как на том же компьютере, так и на другом. Как только синхронизация с главным сервером (где работает старая версия <productname>PostgreSQL</productname>) будет завершена, можно сделать главным новый сервер, а старый экземпляр базы данных просто отключить. При таком переключении обновление можно осуществить, прервав работу сервера всего на несколько секунд.

source: Preventing Server Spoofing
ru: Защита от подмены сервера

source: <primary>server spoofing</primary>
ru: <primary>подмена сервера</primary>

source: While the server is running, it is not possible for a malicious user to take the place of the normal database server. However, when the server is down, it is possible for a local user to spoof the normal server by starting their own server. The spoof server could read passwords and queries sent by clients, but could not return any data because the <varname>PGDATA</varname> directory would still be secure because of directory permissions. Spoofing is possible because any user can start a database server; a client cannot identify an invalid server unless it is specially configured.
ru: Когда сервер работает, злонамеренный пользователь не может подставить свой сервер вместо него. Однако, если сервер отключён, локальный пользователь может подменить нормальный сервер, запустив свой собственный. Поддельный сервер сможет читать пароли и запросы клиентов, хотя не сможет вернуть никакие данные, так как каталог <varname>PGDATA</varname> будет защищён от чтения посторонними пользователями. Такая подмена возможна потому, что любой пользователь может запустить сервер баз данных; клиент, со своей стороны, не может обнаружить подмену, если его не настроить дополнительно.

source: One way to prevent spoofing of <literal>local</literal> connections is to use a Unix domain socket directory (<xref linkend="guc-unix-socket-directories"/>) that has write permission only for a trusted local user. This prevents a malicious user from creating their own socket file in that directory. If you are concerned that some applications might still reference <filename>/tmp</filename> for the socket file and hence be vulnerable to spoofing, during operating system startup create a symbolic link <filename>/tmp/.s.PGSQL.5432</filename> that points to the relocated socket file. You also might need to modify your <filename>/tmp</filename> cleanup script to prevent removal of the symbolic link.
ru: Один из способов предотвратить подмену для <literal>локальных</literal> подключений — использовать каталог доменных сокетов Unix (<xref linkend="guc-unix-socket-directories"/>), в который сможет писать только проверенный локальный пользователь. Это не позволит злонамеренному пользователю создать в этом каталоге свой файл сокета. Если вас беспокоит, что некоторые приложения при этом могут обращаться к файлу сокета в <filename>/tmp</filename> и, таким образом, всё же будут уязвимыми, создайте при загрузке операционной системы символическую ссылку <filename>/tmp/.s.PGSQL.5432</filename>, указывающую на перемещённый файл сокета. Возможно, вам также придётся изменить скрипт очистки <filename>/tmp</filename>, чтобы он не удалял эту ссылку.

source: Another option for <literal>local</literal> connections is for clients to use <link linkend="libpq-connect-requirepeer"><literal>requirepeer</literal></link> to specify the required owner of the server process connected to the socket.
ru: Также клиенты могут защитить <literal>локальные</literal> подключения, установив в параметре <link linkend="libpq-connect-requirepeer"><literal>requirepeer</literal></link> имя пользователя, который должен владеть серверным процессом, подключённым к сокету.

source: To prevent spoofing on TCP connections, the best solution is to use SSL certificates and make sure that clients check the server's certificate. To do that, the server must be configured to accept only <literal>hostssl</literal> connections (<xref linkend="auth-pg-hba-conf"/>) and have SSL key and certificate files (<xref linkend="ssl-tcp"/>). The TCP client must connect using <literal>sslmode=verify-ca</literal> or <literal>verify-full</literal> and have the appropriate root certificate file installed (<xref linkend="libq-ssl-certificates"/>).
ru: Лучший способ защиты от подмены для соединений TCP — использовать сертификаты SSL и добиться, чтобы клиенты проверяли сертификат сервера. Для этого надо настроить сервер, чтобы он принимал только подключения <literal>hostssl</literal> (см. <xref remap="4" linkend="auth-pg-hba-conf"/>) и имел ключ и сертификаты SSL (см. <xref remap="4" linkend="ssl-tcp"/>). Тогда TCP-клиент должен будет подключаться к серверу с параметром <literal>sslmode=verify-ca</literal> или <literal>verify-full</literal> и у него должен быть установлен соответствующий корневой сертификат (см. <xref remap="4" linkend="libq-ssl-certificates"/>).

source: Encryption Options
ru: Возможности шифрования

source: <primary>encryption</primary>
ru: <primary>шифрование</primary>

source: <productname>PostgreSQL</productname> offers encryption at several levels, and provides flexibility in protecting data from disclosure due to database server theft, unscrupulous administrators, and insecure networks. Encryption might also be required to secure sensitive data such as medical records or financial transactions.
ru: <productname>PostgreSQL</productname> обеспечивает шифрование на разных уровнях и даёт гибкость в выборе средств защиты данных в случае кражи сервера, от недобросовестных администраторов или в небезопасных сетях. Шифрование может также требоваться для защиты конфиденциальных данных, например, медицинских сведений или финансовых транзакций.

source: Password Storage Encryption
ru: Шифрование хранимых паролей

source: By default, database user passwords are stored as MD5 hashes, so the administrator cannot determine the actual password assigned to the user. If MD5 encryption is used for client authentication, the unencrypted password is never even temporarily present on the server because the client MD5-encrypts it before being sent across the network.
ru: По умолчанию, пароли пользователей базы данных хранятся в виде хешей MD5, так что даже администратор не может определить, какой именно пароль имеет пользователь. Если шифрование MD5 также применяется при проверке подлинности, пароли не присутствуют на сервере в открытом виде даже кратковременно, так как клиент вычисляет и передаёт по сети только хеши паролей.

source: Encryption For Specific Columns
ru: Шифрование избранных столбцов

source: The <xref linkend="pgcrypto"/> module allows certain fields to be stored encrypted. This is useful if only some of the data is sensitive. The client supplies the decryption key and the data is decrypted on the server and then sent to the client.
ru: Модуль <xref linkend="pgcrypto"/> позволяет хранить в зашифрованном виде избранные поля. Это полезно, если ценность представляют только некоторые данные. Чтобы прочитать эти поля, клиент передаёт дешифрующий ключ, сервер расшифровывает данные и выдаёт их клиенту.

source: The decrypted data and the decryption key are present on the server for a brief time while it is being decrypted and communicated between the client and server. This presents a brief moment where the data and keys can be intercepted by someone with complete access to the database server, such as the system administrator.
ru: Расшифрованные данные и ключ дешифрования находятся на сервере в процессе расшифровывания и передачи данных. Именно в этот момент данные и ключи могут быть перехвачены тем, кто имеет полный доступ к серверу баз данных, например, системным администратором.

source: Data Partition Encryption
ru: Шифрование раздела данных

source: Storage encryption can be performed at the file system level or the block level. Linux file system encryption options include eCryptfs and EncFS, while FreeBSD uses PEFS. Block level or full disk encryption options include dm-crypt + LUKS on Linux and GEOM modules geli and gbde on FreeBSD. Many other operating systems support this functionality, including Windows.
ru: Шифрование хранилища данных можно реализовать на уровне файловой системы или на уровне блоков. В Linux можно воспользоваться шифрованными файловыми системами eCryptfs и EncFS, а во FreeBSD есть PEFS. Шифрование всего диска на блочном уровне в Linux можно организовать, используя dm-crypt + LUKS, а во FreeBSD — модули GEOM, geli и gbde. Подобные возможности есть и во многих других операционных системах, включая Windows.

source: This mechanism prevents unencrypted data from being read from the drives if the drives or the entire computer is stolen. This does not protect against attacks while the file system is mounted, because when mounted, the operating system provides an unencrypted view of the data. However, to mount the file system, you need some way for the encryption key to be passed to the operating system, and sometimes the key is stored somewhere on the host that mounts the disk.
ru: Этот механизм не позволяет читать незашифрованные данные с дисков в случае кражи дисков или всего компьютера. При этом он не защищает данные от чтения, когда эта файловая система смонтирована, так как на смонтированном устройстве операционная система видит все данные в незашифрованном виде. Однако, чтобы смонтировать файловую систему, нужно передать операционной системе ключ (иногда он хранится где-то на компьютере, который выполняет монтирование).

source: Encrypting Passwords Across A Network
ru: Шифрование паролей при передаче по сети

source: The <literal>MD5</literal> authentication method double-encrypts the password on the client before sending it to the server. It first MD5-encrypts it based on the user name, and then encrypts it based on a random salt sent by the server when the database connection was made. It is this double-encrypted value that is sent over the network to the server. Double-encryption not only prevents the password from being discovered, it also prevents another connection from using the same encrypted password to connect to the database server at a later time.
ru: Метод проверки подлинности с <literal>MD5</literal> дважды шифрует пароль на стороне клиента, прежде чем передать его серверу. Сначала вычисляется хеш MD5 пароля вместе с именем пользователя, а затем этот хеш обрабатывается ещё раз с добавлением случайного числа, переданного сервером при попытке подключиться к нему. Затем это дважды хешированное значение передаётся серверу по сети. Двойное хеширование не только позволяет защититься от вычисления исходного пароля, но и не даёт использовать тот же зашифрованный пароль при следующем подключении.

source: Encrypting Data Across A Network
ru: Шифрование данных при передаче по сети

source: SSL connections encrypt all data sent across the network: the password, the queries, and the data returned. The <filename>pg_hba.conf</filename> file allows administrators to specify which hosts can use non-encrypted connections (<literal>host</literal>) and which require SSL-encrypted connections (<literal>hostssl</literal>). Also, clients can specify that they connect to servers only via SSL. <application>Stunnel</application> or <application>SSH</application> can also be used to encrypt transmissions.
ru: SSL-соединения шифруют все данные, передаваемые по сети: пароль, запросы и возвращаемые данные. Файл <filename>pg_hba.conf</filename> позволяет администраторам указать, для каких узлов будут разрешены незашифрованные соединения (<literal>host</literal>), а для каких будет требоваться SSL (<literal>hostssl</literal>). Кроме того, и на стороне клиента можно разрешить подключения к серверам только с SSL. Для шифрования трафика также можно применять <application>stunnel</application> и <application>SSH</application>.

source: SSL Host Authentication
ru: Проверка подлинности сервера SSL

source: It is possible for both the client and server to provide SSL certificates to each other. It takes some extra configuration on each side, but this provides stronger verification of identity than the mere use of passwords. It prevents a computer from pretending to be the server just long enough to read the password sent by the client. It also helps prevent <quote>man in the middle</quote> attacks where a computer between the client and server pretends to be the server and reads and passes all data between the client and server.
ru: И клиент, и сервер могут проверять подлинность друг друга по сертификатам SSL. Это требует дополнительной настройки на каждой стороне, но даёт более надёжную гарантию подлинности, чем обычные пароли. С такой защитой подставной компьютер не сможет представлять из себя сервер с целью получить пароли клиентов. Она также предотвращает атаки с посредником (<quote>man in the middle</quote>), когда компьютер между клиентом и сервером представляется сервером и незаметно передаёт все запросы и данные между клиентом и подлинным сервером.

source: Client-Side Encryption
ru: Шифрование на стороне клиента

source: If the system administrator for the server's machine cannot be trusted, it is necessary for the client to encrypt the data; this way, unencrypted data never appears on the database server. Data is encrypted on the client before being sent to the server, and database results have to be decrypted on the client before being used.
ru: Если системный администратор сервера, где работает база данных, не является доверенным, клиент должен сам шифровать данные; тогда незашифрованные данные никогда не появятся на этом сервере. В этом случае клиент шифрует данные, прежде чем передавать их серверу, а получив из базы данных результаты, он расшифровывает их для использования.

source: Secure TCP/IP Connections with SSL
ru: Защита соединений TCP/IP с применением SSL

source: <productname>PostgreSQL</productname> has native support for using <acronym>SSL</acronym> connections to encrypt client/server communications for increased security. This requires that <productname>OpenSSL</productname> is installed on both client and server systems and that support in <productname>PostgreSQL</productname> is enabled at build time (see <xref linkend="installation"/>).
ru: В <productname>PostgreSQL</productname> встроена поддержка <acronym>SSL</acronym> для шифрования трафика между клиентом и сервером, что повышает уровень безопасности системы. Для использования этой возможности необходимо, чтобы и на сервере, и на клиенте был установлен <productname>OpenSSL</productname>, и поддержка <acronym>SSL</acronym> была разрешена в <productname>PostgreSQL</productname> при сборке (см. <xref remap="4" linkend="installation"/>).

source: With <acronym>SSL</acronym> support compiled in, the <productname>PostgreSQL</productname> server can be started with <acronym>SSL</acronym> enabled by setting the parameter <xref linkend="guc-ssl"/> to <literal>on</literal> in <filename>postgresql.conf</filename>. The server will listen for both normal and <acronym>SSL</acronym> connections on the same TCP port, and will negotiate with any connecting client on whether to use <acronym>SSL</acronym>. By default, this is at the client's option; see <xref linkend="auth-pg-hba-conf"/> about how to set up the server to require use of <acronym>SSL</acronym> for some or all connections.
ru: Когда в установленном сервере <productname>PostgreSQL</productname> разрешена поддержка <acronym>SSL</acronym>, его можно запустить с включённым механизмом <acronym>SSL</acronym>, задав в <filename>postgresql.conf</filename> для параметра <xref linkend="guc-ssl"/> значение <literal>on</literal>. Запущенный сервер будет принимать, как обычные, так и <acronym>SSL</acronym>-подключения в одном порту TCP и будет согласовывать использование <acronym>SSL</acronym> с каждым клиентом. По умолчанию клиент выбирает режим подключения сам; как настроить сервер, чтобы он требовал использовать только <acronym>SSL</acronym> для всех или некоторых подключений, вы можете узнать в <xref remap="6" linkend="auth-pg-hba-conf"/>.

source: <productname>PostgreSQL</productname> reads the system-wide <productname>OpenSSL</productname> configuration file. By default, this file is named <filename>openssl.cnf</filename> and is located in the directory reported by <literal>openssl version -d</literal>. This default can be overridden by setting environment variable <envar>OPENSSL_CONF</envar> to the name of the desired configuration file.
ru: <productname>PostgreSQL</productname> читает системный файл конфигурации <productname>OpenSSL</productname>. По умолчанию этот файл называется <filename>openssl.cnf</filename> и находится в каталоге, который сообщает команда <literal>openssl version -d</literal>. Если требуется указать другое расположение файла конфигурации, его можно задать в переменной окружения <envar>OPENSSL_CONF</envar>.

source: <productname>OpenSSL</productname> supports a wide range of ciphers and authentication algorithms, of varying strength. While a list of ciphers can be specified in the <productname>OpenSSL</productname> configuration file, you can specify ciphers specifically for use by the database server by modifying <xref linkend="guc-ssl-ciphers"/> in <filename>postgresql.conf</filename>.
ru: <productname>OpenSSL</productname> предоставляет широкий выбор шифров и алгоритмов аутентификации разной защищённости. Хотя список шифров может быть задан непосредственно в файле конфигурации <productname>OpenSSL</productname>, можно задать отдельные шифры именно для сервера баз данных, указав их в параметре <xref linkend="guc-ssl-ciphers"/> в <filename>postgresql.conf</filename>.

source: It is possible to have authentication without encryption overhead by using <literal>NULL-SHA</literal> or <literal>NULL-MD5</literal> ciphers. However, a man-in-the-middle could read and pass communications between client and server. Also, encryption overhead is minimal compared to the overhead of authentication. For these reasons NULL ciphers are not recommended.
ru: Накладные расходы, связанные с шифрованием, в принципе можно исключить, ограничившись только проверкой подлинности, то есть применяя шифр <literal>NULL-SHA</literal> или <literal>NULL-MD5</literal>. Однако в этом случае посредник сможет пропускать через себя и читать весь трафик между клиентом и сервером. Кроме того, шифрование привносит минимальную дополнительную нагрузку по сравнению с проверкой подлинности. По этим причинам использовать шифры NULL не рекомендуется.

source: To start in <acronym>SSL</acronym> mode, files containing the server certificate and private key must exist. By default, these files are expected to be named <filename>server.crt</filename> and <filename>server.key</filename>, respectively, in the server's data directory, but other names and locations can be specified using the configuration parameters <xref linkend="guc-ssl-cert-file"/> and <xref linkend="guc-ssl-key-file"/>.
ru: Чтобы сервер мог работать в режиме <acronym>SSL</acronym>, ему необходимы файлы с сертификатом сервера и закрытым ключом. По умолчанию это должны быть файлы <filename>server.crt</filename> и <filename>server.key</filename>, соответственно, расположенные в каталоге данных, но можно использовать и другие имена и местоположения файлов, задав их в конфигурационных параметрах <xref linkend="guc-ssl-cert-file"/> и <xref linkend="guc-ssl-key-file"/>.

source: On Unix systems, the permissions on <filename>server.key</filename> must disallow any access to world or group; achieve this by the command <command>chmod 0600 server.key</command>. Alternatively, the file can be owned by root and have group read access (that is, <literal>0640</literal> permissions). That setup is intended for installations where certificate and key files are managed by the operating system. The user under which the <productname>PostgreSQL</productname> server runs should then be made a member of the group that has access to those certificate and key files.
ru: В Unix-подобных системах к файлу <filename>server.key</filename> должен быть запрещён любой доступ группы и всех остальных; чтобы установить такое ограничение, выполните <command>chmod 0600 server.key</command>. Возможен и другой вариант, когда этим файлом владеет root, а группа имеет доступ на чтение (то есть, маска разрешений <literal>0640</literal>). Данный вариант предназначен для систем, в которых файлами сертификатов и ключей управляет сама операционная система. В этом случае пользователь, запускающий сервер <productname>PostgreSQL</productname>, должен быть членом группы, имеющей доступ к указанным файлам сертификата и ключа.

source: If the private key is protected with a passphrase, the server will prompt for the passphrase and will not start until it has been entered.
ru: Если закрытый ключ защищён паролем, сервер запросит пароль и не запустится, пока этот пароль не будет введён.
