Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: In some cases, the server certificate might be signed by an <quote>intermediate</quote> certificate authority, rather than one that is directly trusted by clients. To use such a certificate, append the certificate of the signing authority to the <filename>server.crt</filename> file, then its parent authority's certificate, and so on up to a certificate authority, <quote>root</quote> or <quote>intermediate</quote>, that is trusted by clients, i.e. signed by a certificate in the clients' <filename>root.crt</filename> files.
ru: В некоторых случаях сертификат сервера может подписываться <quote>промежуточным</quote> центром сертификации, сам этот сертификат не обязательно должен быть доверенным для клиентов. Чтобы использовать такой сертификат, нужно добавить к файлу <filename>server.crt</filename> сертификат выдавшего его центра сертификации, затем сертификат вышестоящего центра и так далее, до сертификата <quote>корневого</quote> или <quote>промежуточного</quote> центра, которому доверяют клиенты. Клиенты считают сертификат доверенным, если он подписан сертификатом, содержащимся в их собственном файле <filename>root.crt</filename>.

source: Using Client Certificates
ru: Использование клиентских сертификатов

source: To require the client to supply a trusted certificate, place certificates of the certificate authorities (<acronym>CA</acronym>s) you trust in the file <filename>root.crt</filename> in the data directory, set the parameter <xref linkend="guc-ssl-ca-file"/> in <filename>postgresql.conf</filename> to <literal>root.crt</literal>, and add the authentication option <literal>clientcert=1</literal> to the appropriate <literal>hostssl</literal> line(s) in <filename>pg_hba.conf</filename>. A certificate will then be requested from the client during SSL connection startup. (See <xref linkend="libpq-ssl"/> for a description of how to set up certificates on the client.) The server will verify that the client's certificate is signed by one of the trusted certificate authorities.
ru: Чтобы клиенты должны были предоставлять серверу доверенные сертификаты, поместите сертификаты центров сертификации (<acronym>ЦС</acronym>), которым вы доверяете, в файл <filename>root.crt</filename> в каталоге данных, укажите в параметре <xref linkend="guc-ssl-ca-file"/> в <filename>postgresql.conf</filename> имя файла <literal>root.crt</literal> и добавьте параметр аутентификации <literal>clientcert=1</literal> в соответствующие строки <literal>hostssl</literal> в <filename>pg_hba.conf</filename>. В результате от клиента в процессе установления SSL-подключения будет затребован сертификат. (Как настроить сертификаты на стороне клиента, описывается в <xref remap="6" linkend="libpq-ssl"/>.) Получив сертификат, сервер будет проверять, был ли этот сертификат подписан одним из доверенным центром сертификации.

source: If intermediate <acronym>CA</acronym>s appear in <filename>root.crt</filename>, the file must also contain certificate chains to their root <acronym>CA</acronym>s. Certificate Revocation List (CRL) entries are also checked if the parameter <xref linkend="guc-ssl-crl-file"/> is set. (See <ulink url="http://h71000.www7.hp.com/doc/83final/ba554_90007/ch04s02.html"/> for diagrams showing SSL certificate usage.)
ru: Если в <filename>root.crt</filename> вносятся промежуточные <acronym>ЦС</acronym>, в этом файле также должны содержаться цепочки сертификатов до их корневых <acronym>ЦС</acronym>. Если установлен параметр <xref linkend="guc-ssl-crl-file"/>, также проверяется список отзыва сертификатов (Certificate Revocation List, CRL). (На странице <ulink url="http://h71000.www7.hp.com/doc/83final/ba554_90007/ch04s02.html"/> можно найти наглядные диаграммы, иллюстрирующие применение сертификатов SSL.)

source: The <literal>clientcert</literal> authentication option is available for all authentication methods, but only in <filename>pg_hba.conf</filename> lines specified as <literal>hostssl</literal>. When <literal>clientcert</literal> is not specified or is set to 0, the server will still verify any presented client certificates against its CA file, if one is configured &mdash; but it will not insist that a client certificate be presented.
ru: Параметр аутентификации <literal>clientcert</literal> можно использовать с любым методом проверки подлинности, но только в строках <filename>pg_hba.conf</filename> типа <literal>hostssl</literal>. Когда <literal>clientcert</literal> не задан или равен 0, сервер, тем не менее, будет проверять все представленные клиентские сертификаты по своему файлу со списком ЦС (если он настроен) &mdash; но позволит подключаться клиентам без сертификата.

source: Note that the server's <filename>root.crt</filename> lists the top-level CAs that are considered trusted for signing client certificates. In principle it need not list the CA that signed the server's certificate, though in most cases that CA would also be trusted for client certificates.
ru: Заметьте, что файл <filename>root.crt</filename> на сервере содержит сертификаты центров сертификации верхнего уровня, которые считаются доверенными для подписания клиентских сертификатов. В принципе в нём может отсутствовать сертификат ЦС, подписавшего сертификат сервера, хотя в большинстве случаев этот ЦС также должен быть доверенным для клиентских сертификатов.

source: If you are setting up client certificates, you may wish to use the <literal>cert</literal> authentication method, so that the certificates control user authentication as well as providing connection security. See <xref linkend="auth-cert"/> for details. (It is not necessary to specify <literal>clientcert=1</literal> explicitly when using the <literal>cert</literal> authentication method.)
ru: Если вы используете клиентские сертификаты, вы можете также применить метод аутентификации <literal>cert</literal>, чтобы сертификаты обеспечивали не только защиту соединений, но и проверку подлинности пользователей. За подробностями обратитесь к <xref remap="3" linkend="auth-cert"/>. (Устанавливать <literal>clientcert=1</literal> явно при использовании метода аутентификации <literal>cert</literal> не требуется.)

source: SSL Server File Usage
ru: Файлы, используемые SSL-сервером

source: <xref linkend="ssl-file-usage"/> summarizes the files that are relevant to the SSL setup on the server. (The shown file names are default or typical names. The locally configured names could be different.)
ru: В <xref remap="6" linkend="ssl-file-usage"/> кратко описаны все файлы, имеющие отношение к настройке SSL на сервере. (Здесь приведены стандартные или типичные имена файлов. В конкретной системе они могут быть другими.)

source: File
ru: Файл

source: Contents
ru: Содержимое

source: Effect
ru: Назначение

source: server certificate
ru: сертификат сервера

source: sent to client to indicate server's identity
ru: отправляется клиенту для идентификации сервера

source: server private key
ru: закрытый ключ сервера

source: proves server certificate was sent by the owner; does not indicate certificate owner is trustworthy
ru: подтверждает, что сертификат сервера был передан его владельцем; не гарантирует, что его владельцу можно доверять

source: trusted certificate authorities
ru: сертификаты доверенных ЦС

source: checks that client certificate is signed by a trusted certificate authority
ru: позволяет проверить, что сертификат клиента подписан доверенным центром сертификации

source: certificates revoked by certificate authorities
ru: сертификаты, отозванные центрами сертификации

source: client certificate must not be on this list
ru: сертификат клиента должен отсутствовать в этом списке

source: The files <filename>server.key</filename>, <filename>server.crt</filename>, <filename>root.crt</filename>, and <filename>root.crl</filename> (or their configured alternative names) are only examined during server start; so you must restart the server for changes in them to take effect.
ru: Файлы <filename>server.key</filename>, <filename>server.crt</filename>, <filename>root.crt</filename> и <filename>root.crl</filename> (или альтернативные файлы, заменяющие их) считываются только при запуске сервера; поэтому сервер необходимо перезапустить, чтобы изменения в них вступили в силу.

source: Creating a Self-signed Certificate
ru: Создание самоподписанного сертификата

source: To create a quick self-signed certificate for the server, use the following <productname>OpenSSL</productname> command: <placeholder-1/> Fill out the information that <application>openssl</application> asks for. Make sure you enter the local host name as <quote>Common Name</quote>; the challenge password can be left blank. The program will generate a key that is passphrase protected; it will not accept a passphrase that is less than four characters long. To remove the passphrase (as you must if you want automatic start-up of the server), run the commands: <placeholder-2/> Enter the old passphrase to unlock the existing key. Now do: <placeholder-3/> to turn the certificate into a self-signed certificate and to copy the key and certificate to where the server will look for them. Finally do: <placeholder-4/> because the server will reject the file if its permissions are more liberal than this. For more details on how to create your server private key and certificate, refer to the <productname>OpenSSL</productname> documentation.
ru: Чтобы создать самоподписанный сертификат для сервера быстрым способом, выполните следующую команду <productname>OpenSSL</productname>: <placeholder-1/> Введите информацию, которую запрашивает <application>openssl</application>. Обязательно укажите правильное имя локального компьютера в поле <quote>Common Name</quote> (Общее имя); пароль запроса можно оставить пустым. Программа сгенерирует ключ, защищённый паролем; она не примет пароль короче четырёх символов. Чтобы удалить пароль (вы должны сделать это, если хотите, чтобы сервер запускался автоматически), выполните такие команды: <placeholder-2/> Введите старый пароль, чтобы разблокировать файл ключа. Теперь выполните: <placeholder-3/> В результате вы получите самоподписанный сертификат, и затем нужно будет скопировать ключ и сертификат туда, где их будет искать сервер. Наконец, выполните: <placeholder-4/> Сервер не примет этот файл, если для него будут заданы более либеральные права доступа. Подробнее узнать о том, как создаётся закрытый ключ и сертификат сервера, можно в документации <productname>OpenSSL</productname>.

source: A self-signed certificate can be used for testing, but a certificate signed by a certificate authority (<acronym>CA</acronym>) (either one of the global <acronym>CAs</acronym> or a local one) should be used in production so that clients can verify the server's identity. If all the clients are local to the organization, using a local <acronym>CA</acronym> is recommended.
ru: Самоподписанный сертификат можно использовать при тестировании, но для производственной среды необходимо получить сертификат, подписанный центром сертификации (<acronym>ЦС</acronym>) (одним из глобальных <acronym>ЦС</acronym> или локальным), чтобы клиенты могли проверять подлинность сервера. Если все клиенты относятся к одной организации, рекомендуется использовать локальный <acronym>ЦС</acronym>.

source: Secure TCP/IP Connections with <application>SSH</application> Tunnels
ru: Защита соединений TCP/IP с применением туннелей <application>SSH</application>

source: It is possible to use <application>SSH</application> to encrypt the network connection between clients and a <productname>PostgreSQL</productname> server. Done properly, this provides an adequately secure network connection, even for non-SSL-capable clients.
ru: Для защиты сетевых соединений клиентов с сервером <productname>PostgreSQL</productname> можно применить <application>SSH</application>. При правильном подходе это позволяет обеспечить должный уровень защиты сетевого трафика, даже для клиентов, не поддерживающих SSL.

source: First make sure that an <application>SSH</application> server is running properly on the same machine as the <productname>PostgreSQL</productname> server and that you can log in using <command>ssh</command> as some user. Then you can establish a secure tunnel with a command like this from the client machine: <placeholder-1/> The first number in the <option>-L</option> argument, 63333, is the port number of your end of the tunnel; it can be any unused port. (IANA reserves ports 49152 through 65535 for private use.) The second number, 5432, is the remote end of the tunnel: the port number your server is using. The name or IP address between the port numbers is the host with the database server you are going to connect to, as seen from the host you are logging in to, which is <literal>foo.com</literal> in this example. In order to connect to the database server using this tunnel, you connect to port 63333 on the local machine: <placeholder-2/> To the database server it will then look as though you are really user <literal>joe</literal> on host <literal>foo.com</literal> connecting to <literal>localhost</literal> in that context, and it will use whatever authentication procedure was configured for connections from this user and host. Note that the server will not think the connection is SSL-encrypted, since in fact it is not encrypted between the <application>SSH</application> server and the <productname>PostgreSQL</productname> server. This should not pose any extra security risk as long as they are on the same machine.
ru: Прежде всего, убедитесь, что на компьютере с сервером <productname>PostgreSQL</productname> также работает сервер <application>SSH</application> и вы можете подключиться к нему через <command>ssh</command> каким-нибудь пользователем. Затем вы можете установить защищённый тоннель с клиентской машины следующим образом: <placeholder-1/> Первое число в аргументе <option>-L</option>, 63333 — это номер порта с вашей стороны туннеля; это может быть номер любого свободного порта. (IANA резервирует порты с 49152 по 65535 для частного использования.) Второе число, 5432 — порт с удалённой стороны туннеля, порт вашего сервера. Имя или IP-адрес между этими номерами портов идентифицирует целевой компьютер (где работает сервер баз данных, к которому вы будете подключаться), с точки зрения компьютера, с которого выполняется подключение (в данном примере, <literal>foo.com</literal>). Чтобы подключиться к этому серверу через созданный тоннель, вы можете подключиться к порту 63333 на локальном компьютере: <placeholder-2/> Для сервера баз данных это будет выглядеть так, как будто вы действительно пользователь <literal>joe</literal> компьютера <literal>foo.com</literal>, подключающийся к <literal>localhost</literal> в этом контексте, и он будет применять ту процедуру проверки подлинности, которая установлена для подключений данного пользователя с этого компьютера. Заметьте, что сервер не будет считать такое соединение защищённым SSL, так как на самом деле трафик между сервером <application>SSH</application> и сервером <productname>PostgreSQL</productname> не защищён. Это не должно нести какие-то дополнительные риски, так как эти серверы работают на одном компьютере.

source: In order for the tunnel setup to succeed you must be allowed to connect via <command>ssh</command> as <literal>joe@foo.com</literal>, just as if you had attempted to use <command>ssh</command> to create a terminal session.
ru: Чтобы настроенный таким образом туннель работал, вы должны иметь возможность подключаться к компьютеру через <command>ssh</command> под именем <literal>joe@foo.com</literal>, так же, как это происходит при установлении терминального подключения с помощью <command>ssh</command>.

source: You could also have set up the port forwarding as <placeholder-1/> but then the database server will see the connection as coming in on its <literal>foo.com</literal> interface, which is not opened by the default setting <literal>listen_addresses = 'localhost'</literal>. This is usually not what you want.
ru: Вы также можете настроить перенаправление портов примерно так: <placeholder-1/> Но в этом случае для сервера баз данных подключение будет приходить с его интерфейса <literal>foo.com</literal>, а этот интерфейс по умолчанию не прослушивается (вследствие указания <literal>listen_addresses = 'localhost'</literal>). Обычно требуется другое поведение.

source: If you have to <quote>hop</quote> to the database server via some login host, one possible setup could look like this: <placeholder-1/> Note that this way the connection from <literal>shell.foo.com</literal> to <literal>db.foo.com</literal> will not be encrypted by the SSH tunnel. SSH offers quite a few configuration possibilities when the network is restricted in various ways. Please refer to the SSH documentation for details.
ru: Если вам нужно <quote>перейти</quote> к серверу баз данных через некоторый шлюз, это можно организовать примерно так: <placeholder-1/> Заметьте, что в этом случае трафик между <literal>shell.foo.com</literal> и <literal>db.foo.com</literal> не будет защищён туннелем SSH. SSH предлагает довольно много вариантов конфигурации, что позволяет организовывать защиту сети разными способами. За подробностями обратитесь к документации SSH.

source: Several other applications exist that can provide secure tunnels using a procedure similar in concept to the one just described.
ru: Существуют и другие приложения, которые могут создавать безопасные туннели, применяя по сути тот же подход, что был описан выше.

source: Registering <application>Event Log</application> on <systemitem class="osname">Windows</systemitem>
ru: Регистрация <application>журнала событий</application> в <systemitem class="osname">Windows</systemitem>

source: <primary>event log</primary> <secondary>event log</secondary>
ru: <primary>журнал событий</primary> <secondary>журнал событий</secondary>

source: To register a <systemitem class="osname">Windows</systemitem> <application>event log</application> library with the operating system, issue this command: <screen> <userinput>regsvr32 <replaceable>pgsql_library_directory</replaceable>/pgevent.dll</userinput> </screen> This creates registry entries used by the event viewer, under the default event source named <literal>PostgreSQL</literal>.
ru: Чтобы зарегистрировать библиотеку <application>журнала событий</application> в <systemitem class="osname">Windows</systemitem>, выполните следующую команду: <screen> <userinput>regsvr32 <replaceable>каталог_библиотек_pgsql</replaceable>/pgevent.dll</userinput> </screen> При этом в реестре будут созданы необходимые записи для средства просмотра событий, относящиеся к источнику событий по умолчанию с именем <literal>PostgreSQL</literal>.

source: To specify a different event source name (see <xref linkend="guc-event-source"/>), use the <literal>/n</literal> and <literal>/i</literal> options: <screen> <userinput>regsvr32 /n /i:<replaceable>event_source_name</replaceable> <replaceable>pgsql_library_directory</replaceable>/pgevent.dll</userinput> </screen>
ru: Чтобы задать другое имя источника событий (см. <xref remap="4" linkend="guc-event-source"/>), укажите ключи <literal>/n</literal> и <literal>/i</literal>: <screen> <userinput>regsvr32 /n /i:<replaceable>имя_источника_событий</replaceable> <replaceable>каталог_библиотек_pgsql</replaceable>/pgevent.dll</userinput> </screen>

source: To unregister the <application>event log</application> library from the operating system, issue this command: <screen> <userinput>regsvr32 /u [/i:<replaceable>event_source_name</replaceable>] <replaceable>pgsql_library_directory</replaceable>/pgevent.dll</userinput> </screen>
ru: Чтобы разрегистрировать библиотеку <application>журнала событий</application> в операционной системе, выполните команду: <screen> <userinput>regsvr32 /u [/i:<replaceable>имя_источника_событий</replaceable>] <replaceable>каталог_библиотек_pgsql</replaceable>/pgevent.dll</userinput> </screen>

source: To enable event logging in the database server, modify <xref linkend="guc-log-destination"/> to include <literal>eventlog</literal> in <filename>postgresql.conf</filename>.
ru: Чтобы сервер баз данных записывал сообщения в журнал событий, добавьте <literal>eventlog</literal> в параметр <xref linkend="guc-log-destination"/> в <filename>postgresql.conf</filename>.
