Repository: pluzanov/pg-doc-ru
Catalog: 9.6/runtime.po
Languages: ru

source: <primary>SCO OpenServer</primary><secondary>IPC configuration</secondary>
ru: <primary>SCO OpenServer</primary> <secondary>настройка IPC</secondary>

source: ./configure SHMMAX=<replaceable>value</replaceable>
ru: ./configure SHMMAX=<replaceable>значение</replaceable>

source: In the default configuration, only 512 kB of shared memory per segment is allowed. To increase the setting, first change to the directory <filename>/etc/conf/cf.d</filename>. To display the current value of <varname>SHMMAX</varname>, run: <placeholder-1/> To set a new value for <varname>SHMMAX</varname>, run: <placeholder-2/> where <replaceable>value</replaceable> is the new value you want to use (in bytes). After setting <varname>SHMMAX</varname>, rebuild the kernel: <placeholder-3/> and reboot.
ru: В стандартной конфигурации размер одного сегмента разделяемой памяти имеет предел в 512 КБ. Чтобы увеличить этот предел, сначала перейдите в каталог <filename>/etc/conf/cf.d</filename>. Затем просмотрите текущее значение <varname>SHMMAX</varname>, выполнив: <placeholder-1/> Задайте новое значение <varname>SHMMAX</varname>, выполнив: <placeholder-2/> Здесь <replaceable>значение</replaceable> — новый предел, который вы хотите установить (в байтах). Установив <varname>SHMMAX</varname>, пересоберите ядро: <placeholder-3/> и перезагрузите систему.

source: <primary>Solaris</primary><secondary>IPC configuration</secondary>
ru: <primary>Solaris</primary> <secondary>настройка IPC</secondary>

source: <systemitem class="osname">Solaris</systemitem> 2.6 to 2.9 (Solaris 6 to Solaris 9) <placeholder-1/>
ru: <systemitem class="osname">Solaris</systemitem> версии с 2.6 по 2.9 (Solaris 6 .. Solaris 9) <placeholder-1/>

source: The relevant settings can be changed in <filename>/etc/system</filename>, for example: <placeholder-1/> You need to reboot for the changes to take effect. See also <ulink url="http://sunsite.uakom.sk/sunworldonline/swol-09-1997/swol-09-insidesolaris.html"/> for information on shared memory under older versions of Solaris.
ru: Соответствующие параметры можно изменить в <filename>/etc/system</filename>, например так: <placeholder-1/> Чтобы изменения вступили в силу, потребуется перегрузить систему. Информацию о разделяемой памяти в более старых версиях Solaris можно найти по ссылке <ulink url="http://sunsite.uakom.sk/sunworldonline/swol-09-1997/swol-09-insidesolaris.html"/>.

source: <systemitem class="osname">Solaris</systemitem> 2.10 (Solaris 10) and later
ru: <systemitem class="osname">Solaris</systemitem> 2.10 (Solaris 10) и более поздние версии

source: In Solaris 10 and later, and OpenSolaris, the default shared memory and semaphore settings are good enough for most <productname>PostgreSQL</productname> applications. Solaris now defaults to a <varname>SHMMAX</varname> of one-quarter of system <acronym>RAM</acronym>. To further adjust this setting, use a project setting associated with the <literal>postgres</literal> user. For example, run the following as <literal>root</literal>: <placeholder-1/>
ru: В Solaris 10 и новее, а также в OpenSolaris, стандартные параметры разделяемой памяти и семафоров достаточно хороши для большинства применений <productname>PostgreSQL</productname>. По умолчанию Solaris теперь устанавливает в <varname>SHMMAX</varname> четверть объёма <acronym>ОЗУ</acronym>. Чтобы изменить этот параметр, воспользуйтесь возможностью задать параметр проекта, связанного с пользователем <literal>postgres</literal>. Например, выполните от имени <literal>root</literal> такую команду: <placeholder-1/>

source: This command adds the <literal>user.postgres</literal> project and sets the shared memory maximum for the <literal>postgres</literal> user to 8GB, and takes effect the next time that user logs in, or when you restart <productname>PostgreSQL</productname> (not reload). The above assumes that <productname>PostgreSQL</productname> is run by the <literal>postgres</literal> user in the <literal>postgres</literal> group. No server reboot is required.
ru: Эта команда создаёт проект <literal>user.postgres</literal> и устанавливает максимальный объём разделяемой памяти для пользователя <literal>postgres</literal> равным 8 ГБ. Это изменение вступает в силу при следующем входе этого пользователя или при перезапуске <productname>PostgreSQL</productname> (не перезагрузке конфигурации). При этом подразумевается, что <productname>PostgreSQL</productname> выполняется пользователем <literal>postgres</literal> в группе <literal>postgres</literal>. Перезагружать систему после этой команды не нужно.

source: Other recommended kernel setting changes for database servers which will have a large number of connections are: <placeholder-1/>
ru: Для серверов баз данных, рассчитанных на большое количество подключений, рекомендуется также изменить следующие параметры: <placeholder-1/>

source: Additionally, if you are running <productname>PostgreSQL</productname> inside a zone, you may need to raise the zone resource usage limits as well. See "Chapter2: Projects and Tasks" in the <citetitle>System Administrator's Guide</citetitle> for more information on <literal>projects</literal> and <command>prctl</command>.
ru: Кроме того, если <productname>PostgreSQL</productname> у вас выполняется внутри зоны, может понадобиться также увеличить лимиты на использование ресурсов зоны. Получить дополнительную информацию о <literal>проектах</literal> и команде <command>prctl</command> можно в <citetitle>Руководстве системного администратора</citetitle> (System Administrator's Guide), &laquo;Главе 2: Проекты и задачи&raquo; (Chapter2: Projects and Tasks).

source: <primary>UnixWare</primary><secondary>IPC configuration</secondary>
ru: <primary>UnixWare</primary> <secondary>настройка IPC</secondary>

source: /etc/conf/bin/idtune SHMMAX <replaceable>value</replaceable>
ru: /etc/conf/bin/idtune SHMMAX <replaceable>значение</replaceable>

source: On <productname>UnixWare</productname> 7, the maximum size for shared memory segments is 512 kB in the default configuration. To display the current value of <varname>SHMMAX</varname>, run: <placeholder-1/> which displays the current, default, minimum, and maximum values. To set a new value for <varname>SHMMAX</varname>, run: <placeholder-2/> where <replaceable>value</replaceable> is the new value you want to use (in bytes). After setting <varname>SHMMAX</varname>, rebuild the kernel: <placeholder-3/> and reboot.
ru: В <productname>UnixWare</productname> 7 максимальный размер сегментов разделяемой памяти равен 512 КБ в стандартной конфигурации. Чтобы просмотреть текущее значение <varname>SHMMAX</varname>, выполните: <placeholder-1/> В результате вы увидите текущее значение, значение по умолчанию, а также минимальные и максимальные значения. Чтобы задать новое значение <varname>SHMMAX</varname>, выполните: <placeholder-2/> Здесь <replaceable>значение</replaceable> — новый предел, который вы хотите установить (в байтах). Изменив значение <varname>SHMMAX</varname>, пересоберите ядро: <placeholder-3/> и перегрузите систему.

source: Resource Limits
ru: Ограничения ресурсов

source: Unix-like operating systems enforce various kinds of resource limits that might interfere with the operation of your <productname>PostgreSQL</productname> server. Of particular importance are limits on the number of processes per user, the number of open files per process, and the amount of memory available to each process. Each of these have a <quote>hard</quote> and a <quote>soft</quote> limit. The soft limit is what actually counts but it can be changed by the user up to the hard limit. The hard limit can only be changed by the root user. The system call <function>setrlimit</function> is responsible for setting these parameters. The shell's built-in command <command>ulimit</command> (Bourne shells) or <command>limit</command> (<application>csh</application>) is used to control the resource limits from the command line. On BSD-derived systems the file <filename>/etc/login.conf</filename> controls the various resource limits set during login. See the operating system documentation for details. The relevant parameters are <varname>maxproc</varname>, <varname>openfiles</varname>, and <varname>datasize</varname>. For example: <placeholder-1/> (<literal>-cur</literal> is the soft limit. Append <literal>-max</literal> to set the hard limit.)
ru: В Unix-подобных операционных системах существуют различные типы ограничений ресурсов, которые могут влиять на работу сервера <productname>PostgreSQL</productname>. Особенно важны ограничения на число процессов для пользователя, число открытых файлов и объём памяти для каждого процесса. Каждое из этих ограничений имеет <quote>жёсткий</quote> и <quote>мягкий</quote> предел. Мягкий предел действительно ограничивает использование ресурса, но пользователь может увеличить его значение до жёсткого предела. Изменить жёсткий предел может только пользователь root. За изменение этих параметров отвечает системный вызов <function>setrlimit</function>. Управлять этими ресурсами в командной строке позволяет встроенная команда <command>ulimit</command> (в оболочках Bourne) и <command>limit</command> (<application>csh</application>). В системах семейства BSD различными ограничениями ресурсов, устанавливаемыми при входе пользователя, управляет файл <filename>/etc/login.conf</filename>. За подробностями обратитесь к документации операционной системы. Для <productname>PostgreSQL</productname> интерес представляют параметры <varname>maxproc</varname>, <varname>openfiles</varname> и <varname>datasize</varname>. Они могут задаваться, например так: <placeholder-1/> (Здесь <literal>-cur</literal> обозначает мягкий предел. Чтобы задать жёсткий предел, нужно заменить это окончание на <literal>-max</literal>.)

source: On <productname>Linux</productname> <filename>/proc/sys/fs/file-max</filename> determines the maximum number of open files that the kernel will support. It can be changed by writing a different number into the file or by adding an assignment in <filename>/etc/sysctl.conf</filename>. The maximum limit of files per process is fixed at the time the kernel is compiled; see <filename>/usr/src/linux/Documentation/proc.txt</filename> for more information.
ru: В <productname>Linux</productname> максимальное число открытых файлов, которое поддерживает ядро, определяется в спецфайле <filename>/proc/sys/fs/file-max</filename>. Изменить этот предел можно, записав другое число в этот файл, либо добавив присваивание в файл <filename>/etc/sysctl.conf</filename>. Максимальное число файлов для одного процесса задаётся при компиляции ядра; за дополнительными сведения обратитесь к <filename>/usr/src/linux/Documentation/proc.txt</filename>.

source: Kernels can also have system-wide limits on some resources. <placeholder-1/>
ru: Ядро также может устанавливать общесистемные ограничения на использование некоторых ресурсов. <placeholder-1/>

source: The <productname>PostgreSQL</productname> server uses one process per connection so you should provide for at least as many processes as allowed connections, in addition to what you need for the rest of your system. This is usually not a problem but if you run several servers on one machine things might get tight.
ru: Сервер <productname>PostgreSQL</productname> использует для обслуживания каждого подключения отдельный процесс, так что возможное число процессов должно быть не меньше числа разрешённых соединений плюс число процессов, требуемых для остальной системы. Это обычно не проблема, но когда в одной системе работает множество серверов, предел может быть достигнут.

source: The factory default limit on open files is often set to <quote>socially friendly</quote> values that allow many users to coexist on a machine without using an inappropriate fraction of the system resources. If you run many servers on a machine this is perhaps what you want, but on dedicated servers you might want to raise this limit.
ru: В качестве максимального числа открытых файлов по умолчанию обычно выбираются <quote>социально-ориентированные</quote> значения, позволяющие использовать одну систему нескольким пользователям так, чтобы ни один из них не потреблял слишком много системных ресурсов. Если вы запускаете в системе несколько серверов, это должно вполне устраивать, но на выделенных машинах может возникнуть желание увеличить этот предел.

source: On the other side of the coin, some systems allow individual processes to open large numbers of files; if more than a few processes do so then the system-wide limit can easily be exceeded. If you find this happening, and you do not want to alter the system-wide limit, you can set <productname>PostgreSQL</productname>'s <xref linkend="guc-max-files-per-process"/> configuration parameter to limit the consumption of open files.
ru: С другой стороны, некоторые системы позволяют отдельным процессам открывать очень много файлов и если это делают сразу несколько процессов, они могут легко исчерпать общесистемный предел. Если вы столкнётесь с такой ситуацией, но не захотите менять общесистемное ограничение, вы можете ограничить использование открытых файлов сервером <productname>PostgreSQL</productname>, установив параметр конфигурации <xref linkend="guc-max-files-per-process"/>.

source: Linux Memory Overcommit
ru: Чрезмерное выделение памяти в Linux

source: In Linux 2.4 and later, the default virtual memory behavior is not optimal for <productname>PostgreSQL</productname>. Because of the way that the kernel implements memory overcommit, the kernel might terminate the <productname>PostgreSQL</productname> postmaster (the master server process) if the memory demands of either <productname>PostgreSQL</productname> or another process cause the system to run out of virtual memory.
ru: В Linux 2.4 и новее механизм виртуальной памяти по умолчанию работает не оптимально для <productname>PostgreSQL</productname>. Вследствие того, что ядро выделяет память в чрезмерном объёме, оно может уничтожить главный управляющий процесс <productname>PostgreSQL</productname> (postmaster), если при выделении памяти процессу <productname>PostgreSQL</productname> или другому процессу виртуальная память будет исчерпана.

source: If this happens, you will see a kernel message that looks like this (consult your system documentation and configuration on where to look for such a message): <placeholder-1/> This indicates that the <filename>postgres</filename> process has been terminated due to memory pressure. Although existing database connections will continue to function normally, no new connections will be accepted. To recover, <productname>PostgreSQL</productname> will need to be restarted.
ru: Когда это происходит, вы можете получить примерно такое сообщение ядра (где именно искать это сообщение, можно узнать в документации вашей системы): <placeholder-1/> Это сообщение говорит о том, что процесс <filename>postgres</filename> был уничтожен из-за нехватки памяти. Хотя существующие подключения к базе данных будут работать по-прежнему, новые подключения приниматься не будут. Чтобы восстановить работу сервера, <productname>PostgreSQL</productname> придётся перезапустить.

source: One way to avoid this problem is to run <productname>PostgreSQL</productname> on a machine where you can be sure that other processes will not run the machine out of memory. If memory is tight, increasing the swap space of the operating system can help avoid the problem, because the out-of-memory (OOM) killer is invoked only when physical memory and swap space are exhausted.
ru: Один из способов обойти эту проблему — запускать <productname>PostgreSQL</productname> на компьютере, где никакие другие процессы не займут всю память. Если физической памяти недостаточно, решить проблему также можно, увеличив объём пространства подкачки, так как уничтожение процессов при нехватке памяти происходит только когда заканчивается и физическая память, и место в пространстве подкачки.

source: If <productname>PostgreSQL</productname> itself is the cause of the system running out of memory, you can avoid the problem by changing your configuration. In some cases, it may help to lower memory-related configuration parameters, particularly <link linkend="guc-shared-buffers"><varname>shared_buffers</varname></link> and <link linkend="guc-work-mem"><varname>work_mem</varname></link>. In other cases, the problem may be caused by allowing too many connections to the database server itself. In many cases, it may be better to reduce <link linkend="guc-max-connections"><varname>max_connections</varname></link> and instead make use of external connection-pooling software.
ru: Если памяти не хватает по вине самого <productname>PostgreSQL</productname>, эту проблему можно решить, изменив конфигурацию сервера. В некоторых случаях может помочь уменьшение конфигурационных параметров, связанных с памятью, а именно <link linkend="guc-shared-buffers"><varname>shared_buffers</varname></link> и <link linkend="guc-work-mem"><varname>work_mem</varname></link>. В других случаях проблема может возникать, потому что разрешено слишком много подключений к самому серверу баз данных. Чаще всего в такой ситуации стоит уменьшить число подключений <link linkend="guc-max-connections"><varname>max_connections</varname></link> и организовать внешний пул соединений.

source: On Linux 2.6 and later, it is possible to modify the kernel's behavior so that it will not <quote>overcommit</quote> memory. Although this setting will not prevent the <ulink url="http://lwn.net/Articles/104179/">OOM killer</ulink> from being invoked altogether, it will lower the chances significantly and will therefore lead to more robust system behavior. This is done by selecting strict overcommit mode via <command>sysctl</command>: <placeholder-1/> or placing an equivalent entry in <filename>/etc/sysctl.conf</filename>. You might also wish to modify the related setting <varname>vm.overcommit_ratio</varname>. For details see the kernel documentation file <ulink url="https://www.kernel.org/doc/Documentation/vm/overcommit-accounting"/>.
ru: В Linux 2.6 и новее <quote>чрезмерное выделение</quote> памяти можно предотвратить, изменив поведение ядра. Хотя при этом <ulink url="http://lwn.net/Articles/104179/">OOM killer</ulink> (уничтожение процессов при нехватке памяти) всё равно может вызываться, вероятность такого уничтожения значительно уменьшается, а значит поведение системы становится более стабильным. Для этого нужно включить режим строгого выделения памяти, воспользовавшись <command>sysctl</command>: <placeholder-1/> либо поместив соответствующую запись в <filename>/etc/sysctl.conf</filename>. Возможно, вы также захотите изменить связанный параметр <varname>vm.overcommit_ratio</varname>. За подробностями обратитесь к документации ядра <ulink url="https://www.kernel.org/doc/Documentation/vm/overcommit-accounting"/>.

source: Another approach, which can be used with or without altering <varname>vm.overcommit_memory</varname>, is to set the process-specific <firstterm>OOM score adjustment</firstterm> value for the postmaster process to <literal>-1000</literal>, thereby guaranteeing it will not be targeted by the OOM killer. The simplest way to do this is to execute <placeholder-1/> in the postmaster's startup script just before invoking the postmaster. Note that this action must be done as root, or it will have no effect; so a root-owned startup script is the easiest place to do it. If you do this, you should also set these environment variables in the startup script before invoking the postmaster: <placeholder-2/> These settings will cause postmaster child processes to run with the normal OOM score adjustment of zero, so that the OOM killer can still target them at need. You could use some other value for <envar>PG_OOM_ADJUST_VALUE</envar> if you want the child processes to run with some other OOM score adjustment. (<envar>PG_OOM_ADJUST_VALUE</envar> can also be omitted, in which case it defaults to zero.) If you do not set <envar>PG_OOM_ADJUST_FILE</envar>, the child processes will run with the same OOM score adjustment as the postmaster, which is unwise since the whole point is to ensure that the postmaster has a preferential setting.
ru: Другой подход, который можно применить (возможно, вместе с изменением <varname>vm.overcommit_memory</varname>), заключается в исключении процесса postmaster из числа возможных жертв при нехватке памяти. Для этого нужно задать для свойства <firstterm>поправка очков OOM</firstterm> этого процесса значение <literal>-1000</literal>. Проще всего это можно сделать, выполнив <placeholder-1/> в скрипте запуска управляющего процесса непосредственно перед тем, как запускать postmaster. Заметьте, что делать это надо под именем root, иначе ничего не изменится; поэтому проще всего вставить эту команду в стартовый скрипт, принадлежащий пользователю root. Если вы делаете это, вы также должны установить в данном скрипте эти переменные окружения перед запуском главного процесса: <placeholder-2/> С такими параметрами дочерние процессы главного будут запускаться с обычной, нулевой поправкой очков OOM, так что при необходимости механизм OOM сможет уничтожать их. Вы можете задать и другое значение для <envar>PG_OOM_ADJUST_VALUE</envar>, если хотите, чтобы дочерние процессы исполнялись с другой поправкой OOM. (<envar>PG_OOM_ADJUST_VALUE</envar> также можно опустить, в этом случае подразумевается нулевое значение.) Если вы не установите <envar>PG_OOM_ADJUST_FILE</envar>, дочерние процессы будут работать с той же поправкой очков OOM, которая задана для главного процесса, что неразумно, так всё это делается как раз для того, чтобы главный процесс оказался на особом положении.

source: Older Linux kernels do not offer <filename>/proc/self/oom_score_adj</filename>, but may have a previous version of the same functionality called <filename>/proc/self/oom_adj</filename>. This works the same except the disable value is <literal>-17</literal> not <literal>-1000</literal>.
ru: В старых ядрах Linux <filename>/proc/self/oom_score_adj</filename> отсутствует, но та же функциональность может быть доступна через <filename>/proc/self/oom_adj</filename>. Эта переменная процесса работает так же, только значение, исключающее уничтожение процесса, равно <literal>-17</literal>, а не <literal>-1000</literal>.

source: Some vendors' Linux 2.4 kernels are reported to have early versions of the 2.6 overcommit <command>sysctl</command> parameter. However, setting <literal>vm.overcommit_memory</literal> to 2 on a 2.4 kernel that does not have the relevant code will make things worse, not better. It is recommended that you inspect the actual kernel source code (see the function <function>vm_enough_memory</function> in the file <filename>mm/mmap.c</filename>) to verify what is supported in your kernel before you try this in a 2.4 installation. The presence of the <filename>overcommit-accounting</filename> documentation file should <emphasis>not</emphasis> be taken as evidence that the feature is there. If in any doubt, consult a kernel expert or your kernel vendor.
ru: Некоторые дистрибутивы с ядрами Linux 2.4 содержат предварительную реализацию механизма <command>sysctl</command> overcommit, появившегося официально в 2.6. Однако, если установить для <literal>vm.overcommit_memory</literal> значение 2 в ядре 2.4, ситуация не улучшится, а только ухудшится. Прежде чем модифицировать этот параметр в ядре 2.4, рекомендуется проанализировать исходный код вашего ядра (см. функцию <function>vm_enough_memory</function> в файле <filename>mm/mmap.c</filename>) и убедиться, что ядро поддерживает именно нужный вам режим. Наличие файла документации <filename>overcommit-accounting</filename> <emphasis>не</emphasis> следует считать признаком того, что он действительно поддерживается. В случае сомнений, обратитесь к эксперту по ядру или поставщику вашей системы.
