Repository: pluzanov/pg-doc-ru
Catalog: 9.6/seg.po
Languages: ru

source: This module implements a data type <type>seg</type> for representing line segments, or floating point intervals. <type>seg</type> can represent uncertainty in the interval endpoints, making it especially useful for representing laboratory measurements.
ru: Этот модуль реализует тип данных <type>seg</type> для представления отрезков или интервалов чисел с плавающей точкой. Тип <type>seg</type> может выражать отсутствие уверенности в границах интервала, что позволяет применять его для представления лабораторных измерений.

source: Rationale
ru: Обоснование

source: The geometry of measurements is usually more complex than that of a point in a numeric continuum. A measurement is usually a segment of that continuum with somewhat fuzzy limits. The measurements come out as intervals because of uncertainty and randomness, as well as because the value being measured may naturally be an interval indicating some condition, such as the temperature range of stability of a protein.
ru: Геометрия измерений обычно более сложна, чем точка в числовом континууме. Измерение обычно представляет собой отрезок этого континуума с нечёткими границами. Измеряемые показатели выражаются интервалами вследствие неопределённости и случайности, а также того, что измеряемое значение может отражать некоторое условие, например, диапазон температур стабильности протеина.

source: Using just common sense, it appears more convenient to store such data as intervals, rather than pairs of numbers. In practice, it even turns out more efficient in most applications.
ru: Руководствуясь только здравым смыслом, кажется более удобным хранить такие данные в виде интервалов, а не в виде двух отдельных чисел. На практике это оказывается даже эффективнее в большинстве приложений.

source: Further along the line of common sense, the fuzziness of the limits suggests that the use of traditional numeric data types leads to a certain loss of information. Consider this: your instrument reads 6.50, and you input this reading into the database. What do you get when you fetch it? Watch: <screen>test=&gt; select 6.50 :: float8 as "pH"; pH --- 6.5 (1 row)</screen> In the world of measurements, 6.50 is not the same as 6.5. It may sometimes be critically different. The experimenters usually write down (and publish) the digits they trust. 6.50 is actually a fuzzy interval contained within a bigger and even fuzzier interval, 6.5, with their center points being (probably) the only common feature they share. We definitely do not want such different data items to appear the same.
ru: Более того, вследствие нечёткости границ использование традиционных числовых типов данных приводит к определённой потере информации. Рассмотрим такой пример: ваш инструмент выдаёт 6.50 и вы вводите это значение в базу данных. Что вы получите, прочитав это значение из базы? Смотрите: <screen>test=&gt; select 6.50 :: float8 as "pH"; pH --- 6.5 (1 row)</screen> В мире измерений, 6.50 — не то же самое, что 6.5. И разница между этими измерениями иногда бывает критической. Экспериментаторы обычно записывают (и публикуют) цифры, которые заслуживают доверия. Запись 6.50 на самом деле представляет неточный интервал, содержащийся внутри большего и ещё более неточного интервала, 6.5, и единственное, что у них может быть общего, это их центральные точки. Поэтому мы определённо не хотим, чтобы такие разные элементы данных выглядели одинаково.

source: Conclusion? It is nice to have a special data type that can record the limits of an interval with arbitrarily variable precision. Variable in the sense that each data element records its own precision.
ru: Вывод? Удобно иметь специальный тип данных, в котором можно сохранить границы интервала с произвольной переменной точностью. В данном случае точность переменная в том смысле, что для каждого элемента данных она может записываться индивидуально.

source: Check this out: <screen>test=&gt; select '6.25 .. 6.50'::seg as "pH"; pH ------------ 6.25 .. 6.50 (1 row)</screen>
ru: Проверьте это: <screen>test=&gt; select '6.25 .. 6.50'::seg as "pH"; pH ------------ 6.25 .. 6.50 (1 row)</screen>

source: Syntax
ru: Синтаксис

source: The external representation of an interval is formed using one or two floating-point numbers joined by the range operator (<literal>..</literal> or <literal>...</literal>). Alternatively, it can be specified as a center point plus or minus a deviation. Optional certainty indicators (<literal>&lt;</literal>, <literal>&gt;</literal> or <literal>~</literal>) can be stored as well. (Certainty indicators are ignored by all the built-in operators, however.) <xref linkend="seg-repr-table"/> gives an overview of allowed representations; <xref linkend="seg-input-examples"/> shows some examples.
ru: Внешнее представление интервала образуется одним или двумя числами с плавающей точкой, соединёнными оператором диапазона (<literal>..</literal> или <literal>...</literal>). Кроме того, интервал можно задать центральной точкой плюс/минус отклонение. Также этот тип позволяет сохранить дополнительные индикаторы достоверности (<literal>&lt;</literal>, <literal>&gt;</literal> или <literal>~</literal>). (Однако индикаторы достоверности игнорируются всеми встроенными операторами.) Допустимые представления показаны в <xref remap="6" linkend="seg-repr-table"/>; некоторые примеры приведены в <xref remap="6" linkend="seg-input-examples"/>.

source: In <xref linkend="seg-repr-table"/>, <replaceable>x</replaceable>, <replaceable>y</replaceable>, and <replaceable>delta</replaceable> denote floating-point numbers. <replaceable>x</replaceable> and <replaceable>y</replaceable>, but not <replaceable>delta</replaceable>, can be preceded by a certainty indicator.
ru: В <xref remap="6" linkend="seg-repr-table"/> символы <replaceable>x</replaceable>, <replaceable>y</replaceable> и <replaceable>delta</replaceable> обозначают числа с плавающей точкой. Перед значениями <replaceable>x</replaceable> и <replaceable>y</replaceable>, но не <replaceable>delta</replaceable>, может быть добавлен индикатор достоверности.

source: <type>seg</type> External Representations
ru: Внешнее представление <type>seg</type>

source: Single value (zero-length interval)
ru: Одно значение (интервал нулевой длины)

source: Interval from <replaceable>x</replaceable> to <replaceable>y</replaceable>
ru: Интервал от <replaceable>x</replaceable> до <replaceable>y</replaceable>

source: Interval from <replaceable>x</replaceable> - <replaceable>delta</replaceable> to <replaceable>x</replaceable> + <replaceable>delta</replaceable>
ru: Интервал от <replaceable>x</replaceable> - <replaceable>delta</replaceable> до <replaceable>x</replaceable> + <replaceable>delta</replaceable>

source: Open interval with lower bound <replaceable>x</replaceable>
ru: Открытый интервал с нижней границей <replaceable>x</replaceable>

source: Open interval with upper bound <replaceable>x</replaceable>
ru: Открытый интервал с верхней границей <replaceable>x</replaceable>

source: Examples of Valid <type>seg</type> Input
ru: Примеры допустимых вводимых значений <type>seg</type>

source: Creates a zero-length segment (a point, if you will)
ru: Создаёт сегмент нулевой длины (или точку, если хотите)

source: Creates a zero-length segment and records <literal>~</literal> in the data. <literal>~</literal> is ignored by <type>seg</type> operations, but is preserved as a comment.
ru: Создаёт сегмент нулевой длины и записывает <literal>~</literal> в данные. Знак <literal>~</literal> игнорируется при операциях с <type>seg</type>, но сохраняется как комментарий.

source: Creates a point at 5.0. <literal>&lt;</literal> is ignored but is preserved as a comment.
ru: Создаёт точку с координатой 5.0. Знак <literal>&lt;</literal> игнорируется, но сохраняется как комментарий.

source: Creates a point at 5.0. <literal>&gt;</literal> is ignored but is preserved as a comment.
ru: Создаёт точку с координатой 5.0. Знак <literal>&gt;</literal> игнорируется, но сохраняется как комментарий.

source: Creates an interval <literal>4.7 .. 5.3</literal>. Note that the <literal>(+-)</literal> notation isn't preserved.
ru: Создаёт интервал <literal>4.7 .. 5.3</literal>. Заметьте, что запись <literal>(+-)</literal> не сохраняется.

source: Everything that is greater than or equal to 50
ru: Всё, что больше или равно 50

source: Everything that is less than or equal to 0
ru: Всё, что меньше или равно 0

source: Creates an interval <literal>0.015 .. 0.02</literal>
ru: Создаёт интервал <literal>0.015 .. 0.02</literal>

source: The same as <literal>1...2</literal>, or <literal>1 .. 2</literal>, or <literal>1..2</literal> (spaces around the range operator are ignored)
ru: То же, что и <literal>1...2</literal>, либо <literal>1 .. 2</literal>, либо <literal>1..2</literal> (пробелы вокруг оператора диапазона игнорируются)

source: Because <literal>...</literal> is widely used in data sources, it is allowed as an alternative spelling of <literal>..</literal>. Unfortunately, this creates a parsing ambiguity: it is not clear whether the upper bound in <literal>0...23</literal> is meant to be <literal>23</literal> or <literal>0.23</literal>. This is resolved by requiring at least one digit before the decimal point in all numbers in <type>seg</type> input.
ru: Так как <literal>...</literal> часто используется в источниках данных, он принимается в качестве альтернативного написания <literal>..</literal>. К сожалению, это порождает неоднозначность при разборе: неясно, какая верхняя граница имеется в виду в записи <literal>0...23</literal> — <literal>23</literal> или <literal>0.23</literal>. Для разрешения этой неоднозначности во входных числах <type>seg</type> перед десятичной точкой всегда должна быть минимум одна цифра.

source: As a sanity check, <type>seg</type> rejects intervals with the lower bound greater than the upper, for example <literal>5 .. 2</literal>.
ru: В качестве меры предосторожности, <type>seg</type> не принимает интервалы с нижней границей, превышающей верхнюю, например: <literal>5 .. 2</literal>.

source: Precision
ru: Точность

source: <type>seg</type> values are stored internally as pairs of 32-bit floating point numbers. This means that numbers with more than 7 significant digits will be truncated.
ru: Значения <type>seg</type> хранятся внутри как пары 32-битных чисел с плавающей точкой. Это значит, что числа с более чем 7 значащими цифрами будут усекаться.

source: Numbers with 7 or fewer significant digits retain their original precision. That is, if your query returns 0.00, you will be sure that the trailing zeroes are not the artifacts of formatting: they reflect the precision of the original data. The number of leading zeroes does not affect precision: the value 0.0067 is considered to have just 2 significant digits.
ru: Числа, содержащие 7 и меньше значащих цифр, сохраняют изначальную точность. То есть, если запрос возвращает 0.00, вы можете быть уверены, что конечные нули не являются артефактами форматирования: они отражают точность исходных данных. Количество ведущих нулей не влияет на точность: значение 0.0067 будет считаться имеющим только две значащих цифры.

source: Usage
ru: Использование

source: The <filename>seg</filename> module includes a GiST index operator class for <type>seg</type> values. The operators supported by the GiST operator class are shown in <xref linkend="seg-gist-operators"/>.
ru: Модуль <filename>seg</filename> включает класс операторов индекса GiST для значений <type>seg</type>. Операторы, поддерживаемые этим классом операторов, перечислены в <xref remap="6" linkend="seg-gist-operators"/>.

source: Seg GiST Operators
ru: Операторы seg для GiST

source: Operator
ru: Оператор

source: Description
ru: Описание

source: [a, b] is entirely to the left of [c, d]. That is, [a, b] &lt;&lt; [c, d] is true if b &lt; c and false otherwise.
ru: [a, b] полностью находится левее [c, d]. То есть, [a, b] &lt;&lt; [c, d] — true, если b &lt; c, и false в противном случае.

source: [a, b] is entirely to the right of [c, d]. That is, [a, b] &gt;&gt; [c, d] is true if a &gt; d and false otherwise.
ru: [a, b] полностью находится правее [c, d]. То есть, [a, b] &gt;&gt; [c, d] — true, если a &gt; d, и false в противном случае.

source: Overlaps or is left of &mdash; This might be better read as <quote>does not extend to right of</quote>. It is true when b &lt;= d.
ru: Пересекает или левее &mdash; Ещё лучше это читается как <quote>не простирается правее</quote>. Результатом будет true, когда b &lt;= d.

source: Overlaps or is right of &mdash; This might be better read as <quote>does not extend to left of</quote>. It is true when a &gt;= c.
ru: Пересекает или правее &mdash; Ещё лучше это читается как <quote>не простирается левее</quote>. Результатом будет true, когда a &gt;= c.

source: Same as &mdash; The segments [a, b] and [c, d] are identical, that is, a = c and b = d.
ru: Равенство &mdash; сегменты [a, b] и [c, d] равны, то есть, a = c и b = d.

source: The segments [a, b] and [c, d] overlap.
ru: Сегменты [a, b] и [c, d] пересекаются.

source: The segment [a, b] contains the segment [c, d], that is, a &lt;= c and b &gt;= d.
ru: Сегмент [a, b] содержит сегмент [c, d], то есть, a &lt;= c и b &gt;= d.

source: The segment [a, b] is contained in [c, d], that is, a &gt;= c and b &lt;= d.
ru: Сегмент [a, b] содержится в [c, d], то есть, a &gt;= c и b &lt;= d.

source: (Before PostgreSQL 8.2, the containment operators <literal>@&gt;</literal> and <literal>&lt;@</literal> were respectively called <literal>@</literal> and <literal>~</literal>. These names are still available, but are deprecated and will eventually be retired. Notice that the old names are reversed from the convention formerly followed by the core geometric data types!)
ru: (До версии PostgreSQL 8.2 операторы включения <literal>@&gt;</literal> и <literal>&lt;@</literal> обозначались соответственно как <literal>@</literal> и <literal>~</literal>. Эти имена по-прежнему действуют, но считаются устаревшими и в конце концов будут упразднены. Заметьте, что старые имена произошли из соглашения, которому раньше следовали ключевые геометрические типы данных!)

source: Less than
ru: Меньше

source: Greater than
ru: Больше

source: The standard B-tree operators are also provided, for example <placeholder-1/> These operators do not make a lot of sense for any practical purpose but sorting. These operators first compare (a) to (c), and if these are equal, compare (b) to (d). That results in reasonably good sorting in most cases, which is useful if you want to use ORDER BY with this type.
ru: Также поддерживаются стандартные операторы для B-дерева, например: <placeholder-1/> Эти операторы не имеют большого смысла ни для какой практической цели, кроме сортировки. Эти операторы сначала сравнивают (a) с (c), и если они равны, сравнивают (b) с (d). Результат сравнения позволяет упорядочить значения образом, подходящим для большинства случаев, что полезно, если вы хотите применять ORDER BY с этим типом.

source: Notes
ru: Замечания

source: For examples of usage, see the regression test <filename>sql/seg.sql</filename>.
ru: Примеры использования можно увидеть в регрессионном тесте <filename>sql/seg.sql</filename>.

source: The mechanism that converts <literal>(+-)</literal> to regular ranges isn't completely accurate in determining the number of significant digits for the boundaries. For example, it adds an extra digit to the lower boundary if the resulting interval includes a power of ten: <screen>postgres=&gt; select '10(+-)1'::seg as seg; seg --------- 9.0 .. 11 -- should be: 9 .. 11</screen>
ru: Механизм, преобразующий <literal>(+-)</literal> в обычные диапазоны, не вполне точно определяет число значащих цифр для границ. Например, он добавляет дополнительную цифру к нижней границе, если результирующий интервал включает степень десяти: <screen>postgres=&gt; select '10(+-)1'::seg as seg; seg --------- 9.0 .. 11 -- должно быть: 9 .. 11</screen>

source: The performance of an R-tree index can largely depend on the initial order of input values. It may be very helpful to sort the input table on the <type>seg</type> column; see the script <filename>sort-segments.pl</filename> for an example.
ru: Производительность индекса-R-дерева может значительно зависеть от начального порядка вводимых значений. Может быть очень полезно отсортировать входную таблицу по столбцу <type>seg</type>; пример можно найти в скрипте <filename>sort-segments.pl</filename>.

source: Credits
ru: Благодарности

source: Original author: Gene Selkov, Jr. <email>selkovjr@mcs.anl.gov</email>, Mathematics and Computer Science Division, Argonne National Laboratory.
ru: Первый автор: Джин Селков мл. <email>selkovjr@mcs.anl.gov</email>, Аргоннская национальная лаборатория, Отдел математики и компьютерных наук

source: My thanks are primarily to Prof. Joe Hellerstein (<ulink url="http://db.cs.berkeley.edu/jmh/"/>) for elucidating the gist of the GiST (<ulink url="http://gist.cs.berkeley.edu/"/>). I am also grateful to all Postgres developers, present and past, for enabling myself to create my own world and live undisturbed in it. And I would like to acknowledge my gratitude to Argonne Lab and to the U.S. Department of Energy for the years of faithful support of my database research.
ru: Я очень благодарен в первую очередь профессору Джо Геллерштейну (<ulink url="http://dbcsberkeleyedu/jmh/"/>) за пояснение сути GiST (<ulink url="http://gistcsberkeleyedu/"/>). Я также признателен всем разработчикам Postgres в настоящем и прошлом за возможность создать свой собственный мир и спокойно жить в нём. Ещё я хотел бы выразить признательность Аргоннской лаборатории и Министерству энергетики США за годы постоянной поддержки моих исследований в области баз данных.
