Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sepgsql.po
Languages: ru

source: For example, consider: <synopsis>UPDATE t1 SET x = 2, y = md5sum(y) WHERE z = 100;</synopsis> Here, <literal>db_column:update</literal> will be checked for <literal>t1.x</literal>, since it is being updated, <literal>db_column:{select update}</literal> will be checked for <literal>t1.y</literal>, since it is both updated and referenced, and <literal>db_column:select</literal> will be checked for <literal>t1.z</literal>, since it is only referenced. <literal>db_table:{select update}</literal> will also be checked at the table level.
ru: Например, рассмотрим запрос: <synopsis>UPDATE t1 SET x = 2, y = md5sum(y) WHERE z = 100;</synopsis> В данном случае <literal>db_column:update</literal> будет проверяться для столбца <literal>t1.x</literal>, так как он изменяется, <literal>db_column:{select update}</literal> будет проверяться для <literal>t1.y</literal>, так как он и считывается, и изменяется, а <literal>db_column:select</literal> — для столбца <literal>t1.z</literal>, так как он только считывается. На уровне таблицы также будет проверяться разрешение <literal>db_table:{select update}</literal>.

source: For sequences, <literal>db_sequence:get_value</literal> is checked when we reference a sequence object using <literal>SELECT</literal>; however, note that we do not currently check permissions on execution of corresponding functions such as <literal>lastval()</literal>.
ru: Для последовательностей проверяется разрешение <literal>db_sequence:get_value</literal>, когда имеет место обращение к объекту последовательности в <literal>SELECT</literal>; заметьте, однако, что в настоящее время разрешения на выполнение связанных функций, таких как, <literal>lastval()</literal>, не проверяются.

source: For views, <literal>db_view:expand</literal> will be checked, then any other required permissions will be checked on the objects being expanded from the view, individually.
ru: Для представлений проверяется <literal>db_view:expand</literal>, а затем все другие соответствующие разрешения для объектов, развёрнутых из определения представления, в индивидуальном порядке.

source: For functions, <literal>db_procedure:{execute}</literal> will be checked when user tries to execute a function as a part of query, or using fast-path invocation. If this function is a trusted procedure, it also checks <literal>db_procedure:{entrypoint}</literal> permission to check whether it can perform as entry point of trusted procedure.
ru: Для функций проверяется <literal>db_procedure:{execute}</literal>, когда пользователь пытается выполнить функцию в составе запроса, либо при вызове по быстрому пути. Если эта функция является доверенной процедурой, также проверяется разрешение <literal>db_procedure:{entrypoint}</literal>, чтобы удостовериться, что эта функция может быть точкой входа в доверенную процедуру.

source: In order to access any schema object, <literal>db_schema:search</literal> permission is required on the containing schema. When an object is referenced without schema qualification, schemas on which this permission is not present will not be searched (just as if the user did not have <literal>USAGE</literal> privilege on the schema). If an explicit schema qualification is present, an error will occur if the user does not have the requisite permission on the named schema.
ru: При обращении к любому объекту схемы необходимо иметь разрешение <literal>db_schema:search</literal> для содержащей его схемы. Когда имя целевого объекта не дополняется схемой, схемы, для которых данное разрешение отсутствует, не будут просматриваться (то же происходит, если у пользователя нет права <literal>USAGE</literal> для этой схемы). Когда схема указывается явно, пользователь получит ошибку, если он не имеет требуемого разрешения для доступа к указанной схеме.

source: The client must be allowed to access all referenced tables and columns, even if they originated from views which were then expanded, so that we apply consistent access control rules independent of the manner in which the table contents are referenced.
ru: Клиенту должен быть разрешён доступ ко всем задействованным в запросе таблицам и столбцам, даже если они проявились в нём в результате разворачивания представлений, так что правила применяются согласованно вне зависимости от варианта обращения к содержимому таблиц.

source: The default database privilege system allows database superusers to modify system catalogs using DML commands, and reference or modify toast tables. These operations are prohibited when <filename>sepgsql</filename> is enabled.
ru: Стандартная система привилегий позволяет суперпользователям баз данных изменять системные каталоги с помощью команд DML и обращаться к таблицам TOAST или модифицировать их. Когда модуль <filename>sepgsql</filename> активен, эти операции запрещаются.

source: DDL Permissions
ru: Разрешения для DDL

source: <productname>SELinux</productname> defines several permissions to control common operations for each object type; such as creation, alter, drop and relabel of security label. In addition, several object types have special permissions to control their characteristic operations; such as addition or deletion of name entries within a particular schema.
ru: <productname>SELinux</productname> определяет набор разрешений для управления стандартными операциями для каждого типа объекта: создание, изменение определения, удаление и смена метки безопасности. В дополнение к ним для некоторых типов объектов предусмотрены специальные разрешения для управления их специфическими операциями, как например, добавление или удаление объектов в определённой схеме.

source: Creating a new database object requires <literal>create</literal> permission. <productname>SELinux</productname> will grant or deny this permission based on the client's security label and the proposed security label for the new object. In some cases, additional privileges are required:
ru: Для создания нового объекта базы данных требуется разрешение <literal>create</literal>. <productname>SELinux</productname> разрешает или запрещает выполнение этой операции в зависимости от метки безопасности клиента и предполагаемой метки безопасности нового объекта. В некоторых случаях требуются дополнительные разрешения:

source: <xref linkend="sql-createdatabase"/> additionally requires <literal>getattr</literal> permission for the source or template database.
ru: <xref linkend="sql-createdatabase"/> дополнительно требует разрешения <literal>getattr</literal> в исходной или шаблонной базе данных.

source: Creating a schema object additionally requires <literal>add_name</literal> permission on the parent schema.
ru: Создание объекта схемы дополнительно требует разрешения <literal>add_name</literal> в родительской схеме.

source: Creating a table additionally requires permission to create each individual table column, just as if each table column were a separate top-level object.
ru: Создание таблицы дополнительно требует разрешения на создание каждой отдельного столбца таблицы, как если бы каждый столбец таблицы был отдельным объектом верхнего уровня.

source: Creating a function marked as <literal>LEAKPROOF</literal> additionally requires <literal>install</literal> permission. (This permission is also checked when <literal>LEAKPROOF</literal> is set for an existing function.)
ru: Создание функции с атрибутом <literal>LEAKPROOF</literal> дополнительно требует разрешения <literal>install</literal>. (Это разрешение также проверяется, когда атрибут <literal>LEAKPROOF</literal> устанавливается для существующей функции.)

source: When <literal>DROP</literal> command is executed, <literal>drop</literal> will be checked on the object being removed. Permissions will be also checked for objects dropped indirectly via <literal>CASCADE</literal>. Deletion of objects contained within a particular schema (tables, views, sequences and procedures) additionally requires <literal>remove_name</literal> on the schema.
ru: Когда выполняется команда <literal>DROP</literal>, для удаляемого объекта будет проверяться разрешение <literal>drop</literal>. Разрешения будут также проверяться и для объектов, удаляемых косвенно, вследствие указания <literal>CASCADE</literal>. Для удаления объектов, содержащихся в определённой схеме, (таблиц, представления, последовательностей и процедур) дополнительно нужно иметь разрешение <literal>remove_name</literal> в этой схеме.

source: When <literal>ALTER</literal> command is executed, <literal>setattr</literal> will be checked on the object being modified for each object types, except for subsidiary objects such as the indexes or triggers of a table, where permissions are instead checked on the parent object. In some cases, additional permissions are required:
ru: Когда выполняется команда <literal>ALTER</literal>, для каждого модифицируемого объекта проверяется разрешение <literal>setattr</literal>, кроме подчинённых объектов, таких как индексы или триггеры таблиц (на них распространяются разрешения родительского объекта). В некоторых случаях требуются дополнительные разрешения:

source: Moving an object to a new schema additionally requires <literal>remove_name</literal> permission on the old schema and <literal>add_name</literal> permission on the new one.
ru: При перемещении объекта в новую схему дополнительно требуется разрешение <literal>remove_name</literal> в старой схеме и <literal>add_name</literal> в новой.

source: Setting the <literal>LEAKPROOF</literal> attribute on a function requires <literal>install</literal> permission.
ru: Для установки атрибута <literal>LEAKPROOF</literal> для функции требуется разрешение <literal>install</literal>.

source: Using <xref linkend="sql-security-label"/> on an object additionally requires <literal>relabelfrom</literal> permission for the object in conjunction with its old security label and <literal>relabelto</literal> permission for the object in conjunction with its new security label. (In cases where multiple label providers are installed and the user tries to set a security label, but it is not managed by <productname>SELinux</productname>, only <literal>setattr</literal> should be checked here. This is currently not done due to implementation restrictions.)
ru: Для использования <xref linkend="sql-security-label"/> дополнительно требуется разрешение <literal>relabelfrom</literal> для объекта с его старой меткой безопасности и <literal>relabelto</literal> для этого объекта с новой меткой безопасности. (В случаях, когда установлено несколько поставщиков меток и пользователь пытается задать метку, неподконтрольную <productname>SELinux</productname>, должно проверяться только разрешение <literal>setattr</literal>. В настоящее время этого не происходит из-за ограничений реализации.)

source: Trusted Procedures
ru: Доверенные процедуры

source: Trusted procedures are similar to security definer functions or setuid commands. <productname>SELinux</productname> provides a feature to allow trusted code to run using a security label different from that of the client, generally for the purpose of providing highly controlled access to sensitive data (e.g. rows might be omitted, or the precision of stored values might be reduced). Whether or not a function acts as a trusted procedure is controlled by its security label and the operating system security policy. For example:
ru: Доверенные процедуры похожи на функции, определяющие контекст безопасности, или команды setuid. В <productname>SELinux</productname> реализована возможность запускать доверенный код с меткой безопасности, отличной от метки клиента, как правило, для предоставления чётко контролируемого доступа к важным данным (при этом например, могут отсеиваться строки или хранимые значения могут выводиться с меньшей точностью). Будет ли функция вызываться как доверенная процедура, определяется её меткой безопасности и политикой операционной системы. Например:

source: The above operations should be performed by an administrative user.
ru: Показанные выше операции должен выполнять пользователь с правами администратора.

source: In this case, a regular user cannot reference <literal>customer.credit</literal> directly, but a trusted procedure <literal>show_credit</literal> allows the user to print the credit card numbers of customers with some of the digits masked out.
ru: В данном случае обычный пользователь не может обращаться к <literal>customer.credit</literal> напрямую, но доверенная процедура <literal>show_credit</literal> позволяет ему получить номера кредитных карт клиентов, в которых будут скрыты некоторые цифры.

source: Dynamic Domain Transitions
ru: Динамические переключения домена

source: It is possible to use SELinux's dynamic domain transition feature to switch the security label of the client process, the client domain, to a new context, if that is allowed by the security policy. The client domain needs the <literal>setcurrent</literal> permission and also <literal>dyntransition</literal> from the old to the new domain.
ru: Возможность динамического перехода из домена в домен SELinux позволяет переводить метку безопасности клиентского процесса, клиентский домен в новый контекст, если это допускается политикой безопасности. Для этого клиент должен иметь разрешение <literal>setcurrent</literal>, а также разрешение <literal>dyntransition</literal> для перехода из старого в новый домен.

source: Dynamic domain transitions should be considered carefully, because they allow users to switch their label, and therefore their privileges, at their option, rather than (as in the case of a trusted procedure) as mandated by the system. Thus, the <literal>dyntransition</literal> permission is only considered safe when used to switch to a domain with a smaller set of privileges than the original one. For example:
ru: Динамические переключения домена следует тщательно продумывать, так как таким образом пользователи могут менять свои метки, а значит и привилегии, по собственному желанию, а не (как в случае с доверенными процедурами) по правилам, диктуемым системой. Таким образом, разрешение <literal>dyntransition</literal> считается безопасным, только когда применяется для переключения в домен с более ограниченным набором привилегий, чем текущий. Например:

source: In this example above we were allowed to switch from the larger MCS range <literal>c1.c1023</literal> to the smaller range <literal>c1.c4</literal>, but switching back was denied.
ru: В показанном выше примере мы смогли переключиться из более широкого диапазона MCS <literal>c1.c1023</literal> в более узкий <literal>c1.c4</literal>, но переключение в обратную сторону было запрещено.

source: A combination of dynamic domain transition and trusted procedure enables an interesting use case that fits the typical process life-cycle of connection pooling software. Even if your connection pooling software is not allowed to run most of SQL commands, you can allow it to switch the security label of the client using the <literal>sepgsql_setcon()</literal> function from within a trusted procedure; that should take some credential to authorize the request to switch the client label. After that, this session will have the privileges of the target user, rather than the connection pooler. The connection pooler can later revert the security label change by again using <literal>sepgsql_setcon()</literal> with <literal>NULL</literal> argument, again invoked from within a trusted procedure with appropriate permissions checks. The point here is that only the trusted procedure actually has permission to change the effective security label, and only does so when given proper credentials. Of course, for secure operation, the credential store (table, procedure definition, or whatever) must be protected from unauthorized access.
ru: Сочетание динамического переключения домена с доверенными процедурами позволяет получить интересное решение, подходящее для реализации жизненного цикла процессов с пулом соединений. Даже если вашему менеджеру пула соединений не разрешается запускать многие команды SQL, вы можете разрешить ему сменить метку безопасности клиента, вызвав функцию <literal>sepgsql_setcon()</literal> из доверенной процедуры; для этого может передаваться удостоверение для авторизации запроса на смену метки клиента. После этого сеанс получит привилегии целевого пользователя, а не пользователя пула соединений. Позднее менеджер пула может отменить смену контекста безопасности, вызвав <literal>sepgsql_setcon()</literal> с аргументом <literal>NULL</literal>, так же из доверенной процедуры с необходимыми проверками разрешений. Идея этого подхода в том, что только этой доверенной процедуре будет разрешено менять действующую метку безопасности и только в том случае, когда ей передаётся правильное удостоверение. Разумеется, чтобы это решение было безопасным, хранилище удостоверений (таблица, определение процедуры или что-то другое) не должно быть общедоступным.

source: Miscellaneous
ru: Разное

source: We reject the <xref linkend="sql-load"/> command across the board, because any module loaded could easily circumvent security policy enforcement.
ru: Выполнение команды <xref linkend="sql-load"/> в активном режиме запрещается, так как любой загруженный модуль может легко обойти ограничения политики безопасности.

source: Sepgsql Functions
ru: Функции sepgsql

source: <xref linkend="sepgsql-functions-table"/> shows the available functions.
ru: В <xref remap="6" linkend="sepgsql-functions-table"/> перечислены все доступные функции.

source: Returns the client domain, the current security label of the client.
ru: Возвращает клиентский домен, текущую метку безопасности клиента.

source: Switches the client domain of the current session to the new domain, if allowed by the security policy. It also accepts <literal>NULL</literal> input as a request to transition to the client's original domain.
ru: Переключает домен клиента текущего сеанса в новый домен, если это допускает политика безопасности. Эта функция также принимает в аргументе <literal>NULL</literal> как запрос на переход в начальный домен клиента.

source: Translates the given qualifies MLS/MCS range into raw format if the mcstrans daemon is running.
ru: Переводит заданный диапазон MLS/MCS из полной записи в низкоуровневый формат, если работает демон mcstrans.

source: Translates the given raw MCS/MCS range into qualified format if the mcstrans daemon is running.
ru: Переводит заданный диапазон MLS/MCS из низкоуровневого формата в полную запись, если работает демон mcstrans.

source: Sets up initial security labels for all objects within the current database. The argument may be NULL, or the name of a specfile to be used as alternative of the system default.
ru: Устанавливает начальные метки безопасности для всех объектов в текущей базе данных. В аргументе может передаваться NULL или имя файла со спецификациями контекстов, который будет применяться вместо стандартного системного.

source: Limitations
ru: Ограничения

source: Data Definition Language (DDL) Permissions
ru: Разрешения для языка определения данных (DDL, Data Definition Language)

source: Due to implementation restrictions, some DDL operations do not check permissions.
ru: Вследствие ограничений реализации, для некоторых операций DDL разрешения не проверяются.

source: Data Control Language (DCL) Permissions
ru: Разрешения для языка управления данными (DCL, Data Control Language)

source: Due to implementation restrictions, DCL operations do not check permissions.
ru: Вследствие ограничений реализации, для операций DCL разрешения не проверяются.

source: Row-level access control
ru: Управление доступом на уровне строк

source: <productname>PostgreSQL</productname> supports row-level access, but <filename>sepgsql</filename> does not.
ru: <productname>PostgreSQL</productname> поддерживает ограничение доступа на уровне строк, а <filename>sepgsql</filename> — нет.

source: Covert channels
ru: Скрытые каналы

source: <filename>sepgsql</filename> does not try to hide the existence of a certain object, even if the user is not allowed to reference it. For example, we can infer the existence of an invisible object as a result of primary key conflicts, foreign key violations, and so on, even if we cannot obtain the contents of the object. The existence of a top secret table cannot be hidden; we only hope to conceal its contents.
ru: Модуль <filename>sepgsql</filename> не пытается скрыть существование определённого объекта, даже если пользователю не разрешено обращаться к нему. Например, возможно догадаться о существовании невидимого объекта по конфликтам первичного ключа, нарушениям внешних ключей и т. д., даже когда нельзя получить содержимое этого объекта. Существование совершенно секретной таблицы невозможно скрыть; надеяться можно только на то, что будет защищено её содержимое.

source: External Resources
ru: Внешние ресурсы

source: <ulink url="http://wiki.postgresql.org/wiki/SEPostgreSQL">SE-PostgreSQL Introduction</ulink>
ru: <ulink url="http://wiki.postgresql.org/wiki/SEPostgreSQL">SE-PostgreSQL Introduction</ulink>, Введение в SE-PostgreSQL

source: This wiki page provides a brief overview, security design, architecture, administration and upcoming features.
ru: На этой вики-странице даётся краткий обзор этого решения и рассказывается об архитектуре и конструкции безопасности, администрировании и ожидаемых в будущем возможностях.

source: <ulink url="http://docs.fedoraproject.org/selinux-user-guide/">Fedora SELinux User Guide</ulink>
ru: <ulink url="http://docs.fedoraproject.org/selinux-user-guide/">Fedora SELinux User Guide</ulink>, Руководство пользователя SELinux в ОС Fedora

source: This document provides a wide spectrum of knowledge to administer <productname>SELinux</productname> on your systems. It focuses primarily on Fedora, but is not limited to Fedora.
ru: В этом документе представлен широкий спектр знаний по администрированию <productname>SELinux</productname> в системе. В первую очередь он ориентирован на ОС Fedora, но его область применения не ограничена ей.

source: <ulink url="http://docs.fedoraproject.org/selinux-faq">Fedora SELinux FAQ</ulink>
ru: <ulink url="http://docs.fedoraproject.org/selinux-faq">Fedora SELinux FAQ</ulink>, Часто задаваемые вопросы по SELinux в ОС Fedora

source: This document answers frequently asked questions about <productname>SELinux</productname>. It focuses primarily on Fedora, but is not limited to Fedora.
ru: В этом документе даются ответы на часто задаваемые вопросы по <productname>SELinux</productname>. В первую очередь он ориентирован на ОС Fedora, но его область применения не ограничена ей.

source: Author
ru: Автор

source: KaiGai Kohei <email>kaigai@ak.jp.nec.com</email>
ru: КайГай Кохей <email>kaigai@ak.jp.nec.com</email>
