Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sepgsql.po
Languages: ru

source: <filename>sepgsql</filename> is a loadable module that supports label-based mandatory access control (MAC) based on <productname>SELinux</productname> security policy.
ru: Загружаемый модуль <filename>sepgsql</filename> поддерживает мандатное управление доступом (MAC, Mandatory Access Control) с метками, построенное на базе политик безопасности <productname>SELinux</productname>.

source: The current implementation has significant limitations, and does not enforce mandatory access control for all actions. See <xref linkend="sepgsql-limitations"/>.
ru: Текущая реализация имеет существенные ограничения и контролирует не все действия. См. <xref remap="4" linkend="sepgsql-limitations"/>.

source: Overview
ru: Обзор

source: This module integrates with <productname>SELinux</productname> to provide an additional layer of security checking above and beyond what is normally provided by <productname>PostgreSQL</productname>. From the perspective of <productname>SELinux</productname>, this module allows <productname>PostgreSQL</productname> to function as a user-space object manager. Each table or function access initiated by a DML query will be checked against the system security policy. This check is in addition to the usual SQL permissions checking performed by <productname>PostgreSQL</productname>.
ru: Этот модуль интегрируется в <productname>SELinux</productname> и обеспечивает дополнительный уровень проверок безопасности, расширяющий и дополняющий обычные средства <productname>PostgreSQL</productname>. С точки зрения <productname>SELinux</productname>, данный модуль позволяет <productname>PostgreSQL</productname> выполнять роль менеджера объектов в пространстве пользователя. При выполнении запроса DML обращение к каждой таблице или функции в нём будет контролироваться согласно системной политике безопасности. Эта проверка дополняет штатную проверку разрешений SQL, которую производит <productname>PostgreSQL</productname>.

source: <productname>SELinux</productname> access control decisions are made using security labels, which are represented by strings such as <literal>system_u:object_r:sepgsql_table_t:s0</literal>. Each access control decision involves two labels: the label of the subject attempting to perform the action, and the label of the object on which the operation is to be performed. Since these labels can be applied to any sort of object, access control decisions for objects stored within the database can be (and, with this module, are) subjected to the same general criteria used for objects of any other type, such as files. This design is intended to allow a centralized security policy to protect information assets independent of the particulars of how those assets are stored.
ru: Механизм <productname>SELinux</productname> принимает решения о разрешении доступа на основе меток безопасности, представляемых строками вида <literal>system_u:object_r:sepgsql_table_t:s0</literal>. В каждом решении учитываются две метки: метка субъекта, пытающегося выполнить действие, и метка объекта, над которым должно совершаться это действие. Так как эти метки могут применяться к объекту любого вида, решения о разрешении доступа к объектам внутри базы данных могут подчиняться (и с этим модулем фактически подчиняются) общим критериям, применяемым к объектам любого другого типа, например, к файлам. Эта схема позволяет организовать централизованную политику безопасности для защиты информационных активов, не зависящую от того, как именно хранятся эти активы.

source: The <xref linkend="sql-security-label"/> statement allows assignment of a security label to a database object.
ru: Назначить метку безопасности объекту баз данных позволяет команда <xref linkend="sql-security-label"/>.

source: Installation
ru: Установка

source: <filename>sepgsql</filename> can only be used on <productname>Linux</productname> 2.6.28 or higher with <productname>SELinux</productname> enabled. It is not available on any other platform. You will also need <productname>libselinux</productname> 2.1.10 or higher and <productname>selinux-policy</productname> 3.9.13 or higher (although some distributions may backport the necessary rules into older policy versions).
ru: Модуль <filename>sepgsql</filename> может работать только в <productname>Linux</productname> 2.6.28 и новее с включённым <productname>SELinux</productname>. На остальных платформах он не поддерживается. Вам также понадобится <productname>libselinux</productname> 2.1.10 или новее и <productname>selinux-policy</productname> 3.9.13 или новее (хотя в некоторых дистрибутивах необходимые правила могут быть адаптированы к политике старой версии).

source: The <command>sestatus</command> command allows you to check the status of <productname>SELinux</productname>. A typical display is: <screen>$ sestatus SELinux status: enabled SELinuxfs mount: /selinux Current mode: enforcing Mode from config file: enforcing Policy version: 24 Policy from config file: targeted</screen> If <productname>SELinux</productname> is disabled or not installed, you must set that product up first before installing this module.
ru: Команда <command>sestatus</command> позволяет проверить состояние <productname>SELinux</productname>. Типичный её вывод выглядит так: <screen>$ sestatus SELinux status: enabled SELinuxfs mount: /selinux Current mode: enforcing Mode from config file: enforcing Policy version: 24 Policy from config file: targeted</screen> Если <productname>SELinux</productname> отключён или не установлен, его необходимо привести в рабочее состояние, прежде чем устанавливать этот модуль.

source: To build this module, include the option <literal>--with-selinux</literal> in your PostgreSQL <literal>configure</literal> command. Be sure that the <filename>libselinux-devel</filename> RPM is installed at build time.
ru: Чтобы собрать этот модуль, добавьте параметр <literal>--with-selinux</literal> в команду PostgreSQL <literal>configure</literal>. Убедитесь в том, что в момент сборки установлен RPM-пакет <filename>libselinux-devel</filename>.

source: To use this module, you must include <literal>sepgsql</literal> in the <xref linkend="guc-shared-preload-libraries"/> parameter in <filename>postgresql.conf</filename>. The module will not function correctly if loaded in any other manner. Once the module is loaded, you should execute <filename>sepgsql.sql</filename> in each database. This will install functions needed for security label management, and assign initial security labels.
ru: Чтобы использовать этот модуль, вы должны включить <literal>sepgsql</literal> в <xref linkend="guc-shared-preload-libraries"/> в <filename>postgresql.conf</filename>. Этот модуль не будет корректно работать, если загрузить его каким-либо другим способом. Загрузив его, нужно выполнить <filename>sepgsql.sql</filename> в каждой базе данных. Этот скрипт установит функции, необходимые для управления метками безопасности, и назначит начальные метки безопасности.

source: Here is an example showing how to initialize a fresh database cluster with <filename>sepgsql</filename> functions and security labels installed. Adjust the paths shown as appropriate for your installation:
ru: Следующий пример показывает, как инициализировать новый кластер баз данных и установить в него функции и метки безопасности <filename>sepgsql</filename>. Измените пути в соответствии с размещением вашей инсталляции:

source: $ export PGDATA=/path/to/data/directory $ initdb $ vi $PGDATA/postgresql.conf change #shared_preload_libraries = '' # (change requires restart) to shared_preload_libraries = 'sepgsql' # (change requires restart) $ for DBNAME in template0 template1 postgres; do postgres --single -F -c exit_on_error=true $DBNAME \ &lt;/usr/local/pgsql/share/contrib/sepgsql.sql &gt;/dev/null done
ru: $ export PGDATA=/path/to/data/directory $ initdb $ vi $PGDATA/postgresql.conf изменить #shared_preload_libraries = '' # (после изменения требуется перезапуск) на shared_preload_libraries = 'sepgsql' # (после изменения требуется перезапуск) $ for DBNAME in template0 template1 postgres; do postgres --single -F -c exit_on_error=true $DBNAME \ &lt;/usr/local/pgsql/share/contrib/sepgsql.sql &gt;/dev/null done

source: Please note that you may see some or all of the following notifications depending on the particular versions you have of <productname>libselinux</productname> and <productname>selinux-policy</productname>: <screen>/etc/selinux/targeted/contexts/sepgsql_contexts: line 33 has invalid object type db_blobs /etc/selinux/targeted/contexts/sepgsql_contexts: line 36 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 37 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 38 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 39 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 40 has invalid object type db_language</screen> These messages are harmless and should be ignored.
ru: Заметьте, что вы можете увидеть следующие уведомления, в зависимости от конкретных установленных версий <productname>libselinux</productname> и <productname>selinux-policy</productname>: <screen>/etc/selinux/targeted/contexts/sepgsql_contexts: line 33 has invalid object type db_blobs /etc/selinux/targeted/contexts/sepgsql_contexts: line 36 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 37 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 38 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 39 has invalid object type db_language /etc/selinux/targeted/contexts/sepgsql_contexts: line 40 has invalid object type db_language</screen> Эти сообщения не критичны и их можно игнорировать.

source: If the installation process completes without error, you can now start the server normally.
ru: Если процесс установки завершается без ошибок, вы можете запустить сервер обычным образом.

source: Regression Tests
ru: Регрессионные тесты

source: Due to the nature of <productname>SELinux</productname>, running the regression tests for <filename>sepgsql</filename> requires several extra configuration steps, some of which must be done as root. The regression tests will not be run by an ordinary <literal>make check</literal> or <literal>make installcheck</literal> command; you must set up the configuration and then invoke the test script manually. The tests must be run in the <filename>contrib/sepgsql</filename> directory of a configured PostgreSQL build tree. Although they require a build tree, the tests are designed to be executed against an installed server, that is they are comparable to <literal>make installcheck</literal> not <literal>make check</literal>.
ru: Природа <productname>SELinux</productname> такова, что для проведения регрессионных тестов <filename>sepgsql</filename> требуются дополнительные действия по настройке и некоторые из них должен выполнять root. Регрессионные тесты не будут запускаться обычной командой <literal>make check</literal> или <literal>make installcheck</literal>; вы должны настроить конфигурацию и затем вызвать тестовый скрипт вручную. Тесты должны запускаться в каталоге <filename>contrib/sepgsql</filename> настроенного дерева сборки PostgreSQL. Хотя им требуется дерево сборки, эти тесты рассчитаны на использование установленного сервера, то есть они примерно соответствуют <literal>make installcheck</literal>, но не <literal>make check</literal>.

source: First, set up <filename>sepgsql</filename> in a working database according to the instructions in <xref linkend="sepgsql-installation"/>. Note that the current operating system user must be able to connect to the database as superuser without password authentication.
ru: Сначала установите <filename>sepgsql</filename> в рабочую базу данных по инструкциям, приведённым в <xref remap="6" linkend="sepgsql-installation"/>. Заметьте, что для этого текущий пользователь операционной системы должен подключаться к базе данных как суперпользователь без аутентификации по паролю.

source: Second, build and install the policy package for the regression test. The <filename>sepgsql-regtest</filename> policy is a special purpose policy package which provides a set of rules to be allowed during the regression tests. It should be built from the policy source file <filename>sepgsql-regtest.te</filename>, which is done using <command>make</command> with a Makefile supplied by SELinux. You will need to locate the appropriate Makefile on your system; the path shown below is only an example. Once built, install this policy package using the <command>semodule</command> command, which loads supplied policy packages into the kernel. If the package is correctly installed, <literal><command>semodule</command> -l</literal> should list <literal>sepgsql-regtest</literal> as an available policy package:
ru: На втором шаге соберите и установите пакет политики для регрессионного теста. Политика <filename>sepgsql-regtest</filename> представляет собой политику особого назначения, предоставляющую набор правил, включаемых во время регрессионных тестов. Её следует скомпилировать из исходного файла <filename>sepgsql-regtest.te</filename>, что можно сделать командой <command>make</command> со скриптом Makefile, поставляемым с SELinux. Вам нужно будет найти нужный Makefile в своей системе; путь, показанный ниже, приведён только в качестве примера. Скомпилировав пакет политики, его нужно установить с помощью команды <command>semodule</command>, которая загружает переданные ей пакеты в ядро. Если пакет установлен корректно, команда <literal><command>semodule</command> -l</literal> должна вывести <literal>sepgsql-regtest</literal> в списке доступных пакетов политик:

source: Third, turn on <literal>sepgsql_regression_test_mode</literal>. For security reasons, the rules in <filename>sepgsql-regtest</filename> are not enabled by default; the <literal>sepgsql_regression_test_mode</literal> parameter enables the rules needed to launch the regression tests. It can be turned on using the <command>setsebool</command> command:
ru: На третьем шаге включите параметр <literal>sepgsql_regression_test_mode</literal>. По соображениям безопасности, правила в <filename>sepgsql-regtest</filename> по умолчанию неактивны; параметр <literal>sepgsql_regression_test_mode</literal> активирует правила, необходимые для проведения регрессионных тестов. Включить этот параметр можно командой <command>setsebool</command>:

source: Fourth, verify your shell is operating in the <literal>unconfined_t</literal> domain:
ru: На четвёртом шаге убедитесь в том, что ваша оболочка работает в домене <literal>unconfined_t</literal>:

source: See <xref linkend="sepgsql-resources"/> for details on adjusting your working domain, if necessary.
ru: Если необходимо сменить рабочий домен, в подробностях это описывается в <xref remap="6" linkend="sepgsql-resources"/>.

source: Finally, run the regression test script:
ru: Наконец, запустите скрипт регрессионного теста:

source: This script will attempt to verify that you have done all the configuration steps correctly, and then it will run the regression tests for the <filename>sepgsql</filename> module.
ru: Этот скрипт попытается проверить, все ли шаги по настройке конфигурации выполнены корректно, а затем запустит регрессионные тесты для модуля <filename>sepgsql</filename>.

source: After completing the tests, it's recommended you disable the <literal>sepgsql_regression_test_mode</literal> parameter:
ru: Завершив тесты, рекомендуется отключить параметр <literal>sepgsql_regression_test_mode</literal>:

source: You might prefer to remove the <filename>sepgsql-regtest</filename> policy entirely:
ru: Другой, возможно, более предпочтительный вариант — удалить политику <filename>sepgsql-regtest</filename> полностью:

source: GUC Parameters
ru: Параметры GUC

source: <primary><varname>sepgsql.permissive</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>sepgsql.permissive</varname></primary>

source: This parameter enables <filename>sepgsql</filename> to function in permissive mode, regardless of the system setting. The default is off. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Этот параметр переводит <filename>sepgsql</filename> в разрешительный режим, вне зависимости от режима системы. По умолчанию он имеет значение off (отключён). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: When this parameter is on, <filename>sepgsql</filename> functions in permissive mode, even if SELinux in general is working in enforcing mode. This parameter is primarily useful for testing purposes.
ru: Когда этот параметр включён, <filename>sepgsql</filename> действует в разрешительном режиме, даже если SELinux в целом находится в ограничительном режиме. Этот параметр полезен в первую очередь для тестирования.

source: <primary><varname>sepgsql.debug_audit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>sepgsql.debug_audit</varname></primary>

source: This parameter enables the printing of audit messages regardless of the system policy settings. The default is off, which means that messages will be printed according to the system settings.
ru: Этот параметр включает вывод сообщений аудита вне зависимости от параметров системной политики. По умолчанию он отключён (имеет значение off), что означает, что сообщения будут выводиться согласно параметрам системы.

source: The security policy of <productname>SELinux</productname> also has rules to control whether or not particular accesses are logged. By default, access violations are logged, but allowed accesses are not.
ru: Политики безопасности <productname>SELinux</productname> также содержит правила, определяющие, будут ли фиксироваться в журнале определённые события. По умолчанию фиксируются нарушения доступа, а успешный доступ — нет.

source: This parameter forces all possible logging to be turned on, regardless of the system policy.
ru: Этот параметр принудительно включает фиксирование в журнале всех возможных событий, вне зависимости от системной политики.

source: Features
ru: Функциональные возможности

source: Controlled Object Classes
ru: Управляемые классы объектов

source: The security model of <productname>SELinux</productname> describes all the access control rules as relationships between a subject entity (typically, a client of the database) and an object entity (such as a database object), each of which is identified by a security label. If access to an unlabeled object is attempted, the object is treated as if it were assigned the label <literal>unlabeled_t</literal>.
ru: Модель безопасности <productname>SELinux</productname> описывает все правила доступа в виде отношений между сущностью субъекта (обычно, это клиент базы данных) и сущностью объекта (например, объектом базы данных), каждая из которых определяется меткой безопасности. Если осуществляется попытка доступа к непомеченному объекту, он обрабатывается как объект, имеющий метку <literal>unlabeled_t</literal>.

source: Currently, <filename>sepgsql</filename> allows security labels to be assigned to schemas, tables, columns, sequences, views, and functions. When <filename>sepgsql</filename> is in use, security labels are automatically assigned to supported database objects at creation time. This label is called a default security label, and is decided according to the system security policy, which takes as input the creator's label, the label assigned to the new object's parent object and optionally name of the constructed object.
ru: В настоящее время <filename>sepgsql</filename> позволяет назначать метки безопасности схемам, таблицам, столбцам, последовательностям, представлениям и функциям. Когда <filename>sepgsql</filename> активен, метки безопасности автоматически назначаются поддерживаемым объектам базы в момент создания. Такая метка называется меткой безопасности по умолчанию и устанавливается согласно политике безопасности системы, которая учитывает метку создателя, метку, назначенную родительскому объекту создаваемого объекта и, возможно, имя создаваемого объекта.

source: A new database object basically inherits the security label of the parent object, except when the security policy has special rules known as type-transition rules, in which case a different label may be applied. For schemas, the parent object is the current database; for tables, sequences, views, and functions, it is the containing schema; for columns, it is the containing table.
ru: Новый объект базы, как правило, наследует метку безопасности, назначенную родительскому объекту, если только в политике безопасности не заданы специальные правила, называемые правилами перехода типов (в этом случае может быть назначена другая метка). Для схем родительским объектом является текущая база данных; для таблиц, последовательностей, представлений и функций — схема, содержащая эти объекты; для столбцов — таблица.

source: DML Permissions
ru: Разрешения для DML

source: For tables, <literal>db_table:select</literal>, <literal>db_table:insert</literal>, <literal>db_table:update</literal> or <literal>db_table:delete</literal> are checked for all the referenced target tables depending on the kind of statement; in addition, <literal>db_table:select</literal> is also checked for all the tables that contain columns referenced in the <literal>WHERE</literal> or <literal>RETURNING</literal> clause, as a data source for <literal>UPDATE</literal>, and so on.
ru: Для таблиц, задействованных в запросе в качестве целевых, проверяются разрешения <literal>db_table:select</literal>, <literal>db_table:insert</literal>, <literal>db_table:update</literal> или <literal>db_table:delete</literal> в зависимости от типа оператора; кроме того, для всех таблиц, содержащих столбцы, фигурирующие в предложении <literal>WHERE</literal> или <literal>RETURNING</literal>, или служащих источником данных для <literal>UPDATE</literal> и т. п., также проверяется разрешение <literal>db_table:select</literal>.

source: Column-level permissions will also be checked for each referenced column. <literal>db_column:select</literal> is checked on not only the columns being read using <literal>SELECT</literal>, but those being referenced in other DML statements; <literal>db_column:update</literal> or <literal>db_column:insert</literal> will also be checked for columns being modified by <literal>UPDATE</literal> or <literal>INSERT</literal>.
ru: Для всех задействованных столбцов также проверяются разрешения на уровне столбцов. Разрешение <literal>db_column:select</literal> проверяется не только для столбцов, которые считываются оператором <literal>SELECT</literal>, но и для тех, к которым обращаются другие операторы DML; <literal>db_column:update</literal> или <literal>db_column:insert</literal> также проверяется для столбцов, изменяемых операторами <literal>UPDATE</literal> или <literal>INSERT</literal>.
