Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sql.po
Languages: ru

source: In the previous section (<xref linkend="formal-notion" endterm="formal-notion"/>) we defined the mathematical notion of the relational model. Now we know how the data can be stored using a relational data model but we do not know what to do with all these tables to retrieve something from the database yet. For example somebody could ask for the names of all suppliers that sell the part 'Screw'. Therefore two rather different kinds of notations for expressing operations on relations have been defined: <placeholder-1/>
ru: В предыдущем разделе (<xref linkend="formal-notion" endterm="formal-notion"/>) мы определили математическую запись реляционной модели. Теперь мы знаем, как данные могут храниться в реляционной модели данных, но пока ещё не знаем, что делать со всеми этими таблицами, чтобы извлечь что-либо из базы данных. Например, кого-то могут интересовать имена всех поставщиков, продающих шурупы (деталь 'Screw'). Для этого были определены два весьма различных вида нотаций, позволяющих выражать операции с отношениями: <placeholder-1/>

source: Relational Algebra
ru: Реляционная алгебра

source: SELECT (&sigma;): extracts <firstterm>tuples</firstterm> from a relation that satisfy a given restriction. Let <parameter>R</parameter> be a table that contains an attribute <parameter>A</parameter>. &sigma;<subscript>A=a</subscript>(R) = {t &isin; R &mid; t(A) = a} where <literal>t</literal> denotes a tuple of <parameter>R</parameter> and <literal>t(A)</literal> denotes the value of attribute <parameter>A</parameter> of tuple <literal>t</literal>.
ru: SELECT (&sigma;): извлекает <firstterm>кортежи</firstterm> из отношения, удовлетворяющие заданному ограничению. Пусть <parameter>R</parameter> — таблица, содержащая атрибут <parameter>A</parameter>. &sigma;<subscript>A=a</subscript>(R) = {t &isin; R &mid; t(A) = a}, где <literal>t</literal> обозначает кортеж отношения <parameter>R</parameter>, а <literal>t(A)</literal> обозначает значение атрибута <parameter>A</parameter> кортежа <literal>t</literal>.

source: PROJECT (&pi;): extracts specified <firstterm>attributes</firstterm> (columns) from a relation. Let <classname>R</classname> be a relation that contains an attribute <classname>X</classname>. &pi;<subscript>X</subscript>(<classname>R</classname>) = {t(X) &mid; t &isin; <classname>R</classname>}, where <literal>t</literal>(<classname>X</classname>) denotes the value of attribute <classname>X</classname> of tuple <literal>t</literal>.
ru: PROJECT (&pi;): извлекает указанные <firstterm>атрибуты</firstterm> (столбцы) из отношения. Пусть <classname>R</classname> — отношение, содержащее атрибут <classname>X</classname>, тогда &pi;<subscript>X</subscript>(<classname>R</classname>) = {t(X) &mid; t &isin; <classname>R</classname>}, где <literal>t</literal>(<classname>X</classname>) обозначает значение атрибута <classname>X</classname> кортежа <literal>t</literal>.

source: PRODUCT (&times;): builds the Cartesian product of two relations. Let <classname>R</classname> be a table with arity <literal>k</literal><subscript>1</subscript> and let <classname>S</classname> be a table with arity <literal>k</literal><subscript>2</subscript>. <classname>R</classname> &times; <classname>S</classname> is the set of all <literal>k</literal><subscript>1</subscript> + <literal>k</literal><subscript>2</subscript>-tuples whose first <literal>k</literal><subscript>1</subscript> components form a tuple in <classname>R</classname> and whose last <literal>k</literal><subscript>2</subscript> components form a tuple in <classname>S</classname>.
ru: PRODUCT (&times;): формирует декартово произведение двух отношений. Пусть <classname>R</classname> — таблица с арностью <literal>k</literal><subscript>1</subscript> и <classname>S</classname> — таблица с арностью <literal>k</literal><subscript>2</subscript>. Тогда <classname>R</classname> &times; <classname>S</classname> — множество всех <literal>k</literal><subscript>1</subscript> + <literal>k</literal><subscript>2</subscript>-арных кортежей, в которых первые <literal>k</literal><subscript>1</subscript> компонентов формируют кортеж в <classname>R</classname>, а последние <literal>k</literal><subscript>2</subscript> компонентов формируют кортеж в <classname>S</classname>.

source: UNION (&cup;): builds the set-theoretic union of two tables. Given the tables <classname>R</classname> and <classname>S</classname> (both must have the same arity), the union <classname>R</classname> &cup; <classname>S</classname> is the set of tuples that are in <classname>R</classname> or <classname>S</classname> or both.
ru: UNION (&cup;): формирует объединение (в терминах теории множеств) двух таблиц. Для данных таблиц <classname>R</classname> и <classname>S</classname> (обе должны иметь одну арность) объединением <classname>R</classname> &cup; <classname>S</classname> будет множество кортежей, принадлежащих <classname>R</classname> или <classname>S</classname> или обеим таблицам.

source: INTERSECT (&cap;): builds the set-theoretic intersection of two tables. Given the tables <classname>R</classname> and <classname>S</classname>, <classname>R</classname> &cap; <classname>S</classname> is the set of tuples that are in <classname>R</classname> and in <classname>S</classname>. We again require that <classname>R</classname> and <classname>S</classname> have the same arity.
ru: INTERSECT (&cap;): формирует пересечение (в терминах теории множеств) двух таблиц. Для данных таблиц <classname>R</classname> и <classname>S</classname>, пересечением <classname>R</classname> &cap; <classname>S</classname> будет множество кортежей, принадлежащих и <classname>R</classname>, и <classname>S</classname>. При этом опять же требуется, чтобы <classname>R</classname> и <classname>S</classname> были одной арности.

source: DIFFERENCE (&minus; or &setmn;): builds the set difference of two tables. Let <classname>R</classname> and <classname>S</classname> again be two tables with the same arity. <classname>R</classname> - <classname>S</classname> is the set of tuples in <classname>R</classname> but not in <classname>S</classname>.
ru: DIFFERENCE (&minus; или &setmn;): формирует разность (в терминах теории множеств) двух таблиц. Пусть <classname>R</classname> и <classname>S</classname> так же две таблицы одинаковой арности, тогда <classname>R</classname> — <classname>S</classname> — множество кортежей, принадлежащих <classname>R</classname>, но не <classname>S</classname>.

source: JOIN (&prod;): connects two tables by their common attributes. Let <classname>R</classname> be a table with the attributes <classname>A</classname>,<classname>B</classname> and <classname>C</classname> and let <classname>S</classname> be a table with the attributes <classname>C</classname>,<classname>D</classname> and <classname>E</classname>. There is one attribute common to both relations, the attribute <classname>C</classname>. R &prod; S = &pi;<subscript>R.A,R.B,R.C,S.D,S.E</subscript>(&sigma;<subscript>R.C=S.C</subscript>(R &times; S)). What are we doing here? We first calculate the Cartesian product <classname>R</classname> &times; <classname>S</classname>. Then we select those tuples whose values for the common attribute <classname>C</classname> are equal (&sigma;<subscript>R.C = S.C</subscript>). Now we have a table that contains the attribute <classname>C</classname> two times and we correct this by projecting out the duplicate column.
ru: JOIN (&prod;): соединяет две таблицы по их общим атрибутам. Пусть <classname>R</classname> — таблица с атрибутами <classname>A</classname>, <classname>B</classname> и <classname>C</classname>, а <classname>S</classname> — таблица с атрибутами <classname>C</classname>, <classname>D</classname> и <classname>E</classname>. Общим для обоих отношений является только один атрибут, атрибут <classname>C</classname>. Тогда R &prod; S = &pi;<subscript>R.A,R.B,R.C,S.D,S.E</subscript>(&sigma;<subscript>R.C=S.C</subscript>(R &times; S)). Что здесь происходит? Сначала мы вычисляем декартово произведение <classname>R</classname> &times; <classname>S</classname>, а затем выбираем кортежи, в которых значения общего атрибута <classname>C</classname> равны (&sigma;<subscript>R.C = S.C</subscript>). В результате получается таблица, содержащая атрибут <classname>C</classname> два раза, и мы исправляем это, извлекая столбцы без повторения.

source: An Inner Join
ru: Внутреннее соединение

source: Let's have a look at the tables that are produced by evaluating the steps necessary for a join. Let the following two tables be given: <screen>R: S: A | B | C C | D | E ---+---+--- ---+---+--- 1 | 2 | 3 3 | a | b 4 | 5 | 6 6 | c | d 7 | 8 | 9</screen>
ru: Давайте взглянем на получаемые таблицы, проанализировав этапы соединения. Пусть даны две следующие таблицы: <screen>R: S: A | B | C C | D | E ---+---+--- ---+---+--- 1 | 2 | 3 3 | a | b 4 | 5 | 6 6 | c | d 7 | 8 | 9</screen>

source: First we calculate the Cartesian product <classname>R</classname> &times; <classname>S</classname> and get: <screen>R x S: A | B | R.C | S.C | D | E ---+---+-----+-----+---+--- 1 | 2 | 3 | 3 | a | b 1 | 2 | 3 | 6 | c | d 4 | 5 | 6 | 3 | a | b 4 | 5 | 6 | 6 | c | d 7 | 8 | 9 | 3 | a | b 7 | 8 | 9 | 6 | c | d</screen>
ru: Сначала вычислим декартово произведение <classname>R</classname> &times; <classname>S</classname> и получим: <screen>R x S: A | B | R.C | S.C | D | E ---+---+-----+-----+---+--- 1 | 2 | 3 | 3 | a | b 1 | 2 | 3 | 6 | c | d 4 | 5 | 6 | 3 | a | b 4 | 5 | 6 | 6 | c | d 7 | 8 | 9 | 3 | a | b 7 | 8 | 9 | 6 | c | d</screen>

source: After the selection &sigma;<subscript>R.C=S.C</subscript>(R &times; S) we get: <screen> A | B | R.C | S.C | D | E ---+---+-----+-----+---+--- 1 | 2 | 3 | 3 | a | b 4 | 5 | 6 | 6 | c | d</screen>
ru: После выборки &sigma;<subscript>R.C=S.C</subscript>(R &times; S) мы получаем: <screen> A | B | R.C | S.C | D | E ---+---+-----+-----+---+--- 1 | 2 | 3 | 3 | a | b 4 | 5 | 6 | 6 | c | d</screen>

source: To remove the duplicate column <classname>S</classname>.<classname>C</classname> we project it out by the following operation: &pi;<subscript>R.A,R.B,R.C,S.D,S.E</subscript>(&sigma;<subscript>R.C=S.C</subscript>(R &times; S)) and get: <screen> A | B | C | D | E ---+---+---+---+--- 1 | 2 | 3 | a | b 4 | 5 | 6 | c | d</screen>
ru: Чтобы удалить дублирующийся столбец <classname>S</classname>.<classname>C</classname>, мы проделываем следующую операцию: &pi;<subscript>R.A,R.B,R.C,S.D,S.E</subscript>(&sigma;<subscript>R.C=S.C</subscript>(R &times; S)) и получаем: <screen> A | B | C | D | E ---+---+---+---+--- 1 | 2 | 3 | a | b 4 | 5 | 6 | c | d</screen>

source: DIVIDE (&divide;): Let <classname>R</classname> be a table with the attributes A, B, C, and D and let <classname>S</classname> be a table with the attributes C and D. Then we define the division as: <placeholder-1/> such that t<subscript>r</subscript>(A,B)=t&and;t<subscript>r</subscript>(C,D)=t<subscript>s</subscript>} where t<subscript>r</subscript>(x,y) denotes a tuple of table <classname>R</classname> that consists only of the components <literal>x</literal> and <literal>y</literal>. Note that the tuple <literal>t</literal> only consists of the components <classname>A</classname> and <classname>B</classname> of relation <classname>R</classname>.
ru: DIVIDE (&divide;): Пусть <classname>R</classname> — таблица с атрибутами A, B, C и D и пусть <classname>S</classname> — таблица с атрибутами C и D. Тогда мы определим деление как: <placeholder-1/> и <subscript>r</subscript>(A,B)=t&and;t<subscript>r</subscript>(C,D)=t<subscript>s</subscript>} где t<subscript>r</subscript>(x,y) обозначает кортеж таблицы <classname>R</classname>, состоящий только из компонентов <literal>x</literal> и <literal>y</literal>. Заметьте, что кортеж <literal>t</literal> состоит только из компонентов <classname>A</classname> и <classname>B</classname> отношения <classname>R</classname>.

source: Given the following tables <screen>R: S: A | B | C | D C | D ---+---+---+--- ---+--- a | b | c | d c | d a | b | e | f e | f b | c | e | f e | d | c | d e | d | e | f a | b | d | e</screen> R &divide; S is derived as <screen> A | B ---+--- a | b e | d</screen>
ru: Со следующими таблицами <screen>R: S: A | B | C | D C | D ---+---+---+--- ---+--- a | b | c | d c | d a | b | e | f e | f b | c | e | f e | d | c | d e | d | e | f a | b | d | e</screen> R &divide; S даёт <screen> A | B ---+--- a | b e | d</screen>

source: The <firstterm>Relational Algebra</firstterm> was introduced by E. F. Codd in 1972. It consists of a set of operations on relations: <placeholder-1/>
ru: <firstterm>Реляционную алгебру</firstterm> впервые ввёл Эдгар Франк Кодд в 1972 г. Она включает набор операций с отношениями: <placeholder-1/>

source: For a more detailed description and definition of the relational algebra refer to [<xref linkend="ull88" endterm="ull88"/>] or [<xref linkend="date04" endterm="date04"/>].
ru: За более подробным описанием и определением реляционной алгебры обратитесь к [<xref linkend="ull88" endterm="ull88"/>] или [<xref linkend="date04" endterm="date04"/>].

source: A Query Using Relational Algebra
ru: Запросы с применением реляционной алгебры

source: Recall that we formulated all those relational operators to be able to retrieve data from the database. Let's return to our example from the previous section (<xref linkend="operations" endterm="operations"/>) where someone wanted to know the names of all suppliers that sell the part <literal>Screw</literal>. This question can be answered using relational algebra by the following operation: <placeholder-1/>
ru: Вспомните, что мы формулировали все эти реляционные операторы, чтобы иметь возможность извлекать данные из базы данных. Давайте вернёмся к нашему примеру из предыдущего раздела (<xref linkend="operations" endterm="operations"/>), когда кто-то захотел узнать имена всех поставщиков шурупов (детали <literal>Screw</literal>). На этот вопрос можно ответить, применяя реляционную алгебру, выполнив следующую операцию: <placeholder-1/>

source: We call such an operation a query. If we evaluate the above query against the our example tables (<xref linkend="supplier-fig" endterm="supplier-fig"/>) we will obtain the following result: <screen> SNAME ------- Smith Adams</screen>
ru: Мы называем такую операцию запросом. Если мы вычислим предыдущий запрос с таблицами из нашего примера (см. <xref remap="4" linkend="supplier-fig" endterm="supplier-fig"/>), мы получим следующий результат: <screen> SNAME ------- Smith Adams</screen>

source: Relational Calculus
ru: Реляционное исчисление

source: The <firstterm>Domain Relational Calculus</firstterm> (<acronym>DRC</acronym>), where variables stand for components (attributes) of the tuples.
ru: <firstterm>Реляционное исчисление доменов</firstterm> (Domain Relational Calculus, <acronym>DRC</acronym>), где под переменными понимаются компоненты (атрибуты) кортежей.

source: The <firstterm>Tuple Relational Calculus</firstterm> (<acronym>TRC</acronym>), where variables stand for tuples.
ru: <firstterm>Реляционное исчисление кортежей</firstterm> (Tuple Relational Calculus, <acronym>TRC</acronym>), где под переменными понимаются кортежи.

source: The relational calculus is based on the <firstterm>first order logic</firstterm>. There are two variants of the relational calculus: <placeholder-1/>
ru: Реляционное исчисление основано на <firstterm>логике первого порядка</firstterm>. Существует два варианта реляционного исчисления: <placeholder-1/>

source: We want to discuss the tuple relational calculus only because it is the one underlying the most relational languages. For a detailed discussion on <acronym>DRC</acronym> (and also <acronym>TRC</acronym>) see <xref linkend="date04" endterm="date04"/> or <xref linkend="ull88" endterm="ull88"/>.
ru: Мы хотим обсудить реляционное исчисление кортежей только потому, что на нём основаны многие реляционные языки. Более подробное описание <acronym>DRC</acronym> (а также <acronym>TRC</acronym>) можно найти в <xref remap="6" linkend="date04" endterm="date04"/> или <xref remap="6" linkend="ull88" endterm="ull88"/>.

source: Tuple Relational Calculus
ru: Реляционное исчисление кортежей

source: The queries used in <acronym>TRC</acronym> are of the following form: <placeholder-1/> where <literal>x</literal> is a tuple variable <classname>A</classname> is a set of attributes and <literal>F</literal> is a formula. The resulting relation consists of all tuples <literal>t(A)</literal> that satisfy <literal>F(t)</literal>.
ru: Запросы в <acronym>TRC</acronym> имеют следующий вид: <placeholder-1/> где <literal>x</literal> — переменная кортежа, <classname>A</classname> — множество атрибутов, а <literal>F</literal> — формула. Результирующее отношение состоит из всех кортежей <literal>t(A)</literal>, удовлетворяющих условию <literal>F(t)</literal>.

source: If we want to answer the question from example <xref linkend="suppl-rel-alg" endterm="suppl-rel-alg"/> using <acronym>TRC</acronym> we formulate the following query: <placeholder-1/>
ru: Если мы хотим ответить на вопрос из примера <xref linkend="suppl-rel-alg" endterm="suppl-rel-alg"/>, применяя <acronym>TRC</acronym>, мы можем сформулировать следующий запрос: <placeholder-1/>

source: Evaluating the query against the tables from <xref linkend="supplier-fig" endterm="supplier-fig"/> again leads to the same result as in <xref linkend="suppl-rel-alg" endterm="suppl-rel-alg"/>.
ru: Вычисление этого запроса с таблицами из <xref linkend="supplier-fig" endterm="supplier-fig"/> даёт тот же результат, что и в разделе <xref linkend="suppl-rel-alg" endterm="suppl-rel-alg"/>.

source: Relational Algebra vs. Relational Calculus
ru: Реляционная алгебра и реляционное исчисление

source: The relational algebra and the relational calculus have the same <firstterm>expressive power</firstterm>; i.e., all queries that can be formulated using relational algebra can also be formulated using the relational calculus and vice versa. This was first proved by E. F. Codd in 1972. This proof is based on an algorithm (<quote>Codd's reduction algorithm</quote>) by which an arbitrary expression of the relational calculus can be reduced to a semantically equivalent expression of relational algebra. For a more detailed discussion on that refer to <xref linkend="date04" endterm="date04"/> and <xref linkend="ull88" endterm="ull88"/>.
ru: Реляционная алгебра и реляционное исчисление имеют одинаковую <firstterm>выразительную мощность</firstterm>; то есть, все запросы, которые можно выразить в реляционной алгебре, можно также выразить в реляционном исчислении, и наоборот. Впервые это доказал Эдгар Франк Кодд в 1972 г. Это доказательство основывалось на алгоритме (<quote>алгоритме редукции Кодда</quote>), по которому произвольное выражение реляционного исчисления можно свести к семантически равнозначному выражению реляционной алгебры. Более подробно это обсуждается в книге <xref linkend="date04" endterm="date04"/> и <xref linkend="ull88" endterm="ull88"/>.

source: It is sometimes said that languages based on the relational calculus are <quote>higher level</quote> or <quote>more declarative</quote> than languages based on relational algebra because the algebra (partially) specifies the order of operations while the calculus leaves it to a compiler or interpreter to determine the most efficient order of evaluation.
ru: Иногда говорят, что языки, основанные на реляционном исчислении, более <quote>высокоуровневые</quote> или <quote>более декларативные</quote>, чем языки, основанные на реляционной алгебре, так как в алгебре (частично) задаётся порядок операций, тогда как в исчислении выбор наиболее эффективного порядка вычислений — задача компилятора или интерпретатора.

source: The <acronym>SQL</acronym> Language
ru: Язык <acronym>SQL</acronym>

source: Commands for insertion, deletion or modification of data.
ru: Команды для добавления, удаления или изменения данных

source: Arithmetic capability: In <acronym>SQL</acronym> it is possible to involve arithmetic operations as well as comparisons, e.g.: <placeholder-1/> Note that + or other arithmetic operators appear neither in relational algebra nor in relational calculus.
ru: Арифметические действия: В <acronym>SQL</acronym> возможно задействовать арифметические операции, а также сравнения: <placeholder-1/> Заметьте, что ни в реляционной алгебре, ни в реляционном исчислении нет операции + и других арифметических операций.

source: Assignment and Print Commands: It is possible to print a relation constructed by a query and to assign a computed relation to a relation name.
ru: Команды вывода и присвоения: Отношение, сконструированное запросом, можно вывести, и можно связать вычисленное отношение с именем.

source: Aggregate Functions: Operations such as <firstterm>average</firstterm>, <firstterm>sum</firstterm>, <firstterm>max</firstterm>, etc. can be applied to columns of a relation to obtain a single quantity.
ru: Агрегатные функции: Такие операции, как <firstterm>среднее</firstterm>, <firstterm>сумма</firstterm>, <firstterm>максимум</firstterm> и т. п. можно применять к столбцам отношения для получения единственного значения.

source: As is the case with most modern relational languages, <acronym>SQL</acronym> is based on the tuple relational calculus. As a result every query that can be formulated using the tuple relational calculus (or equivalently, relational algebra) can also be formulated using <acronym>SQL</acronym>. There are, however, capabilities beyond the scope of relational algebra or calculus. Here is a list of some additional features provided by <acronym>SQL</acronym> that are not part of relational algebra or calculus: <placeholder-1/>
ru: Как и большинство современных реляционных языков, <acronym>SQL</acronym> основывается на реляционном исчислении кортежей. Вследствие этого, каждый запрос, который можно сформулировать с применением реляционного исчисления кортежей (или, что равнозначно, реляционной алгебры), можно так же сформулировать, используя <acronym>SQL</acronym>. Однако у него есть дополнительные возможности, выходящие за рамки реляционной алгебры или реляционного исчисления. К числу дополнительных возможностей <acronym>SQL</acronym>, отсутствующих в реляционной алгебре и реляционном исчислении, относятся: <placeholder-1/>
