Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sql.po
Languages: ru

source: The new value of attribute PRICE of the tuple whose name is 'Screw' is now 15.
ru: Новым значением атрибута PRICE кортежа с именем 'Screw' стало 15.

source: DELETE FROM <replaceable class="parameter">table_name</replaceable> WHERE <replaceable class="parameter">condition</replaceable>;
ru: DELETE FROM <replaceable class="parameter">имя_таблицы</replaceable> WHERE <replaceable class="parameter">условие</replaceable>;

source: To delete a tuple from a particular table use the command DELETE FROM. The syntax is: <placeholder-1/>
ru: Для удаления кортежей из определённой таблицы применяется команда DELETE FROM. Она имеет такой синтаксис: <placeholder-1/>

source: To delete the supplier called 'Smith' of the table SUPPLIER the following statement is used: <placeholder-1/>
ru: Следующий оператор удаляет поставщика с именем 'Smith' из таблицы SUPPLIER: <placeholder-1/>

source: System Catalogs
ru: Системные каталоги

source: In every <acronym>SQL</acronym> database system <firstterm>system catalogs</firstterm> are used to keep track of which tables, views indexes etc. are defined in the database. These system catalogs can be queried as if they were normal relations. For example there is one catalog used for the definition of views. This catalog stores the query from the view definition. Whenever a query against a view is made, the system first gets the <firstterm>view definition query</firstterm> out of the catalog and materializes the view before proceeding with the user query (see <xref linkend="sim98" endterm="sim98"/> for a more detailed description). For more information about system catalogs refer to <xref linkend="date04" endterm="date04"/>.
ru: Во всех СУБД <acronym>SQL</acronym> существуют <firstterm>системные каталоги</firstterm>, в которых описывается, какие таблицы, представления, индексы и т. п. определены в базе данных. К этим системным каталогам можно обращаться, как если бы они были обычными отношениями. Например, существует каталог, в котором определяются представления. В этом каталоге хранится запрос, заданный в определении представления. Когда выполняется запрос к представлению, система сначала извлекает <firstterm>запрос, определяющий представление</firstterm>, из каталога и материализует представление, прежде чем обрабатывать запрос пользователя (более подробно это описано в <xref remap="6" linkend="sim98" endterm="sim98"/>). За дополнительными сведениями о системных каталогах обратитесь к <xref remap="3" linkend="date04" endterm="date04"/>.

source: Embedded <acronym>SQL</acronym>
ru: Встраиваемый <acronym>SQL</acronym>

source: There are queries that cannot be formulated using pure <acronym>SQL</acronym> (i.e., recursive queries). To be able to perform such queries we need a host language with a greater expressive power than <acronym>SQL</acronym>.
ru: Существуют и такие запросы, которые нельзя сформулировать на чистом <acronym>SQL</acronym> (например, рекурсивные запросы). Чтобы иметь возможность выполнять эти запросы, нам нужен язык с большей выразительной мощностью, чем <acronym>SQL</acronym>.

source: We simply want to access a database from some application that is written in the host language (e.g., a ticket reservation system with a graphical user interface is written in C and the information about which tickets are still left is stored in a database that can be accessed using embedded <acronym>SQL</acronym>).
ru: Мы просто хотим обратиться к базе данных из некоторого приложения, написанного на ведущем языке (например, система резервирования билетов с графическим интерфейсом разрабатывается на C, а информация о наличии билетов хранится в базе данных, и может быть получена с применением встраиваемого <acronym>SQL</acronym>).

source: In this section we will sketch how <acronym>SQL</acronym> can be embedded into a host language (e.g., <literal>C</literal>). There are two main reasons why we want to use <acronym>SQL</acronym> from a host language: <placeholder-1/>
ru: В этом разделе мы кратко расскажем, как язык <acronym>SQL</acronym> может встраиваться в ведущий язык (например, <literal>C</literal>). Для использования <acronym>SQL</acronym> в среде ведущего языка есть две основные причины: <placeholder-1/>

source: A program using embedded <acronym>SQL</acronym> in a host language consists of statements of the host language and of <firstterm>embedded <acronym>SQL</acronym></firstterm> (<acronym>ESQL</acronym>) statements. Every <acronym>ESQL</acronym> statement begins with the keywords <command>EXEC SQL</command>. The <acronym>ESQL</acronym> statements are transformed to statements of the host language by a <firstterm>precompiler</firstterm> (which usually inserts calls to library routines that perform the various <acronym>SQL</acronym> commands).
ru: Программа, использующая встраиваемый <acronym>SQL</acronym> в ведущем языке, состоит из операторов ведущего языка и операторов <firstterm>встраиваемого <acronym>SQL</acronym></firstterm> (Embedded SQL, <acronym>ESQL</acronym>). Каждый оператор <acronym>ESQL</acronym> начинается с ключевых слов <command>EXEC SQL</command>. Операторы <acronym>ESQL</acronym> преобразуются в операторы ведущего языка <firstterm>предкомпилятором</firstterm> (который обычно вставляет вместо них вызовы библиотечных подпрограмм, выполняющих различные команды <acronym>SQL</acronym>).

source: When we look at the examples throughout <xref linkend="select-title" endterm="select-title"/> we realize that the result of the queries is very often a set of tuples. Most host languages are not designed to operate on sets so we need a mechanism to access every single tuple of the set of tuples returned by a SELECT statement. This mechanism can be provided by declaring a <firstterm>cursor</firstterm>. After that we can use the <command>FETCH</command> command to retrieve a tuple and set the cursor to the next tuple.
ru: Взглянув на примеры, приведённые в разделе <xref linkend="select-title" endterm="select-title"/>, можно понять, что результатом запросов часто оказывается множество кортежей. Многие языки не предназначены для работы с множествами, так что нам нужен механизм для обращения к каждому отдельному кортежу из множества, выданного оператором SELECT. Этот механизм может обеспечиваться <firstterm>курсором</firstterm>. Объявив курсор, мы можем применять команду <command>FETCH</command> для чтения текущего кортежа и перемещения к следующему.

source: For a detailed discussion on embedded <acronym>SQL</acronym> refer to <xref linkend="date97" endterm="date97"/>, <xref linkend="date04" endterm="date04"/>, or <xref linkend="ull88" endterm="ull88"/>.
ru: Узнать о встраиваемом <acronym>SQL</acronym> больше можно в <xref linkend="date97" endterm="date97"/>, <xref linkend="date04" endterm="date04"/> и <xref linkend="ull88" endterm="ull88"/>.
