Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sql.po
Languages: ru

source: If we want only those suppliers selling more than one part we use the query: <placeholder-1/> and get: <screen> SNO | SNAME | COUNT -----+-------+------- 1 | Smith | 2 3 | Adams | 2 4 | Blake | 3</screen>
ru: Если мы хотим получить только поставщиков, продающих больше одного вида деталей, воспользуемся запросом: <placeholder-1/> и получим: <screen> SNO | SNAME | COUNT -----+-------+------- 1 | Smith | 2 3 | Adams | 2 4 | Blake | 3</screen>

source: The HAVING clause works much like the WHERE clause and is used to consider only those groups satisfying the qualification given in the HAVING clause. Essentially, WHERE filters out unwanted input rows before grouping and aggregation are done, whereas HAVING filters out unwanted group rows post-GROUP. Therefore, WHERE cannot refer to the results of aggregate functions. On the other hand, there's no point in writing a HAVING condition that doesn't involve an aggregate function! If your condition doesn't involve aggregates, you might as well write it in WHERE, and thereby avoid the computation of aggregates for groups that you're just going to throw away anyway. <placeholder-1/>
ru: Предложение HAVING действует во многом как предложение WHERE и применяется для рассмотрения только тех групп, которые удовлетворяют заданным в этом предложении условиям. По сути, предложение WHERE отфильтровывает ненужные входные строки до группирования и агрегирования, тогда как HAVING отфильтровывает ненужные группы после группирования. Таким образом, WHERE не может обращаться к результатам агрегатной функции. С другой стороны, нет смысла в условии HAVING, которое не включает агрегатную функцию. Если в вашем условии не задействованы агрегатные функции, вы можете также написать его и в WHERE и тем самым избежать вычисления агрегатных функций для групп, которые вы всё равно собираетесь исключать. <placeholder-1/>

source: Subqueries
ru: Подзапросы

source: Subselect
ru: Вложенная выборка

source: If we want to know all parts having a greater price than the part named 'Screw' we use the query: <placeholder-1/>
ru: Если мы хотим узнать, какие детали стоят дороже, чем деталь 'Screw', воспользуемся запросом: <placeholder-1/>

source: The result is: <screen> PNO | PNAME | PRICE -----+---------+-------- 3 | Bolt | 15 4 | Cam | 25</screen>
ru: Результат: <screen> PNO | PNAME | PRICE -----+---------+-------- 3 | Bolt | 15 4 | Cam | 25</screen>

source: When we look at the above query we can see the keyword <command>SELECT</command> two times. The first one at the beginning of the query - we will refer to it as outer <command>SELECT</command> - and the one in the WHERE clause which begins a nested query - we will refer to it as inner <command>SELECT</command>. For every tuple of the outer <command>SELECT</command> the inner <command>SELECT</command> has to be evaluated. After every evaluation we know the price of the tuple named 'Screw' and we can check if the price of the actual tuple is greater. (Actually, in this example the inner query need only be evaluated once, since it does not depend on the state of the outer query.)
ru: Взглянув на приведённый выше запрос, вы можете увидеть ключевое слово <command>SELECT</command>, написанное два раза. Первое, в начале запроса, мы будем называть внешним <command>SELECT</command>, а второе, внутри предложения WHERE, начинающее вложенный запрос, — внутренним <command>SELECT</command>. Внутренний <command>SELECT</command> должен вычисляться для каждого кортежа внешнего <command>SELECT</command>. После каждого вычисления внутреннего запроса мы знаем цену шурупа (детали 'Screw') и можем проверить, больше ли цена детали в текущем кортеже. (На самом деле в этом примере внутренний запрос нужно было вычислить только один раз, так как он не зависит от состояния внешнего запроса.)

source: If we want to know all suppliers that do not sell any part (e.g., to be able to remove these suppliers from the database) we use: <placeholder-1/>
ru: Если мы хотим узнать, какие поставщики не продают никакие детали (например, чтобы этих поставщиков можно было удалить из базы данных), выполним: <placeholder-1/>

source: In our example the result will be empty because every supplier sells at least one part. Note that we use S.SNO from the outer <command>SELECT</command> within the WHERE clause of the inner <command>SELECT</command>. Here the subquery must be evaluated afresh for each tuple from the outer query, i.e., the value for S.SNO is always taken from the current tuple of the outer <command>SELECT</command>.
ru: В нашем примере результат будет пустым, так как каждый поставщик продаёт минимум один вид деталей. Заметьте, что мы использовали S.SNO из внешнего <command>SELECT</command> в предложении WHERE внутреннего <command>SELECT</command>. В данном случае подзапрос должен вычисляться заново для каждого кортежа из внешнего запроса, то есть значение S.SNO всегда берётся из текущего кортежа внешнего <command>SELECT</command>.

source: In the WHERE and HAVING clauses the use of subqueries (subselects) is allowed in every place where a value is expected. In this case the value must be derived by evaluating the subquery first. The usage of subqueries extends the expressive power of <acronym>SQL</acronym>. <placeholder-1/>
ru: Подзапросы (вложенные SELECT) можно использовать в предложениях WHERE и HAVING везде, где ожидается значение. В этом случае сначала должно быть получено значение в результате вычисления подзапроса. Использование подзапросов увеличивает выразительную мощность <acronym>SQL</acronym>. <placeholder-1/>

source: Subqueries in FROM
ru: Подзапросы во FROM

source: Subselect in FROM
ru: Вложенная выборка во FROM

source: If we want to know the highest average part price among all our suppliers, we cannot write MAX(AVG(PRICE)), but we can write: <placeholder-1/> The subquery returns one row per supplier (because of its GROUP BY) and then we aggregate over those rows in the outer query.
ru: Если мы хотим узнать наибольшую среднюю цену деталей по всем поставщикам, мы не можем написать MAX(AVG(PRICE)), но можем написать: <placeholder-1/> Этот подзапрос возвращает одну строку для каждого поставщика (из-за GROUP BY), а затем мы агрегируем эти строки во внешнем запросе.

source: A somewhat different way of using subqueries is to put them in the FROM clause. This is a useful feature because a subquery of this kind can output multiple columns and rows, whereas a subquery used in an expression must deliver just a single result. It also lets us get more than one round of grouping/aggregation without resorting to a temporary table. <placeholder-1/>
ru: Подзапросы можно использовать и несколько по-другому, поместив их в предложение FROM. Это полезная возможность, так как подзапрос такого рода может выдавать несколько столбцов и строк, тогда как подзапрос в выражении должен сводиться всего к одному результату. Это также позволяет нам произвести несколько проходов группировки/агрегирования, не прибегая к использованию временных таблиц. <placeholder-1/>

source: Union, Intersect, Except
ru: Объединение, пересечение, разность

source: The following query is an example for UNION: <placeholder-1/> gives the result: <screen> SNO | SNAME | CITY -----+-------+-------- 2 | Jones | Paris 3 | Adams | Vienna</screen>
ru: Следующий запрос демонстрирует объединение (UNION): <placeholder-1/> и выдаёт результат: <screen> SNO | SNAME | CITY -----+-------+-------- 2 | Jones | Paris 3 | Adams | Vienna</screen>

source: Here is an example for INTERSECT: <placeholder-1/> gives the result: <screen> SNO | SNAME | CITY -----+-------+-------- 2 | Jones | Paris</screen> The only tuple returned by both parts of the query is the one having SNO=2.
ru: Пример для INTERSECT: <placeholder-1/> даёт следующий результат: <screen> SNO | SNAME | CITY -----+-------+-------- 2 | Jones | Paris</screen> Единственным кортежем, возвращаемым двумя частями запроса, является кортеж с SNO=2.

source: Finally an example for EXCEPT: <placeholder-1/> gives the result: <screen> SNO | SNAME | CITY -----+-------+-------- 2 | Jones | Paris 3 | Adams | Vienna</screen>
ru: И наконец, пример для EXCEPT: <placeholder-1/> даёт такой результат: <screen> SNO | SNAME | CITY -----+-------+-------- 2 | Jones | Paris 3 | Adams | Vienna</screen>

source: These operations calculate the union, intersection and set theoretic difference of the tuples derived by two subqueries. <placeholder-1/>
ru: Эти операции вычисляют объединение, пересечение и разность (как она понимается в теории множеств) для кортежей, полученных из двух подзапросов. <placeholder-1/>

source: Data Definition
ru: Определение данных

source: There is a set of commands used for data definition included in the <acronym>SQL</acronym> language.
ru: Язык <acronym>SQL</acronym> включает набор команд для определения данных.

source: Table Creation
ru: Создание таблицы

source: To create the tables defined in <xref linkend="supplier-fig" endterm="supplier-fig"/> the following <acronym>SQL</acronym> statements are used: <placeholder-1/> <placeholder-2/> <placeholder-3/>
ru: Следующие операторы <acronym>SQL</acronym> создают таблицы, описанные в <xref linkend="supplier-fig" endterm="supplier-fig"/>: <placeholder-1/> <placeholder-2/> <placeholder-3/>

source: The most fundamental command for data definition is the one that creates a new relation (a new table). The syntax of the <command>CREATE TABLE</command> command is: <synopsis>CREATE TABLE <replaceable class="parameter">table_name</replaceable> (<replaceable class="parameter">name_of_attr_1</replaceable> <replaceable class="parameter">type_of_attr_1</replaceable> [, <replaceable class="parameter">name_of_attr_2</replaceable> <replaceable class="parameter">type_of_attr_2</replaceable> [, ...]]);</synopsis> <placeholder-1/>
ru: Самой фундаментальной командой определения данных является команда, создающая новое отношение (новую таблицу). Команда <command>CREATE TABLE</command> имеет следующий синтаксис: <synopsis>CREATE TABLE <replaceable class="parameter">имя_таблицы</replaceable> (<replaceable class="parameter">имя_атрибута_1</replaceable> <replaceable class="parameter">тип_атрибута_1</replaceable> [, <replaceable class="parameter">имя_атрибута_2</replaceable> <replaceable class="parameter">тип_атрибута_2</replaceable> [, ...]]);</synopsis> <placeholder-1/>

source: Data Types in <acronym>SQL</acronym>
ru: Типы данных в <acronym>SQL</acronym>

source: INTEGER: signed fullword binary integer (31 bits precision).
ru: INTEGER: знаковое двоичное целое, занимающее полное слово (точность 31 бит).

source: SMALLINT: signed halfword binary integer (15 bits precision).
ru: SMALLINT: знаковое двоичное целое, занимающее полслова (точность 15 бит).

source: DECIMAL (<replaceable class="parameter">p</replaceable>[,<replaceable class="parameter">q</replaceable>]): signed packed decimal number of up to <replaceable class="parameter">p</replaceable> digits, with <replaceable class="parameter">q</replaceable> digits to the right of the decimal point. If <replaceable class="parameter">q</replaceable> is omitted it is assumed to be 0.
ru: DECIMAL (<replaceable class="parameter">p</replaceable>[,<replaceable class="parameter">q</replaceable>]): знаковое упакованное десятичное число, содержащее до <replaceable class="parameter">p</replaceable> цифр и <replaceable class="parameter">q</replaceable> цифр справа от десятичной точки. Если <replaceable class="parameter">q</replaceable> опущено, оно считается равным 0.

source: FLOAT: signed doubleword floating point number.
ru: FLOAT: знаковое число с плавающей точкой, занимающее двойное слово.

source: VARCHAR(<replaceable class="parameter">n</replaceable>): varying length character string of maximum length <replaceable class="parameter">n</replaceable>.
ru: VARCHAR(<replaceable class="parameter">n</replaceable>): символьная строка переменной длины не больше <replaceable class="parameter">n</replaceable>.

source: CHAR(<replaceable class="parameter">n</replaceable>): fixed length character string of length <replaceable class="parameter">n</replaceable>.
ru: CHAR(<replaceable class="parameter">n</replaceable>): символьная строка фиксированной длины <replaceable class="parameter">n</replaceable>.

source: The following is a list of some data types that are supported by <acronym>SQL</acronym>: <placeholder-1/>
ru: Ниже перечислены некоторые типы данных, поддерживаемые <acronym>SQL</acronym>: <placeholder-1/>

source: Indexes are used to speed up access to a relation. If a relation <classname>R</classname> has an index on attribute <classname>A</classname> then we can retrieve all tuples <replaceable>t</replaceable> having <replaceable>t</replaceable>(<classname>A</classname>) = <replaceable>a</replaceable> in time roughly proportional to the number of such tuples <replaceable>t</replaceable> rather than in time proportional to the size of <classname>R</classname>.
ru: Индексы используются для ускорения доступа к отношению. Если в отношении <classname>R</classname> есть индекс по атрибуту <classname>A</classname>, мы можем получить все кортежи <replaceable>t</replaceable>, для которых <replaceable>t</replaceable>(<classname>A</classname>) = <replaceable>a</replaceable>, за время, пропорциональное количеству таких кортежей <replaceable>t</replaceable>, а не размеру всего отношения <classname>R</classname>.

source: CREATE INDEX <replaceable class="parameter">index_name</replaceable> ON <replaceable class="parameter">table_name</replaceable> ( <replaceable class="parameter">name_of_attribute</replaceable> );
ru: CREATE INDEX <replaceable class="parameter">имя_индекса</replaceable> ON <replaceable class="parameter">имя_таблицы</replaceable> ( <replaceable class="parameter">имя_атрибута</replaceable> );

source: To create an index in <acronym>SQL</acronym> the <command>CREATE INDEX</command> command is used. The syntax is: <placeholder-1/>
ru: Для создания индекса в <acronym>SQL</acronym> применяется команда <command>CREATE INDEX</command>. Она имеет следующий синтаксис: <placeholder-1/>

source: To create an index named I on attribute SNAME of relation SUPPLIER we use the following statement: <placeholder-1/>
ru: Следующий оператор создаёт индекс с именем I по атрибуту SNAME в отношении SUPPLIER: <placeholder-1/>

source: The created index is maintained automatically, i.e., whenever a new tuple is inserted into the relation SUPPLIER the index I is adapted. Note that the only changes a user can perceive when an index is present are increased speed for <command>SELECT</command> and decreases in speed of updates.
ru: Созданный индекс поддерживается автоматически, то есть добавление нового кортежа в отношение SUPPLIER отражается в индексе I. Заметьте, что единственное изменение, которое замечает пользователь при добавлении индекса, это увеличение скорости <command>SELECT</command> и снижение скорости изменений данных.

source: A view can be regarded as a <firstterm>virtual table</firstterm>, i.e., a table that does not <emphasis>physically</emphasis> exist in the database but looks to the user as if it does. By contrast, when we talk of a <firstterm>base table</firstterm> there is really a physically stored counterpart of each row of the table somewhere in the physical storage.
ru: Представление можно считать <firstterm>виртуальной таблицей</firstterm>, то есть таблицей, не существующей <emphasis>физически</emphasis> в базе данных, но существующей для пользователя. И напротив, когда речь идёт о <firstterm>базовой таблице</firstterm>, каждой её строке соответствует физически сохранённая в хранилище сущность.

source: Views do not have their own, physically separate, distinguishable stored data. Instead, the system stores the definition of the view (i.e., the rules about how to access physically stored base tables in order to materialize the view) somewhere in the system catalogs (see <xref linkend="tutorial-catalogs-title" endterm="tutorial-catalogs-title"/>). For a discussion on different techniques to implement views refer to <citetitle>SIM98</citetitle>.
ru: Представления лишены собственных, физически отдельных и независимых хранимых данных. Вместо этого, система хранит определение представления (то есть, правила, говорящие, как нужно обращаться к физически хранимым базовым таблицам, чтобы материализовать представление) в своих каталогах (см. <xref remap="4" linkend="tutorial-catalogs-title" endterm="tutorial-catalogs-title"/>). Различные технологии реализации представлений обсуждаются в <citetitle>SIM98</citetitle>.

source: CREATE VIEW <replaceable class="parameter">view_name</replaceable> AS <replaceable class="parameter">select_stmt</replaceable>
ru: CREATE VIEW <replaceable class="parameter">имя_представления</replaceable> AS <replaceable class="parameter">оператор_select</replaceable>

source: In <acronym>SQL</acronym> the <command>CREATE VIEW</command> command is used to define a view. The syntax is: <placeholder-1/> where <replaceable class="parameter">select_stmt</replaceable> is a valid select statement as defined in <xref linkend="select-title" endterm="select-title"/>. Note that <replaceable class="parameter">select_stmt</replaceable> is not executed when the view is created. It is just stored in the <firstterm>system catalogs</firstterm> and is executed whenever a query against the view is made.
ru: В <acronym>SQL</acronym> представление создаёт команда <command>CREATE VIEW</command>. Она имеет следующий синтаксис: <placeholder-1/> Здесь <replaceable class="parameter">оператор_SELECT</replaceable> — допустимый оператор SELECT, как определено в <xref remap="6" linkend="select-title" endterm="select-title"/>. Заметьте, что <replaceable class="parameter">оператор_SELECT</replaceable> не выполняется при создании представления. Он только сохраняется в <firstterm>системных каталогах</firstterm> и выполняется, когда обрабатывается запрос к представлению.

source: Let the following view definition be given (we use the tables from <xref linkend="supplier-fig" endterm="supplier-fig"/> again): <placeholder-1/>
ru: Пусть дано следующее определение представления (в нём мы снова используем таблицы из примера <xref linkend="supplier-fig" endterm="supplier-fig"/>): <placeholder-1/>

source: Now we can use this <firstterm>virtual relation</firstterm> <classname>London_Suppliers</classname> as if it were another base table: <placeholder-1/> which will return the following table: <screen> SNAME | PNAME -------+------- Smith | Screw </screen>
ru: Теперь мы можем использовать это <firstterm>виртуальное отношение</firstterm> <classname>London_Suppliers</classname>, как если бы это была другая базовая таблица: <placeholder-1/> и в результате мы получим следующую таблицу: <screen> SNAME | PNAME -------+------- Smith | Screw </screen>

source: To calculate this result the database system has to do a <emphasis>hidden</emphasis> access to the base tables SUPPLIER, SELLS and PART first. It does so by executing the query given in the view definition against those base tables. After that the additional qualifications (given in the query against the view) can be applied to obtain the resulting table.
ru: Чтобы вычислить этот результат, система управления базой данных должна сначала осуществить <emphasis>скрытое</emphasis> обращение к базовым таблицам SUPPLIER, SELLS и PART. Для этого она выполняет запрос к базовым таблицам, заданный в определении представления. После этого для получения результирующей таблицы могут быть применены дополнительные условия (заданные в запросе с представлением).

source: DROP TABLE <replaceable class="parameter">table_name</replaceable>;
ru: DROP TABLE <replaceable class="parameter">имя_таблицы</replaceable>;

source: To destroy a table (including all tuples stored in that table) the <command>DROP TABLE</command> command is used: <placeholder-1/>
ru: Чтобы уничтожить таблицы (включая все содержащиеся в ней кортежи), применяется команда <command>DROP TABLE</command>: <placeholder-1/>

source: To destroy the SUPPLIER table use the following statement: <placeholder-1/>
ru: Чтобы уничтожить таблицу SUPPLIER, выполните следующий оператор: <placeholder-1/>

source: DROP INDEX <replaceable class="parameter">index_name</replaceable>;
ru: DROP INDEX <replaceable class="parameter">имя_индекса</replaceable>;

source: The <command>DROP INDEX</command> command is used to destroy an index: <placeholder-1/>
ru: Для уничтожения индекса применяется команда <command>DROP INDEX</command>: <placeholder-1/>

source: DROP VIEW <replaceable class="parameter">view_name</replaceable>;
ru: DROP VIEW <replaceable class="parameter">имя_представления</replaceable>;

source: Finally to destroy a given view use the command <command>DROP VIEW</command>: <placeholder-1/>
ru: Наконец, чтобы уничтожить указанное представление, выполните команду <command>DROP VIEW</command>: <placeholder-1/>

source: Data Manipulation
ru: Обработка данных

source: INSERT INTO <replaceable class="parameter">table_name</replaceable> (<replaceable class="parameter">name_of_attr_1</replaceable> [, <replaceable class="parameter">name_of_attr_2</replaceable> [, ...]]) VALUES (<replaceable class="parameter">val_attr_1</replaceable> [, <replaceable class="parameter">val_attr_2</replaceable> [, ...]]);
ru: INSERT INTO <replaceable class="parameter">имя_таблицы</replaceable> (<replaceable class="parameter">имя_атр_1</replaceable> [, <replaceable class="parameter">имя_атр_2</replaceable> [, ...]]) VALUES (<replaceable class="parameter">знач_атр_1</replaceable> [, <replaceable class="parameter">знач_атр_2</replaceable> [, ...]]);

source: Once a table is created (see <xref linkend="create-title" endterm="create-title"/>), it can be filled with tuples using the command <command>INSERT INTO</command>. The syntax is: <placeholder-1/>
ru: Когда таблица создана (см. <xref remap="4" linkend="create-title" endterm="create-title"/>), её можно наполнить кортежами, применив команду <command>INSERT INTO</command>. Синтаксис этой команды: <placeholder-1/>

source: To insert the first tuple into the relation SUPPLIER (from <xref linkend="supplier-fig" endterm="supplier-fig"/>) we use the following statement: <placeholder-1/>
ru: Для добавления первого кортежа в отношение SUPPLIER (из <xref linkend="supplier-fig" endterm="supplier-fig"/>) воспользуемся следующим оператором: <placeholder-1/>

source: To insert the first tuple into the relation SELLS we use: <placeholder-1/>
ru: Для добавления первого кортежа в отношение SELLS мы выполним: <placeholder-1/>

source: UPDATE <replaceable class="parameter">table_name</replaceable> SET <replaceable class="parameter">name_of_attr_1</replaceable> = <replaceable class="parameter">value_1</replaceable> [, ... [, <replaceable class="parameter">name_of_attr_k</replaceable> = <replaceable class="parameter">value_k</replaceable>]] WHERE <replaceable class="parameter">condition</replaceable>;
ru: UPDATE <replaceable class="parameter">имя_таблицы</replaceable> SET <replaceable class="parameter">имя_атрибута_1</replaceable> = <replaceable class="parameter">значение_1</replaceable> [, ... [, <replaceable class="parameter">имя_атрибута_k</replaceable> = <replaceable class="parameter">значение_k</replaceable>]] WHERE <replaceable class="parameter">условие</replaceable>;

source: To change one or more attribute values of tuples in a relation the <command>UPDATE</command> command is used. The syntax is: <placeholder-1/>
ru: Чтобы изменить значения одного или нескольких атрибутов кортежей в отношении, применяется команда <command>UPDATE</command>. Она имеет следующий синтаксис: <placeholder-1/>

source: To change the value of attribute PRICE of the part 'Screw' in the relation PART we use: <placeholder-1/>
ru: Чтобы изменить значение атрибута PRICE детали 'Screw' в отношении PART, выполним: <placeholder-1/>
