Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sql.po
Languages: ru

source: This chapter introduces the mathematical concepts behind relational databases. It is not required reading, so if you bog down or want to get straight to some simple examples feel free to jump ahead to the next chapter and come back when you have more time and patience. This stuff is supposed to be fun!
ru: В этой главе вводятся математические концепции, стоящие за реляционными базами данных. Этот материал не является обязательным к прочтению, так что если он окажется сложным или вы хотите сразу перейти к простым примерам, вы можете свободно пропустить эту главу и вернуться сюда, когда у вас будет больше времени и терпения. Тут должно быть интересно!

source: This material originally appeared as a part of Stefan Simkovics' Master's Thesis (<xref linkend="sim98" endterm="sim98"/>).
ru: Этот материал изначально был представлен в дипломной работе Стефана Симковича (<xref linkend="sim98" endterm="sim98"/>).

source: <acronym>SQL</acronym> has become the most popular relational query language. The name <quote><acronym>SQL</acronym></quote> is an abbreviation for <firstterm>Structured Query Language</firstterm>. In 1974 Donald Chamberlin and others defined the language SEQUEL (<firstterm>Structured English Query Language</firstterm>) at IBM Research. This language was first implemented in an IBM prototype called SEQUEL-XRM in 1974-75. In 1976-77 a revised version of SEQUEL called SEQUEL/2 was defined and the name was changed to <acronym>SQL</acronym> subsequently.
ru: <acronym>SQL</acronym> стал самым популярным языком реляционных запросов. Название <quote><acronym>SQL</acronym></quote> является аббревиатурой от <firstterm>Structured Query Language</firstterm> (Язык структурированных запросов). В 1974 в группе IBM Research Дональд Чамберлин с коллегами разработали язык SEQUEL (<firstterm>Structured English Query Language</firstterm>, Язык структурированных англоязычных запросов). Сначала этот язык был воплощён внутри IBM, в прототипе, названном SEQUEL-XRM, в 1974-75 г. В 1976-77 была определена пересмотренная версия SEQUEL, названная SEQUEL/2, а затем имя было изменено на <acronym>SQL</acronym>.

source: A new prototype called System R was developed by IBM in 1977. System R implemented a large subset of SEQUEL/2 (now <acronym>SQL</acronym>) and a number of changes were made to <acronym>SQL</acronym> during the project. System R was installed in a number of user sites, both internal IBM sites and also some selected customer sites. Thanks to the success and acceptance of System R at those user sites IBM started to develop commercial products that implemented the <acronym>SQL</acronym> language based on the System R technology.
ru: Новый прототип, названный System R, был разработан в IBM в 1977 г. В проекте System R было реализовано большое подмножество SEQUEL/2 (ставшего <acronym>SQL</acronym>), а в процессе его разработки ряд изменений был внесён и в <acronym>SQL</acronym>. Технология System R была внедрена на нескольких площадках, как внутри IBM, так и у некоторых клиентов. Благодаря признанию System R и успеху у этих пользователей, IBM начала разрабатывать коммерческие продукты, реализующие язык <acronym>SQL</acronym> на базе System R.

source: Over the next years IBM and also a number of other vendors announced <acronym>SQL</acronym> products such as <productname>SQL/DS</productname> (IBM), <productname>DB2</productname> (IBM), <productname>ORACLE</productname> (Oracle Corp.), <productname>DG/SQL</productname> (Data General Corp.), and <productname>SYBASE</productname> (Sybase Inc.).
ru: За следующие несколько лет IBM и ряд других компаний анонсировали несколько продуктов <acronym>SQL</acronym>, включая <productname>SQL/DS</productname> (IBM), <productname>DB2</productname> (IBM), <productname>ORACLE</productname> (Oracle Corp.), <productname>DG/SQL</productname> (Data General Corp.) и <productname>SYBASE</productname> (Sybase Inc.).

source: <acronym>SQL</acronym> is also an official standard now. In 1982 the American National Standards Institute (<acronym>ANSI</acronym>) chartered its Database Committee X3H2 to develop a proposal for a standard relational language. This proposal was ratified in 1986 and consisted essentially of the IBM dialect of <acronym>SQL</acronym>. In 1987 this <acronym>ANSI</acronym> standard was also accepted as an international standard by the International Organization for Standardization (<acronym>ISO</acronym>). This original standard version of <acronym>SQL</acronym> is often referred to, informally, as <quote><abbrev>SQL/86</abbrev></quote>. In 1989 the original standard was extended and this new standard is often, again informally, referred to as <quote><abbrev>SQL/89</abbrev></quote>. Also in 1989, a related standard called <firstterm>Database Language Embedded <acronym>SQL</acronym></firstterm> (<acronym>ESQL</acronym>) was developed.
ru: Сейчас <acronym>SQL</acronym> является официальным стандартом. В 1982 г. Американский национальный институт стандартов (<acronym>ANSI</acronym>, American National Standards Institute) поручил своему комитету баз данных X3H2 разработать предложение для стандартного реляционного языка. Это предложение было принято в 1986 и по сути содержало диалект <acronym>SQL</acronym>, сложившийся в IBM. В 1987 г. этот стандарт <acronym>ANSI</acronym> также был принят в качестве международного стандарта Международной организацией по стандартизации (<acronym>ISO</acronym>, International Organization for Standardization). Первоначальная версия стандарта <acronym>SQL</acronym> часто неформально называется <quote><abbrev>SQL/86</abbrev></quote>. В 1989 г. первая версия стандарта была расширена и этот новый стандарт получил, так же неформальное, название <quote><abbrev>SQL/89</abbrev></quote>. В том же 1989 г. был разработан связанный стандарт <firstterm>Язык баз данных Встраиваемый <acronym>SQL</acronym></firstterm> (<acronym>ESQL</acronym>, Embedded <acronym>SQL</acronym>).

source: The <acronym>ISO</acronym> and <acronym>ANSI</acronym> committees have been working for many years on the definition of a greatly expanded version of the original standard, referred to informally as <firstterm><acronym>SQL2</acronym></firstterm> or <firstterm><acronym>SQL/92</acronym></firstterm>. This version became a ratified standard - <quote>International Standard ISO/IEC 9075:1992, Database Language <acronym>SQL</acronym></quote> - in late 1992. <acronym>SQL/92</acronym> is the version normally meant when people refer to <quote>the <acronym>SQL</acronym> standard</quote>. A detailed description of <acronym>SQL/92</acronym> is given in <xref linkend="date97" endterm="date97"/>. At the time of writing this document a new standard informally referred to as <firstterm><acronym>SQL3</acronym></firstterm> is under development. It is planned to make <acronym>SQL</acronym> a Turing-complete language, i.e., all computable queries (e.g., recursive queries) will be possible. This has now been completed as SQL:2003.
ru: Комитеты <acronym>ISO</acronym> и <acronym>ANSI</acronym> несколько лет работали над определением значительно расширенной версии начального стандарта, получившей неформальное название <firstterm><acronym>SQL2</acronym></firstterm> или <firstterm><acronym>SQL/92</acronym></firstterm>. Эта версия стала принятым стандартом <quote>International Standard ISO/IEC 9075:1992, Database Language <acronym>SQL</acronym></quote> в конце 1992 г. И сейчас, когда говорят <quote>о стандарте <acronym>SQL</acronym></quote>, обычно имеют в виду версию <acronym>SQL/92</acronym>. Подробное описание <acronym>SQL/92</acronym> приведено в книге <xref linkend="date97" endterm="date97"/>. На момент написания этого материала разрабатывался новый стандарт, неформально называемый <firstterm><acronym>SQL3</acronym></firstterm>. Планировалось, что в нём <acronym>SQL</acronym> станет языком, полным по Тьюрингу, то есть будут возможны все вычисляемые запросы (например, рекурсивные). Позже это было воплощено в стандарте SQL:2003.

source: The Relational Data Model
ru: Реляционная модель данных

source: As mentioned before, <acronym>SQL</acronym> is a relational language. That means it is based on the <firstterm>relational data model</firstterm> first published by E.F. Codd in 1970. We will give a formal description of the relational model later (in <xref linkend="formal-notion" endterm="formal-notion"/>) but first we want to have a look at it from a more intuitive point of view.
ru: Как упоминалось ранее, <acronym>SQL</acronym> является реляционным языком. Это означает, что он основан на <firstterm>реляционной модели данных</firstterm>, которую впервые предложил Эдгар Франк Кодд в 1970 г. Мы дадим формальное описание реляционной модели позже (в <xref remap="6" linkend="formal-notion" endterm="formal-notion"/>), но сначала хотим посмотреть на неё с более интуитивной точки зрения.

source: SUPPLIER is a table storing the number (SNO), the name (SNAME) and the city (CITY) of a supplier.
ru: Таблица &laquo;Поставщик&raquo; (SUPPLIER) содержит номер (SNO), имя (SNAME) и город (CITY) поставщика.

source: PART is a table storing the number (PNO) the name (PNAME) and the price (PRICE) of a part.
ru: Таблица &laquo;Деталь&raquo; (PART) содержит номер (PNO), имя (PNAME) и цену (PRICE) детали.

source: SELLS stores information about which part (PNO) is sold by which supplier (SNO). It serves in a sense to connect the other two tables together.
ru: Таблица &laquo;Продажи&raquo; (SELLS) содержит информацию о том, какая деталь (PNO) была продана каким поставщиком (SNO). Она играет роль связывающей две другие таблицы.

source: The Suppliers and Parts Database
ru: База данных поставщиков и деталей

source: A <firstterm>relational database</firstterm> is a database that is perceived by its users as a <firstterm>collection of tables</firstterm> (and nothing else but tables). A table consists of rows and columns where each row represents a record and each column represents an attribute of the records contained in the table. <xref linkend="supplier-fig" endterm="supplier-fig"/> shows an example of a database consisting of three tables: <placeholder-1/> <example><placeholder-2/> <screen>SUPPLIER: SELLS: SNO | SNAME | CITY SNO | PNO ----+---------+-------- -----+----- 1 | Smith | London 1 | 1 2 | Jones | Paris 1 | 2 3 | Adams | Vienna 2 | 4 4 | Blake | Rome 3 | 1 3 | 3 4 | 2 PART: 4 | 3 PNO | PNAME | PRICE 4 | 4 ----+---------+--------- 1 | Screw | 10 2 | Nut | 8 3 | Bolt | 15 4 | Cam | 25</screen></example>
ru: <firstterm>Реляционная база данных</firstterm> — это база данных, воспринимаемая пользователями как <firstterm>набор таблиц</firstterm> (и ничего кроме таблиц). Таблицы состоят из строк и столбцов, в которой каждая строка представляет запись, а каждый столбец — один атрибут записей, содержащихся в таблице. <xref linkend="supplier-fig" endterm="supplier-fig"/> показывает пример базы данных, состоящей из трёх таблиц: <placeholder-1/> <example><placeholder-2/> <screen>SUPPLIER: SELLS: SNO | SNAME | CITY SNO | PNO ----+---------+-------- -----+----- 1 | Smith | London 1 | 1 2 | Jones | Paris 1 | 2 3 | Adams | Vienna 2 | 4 4 | Blake | Rome 3 | 1 3 | 3 4 | 2 PART: 4 | 3 PNO | PNAME | PRICE 4 | 4 ----+---------+--------- 1 | Screw | 10 2 | Nut | 8 3 | Bolt | 15 4 | Cam | 25</screen></example>

source: The tables PART and SUPPLIER can be regarded as <firstterm>entities</firstterm> and SELLS can be regarded as a <firstterm>relationship</firstterm> between a particular part and a particular supplier.
ru: Таблицы PART и SUPPLIER можно считать <firstterm>сущностями</firstterm> в БД, а SELLS — устанавливающей <firstterm>связь</firstterm> между определённой деталью и определённым поставщиком.

source: As we will see later, <acronym>SQL</acronym> operates on tables like the ones just defined but before that we will study the theory of the relational model.
ru: Как мы увидим позже, <acronym>SQL</acronym> работает с таблицами, подобными тем, что были только что определены, но прежде мы изучим теорию реляционной модели.

source: Relational Data Model Formalities
ru: Формальное определение реляционной модели данных

source: The mathematical concept underlying the relational model is the set-theoretic <firstterm>relation</firstterm> which is a subset of the Cartesian product of a list of domains. This set-theoretic relation gives the model its name (do not confuse it with the relationship from the <firstterm>Entity-Relationship model</firstterm>). Formally a domain is simply a set of values. For example the set of integers is a domain. Also the set of character strings of length 20 and the real numbers are examples of domains.
ru: Математическая концепция, стоящая за реляционной моделью, основана на <firstterm>отношениях</firstterm>, являющихся декартовым произведением списка доменов. Отношение (англ. relation) из теории множеств и дало модели название (англ. relational) (не стоит путать его с отношением в <firstterm>модели сущность-связь</firstterm>). Доменом в данном контексте формально является просто множество значений. Например, домен образует множество целых чисел. Другие примеры доменов — множество строк из 20 символов или вещественные числа.

source: The <firstterm>Cartesian product</firstterm> of domains <parameter>D<subscript>1</subscript></parameter>, <parameter>D<subscript>2</subscript></parameter>, ... <parameter>D<subscript>k</subscript></parameter>, written <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> &times; ... &times; <parameter>D<subscript>k</subscript></parameter> is the set of all k-tuples <parameter>v<subscript>1</subscript></parameter>, <parameter>v<subscript>2</subscript></parameter>, ... <parameter>v<subscript>k</subscript></parameter>, such that <parameter>v<subscript>1</subscript></parameter> &isin; <parameter>D<subscript>1</subscript></parameter>, <parameter>v<subscript>2</subscript></parameter> &isin; <parameter>D<subscript>2</subscript></parameter>, ... <parameter>v<subscript>k</subscript></parameter> &isin; <parameter>D<subscript>k</subscript></parameter>.
ru: <firstterm>Декартовым произведением</firstterm> доменов <parameter>D<subscript>1</subscript></parameter>, <parameter>D<subscript>2</subscript></parameter>, ... <parameter>D<subscript>k</subscript></parameter> (записывается как <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> &times; ... &times; <parameter>D<subscript>k</subscript></parameter>) является множество из всех k-арных кортежей <parameter>v<subscript>1</subscript></parameter>, <parameter>v<subscript>2</subscript></parameter>, ... <parameter>v<subscript>k</subscript></parameter>, таких, что <parameter>v<subscript>1</subscript></parameter> &isin; <parameter>D<subscript>1</subscript></parameter>, <parameter>v<subscript>2</subscript></parameter> &isin; <parameter>D<subscript>2</subscript></parameter>, ... <parameter>v<subscript>k</subscript></parameter> &isin; <parameter>D<subscript>k</subscript></parameter>.

source: For example, when we have <parameter>k</parameter>=2, <parameter>D<subscript>1</subscript></parameter>=<literal>{0,1}</literal> and <parameter>D<subscript>2</subscript></parameter>=<literal>{a,b,c}</literal> then <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> is <literal>{(0,a),(0,b),(0,c),(1,a),(1,b),(1,c)}</literal>.
ru: Например, если <parameter>k</parameter>=2, <parameter>D<subscript>1</subscript></parameter>=<literal>{0,1}</literal> и <parameter>D<subscript>2</subscript></parameter>=<literal>{a,b,c}</literal>, то <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> равняется <literal>{(0,a),(0,b),(0,c),(1,a),(1,b),(1,c)}</literal>.

source: A Relation is any subset of the Cartesian product of one or more domains: <parameter>R</parameter> &sube; <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> &times; ... &times; <parameter>D<subscript>k</subscript></parameter>.
ru: Отношением является любое подмножество декартова произведения одного или нескольких доменов: <parameter>R</parameter> &sube; <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> &times; ... &times; <parameter>D<subscript>k</subscript></parameter>.

source: For example <literal>{(0,a),(0,b),(1,a)}</literal> is a relation; it is in fact a subset of <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> mentioned above.
ru: Например, <literal>{(0,a),(0,b),(1,a)}</literal> — это отношение, и на самом деле оно является подмножеством вышеописанного произведения <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter>.

source: The members of a relation are called tuples. Each relation of some Cartesian product <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> &times; ... &times; <parameter>D<subscript>k</subscript></parameter> is said to have arity <literal>k</literal> and is therefore a set of <literal>k</literal>-tuples.
ru: Члены отношения называются кортежами. Про отношение некоторого декартового произведения <parameter>D<subscript>1</subscript></parameter> &times; <parameter>D<subscript>2</subscript></parameter> &times; ... &times; <parameter>D<subscript>k</subscript></parameter> говорят, что оно имеет арность <literal>k</literal> и таким образом является множеством <literal>k</literal>-арных кортежей.

source: A relation can be viewed as a table (as we already did, remember <xref linkend="supplier-fig" endterm="supplier-fig"/> where every tuple is represented by a row and every column corresponds to one component of a tuple. Giving names (called attributes) to the columns leads to the definition of a <firstterm>relation scheme</firstterm>.
ru: Отношение можно рассматривать как таблицу (как мы уже делали, вспомните <xref linkend="supplier-fig" endterm="supplier-fig"/>, где каждый кортеж представляет строку, а каждый столбец соответствует одному компоненту кортежа. Введя имёна (называемые атрибутами) столбцов, мы приходим к определению <firstterm>схемы отношения</firstterm>.

source: A <firstterm>relation scheme</firstterm> is just a kind of template whereas a <firstterm>relation</firstterm> is an instance of a <firstterm>relation scheme</firstterm>. The relation consists of tuples (and can therefore be viewed as a table); not so the relation scheme.
ru: <firstterm>Реляционная схема</firstterm> — это своего рода класс, экземпляром которого является <firstterm>отношение</firstterm>. Отношение состоит из кортежей (и поэтому может рассматриваться как таблица), в отличие от реляционной схемы.

source: A <firstterm>relation scheme</firstterm> <literal>R</literal> is a finite set of attributes <parameter>A<subscript>1</subscript></parameter>, <parameter>A<subscript>2</subscript></parameter>, ... <parameter>A<subscript>k</subscript></parameter>. There is a domain <parameter>D<subscript>i</subscript></parameter>, for each attribute <parameter>A<subscript>i</subscript></parameter>, 1 &lt;= <literal>i</literal> &lt;= <literal>k</literal>, where the values of the attributes are taken from. We often write a relation scheme as <literal>R(<parameter>A<subscript>1</subscript></parameter>, <parameter>A<subscript>2</subscript></parameter>, ... <parameter>A<subscript>k</subscript></parameter>)</literal>. <placeholder-1/>
ru: <firstterm>Реляционная схема</firstterm> <literal>R</literal> определяет <parameter>A<subscript>1</subscript></parameter>, <parameter>A<subscript>2</subscript></parameter>, ... <parameter>A<subscript>k</subscript></parameter>. Для каждого атрибута <parameter>A<subscript>i</subscript></parameter>, 1 &lt;= <literal>i</literal> &lt;= <literal>k</literal> существует домен <parameter>D<subscript>i</subscript></parameter>, из которого берутся значения атрибутов. Мы часто записываем реляционную схему как <literal>R(<parameter>A<subscript>1</subscript></parameter>, <parameter>A<subscript>2</subscript></parameter>, ... <parameter>A<subscript>k</subscript></parameter>)</literal>. <placeholder-1/>

source: Domains vs. Data Types
ru: Домены и типы данных

source: We often talked about <firstterm>domains</firstterm> in the last section. Recall that a domain is, formally, just a set of values (e.g., the set of integers or the real numbers). In terms of database systems we often talk of <firstterm>data types</firstterm> instead of domains. When we define a table we have to make a decision about which attributes to include. Additionally we have to decide which kind of data is going to be stored as attribute values. For example the values of <classname>SNAME</classname> from the table <classname>SUPPLIER</classname> will be character strings, whereas <classname>SNO</classname> will store integers. We define this by assigning a data type to each attribute. The type of <classname>SNAME</classname> will be <type>VARCHAR(20)</type> (this is the <acronym>SQL</acronym> type for character strings of length &lt;= 20), the type of <classname>SNO</classname> will be <type>INTEGER</type>. With the assignment of a data type we also have selected a domain for an attribute. The domain of <classname>SNAME</classname> is the set of all character strings of length &lt;= 20, the domain of <classname>SNO</classname> is the set of all integer numbers.
ru: В последнем разделе мы часто говорили о <firstterm>доменах</firstterm>. Вспомните, что домен формально является просто множеством значений (например, множество целых или вещественных чисел). В терминах баз данных мы часто говорим о <firstterm>типах данных</firstterm>, а не о доменах. Когда мы определяем таблицу, мы должны решить, какие атрибуты в неё включить. Кроме того, необходимо решить, какого рода данные будут храниться в качестве значений атрибутов. Например, значениями <classname>SNAME</classname> в таблице <classname>SUPPLIER</classname> будут символьные строки, тогда как в <classname>SNO</classname> будут храниться целые числа. Мы определяем это, назначая типы данных каждому атрибуту. Типом <classname>SNAME</classname> будет <type>VARCHAR(20)</type> (это тип <acronym>SQL</acronym> для символьных строк длины &lt;= 20), а типом <classname>SNO</classname> будет <type>INTEGER</type>. Назначая тип данных, мы тем самым также выбираем домен для атрибута. Доменом <classname>SNAME</classname> будет множество всех символьных строк длины &lt;= 20, а доменом <classname>SNO</classname> — множество всех целых чисел.

source: Operations in the Relational Data Model
ru: Операции в реляционной модели данных

source: The <firstterm>Relational Algebra</firstterm> which is an algebraic notation, where queries are expressed by applying specialized operators to the relations.
ru: <firstterm>Реляционная алгебра</firstterm>, представляющая алгебраическую нотацию, в которой запросы выражаются как применение специализированных операторов к отношениям.

source: The <firstterm>Relational Calculus</firstterm> which is a logical notation, where queries are expressed by formulating some logical restrictions that the tuples in the answer must satisfy.
ru: <firstterm>Реляционное исчисление</firstterm>, представляющее логическую нотацию, в которой запросы выражаются как формулировка логических ограничений, которым должны удовлетворять интересующие кортежи.
