Repository: pluzanov/pg-doc-ru
Catalog: 9.6/sql.po
Languages: ru

source: The most often used command in <acronym>SQL</acronym> is the <command>SELECT</command> statement, used to retrieve data. The syntax is: <synopsis>SELECT [ ALL | DISTINCT [ ON ( <replaceable class="parameter">expression</replaceable> [, ...] ) ] ] * | <replaceable class="parameter">expression</replaceable> [ [ AS ] <replaceable class="parameter">output_name</replaceable> ] [, ...] [ INTO [ TEMPORARY | TEMP ] [ TABLE ] <replaceable class="parameter">new_table</replaceable> ] [ FROM <replaceable class="parameter">from_item</replaceable> [, ...] ] [ WHERE <replaceable class="parameter">condition</replaceable> ] [ GROUP BY <replaceable class="parameter">expression</replaceable> [, ...] ] [ HAVING <replaceable class="parameter">condition</replaceable> [, ...] ] [ { UNION | INTERSECT | EXCEPT } [ ALL ] <replaceable class="parameter">select</replaceable> ] [ ORDER BY <replaceable class="parameter">expression</replaceable> [ ASC | DESC | USING <replaceable class="parameter">operator</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] ] [ LIMIT { <replaceable class="parameter">count</replaceable> | ALL } ] [ OFFSET <replaceable class="parameter">start</replaceable> ] [ FOR { UPDATE | SHARE } [ OF <replaceable class="parameter">table_name</replaceable> [, ...] ] [ NOWAIT | SKIP LOCKED ] [...] ]</synopsis>
ru: Наиболее часто используемая команда в <acronym>SQL</acronym> — оператор <command>SELECT</command>, осуществляющий выборку данных. Он имеет следующий синтаксис: <synopsis>SELECT [ ALL | DISTINCT [ ON ( <replaceable class="parameter">выражение</replaceable> [, ...] ) ] ] * | <replaceable class="parameter">выражение</replaceable> [ [ AS ] <replaceable class="parameter">выходное_имя</replaceable> ] [, ...] [ INTO [ TEMPORARY | TEMP ] [ TABLE ] <replaceable class="parameter">новая_таблица</replaceable> ] [ FROM <replaceable class="parameter">элемент_FROM</replaceable> [, ...] ] [ WHERE <replaceable class="parameter">условие</replaceable> ] [ GROUP BY <replaceable class="parameter">выражение</replaceable> [, ...] ] [ HAVING <replaceable class="parameter">условие</replaceable> [, ...] ] [ { UNION | INTERSECT | EXCEPT } [ ALL ] <replaceable class="parameter">выборка</replaceable> ] [ ORDER BY <replaceable class="parameter">выражение</replaceable> [ ASC | DESC | USING <replaceable class="parameter">оператор</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] ] [ LIMIT { <replaceable class="parameter">количество</replaceable> | ALL } ] [ OFFSET <replaceable class="parameter">начало</replaceable> ] [ FOR { UPDATE | SHARE } [ OF <replaceable class="parameter">имя_таблицы</replaceable> [, ...] ] [ NOWAIT | SKIP LOCKED ] [...] ]</synopsis>

source: Now we will illustrate the complex syntax of the <command>SELECT</command> statement with various examples. The tables used for the examples are defined in <xref linkend="supplier-fig" endterm="supplier-fig"/>.
ru: Далее мы проиллюстрируем сложный синтаксис оператора <command>SELECT</command> различными примерами. Таблицы для этих примеров определены в <xref remap="6" linkend="supplier-fig" endterm="supplier-fig"/>.

source: Simple Selects
ru: Простые выборки

source: Simple Query with Qualification
ru: Простой запрос с условием

source: To retrieve all tuples from table PART where the attribute PRICE is greater than 10 we formulate the following query: <placeholder-1/> and get the table: <screen> PNO | PNAME | PRICE -----+---------+-------- 3 | Bolt | 15 4 | Cam | 25</screen>
ru: Чтобы выбрать все кортежи из таблицы PART (детали), у которых атрибут PRICE (цена) больше 10, мы формулируем следующий запрос: <placeholder-1/> и получаем таблицу: <screen> PNO | PNAME | PRICE -----+---------+-------- 3 | Bolt | 15 4 | Cam | 25</screen>

source: Using <quote>*</quote> in the <command>SELECT</command> statement will deliver all attributes from the table. If we want to retrieve only the attributes PNAME and PRICE from table PART we use the statement: <placeholder-1/> In this case the result is: <screen> PNAME | PRICE --------+-------- Bolt | 15 Cam | 25</screen> Note that the <acronym>SQL</acronym> <command>SELECT</command> corresponds to the <quote>projection</quote> in relational algebra not to the <quote>selection</quote> (see <xref linkend="rel-alg" endterm="rel-alg"/> for more details).
ru: Используя <quote>*</quote> в операторе <command>SELECT</command>, мы получим все атрибуты из этой таблицы. Если мы хотим выбрать из таблицы PART только атрибуты PNAME and PRICE, воспользуемся таким оператором: <placeholder-1/> В этом случае мы получим такой результат: <screen> PNAME | PRICE --------+-------- Bolt | 15 Cam | 25</screen> Заметьте, что <command>SELECT</command> в <acronym>SQL</acronym> соответствует в реляционной алгебре <quote>проекции</quote>, а не <quote>выборке</quote> (за подробностями обратитесь к <xref remap="3" linkend="rel-alg" endterm="rel-alg"/>).

source: The qualifications in the WHERE clause can also be logically connected using the keywords OR, AND, and NOT: <placeholder-1/> will lead to the result: <screen> PNAME | PRICE --------+-------- Bolt | 15</screen>
ru: Условия в предложении WHERE также могут логически связываться ключевыми словами OR (ИЛИ), AND (И) и NOT (НЕ): <placeholder-1/> даст результат: <screen> PNAME | PRICE --------+-------- Bolt | 15</screen>

source: Arithmetic operations can be used in the target list and in the WHERE clause. For example if we want to know how much it would cost if we take two pieces of a part we could use the following query: <placeholder-1/> and we get: <screen> PNAME | DOUBLE --------+--------- Screw | 20 Nut | 16 Bolt | 30</screen> Note that the word DOUBLE after the keyword AS is the new title of the second column. This technique can be used for every element of the target list to assign a new title to the resulting column. This new title is often referred to as alias. The alias cannot be used throughout the rest of the query.
ru: В целевом списке и в предложении WHERE могут использоваться арифметические операции. Например, если мы хотим узнать, сколько будет стоить пара каждых деталей, воспользуемся следующим запросом: <placeholder-1/> и получим: <screen> PNAME | DOUBLE --------+--------- Screw | 20 Nut | 16 Bolt | 30</screen> Заметьте, что слово DOUBLE после ключевого слова AS обозначает новое имя второго столбца. Этот приём можно использовать для каждого элемента целевого списка, чтобы присвоить результирующему столбцу новое имя. Это новое имя часто называется псевдонимом. Использовать этот псевдоним в другой части запроса нельзя.

source: Here are some simple examples using a <command>SELECT</command> statement: <placeholder-1/>
ru: Несколько простых примеров использования оператора <command>SELECT</command>: <placeholder-1/>

source: Joins
ru: Соединения

source: The following example shows how <firstterm>joins</firstterm> are realized in <acronym>SQL</acronym>.
ru: Следующий пример показывает, как в <acronym>SQL</acronym> реализованы <firstterm>соединения</firstterm>.

source: To join the three tables SUPPLIER, PART and SELLS over their common attributes we formulate the following statement: <placeholder-1/> and get the following table as a result: <screen> SNAME | PNAME -------+------- Smith | Screw Smith | Nut Jones | Cam Adams | Screw Adams | Bolt Blake | Nut Blake | Bolt Blake | Cam</screen>
ru: Чтобы соединить три таблицы SUPPLIER, PART и SELLS по их общим атрибутам, мы формулируем следующий оператор: <placeholder-1/> и получаем в результате следующую таблицу: <screen> SNAME | PNAME -------+------- Smith | Screw Smith | Nut Jones | Cam Adams | Screw Adams | Bolt Blake | Nut Blake | Bolt Blake | Cam</screen>

source: In the FROM clause we introduced an alias name for every relation because there are common named attributes (SNO and PNO) among the relations. Now we can distinguish between the common named attributes by simply prefixing the attribute name with the alias name followed by a dot. The join is calculated in the same way as shown in <xref linkend="join-example" endterm="join-example"/>. First the Cartesian product SUPPLIER &times; PART &times; SELLS is derived. Now only those tuples satisfying the conditions given in the WHERE clause are selected (i.e., the common named attributes have to be equal). Finally we project out all columns but S.SNAME and P.PNAME.
ru: В предложении FROM мы ввели псевдоним для каждого отношения, так как у отношений есть одноимённые атрибуты (SNO и PNO). Теперь мы можем различать общие атрибуты, просто добавляя перед именем атрибута имя псевдонима с точкой. Соединение вычисляется так же, как показано в <xref remap="6" linkend="join-example" endterm="join-example"/>. На первом этапе формируется декартово произведение SUPPLIER &times; PART &times; SELLS. Затем выбираются только те кортежи, которые удовлетворяют условиям, заданным в предложении WHERE (то есть те, у которых указанные общие атрибуты равны). Наконец, мы отбираем все столбцы, кроме S.SNAME и P.PNAME.

source: Another way to perform joins is to use the SQL JOIN syntax as follows: <placeholder-1/> giving again: <screen> sname | pname -------+------- Smith | Screw Adams | Screw Smith | Nut Blake | Nut Adams | Bolt Blake | Bolt Jones | Cam Blake | Cam (8 rows)</screen>
ru: Ещё один способ выполнить соединение — использовать синтаксис SQL JOIN так: <placeholder-1/> Это даёт нам: <screen> sname | pname -------+------- Smith | Screw Adams | Screw Smith | Nut Blake | Nut Adams | Bolt Blake | Bolt Jones | Cam Blake | Cam (8 rows)</screen>

source: A joined table, created using JOIN syntax, is a table reference list item that occurs in a FROM clause and before any WHERE, GROUP BY, or HAVING clause. Other table references, including table names or other JOIN clauses, can be included in the FROM clause if separated by commas. JOINed tables are logically like any other table listed in the FROM clause.
ru: Соединённая таблица, созданная с использованием синтаксиса JOIN, становится элементом списка ссылок на таблицы, имеющим место внутри предложения FROM и перед предложениями WHERE, GROUP BY или HAVING. В предложение FROM можно включить другие ссылки на таблицы, в том числе по именам, или другие предложения JOIN. Соединённые таблицы логически не отличаются от любых других таблиц, перечисленных в предложении FROM.

source: SQL JOINs come in two main types, CROSS JOINs (unqualified joins) and <firstterm>qualified JOINs</firstterm>. Qualified joins can be further subdivided based on the way in which the <firstterm>join condition</firstterm> is specified (ON, USING, or NATURAL) and the way in which it is applied (INNER or OUTER join).
ru: Среди соединений SQL можно выделить два основных типа, перекрёстные соединения (соединения без условий, CROSS JOIN) и <firstterm>соединения с условиями</firstterm>. Соединения с условиями можно затем разделить в зависимости от способа указания <firstterm>условия соединения</firstterm> (ON, USING или NATURAL) и способа его применения (внутреннее (INNER) или внешнее (OUTER) соединение).

source: Join Types
ru: Типы соединений

source: A cross join takes two tables T1 and T2 having N and M rows respectively, and returns a joined table containing all N*M possible joined rows. For each row R1 of T1, each row R2 of T2 is joined with R1 to yield a joined table row JR consisting of all fields in R1 and R2. A CROSS JOIN is equivalent to an INNER JOIN ON TRUE.
ru: Перекрёстное соединение получает две таблицы T1 и T2, имеющих соответственно N и M строк, и выдаёт соединённую таблицу, содержащую все возможные соединённые строки (N*M). Для каждой строки R1 из T1, каждая строка R2 из T2 соединяется с R1 и в результате выдаётся соединённая строка таблицы JR, состоящая из всех полей в R1 и R2. Соединение CROSS JOIN равнозначно соединению INNER JOIN ON TRUE.

source: Qualified JOINs
ru: Соединения с условиями

source: search condition
ru: условие поиска

source: join column list
ru: список столбцов соединения

source: A qualified JOIN must specify its join condition by providing one (and only one) of NATURAL, ON, or USING. The ON clause takes a <replaceable>search condition</replaceable>, which is the same as in a WHERE clause. The USING clause takes a comma-separated list of column names, which the joined tables must have in common, and joins the tables on equality of those columns. NATURAL is shorthand for a USING clause that lists all the common column names of the two tables. A side-effect of both USING and NATURAL is that only one copy of each joined column is emitted into the result table (compare the relational-algebra definition of JOIN, shown earlier).
ru: В соединении с условием должно задаваться условие соединения в одном (и только одном) предложении NATURAL, ON или USING. Предложение ON принимает <replaceable>условие поиска</replaceable>, которое действует так же, как и в предложении WHERE. Предложение USING принимает список имён столбцов через запятую, которые должны быть общими у соединяемых таблиц, и соединяет таблицы по равенству этих столбцов. Предложение NATURAL является краткой формой USING с перечислением всех общих имён столбцов двух таблиц. Побочный эффект использования и USING, и NATURAL состоит в том, что в результирующую таблицу выдаётся только одна копия каждого соединяемого столбца (сравните это с описанным выше определением JOIN в реляционной алгебре).

source: For each row R1 of T1, the joined table has a row for each row in T2 that satisfies the join condition with R1.
ru: Для каждой строки R1 из T1 в результирующей таблице содержится строка для каждой строки в T2, удовлетворяющей условию соединения с R1.

source: The words INNER and OUTER are optional for all JOINs. INNER is the default. LEFT, RIGHT, and FULL imply an OUTER JOIN.
ru: Слова INNER и OUTER необязательны для всех форм JOIN. По умолчанию подразумевается INNER (внутреннее соединение), а при указании LEFT, RIGHT и FULL — OUTER (внешнее соединение).

source: First, an INNER JOIN is performed. Then, for each row in T1 that does not satisfy the join condition with any row in T2, an additional joined row is returned with null fields in the columns from T2.
ru: Сначала выполняется внутреннее соединение (INNER JOIN). Затем для каждой строки в T1, не удовлетворяющей условию соединения ни с какой строкой в T2, возвращается дополнительная строка со значениями NULL в столбцах из T2.

source: The joined table unconditionally has a row for each row in T1.
ru: В соединённой таблице всегда оказывается строка для каждой строки в T1.

source: First, an INNER JOIN is performed. Then, for each row in T2 that does not satisfy the join condition with any row in T1, an additional joined row is returned with null fields in the columns from T1.
ru: Сначала выполняется внутреннее соединение (INNER JOIN). Затем для каждой строки в T2, не удовлетворяющей условию соединения ни с какой строкой в T1, возвращается дополнительная строка со значениями NULL в столбцах из T1.

source: The joined table unconditionally has a row for each row in T2.
ru: В соединённой таблице всегда оказывается строка для каждой строки в T2.

source: First, an INNER JOIN is performed. Then, for each row in T1 that does not satisfy the join condition with any row in T2, an additional joined row is returned with null fields in the columns from T2. Also, for each row in T2 that does not satisfy the join condition with any row in T1, an additional joined row is returned with null fields in the columns from T1.
ru: Сначала выполняется внутреннее соединение (INNER JOIN). Затем для каждой строки в T1, не удовлетворяющей условию соединения ни с какой строкой в T2, возвращается дополнительная строка со значениями NULL в столбцах из T2. А также для каждой строки в T2, не удовлетворяющей условию соединения ни с какой строкой в T1, возвращается дополнительная строка со значениями NULL в столбцах из T1.

source: The joined table unconditionally has a row for every row of T1 and a row for every row of T2.
ru: В соединённой таблице всегда оказывается строка для каждой строки в T1 и для каждой строки в T2.

source: JOINs of all types can be chained together or nested where either or both of <replaceable class="parameter">T1</replaceable> and <replaceable class="parameter">T2</replaceable> can be JOINed tables. Parenthesis can be used around JOIN clauses to control the order of JOINs which are otherwise processed left to right.
ru: Соединения всех типов можно связывать вместе или вкладывать одно в другое, так что и <replaceable class="parameter">T1</replaceable>, и <replaceable class="parameter">T2</replaceable> могут быть соединёнными таблицами. Предложения JOIN могут быть заключены в скобки для установления нужного порядка соединений (без них действует порядок справа налево).

source: Aggregate Functions
ru: Агрегатные функции

source: Aggregates
ru: Агрегатные функции

source: If we want to know the average cost of all parts in table PART we use the following query: <placeholder-1/>
ru: Если мы хотим узнать среднюю стоимость всех деталей в таблице PART, воспользуемся следующим запросом: <placeholder-1/>

source: The result is: <screen> AVG_PRICE ----------- 14.5</screen>
ru: Результат: <screen> AVG_PRICE ----------- 14.5</screen>

source: If we want to know how many parts are defined in table PART we use the statement: <placeholder-1/> and get: <screen> COUNT ------- 4</screen>
ru: Если мы хотим узнать, сколько деталей учтено в таблице PART, воспользуемся этим оператором: <placeholder-1/> и получим: <screen> COUNT ------- 4</screen>

source: <acronym>SQL</acronym> provides aggregate functions such as AVG, COUNT, SUM, MIN, and MAX. The argument(s) of an aggregate function are evaluated at each row that satisfies the WHERE clause, and the aggregate function is calculated over this set of input values. Normally, an aggregate delivers a single result for a whole <command>SELECT</command> statement. But if grouping is specified in the query, then a separate calculation is done over the rows of each group, and an aggregate result is delivered per group (see next section). <placeholder-1/>
ru: В <acronym>SQL</acronym> имеются агрегатные функции, такие как AVG, COUNT, SUM, MIN и MAX. Агрегатная функция вычисляется по набору входных значений, получаемых для каждой строки, удовлетворяющей предложению WHERE. Обычно агрегатная функция выдаёт единственный результат для всего оператора <command>SELECT</command>. Но если в запросе устанавливается группировка, по строкам в каждой группе выполняется отдельное вычисление и агрегатные результаты выдаются для каждой группы (см. следующий раздел). <placeholder-1/>

source: Aggregation by Groups
ru: Агрегирование по группам

source: <acronym>SQL</acronym> allows one to partition the tuples of a table into groups. Then the aggregate functions described above can be applied to the groups &mdash; i.e., the value of the aggregate function is no longer calculated over all the values of the specified column but over all values of a group. Thus the aggregate function is evaluated separately for every group.
ru: <acronym>SQL</acronym> позволяет разбивать кортежи таблицы на группы. Затем к группам можно применить описанные выше агрегатные функции &mdash; т. е. значение агрегатной функции будет вычисляться не по всем значениям определённого столбца, а по всем значениям группы. Таким образом, агрегатная функция вычисляется отдельно для каждой группы.

source: If we want to know how many parts are sold by every supplier we formulate the query: <placeholder-1/> and get: <screen> SNO | SNAME | COUNT -----+-------+------- 1 | Smith | 2 2 | Jones | 1 3 | Adams | 2 4 | Blake | 3</screen>
ru: Если мы хотим узнать, сколько деталей было продано каждым поставщиком, мы формулируем запрос: <placeholder-1/> и получаем: <screen> SNO | SNAME | COUNT -----+-------+------- 1 | Smith | 2 2 | Jones | 1 3 | Adams | 2 4 | Blake | 3</screen>

source: Now let's have a look of what is happening here. First the join of the tables SUPPLIER and SELLS is derived: <screen> S.SNO | S.SNAME | SE.PNO -------+---------+-------- 1 | Smith | 1 1 | Smith | 2 2 | Jones | 4 3 | Adams | 1 3 | Adams | 3 4 | Blake | 2 4 | Blake | 3 4 | Blake | 4</screen>
ru: Теперь давайте посмотрим, что здесь происходит. Сначала образуется соединение таблиц SUPPLIER и SELLS: <screen> S.SNO | S.SNAME | SE.PNO -------+---------+-------- 1 | Smith | 1 1 | Smith | 2 2 | Jones | 4 3 | Adams | 1 3 | Adams | 3 4 | Blake | 2 4 | Blake | 3 4 | Blake | 4</screen>

source: Next we partition the tuples into groups by putting all tuples together that agree on both attributes S.SNO and S.SNAME: <screen> S.SNO | S.SNAME | SE.PNO -------+---------+-------- 1 | Smith | 1 | 2 -------------------------- 2 | Jones | 4 -------------------------- 3 | Adams | 1 | 3 -------------------------- 4 | Blake | 2 | 3 | 4</screen>
ru: Затем мы разбиваем кортежи на группы, собирая вместе все кортежи, имеющие общие атрибуты S.SNO и S.SNAME: <screen> S.SNO | S.SNAME | SE.PNO -------+---------+-------- 1 | Smith | 1 | 2 -------------------------- 2 | Jones | 4 -------------------------- 3 | Adams | 1 | 3 -------------------------- 4 | Blake | 2 | 3 | 4</screen>

source: In our example we got four groups and now we can apply the aggregate function COUNT to every group leading to the final result of the query given above.
ru: В данном примере мы получаем четыре группы и теперь можем применить агрегатную функцию COUNT к каждой группе, чтобы в результате получить окончательный результат данного выше запроса.

source: The partitioning of the tuples into groups is done by using the keywords <command>GROUP BY</command> followed by a list of attributes that define the groups. If we have <command>GROUP BY A<subscript>1</subscript>, &tdot;, A<subscript>k</subscript></command> we partition the relation into groups, such that two tuples are in the same group if and only if they agree on all the attributes A<subscript>1</subscript>, &tdot;, A<subscript>k</subscript>. <placeholder-1/>
ru: Разбиение кортежей на группы осуществляется ключевым словом <command>GROUP BY</command>, за которым следует список атрибутов, определяющих группы. Написав <command>GROUP BY A<subscript>1</subscript>, &tdot;, A<subscript>k</subscript></command>, мы разделяем отношение на группы так, что два кортежа оказываются в одной группе, если и только если они имеют одинаковые значения всех атрибутов A<subscript>1</subscript>, &tdot;, A<subscript>k</subscript>. <placeholder-1/>

source: Note that for a query using GROUP BY and aggregate functions to make sense, the target list can only refer directly to the attributes being grouped by. Other attributes can only be used inside the arguments of aggregate functions. Otherwise there would not be a unique value to associate with the other attributes.
ru: Заметьте, чтобы применение GROUP BY и агрегатных функций в запросе имело смысл, в целевом списке должны указываться только непосредственно группируемые атрибуты. Другие атрибуты можно использовать только в аргументах агрегатных функций. В противном случае не будут получены уникальные значения, которые нужно связывать с другими атрибутами.

source: Also observe that it makes no sense to ask for an aggregate of an aggregate, e.g., AVG(MAX(sno)), because a <command>SELECT</command> only does one pass of grouping and aggregation. You can get a result of this kind by using a temporary table or a sub-SELECT in the FROM clause to do the first level of aggregation.
ru: Также заметьте, что не имеет смысла применять агрегатную функцию к агрегатной функции, например, AVG(MAX(sno)), так как <command>SELECT</command> делает только один проход для группирования и агрегирования. Получить подобный результат можно, осуществив первый уровень агрегирования с использованием временной таблицы или вложенного SELECT в предложении FROM.
