Repository: pluzanov/pg-doc-ru
Catalog: 9.6/start.po
Languages: ru

source: Getting Started
ru: Начало

source: Installation
ru: Установка

source: Before you can use <productname>PostgreSQL</productname> you need to install it, of course. It is possible that <productname>PostgreSQL</productname> is already installed at your site, either because it was included in your operating system distribution or because the system administrator already installed it. If that is the case, you should obtain information from the operating system documentation or your system administrator about how to access <productname>PostgreSQL</productname>.
ru: Прежде чем вы сможете использовать <productname>PostgreSQL</productname>, вы конечно должны его установить. Однако возможно, что <productname>PostgreSQL</productname> уже установлен у вас, либо потому что он включён в вашу операционную систему, либо его установил системный администратор. Если это так, обратитесь к документации по операционной системе или к вашему администратору и узнайте, как получить доступ к <productname>PostgreSQL</productname>.

source: If you are not sure whether <productname>PostgreSQL</productname> is already available or whether you can use it for your experimentation then you can install it yourself. Doing so is not hard and it can be a good exercise. <productname>PostgreSQL</productname> can be installed by any unprivileged user; no superuser (<systemitem>root</systemitem>) access is required.
ru: Если же вы не знаете, установлен ли <productname>PostgreSQL</productname> или можно ли использовать его для экспериментов, тогда просто установите его сами. Сделать это несложно и это будет хорошим упражнением. <productname>PostgreSQL</productname> может установить любой обычный пользователь; права суперпользователя (<systemitem>root</systemitem>) не требуются.

source: If you are installing <productname>PostgreSQL</productname> yourself, then refer to <xref linkend="installation"/> for instructions on installation, and return to this guide when the installation is complete. Be sure to follow closely the section about setting up the appropriate environment variables.
ru: Если вы устанавливаете <productname>PostgreSQL</productname> самостоятельно, обратитесь к <xref remap="3" linkend="installation"/> за инструкциями по установке, а закончив установку, вернитесь к этому введению. Обязательно прочитайте и выполните указания по установке соответствующих переменных окружения.

source: If your site administrator has not set things up in the default way, you might have some more work to do. For example, if the database server machine is a remote machine, you will need to set the <envar>PGHOST</envar> environment variable to the name of the database server machine. The environment variable <envar>PGPORT</envar> might also have to be set. The bottom line is this: if you try to start an application program and it complains that it cannot connect to the database, you should consult your site administrator or, if that is you, the documentation to make sure that your environment is properly set up. If you did not understand the preceding paragraph then read the next section.
ru: Если ваш администратор выполнил установку не с параметрами по умолчанию, вам может потребоваться проделать дополнительную работу. Например, если сервер баз данных установлен на удалённом компьютере, вам нужно будет указать в переменной окружения <envar>PGHOST</envar> имя этого компьютера. Вероятно, также придётся установить переменную окружения <envar>PGPORT</envar>. То есть, если вы пытаетесь запустить клиентское приложение и оно сообщает, что не может подключиться к базе данных, вы должны обратиться к вашему администратору. Если это вы сами, вам следует обратиться к документации и убедиться в правильности настройки окружения. Если вы не поняли, о чём здесь идёт речь, перейдите к следующему разделу.

source: Architectural Fundamentals
ru: Основы архитектуры

source: Before we proceed, you should understand the basic <productname>PostgreSQL</productname> system architecture. Understanding how the parts of <productname>PostgreSQL</productname> interact will make this chapter somewhat clearer.
ru: Прежде чем продолжить, вы должны разобраться в основах архитектуры системы <productname>PostgreSQL</productname>. Составив картину взаимодействия частей <productname>PostgreSQL</productname>, вы сможете лучше понять материал этой главы.

source: A server process, which manages the database files, accepts connections to the database from client applications, and performs database actions on behalf of the clients. The database server program is called <filename>postgres</filename>. <placeholder-1/>
ru: Главный серверный процесс, управляющий файлами баз данных, принимающий подключения клиентских приложений и выполняющий различные запросы клиентов к базам данных. Эта программа сервера БД называется <filename>postgres</filename>. <placeholder-1/>

source: The user's client (frontend) application that wants to perform database operations. Client applications can be very diverse in nature: a client could be a text-oriented tool, a graphical application, a web server that accesses the database to display web pages, or a specialized database maintenance tool. Some client applications are supplied with the <productname>PostgreSQL</productname> distribution; most are developed by users.
ru: Клиентское приложение пользователя, желающее выполнять операции в базе данных. Клиентские приложения могут быть очень разнообразными: это может быть текстовая утилита, графическое приложение, веб-сервер, использующий базу данных для отображения веб-страниц, или специализированный инструмент для обслуживания БД. Некоторые клиентские приложения поставляются в составе дистрибутива <productname>PostgreSQL</productname>, однако большинство создают сторонние разработчики.

source: In database jargon, <productname>PostgreSQL</productname> uses a client/server model. A <productname>PostgreSQL</productname> session consists of the following cooperating processes (programs): <placeholder-1/>
ru: Говоря техническим языком, <productname>PostgreSQL</productname> реализован в архитектуре клиент-сервер. Рабочий сеанс <productname>PostgreSQL</productname> включает следующие взаимодействующие процессы (программы): <placeholder-1/>

source: As is typical of client/server applications, the client and the server can be on different hosts. In that case they communicate over a TCP/IP network connection. You should keep this in mind, because the files that can be accessed on a client machine might not be accessible (or might only be accessible using a different file name) on the database server machine.
ru: Как и в других типичных клиент-серверных приложениях, клиент и сервер могут располагаться на разных компьютерах. В этом случае они взаимодействует по сети TCP/IP. Важно не забывать это и понимать, что файлы, доступные на клиентском компьютере, могут быть недоступны (или доступны только под другим именем) на компьютере-сервере.

source: The <productname>PostgreSQL</productname> server can handle multiple concurrent connections from clients. To achieve this it starts (<quote>forks</quote>) a new process for each connection. From that point on, the client and the new server process communicate without intervention by the original <filename>postgres</filename> process. Thus, the master server process is always running, waiting for client connections, whereas client and associated server processes come and go. (All of this is of course invisible to the user. We only mention it here for completeness.)
ru: Сервер <productname>PostgreSQL</productname> может обслуживать одновременно несколько подключений клиентов. Для этого он запускает (<quote>порождает</quote>) отдельный процесс для каждого подключения. Можно сказать, что клиент и серверный процесс общаются, не затрагивая главный процесс <filename>postgres</filename>. Таким образом, главный серверный процесс всегда работает и ожидает подключения клиентов, принимая которые, он организует взаимодействие клиента и отдельного серверного процесса. (Конечно всё это происходит незаметно для пользователя, а эта схема рассматривается здесь только для понимания.)

source: Creating a Database
ru: Создание базы данных

source: <primary>database</primary><secondary>creating</secondary>
ru: <primary>база данных</primary><secondary>создание</secondary>

source: The first test to see whether you can access the database server is to try to create a database. A running <productname>PostgreSQL</productname> server can manage many databases. Typically, a separate database is used for each project or for each user.
ru: Первое, как можно проверить, есть ли у вас доступ к серверу баз данных, &mdash; это попытаться создать базу данных. Работающий сервер <productname>PostgreSQL</productname> может управлять множеством баз данных, что позволяет создавать отдельные базы данных для разных проектов и пользователей.

source: Possibly, your site administrator has already created a database for your use. In that case you can omit this step and skip ahead to the next section.
ru: Возможно, ваш администратор уже создал базу данных для вас. В этом случае вы можете пропустить этот этап и перейти к следующему разделу.

source: To create a new database, in this example named <literal>mydb</literal>, you use the following command: <screen><prompt>$</prompt> <userinput>createdb mydb</userinput></screen> If this produces no response then this step was successful and you can skip over the remainder of this section.
ru: Для создания базы данных, в этом примере названной <literal>mydb</literal>, выполните следующую команду: <screen><prompt>$</prompt> <userinput>createdb mydb</userinput></screen> Если вы не увидите никаких сообщений, значит операция была выполнена успешно и продолжение этого раздела можно пропустить.

source: If you see a message similar to: <screen>createdb: command not found</screen> then <productname>PostgreSQL</productname> was not installed properly. Either it was not installed at all or your shell's search path was not set to include it. Try calling the command with an absolute path instead: <screen><prompt>$</prompt> <userinput>/usr/local/pgsql/bin/createdb mydb</userinput></screen> The path at your site might be different. Contact your site administrator or check the installation instructions to correct the situation.
ru: Если вы видите сообщение типа: <screen>createdb: command not found</screen>значит <productname>PostgreSQL</productname> не был установлен правильно. Либо он не установлен вообще, либо в путь поиска команд оболочки не включён его каталог. Попробуйте вызвать ту же команду, указав абсолютный путь: <screen><prompt>$</prompt> <userinput>/usr/local/pgsql/bin/createdb mydb</userinput></screen> У вас этот путь может быть другим. Свяжитесь с вашим администратором или проверьте, как были выполнены инструкции по установке, чтобы исправить ситуацию.

source: Another response could be this: <screen>createdb: could not connect to database postgres: could not connect to server: No such file or directory Is the server running locally and accepting connections on Unix domain socket "/tmp/.s.PGSQL.5432"?</screen> This means that the server was not started, or it was not started where <command>createdb</command> expected it. Again, check the installation instructions or consult the administrator.
ru: Ещё один возможный ответ: <screen>createdb: не удалось подключиться к базе postgres: не удалось подключиться к серверу: No such file or directory Он действительно работает локально и принимает соединения через доменный сокет "/tmp/.s.PGSQL.5432"?</screen> Это означает, что сервер не работает или <command>createdb</command> не может к нему подключиться. И в этом случае пересмотрите инструкции по установке или обратитесь к администратору.

source: Another response could be this: <screen>createdb: could not connect to database postgres: FATAL: role "joe" does not exist</screen> where your own login name is mentioned. This will happen if the administrator has not created a <productname>PostgreSQL</productname> user account for you. (<productname>PostgreSQL</productname> user accounts are distinct from operating system user accounts.) If you are the administrator, see <xref linkend="user-manag"/> for help creating accounts. You will need to become the operating system user under which <productname>PostgreSQL</productname> was installed (usually <literal>postgres</literal>) to create the first user account. It could also be that you were assigned a <productname>PostgreSQL</productname> user name that is different from your operating system user name; in that case you need to use the <option>-U</option> switch or set the <envar>PGUSER</envar> environment variable to specify your <productname>PostgreSQL</productname> user name.
ru: Также вы можете получить сообщение: <screen>createdb: не удалось подключиться к базе postgres: ВАЖНО: роль "joe" не существует</screen>где фигурирует ваше имя пользователя. Это говорит о том, что администратор не создал учётную запись <productname>PostgreSQL</productname> для вас. (Учётные записи <productname>PostgreSQL</productname> отличаются от учётных записей пользователей операционной системы.) Если вы сами являетесь администратором, прочитайте <xref remap="4" linkend="user-manag"/>, где написано, как создавать учётные записи. Для создания нового пользователя вы должны стать пользователем операционной системы, под именем которого был установлен <productname>PostgreSQL</productname> (обычно это <literal>postgres</literal>). Также возможно, что вам назначено имя пользователя <productname>PostgreSQL</productname>, не совпадающее с вашим именем в ОС; в этом случае вам нужно явно указать ваше имя пользователя <productname>PostgreSQL</productname>, используя ключ <option>-U</option> или установив переменную окружения <envar>PGUSER</envar>.

source: As an explanation for why this works: <productname>PostgreSQL</productname> user names are separate from operating system user accounts. When you connect to a database, you can choose what <productname>PostgreSQL</productname> user name to connect as; if you don't, it will default to the same name as your current operating system account. As it happens, there will always be a <productname>PostgreSQL</productname> user account that has the same name as the operating system user that started the server, and it also happens that that user always has permission to create databases. Instead of logging in as that user you can also specify the <option>-U</option> option everywhere to select a <productname>PostgreSQL</productname> user name to connect as.
ru: Объяснить это поведение можно так: Учётные записи пользователей <productname>PostgreSQL</productname> отличаются от учётных записей операционной системы. При подключении к базе данных вы можете указать, с каким именем пользователя <productname>PostgreSQL</productname> нужно подключаться. По умолчанию же используется имя, с которым вы зарегистрированы в операционной системе. При этом получается, что в <productname>PostgreSQL</productname> всегда есть учётная запись с именем, совпадающим с именем системного пользователя, запускающего сервер, и к тому же этот пользователь всегда имеет права на создание баз данных. И чтобы подключиться с именем этого пользователя <productname>PostgreSQL</productname>, необязательно входить с этим именем в систему, достаточно везде передавать его с параметром <option>-U</option>.

source: If you have a user account but it does not have the privileges required to create a database, you will see the following: <screen>createdb: database creation failed: ERROR: permission denied to create database</screen> Not every user has authorization to create new databases. If <productname>PostgreSQL</productname> refuses to create databases for you then the site administrator needs to grant you permission to create databases. Consult your site administrator if this occurs. If you installed <productname>PostgreSQL</productname> yourself then you should log in for the purposes of this tutorial under the user account that you started the server as. <placeholder-1/>
ru: Если у вас есть учётная запись пользователя, но нет прав на создание базы данных, вы увидите сообщение: <screen>createdb: создать базу данных не удалось: ОШИБКА: нет прав на создание базы данных</screen> Создавать базы данных разрешено не всем пользователям. Если <productname>PostgreSQL</productname> отказывается создавать базы данных для вас, значит вам необходимо соответствующее разрешение. В этом случае обратитесь к вашему администратору. Если вы устанавливали <productname>PostgreSQL</productname> сами, то для целей этого введения вы должны войти в систему с именем пользователя, запускающего сервер БД. <placeholder-1/>

source: You can also create databases with other names. <productname>PostgreSQL</productname> allows you to create any number of databases at a given site. Database names must have an alphabetic first character and are limited to 63 bytes in length. A convenient choice is to create a database with the same name as your current user name. Many tools assume that database name as the default, so it can save you some typing. To create that database, simply type: <screen><prompt>$</prompt> <userinput>createdb</userinput></screen>
ru: Вы также можете создавать базы данных с другими именами. <productname>PostgreSQL</productname> позволяет создавать сколько угодно баз данных. Имена баз данных должны начинаться с буквы и быть не длиннее 63 символов. В качестве имени базы данных удобно использовать ваше текущее имя пользователя. Многие утилиты предполагают такое имя по умолчанию, так что вы сможете упростить ввод команд. Чтобы создать базу данных с таким именем, просто введите: <screen><prompt>$</prompt> <userinput>createdb</userinput></screen>

source: If you do not want to use your database anymore you can remove it. For example, if you are the owner (creator) of the database <literal>mydb</literal>, you can destroy it using the following command: <screen><prompt>$</prompt> <userinput>dropdb mydb</userinput></screen> (For this command, the database name does not default to the user account name. You always need to specify it.) This action physically removes all files associated with the database and cannot be undone, so this should only be done with a great deal of forethought.
ru: Если вы больше не хотите использовать вашу базу данных, вы можете удалить её. Например, если вы владелец (создатель) базы данных <literal>mydb</literal>, вы можете уничтожить её, выполнив следующую команду: <screen><prompt>$</prompt> <userinput>dropdb mydb</userinput></screen> (Эта команда не считает именем БД по умолчанию имя текущего пользователя, вы должны явно указать его.) В результате будут физически удалены все файлы, связанные с базой данных, и так как отменить это действие нельзя, не выполняйте его, не подумав о последствиях.

source: More about <command>createdb</command> and <command>dropdb</command> can be found in <xref linkend="app-createdb"/> and <xref linkend="app-dropdb"/> respectively.
ru: Узнать о командах <command>createdb</command> и <command>dropdb</command> больше можно в справке <xref linkend="app-createdb"/> и <xref linkend="app-dropdb"/>.

source: Accessing a Database
ru: Подключение к базе данных

source: Running the <productname>PostgreSQL</productname> interactive terminal program, called <application><firstterm>psql</firstterm></application>, which allows you to interactively enter, edit, and execute <acronym>SQL</acronym> commands.
ru: Запустив терминальную программу <productname>PostgreSQL</productname> под названием <application><firstterm>psql</firstterm></application>, в которой можно интерактивно вводить, редактировать и выполнять команды <acronym>SQL</acronym>.

source: Using an existing graphical frontend tool like <application>pgAdmin</application> or an office suite with <acronym>ODBC</acronym> or <acronym>JDBC</acronym> support to create and manipulate a database. These possibilities are not covered in this tutorial.
ru: Используя существующие графические инструменты, например, <application>pgAdmin</application> или офисный пакет с поддержкой <acronym>ODBC</acronym> или <acronym>JDBC</acronym>, позволяющий создавать и управлять базой данных. Эти возможности здесь не рассматриваются.

source: Writing a custom application, using one of the several available language bindings. These possibilities are discussed further in <xref linkend="client-interfaces"/>.
ru: Написав собственное приложение, используя один из множества доступных языковых интерфейсов. Подробнее это рассматривается в <xref remap="6" linkend="client-interfaces"/>.

source: Once you have created a database, you can access it by: <placeholder-1/> You probably want to start up <command>psql</command> to try the examples in this tutorial. It can be activated for the <literal>mydb</literal> database by typing the command: <screen><prompt>$</prompt> <userinput>psql mydb</userinput></screen> If you do not supply the database name then it will default to your user account name. You already discovered this scheme in the previous section using <command>createdb</command>.
ru: Создав базу данных, вы можете обратиться к ней: <placeholder-1/> Чтобы работать с примерами этого введения, начните с <command>psql</command>. Подключиться с его помощью к базе данных <literal>mydb</literal> можно, введя команду: <screen><prompt>$</prompt> <userinput>psql mydb</userinput></screen> Если имя базы данных не указать, она будет выбрана по имени пользователя. Об этом уже рассказывалось в предыдущем разделе, посвящённом команде <command>createdb</command>.

source: <primary>superuser</primary>
ru: <primary>суперпользователь</primary>

source: In <command>psql</command>, you will be greeted with the following message: <screen>psql (&version;) Type "help" for help. mydb=&gt;</screen> <placeholder-1/> The last line could also be: <screen>mydb=#</screen> That would mean you are a database superuser, which is most likely the case if you installed the <productname>PostgreSQL</productname> instance yourself. Being a superuser means that you are not subject to access controls. For the purposes of this tutorial that is not important.
ru: В <command>psql</command> вы увидите следующее сообщение: <screen>psql (&version;) Type "help" for help. mydb=&gt;</screen> <placeholder-1/> Последняя строка может выглядеть и так: <screen>mydb=#</screen> Что показывает, что вы являетесь суперпользователем, и так скорее всего будет, если вы устанавливали экземпляр <productname>PostgreSQL</productname> сами. В этом случае на вас не будут распространяться никакие ограничения доступа, но для целей данного введения это не важно.

source: If you encounter problems starting <command>psql</command> then go back to the previous section. The diagnostics of <command>createdb</command> and <command>psql</command> are similar, and if the former worked the latter should work as well.
ru: Если вы столкнулись с проблемами при запуске <command>psql</command>, вернитесь к предыдущему разделу. Команды <command>createdb</command> и <command>psql</command> подключаются к серверу одинаково, так что если первая работает, должна работать и вторая.

source: <primary>version</primary>
ru: <primary>версия</primary>
