Repository: pluzanov/pg-doc-ru
Catalog: 9.6/start.po
Languages: ru

source: The last line printed out by <command>psql</command> is the prompt, and it indicates that <command>psql</command> is listening to you and that you can type <acronym>SQL</acronym> queries into a work space maintained by <command>psql</command>. Try out these commands: <placeholder-1/> <screen><prompt>mydb=&gt;</prompt> <userinput>SELECT version();</userinput> version ------------------------------------------------------------------------------------------ PostgreSQL &version; on x86_64-pc-linux-gnu, compiled by gcc (Debian 4.9.2-10) 4.9.2, 64-bit (1 row) <prompt>mydb=&gt;</prompt> <userinput>SELECT current_date;</userinput> date ------------ 2016-01-07 (1 row) <prompt>mydb=&gt;</prompt> <userinput>SELECT 2 + 2;</userinput> ?column? ---------- 4 (1 row)</screen>
ru: Последняя строка в выводе <command>psql</command> &mdash; это приглашение, которое показывает, что <command>psql</command> ждёт ваших команд и вы можете вводить <acronym>SQL</acronym>-запросы в рабочей среде <command>psql</command>. Попробуйте эти команды: <placeholder-1/> <screen><prompt>mydb=&gt;</prompt> <userinput>SELECT version();</userinput> version ------------------------------------------------------------------------------------------ PostgreSQL &version; on x86_64-pc-linux-gnu, compiled by gcc (Debian 4.9.2-10) 4.9.2, 64-bit (1 row) <prompt>mydb=&gt;</prompt> <userinput>SELECT current_date;</userinput> date ------------ 2016-01-07 (1 row) <prompt>mydb=&gt;</prompt> <userinput>SELECT 2 + 2;</userinput> ?column? ---------- 4 (1 row)</screen>

source: The <command>psql</command> program has a number of internal commands that are not SQL commands. They begin with the backslash character, <quote><literal>\</literal></quote>. For example, you can get help on the syntax of various <productname>PostgreSQL</productname> <acronym>SQL</acronym> commands by typing: <screen><prompt>mydb=&gt;</prompt> <userinput>\h</userinput></screen>
ru: В программе <command>psql</command> есть множество внутренних команд, которые не являются SQL-операторами. Они начинаются с обратной косой черты, <quote><literal>\</literal></quote>. Например, вы можете получить справку по различным <acronym>SQL</acronym>-командам <productname>PostgreSQL</productname>, введя: <screen><prompt>mydb=&gt;</prompt> <userinput>\h</userinput></screen>

source: To get out of <command>psql</command>, type: <screen><prompt>mydb=&gt;</prompt> <userinput>\q</userinput></screen> and <command>psql</command> will quit and return you to your command shell. (For more internal commands, type <literal>\?</literal> at the <command>psql</command> prompt.) The full capabilities of <command>psql</command> are documented in <xref linkend="app-psql"/>. In this tutorial we will not use these features explicitly, but you can use them yourself when it is helpful.
ru: Чтобы выйти из <command>psql</command>, введите: <screen><prompt>mydb=&gt;</prompt> <userinput>\q</userinput></screen> и <command>psql</command> завершит свою работу, а вы вернётесь в командную оболочку операционной системы. (Чтобы узнать о внутренних командах, введите <literal>\?</literal> в приглашении командной строки <command>psql</command>.) Все возможности <command>psql</command> документированы в справке <xref remap="6" linkend="app-psql"/>. В этом руководстве мы не будем использовать эти возможности явно, но вы можете изучить их и применять при удобном случае.
