Repository: pluzanov/pg-doc-ru
Catalog: 9.6/tablesample-method.po
Languages: ru

source: Writing A Table Sampling Method
ru: Написание метода извлечения выборки таблицы

source: <primary>table sampling method</primary>
ru: <primary>метод извлечения выборки таблицы</primary>

source: <primary><literal>TABLESAMPLE</literal> method</primary>
ru: <primary>метод <literal>TABLESAMPLE</literal></primary>

source: <productname>PostgreSQL</productname>'s implementation of the <literal>TABLESAMPLE</literal> clause supports custom table sampling methods, in addition to the <literal>BERNOULLI</literal> and <literal>SYSTEM</literal> methods that are required by the SQL standard. The sampling method determines which rows of the table will be selected when the <literal>TABLESAMPLE</literal> clause is used.
ru: Реализация предложения <literal>TABLESAMPLE</literal> в <productname>PostgreSQL</productname> поддерживает подключение собственных методов извлечения выборки таблицы, в дополнение к методам <literal>BERNOULLI</literal> и <literal>SYSTEM</literal>, которые требуются стандартом SQL. Метод выборки определяет, какие строки таблицы будут выбираться, когда используется предложение <literal>TABLESAMPLE</literal>.

source: At the SQL level, a table sampling method is represented by a single SQL function, typically implemented in C, having the signature <placeholder-1/> The name of the function is the same method name appearing in the <literal>TABLESAMPLE</literal> clause. The <type>internal</type> argument is a dummy (always having value zero) that simply serves to prevent this function from being called directly from a SQL command. The result of the function must be a palloc'd struct of type <type>TsmRoutine</type>, which contains pointers to support functions for the sampling method. These support functions are plain C functions and are not visible or callable at the SQL level. The support functions are described in <xref linkend="tablesample-support-functions"/>.
ru: На уровне SQL метод извлечения выборки таблицы представляется одной функцией SQL, обычно реализуемой на C, имеющей сигнатуру <placeholder-1/> Имя функции будет совпадать с именем метода, указываемым в предложении <literal>TABLESAMPLE</literal>. Аргумент <type>internal</type> является фиктивным (в нём всегда передаётся ноль) и введён только для того, чтобы эту функцию нельзя было вызывать напрямую из команд SQL. Возвращать эта функция должна структуру типа <type>TsmRoutine</type> (выделенную вызовом palloc), содержащую указатели на опорные функции для метода извлечения выборки. Эти опорные функции представляют собой простые функции на C, которые не видны и не могут вызываться на уровне SQL. Эти опорные функции описаны в <xref remap="6" linkend="tablesample-support-functions"/>.

source: In addition to function pointers, the <type>TsmRoutine</type> struct must provide these additional fields:
ru: В дополнение к указателям на функции в структуре <type>TsmRoutine</type> должны задаваться следующие дополнительные поля:

source: This is an OID list containing the data type OIDs of the parameter(s) that will be accepted by the <literal>TABLESAMPLE</literal> clause when this sampling method is used. For example, for the built-in methods, this list contains a single item with value <literal>FLOAT4OID</literal>, which represents the sampling percentage. Custom sampling methods can have more or different parameters.
ru: Это список OID, содержащий OID типов данных параметров, которые будут приниматься предложением <literal>TABLESAMPLE</literal> при использовании этого метода извлечения выборки. Например, для встроенных методов этот список содержит один элемент со значением <literal>FLOAT4OID</literal>, представляющий процент выборки. Другие методы могут иметь дополнительные или иные параметры.

source: If <literal>true</literal>, the sampling method can deliver identical samples across successive queries, if the same parameters and <literal>REPEATABLE</literal> seed value are supplied each time and the table contents have not changed. When this is <literal>false</literal>, the <literal>REPEATABLE</literal> clause is not accepted for use with the sampling method.
ru: Если это поле равно <literal>true</literal>, данный метод извлечения выборки может выдавать одинаковые выборки при последовательных запросах с одними и теми же параметрами и значением затравки <literal>REPEATABLE</literal> при условии неизменности содержимого таблицы. Если равно <literal>false</literal>, предложение <literal>REPEATABLE</literal> не будет приниматься с этим методом извлечения выборки.

source: If <literal>true</literal>, the sampling method can deliver identical samples across successive scans in the same query (assuming unchanging parameters, seed value, and snapshot). When this is <literal>false</literal>, the planner will not select plans that would require scanning the sampled table more than once, since that might result in inconsistent query output.
ru: Если это поле равно <literal>true</literal>, метод извлечения выборки может выдавать одинаковые выборки при последовательном сканировании в рамках одного запроса (предполагается неизменность параметров, значения затравки и снимка данных). Если равно <literal>false</literal>, планировщик не будет выбирать планы, требующие неоднократного сканирования выборки, так как это может привести к несогласованному результату запроса.

source: The <type>TsmRoutine</type> struct type is declared in <filename>src/include/access/tsmapi.h</filename>, which see for additional details.
ru: Тип структуры <type>TsmRoutine</type> объявлен в <filename>src/include/access/tsmapi.h</filename>, где можно найти дополнительную информацию.

source: The table sampling methods included in the standard distribution are good references when trying to write your own. Look into the <filename>src/backend/access/tablesample</filename> subdirectory of the source tree for the built-in sampling methods, and into the <filename>contrib</filename> subdirectory for add-on methods.
ru: Методы извлечения выборки, включённые в стандартный дистрибутив, могут послужить хорошим примером, если вы хотите написать свой метод. Код встроенных методов вы можете найти в подкаталоге <filename>src/backend/access/tablesample</filename> дерева исходного кода, а код дополнительных методов — в подкаталоге <filename>contrib</filename>.

source: Sampling Method Support Functions
ru: Опорные функции метода извлечения выборки

source: The TSM handler function returns a palloc'd <type>TsmRoutine</type> struct containing pointers to the support functions described below. Most of the functions are required, but some are optional, and those pointers can be NULL.
ru: Функция-обработчик TSM возвращает структуру <type>TsmRoutine</type> (выделенную вызовом palloc) с указателями на опорные функции, описанные ниже. Большинство этих функций обязательные, но некоторые — нет, и их указатели могут быть равны NULL.

source: <placeholder-1/> This function is called during planning. It must estimate the number of relation pages that will be read during a sample scan, and the number of tuples that will be selected by the scan. (For example, these might be determined by estimating the sampling fraction, and then multiplying the <literal>baserel-&gt;pages</literal> and <literal>baserel-&gt;tuples</literal> numbers by that, being sure to round the results to integral values.) The <literal>paramexprs</literal> list holds the expression(s) that are parameters to the <literal>TABLESAMPLE</literal> clause. It is recommended to use <function>estimate_expression_value()</function> to try to reduce these expressions to constants, if their values are needed for estimation purposes; but the function must provide size estimates even if they cannot be reduced, and it should not fail even if the values appear invalid (remember that they're only estimates of what the run-time values will be). The <literal>pages</literal> and <literal>tuples</literal> parameters are outputs.
ru: <placeholder-1/> Эта функция вызывается во время планирования. Она должна рассчитать число страниц отношения, которые будут прочитаны при простом сканировании, и число кортежей, выбираемых при сканировании. (Например, эти числа можно получить, оценив процент выбираемых данных, а затем умножив <literal>baserel-&gt;pages</literal> и <literal>baserel-&gt;tuples</literal> на это значение и округлив результат до целых.) Список <literal>paramexprs</literal> содержит выражения, переданные в параметрах предложению <literal>TABLESAMPLE</literal>. Если для целей оценивания нужны их значения, рекомендуется воспользоваться <function>estimate_expression_value()</function>, чтобы попытаться свести эти выражения к константам; но данная функция должна выдавать оценку размера, даже если это не удастся, и не должна выдавать ошибку, даже если считает переданные значения неверными (помните, что это только приблизительные оценки чисел, которые будут получены во время выполнения). Параметры <literal>pages</literal> и <literal>tuples</literal> являются выходными.

source: <placeholder-1/> Initialize for execution of a SampleScan plan node. This is called during executor startup. It should perform any initialization needed before processing can start. The <structname>SampleScanState</structname> node has already been created, but its <structfield>tsm_state</structfield> field is NULL. The <function>InitSampleScan</function> function can palloc whatever internal state data is needed by the sampling method, and store a pointer to it in <literal>node-&gt;tsm_state</literal>. Information about the table to scan is accessible through other fields of the <structname>SampleScanState</structname> node (but note that the <literal>node-&gt;ss.ss_currentScanDesc</literal> scan descriptor is not set up yet). <literal>eflags</literal> contains flag bits describing the executor's operating mode for this plan node.
ru: <placeholder-1/> Выполняет инициализацию перед выполнением узла плана SampleScan. Эта функция вызывается при запуске исполнителя. Она должна выполнить все подготовительные действия, необходимые для начала обработки. Узел <structname>SampleScanState</structname> уже был создан, но его поле <structfield>tsm_state</structfield> содержит NULL. Функция <function>InitSampleScan</function> может выделить через palloc область для любых внутренних данных, нужных методу извлечения выборки, и сохранить указатель на неё в <literal>node-&gt;tsm_state</literal>. Информацию о сканируемой таблице можно получить через другие поля узла <structname>SampleScanState</structname> (но заметьте, что дескриптор сканирования <literal>node-&gt;ss.ss_currentScanDesc</literal> ещё не настроен). Параметр <literal>eflags</literal> содержит битовые флаги, описывающие режим работы исполнителя для этого узла плана.

source: When <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> is true, the scan will not actually be performed, so this function should only do the minimum required to make the node state valid for <command>EXPLAIN</command> and <function>EndSampleScan</function>.
ru: Когда <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> не равно нулю, собственно сканирование не будет выполняться, поэтому эта функция должна сделать только то, что необходимо для получения состояния узла, подходящего для <command>EXPLAIN</command> и <function>EndSampleScan</function>.

source: This function can be omitted (set the pointer to NULL), in which case <function>BeginSampleScan</function> must perform all initialization needed by the sampling method.
ru: Эту функцию можно опустить (присвоить указателю NULL), тогда вся инициализация, необходимая для метода извлечения выборки, должна иметь место в <function>BeginSampleScan</function>.

source: <placeholder-1/> Begin execution of a sampling scan. This is called just before the first attempt to fetch a tuple, and may be called again if the scan needs to be restarted. Information about the table to scan is accessible through fields of the <structname>SampleScanState</structname> node (but note that the <literal>node-&gt;ss.ss_currentScanDesc</literal> scan descriptor is not set up yet). The <literal>params</literal> array, of length <literal>nparams</literal>, contains the values of the parameters supplied in the <literal>TABLESAMPLE</literal> clause. These will have the number and types specified in the sampling method's <literal>parameterTypes</literal> list, and have been checked to not be null. <literal>seed</literal> contains a seed to use for any random numbers generated within the sampling method; it is either a hash derived from the <literal>REPEATABLE</literal> value if one was given, or the result of <literal>random()</literal> if not.
ru: <placeholder-1/> Начинает выполнение сканирования выборки. Эта функция вызывается непосредственно перед первой попыткой выбрать кортеж и может вызываться повторно, если потребуется перезапустить сканирование. Информацию о сканируемой таблице можно получить через поля узла <structname>SampleScanState</structname> (но заметьте, что дескриптор сканирования <literal>node-&gt;ss.ss_currentScanDesc</literal> ещё не настроен). Массив <literal>params</literal>, длины <literal>nparams</literal>, содержит значения параметров, переданных в предложении <literal>TABLESAMPLE</literal>. Их количество и типы задаются в списке <literal>parameterTypes</literal> метода выборки, и они гарантированно не равны NULL. Параметр <literal>seed</literal> содержит значение затравки, которое этот метод должен учитывать при генерации любых случайных чисел; это либо хеш, полученный из значения <literal>REPEATABLE</literal>, если оно было передано, либо результат <literal>random()</literal> в противном случае.

source: This function may adjust the fields <literal>node-&gt;use_bulkread</literal> and <literal>node-&gt;use_pagemode</literal>. If <literal>node-&gt;use_bulkread</literal> is <literal>true</literal>, which it is by default, the scan will use a buffer access strategy that encourages recycling buffers after use. It might be reasonable to set this to <literal>false</literal> if the scan will visit only a small fraction of the table's pages. If <literal>node-&gt;use_pagemode</literal> is <literal>true</literal>, which it is by default, the scan will perform visibility checking in a single pass for all tuples on each visited page. It might be reasonable to set this to <literal>false</literal> if the scan will select only a small fraction of the tuples on each visited page. That will result in fewer tuple visibility checks being performed, though each one will be more expensive because it will require more locking.
ru: Эта функция может скорректировать поля <literal>node-&gt;use_bulkread</literal> и <literal>node-&gt;use_pagemode</literal>. Если поле <literal>node-&gt;use_bulkread</literal> равно <literal>true</literal> (это значение по умолчанию), при сканировании будет использоваться стратегия доступа к буферу, ориентированная на переработку буферов после использования. Может быть разумным присвоить ему <literal>false</literal>, если при сканировании будет просматриваться только небольшой процент страниц. Если поле <literal>node-&gt;use_pagemode</literal> равно <literal>true</literal> (это значение по умолчанию), при сканировании проверка видимости будет выполняться в один проход для всех кортежей на каждой просматриваемой странице. Может иметь смысл присвоить ему <literal>false</literal>, если при сканировании выбирается только небольшой процент кортежей на странице. В результате будет выполняться меньше проверок видимости кортежей, хотя каждая проверка будет дороже, так как потребует расширенную блокировку.

source: If the sampling method is marked <literal>repeatable_across_scans</literal>, it must be able to select the same set of tuples during a rescan as it did originally, that is a fresh call of <function>BeginSampleScan</function> must lead to selecting the same tuples as before (if the <literal>TABLESAMPLE</literal> parameters and seed don't change).
ru: Если метод выборки помечен как <literal>repeatable_across_scans</literal>, он должен быть способен выбирать при повторном сканировании тот же набор кортежей, что был выбран в первый раз, то есть новый вызов <function>BeginSampleScan</function> должен приводить к выборке тех же кортежей, что и предыдущий (если параметры <literal>TABLESAMPLE</literal> и значение затравки не меняются).

source: <placeholder-1/> Returns the block number of the next page to be scanned, or <literal>InvalidBlockNumber</literal> if no pages remain to be scanned.
ru: <placeholder-1/> Возвращает номер блока следующей сканируемой страницы либо <literal>InvalidBlockNumber</literal>, если страниц для сканирования не осталось.

source: This function can be omitted (set the pointer to NULL), in which case the core code will perform a sequential scan of the entire relation. Such a scan can use synchronized scanning, so that the sampling method cannot assume that the relation pages are visited in the same order on each scan.
ru: Эту функцию можно опустить (присвоить её указателю NULL), в этом случае код ядра произведёт последовательное сканирование всего отношения. Такое сканирование может быть синхронизированным, так что метод выборки не должен полагать, что страницы отношения каждый раз просматриваются в одном и том же порядке.

source: <placeholder-1/> Returns the offset number of the next tuple to be sampled on the specified page, or <literal>InvalidOffsetNumber</literal> if no tuples remain to be sampled. <literal>maxoffset</literal> is the largest offset number in use on the page.
ru: <placeholder-1/> Возвращает номер смещения следующего кортежа, выбираемого с указанной страницы, либо <literal>InvalidOffsetNumber</literal>, если кортежей для выборки не осталось. В <literal>maxoffset</literal> задаётся максимальный номер смещения, допустимый на этой странице.

source: <function>NextSampleTuple</function> is not explicitly told which of the offset numbers in the range <literal>1 .. maxoffset</literal> actually contain valid tuples. This is not normally a problem since the core code ignores requests to sample missing or invisible tuples; that should not result in any bias in the sample. However, if necessary, the function can examine <literal>node-&gt;ss.ss_currentScanDesc-&gt;rs_vistuples[]</literal> to identify which tuples are valid and visible. (This requires <literal>node-&gt;use_pagemode</literal> to be <literal>true</literal>.)
ru: <function>NextSampleTuple</function> не говорит явно, для каких из номеров смещений в диапазоне <literal>1 .. maxoffset</literal> действительно содержатся актуальные кортежи. Это обычно не проблема, так как код ядра игнорирует запросы на выборку несуществующих или невидимых кортежей; это не должно приводить к отклонениям в выборке. Однако при необходимости функция может проверить <literal>node-&gt;ss.ss_currentScanDesc-&gt;rs_vistuples[]</literal> и понять, какие кортежи актуальны и видимы. (Для этого требуется, чтобы признак <literal>node-&gt;use_pagemode</literal> равнялся <literal>true</literal>.)

source: <function>NextSampleTuple</function> must <emphasis>not</emphasis> assume that <literal>blockno</literal> is the same page number returned by the most recent <function>NextSampleBlock</function> call. It was returned by some previous <function>NextSampleBlock</function> call, but the core code is allowed to call <function>NextSampleBlock</function> in advance of actually scanning pages, so as to support prefetching. It is OK to assume that once sampling of a given page begins, successive <function>NextSampleTuple</function> calls all refer to the same page until <literal>InvalidOffsetNumber</literal> is returned.
ru: Функция <function>NextSampleTuple</function> <emphasis>не</emphasis> должна полагать, что в <literal>blockno</literal> будет получен тот же номер страницы, что был выдан при последнем вызове <function>NextSampleBlock</function>. Этот номер определённо был выдан при каком-то предыдущем вызове <function>NextSampleBlock</function>, но код ядра может вызывать <function>NextSampleBlock</function> перед тем, как собственно сканировать страницы, для поддержки упреждающего чтения. Однако можно рассчитывать на то, что как только начнётся выборка кортежей с одной данной страницы, все последующие вызовы <function>NextSampleTuple</function> будут обращаться к этой странице, пока не будет возвращено значение <literal>InvalidOffsetNumber</literal>.

source: <placeholder-1/> End the scan and release resources. It is normally not important to release palloc'd memory, but any externally-visible resources should be cleaned up. This function can be omitted (set the pointer to NULL) in the common case where no such resources exist.
ru: <placeholder-1/> Завершает сканирование и освобождает ресурсы. Обычно при этом не нужно освобождать память, выделенную через palloc, но все видимые извне ресурсы должны быть очищены. Эту функцию чаще всего можно опустить (присвоить её указателю NULL), если таких ресурсов нет.
