Repository: pluzanov/pg-doc-ru
Catalog: 9.6/trigger.po
Languages: ru

source: Triggers
ru: Триггеры

source: This chapter provides general information about writing trigger functions. Trigger functions can be written in most of the available procedural languages, including <application>PL/pgSQL</application> (<xref linkend="plpgsql"/>), <application>PL/Tcl</application> (<xref linkend="pltcl"/>), <application>PL/Perl</application> (<xref linkend="plperl"/>), and <application>PL/Python</application> (<xref linkend="plpython"/>). After reading this chapter, you should consult the chapter for your favorite procedural language to find out the language-specific details of writing a trigger in it.
ru: В этой главе содержится общая информация о разработке триггерных функций. Триггерные функции могут быть написаны на большинстве доступных процедурных языков, включая <application>PL/pgSQL</application> (<xref linkend="plpgsql"/>), <application>PL/Tcl</application> (<xref linkend="pltcl"/>), <application>PL/Perl</application> (<xref linkend="plperl"/>) и <application>PL/Python</application> (<xref linkend="plpython"/>). После прочтения этого раздела, следует обратиться к разделу, посвящённому любимому процедурному языку, чтобы узнать специфические для него детали разработки триггеров.

source: It is also possible to write a trigger function in C, although most people find it easier to use one of the procedural languages. It is not currently possible to write a trigger function in the plain SQL function language.
ru: Триггерные функции можно писать и на C, хотя большинство людей находит, что проще использовать один из процедурных языков. В настоящее время невозможно написать триггерную функцию на чистом SQL.

source: Overview of Trigger Behavior
ru: Обзор механизма работы триггеров

source: A trigger is a specification that the database should automatically execute a particular function whenever a certain type of operation is performed. Triggers can be attached to tables, views, and foreign tables.
ru: Триггер является указанием, что база данных должна автоматически выполнить заданную функцию, всякий раз когда выполнен определённый тип операции. Триггеры можно использовать с таблицами, с представлениями и с внешними таблицами.

source: On tables and foreign tables, triggers can be defined to execute either before or after any <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> operation, either once per modified row, or once per <acronym>SQL</acronym> statement. If an <command>INSERT</command> contains an <literal>ON CONFLICT DO UPDATE</literal> clause, it is possible that the effects of a BEFORE insert trigger and a BEFORE update trigger can both be applied together, if a reference to an <varname>EXCLUDED</varname> column appears. <command>UPDATE</command> triggers can moreover be set to fire only if certain columns are mentioned in the <literal>SET</literal> clause of the <command>UPDATE</command> statement. Triggers can also fire for <command>TRUNCATE</command> statements. If a trigger event occurs, the trigger's function is called at the appropriate time to handle the event. Foreign tables do not support the TRUNCATE statement at all.
ru: Для обычных и сторонних таблиц можно определять триггеры, которые будут срабатывать до или после любой из команд <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>; либо один раз для каждой модифицируемой строки, либо один раз для оператора <acronym>SQL</acronym>. С запросом <command>INSERT</command>, содержащим предложение <literal>ON CONFLICT DO UPDATE</literal>, возможна ситуация, когда проявится действие сразу двух триггеров BEFORE INSERT и BEFORE UPDATE, если запрос обращается к столбцам <varname>EXCLUDED</varname>. Более того, триггеры <command>UPDATE</command> можно установить так, чтобы они срабатывали, только когда в предложении <literal>SET</literal> оператора <command>UPDATE</command> упоминаются определённые столбцы. Также триггеры могут срабатывать для операторов <command>TRUNCATE</command> (сторонние таблицы не поддерживают этот оператор вовсе). Когда происходит событие триггера, для обработки этого события в установленный момент времени вызывается функция триггера.

source: On views, triggers can be defined to execute instead of <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> operations. <literal>INSTEAD OF</literal> triggers are fired once for each row that needs to be modified in the view. It is the responsibility of the trigger's function to perform the necessary modifications to the underlying base tables and, where appropriate, return the modified row as it will appear in the view. Triggers on views can also be defined to execute once per <acronym>SQL</acronym> statement, before or after <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> operations.
ru: Для представлений триггеры могут быть определены вместо команд <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>. Триггеры <literal>INSTEAD OF</literal> запускаются один раз для каждой строки, которую необходимо изменить в представлении. Именно триггерная функция отвечает за выполнение необходимых изменений в базовых таблицах и, где это уместно, возвращает изменённую строку в том виде, как она будет отображаться в представлении. Триггеры на представления также можно определять для срабатывания только один раз на <acronym>SQL</acronym>-оператор, до или после команд <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>.

source: The trigger function must be defined before the trigger itself can be created. The trigger function must be declared as a function taking no arguments and returning type <literal>trigger</literal>. (The trigger function receives its input through a specially-passed <structname>TriggerData</structname> structure, not in the form of ordinary function arguments.)
ru: Триггерная функция должна быть создана до триггера. Она должна быть объявлена без аргументов и возвращать тип <literal>trigger</literal>. (Триггерная функция получает данные на вход посредством специально переданной структуры <structname>TriggerData</structname>, а не в форме обычных аргументов.)

source: Once a suitable trigger function has been created, the trigger is established with <xref linkend="sql-createtrigger"/>. The same trigger function can be used for multiple triggers.
ru: После создания триггерной функции создаётся триггер с помощью <xref linkend="sql-createtrigger"/>. Одна и та же триггерная функция может быть использована для нескольких триггеров.

source: <productname>PostgreSQL</productname> offers both <firstterm>per-row</firstterm> triggers and <firstterm>per-statement</firstterm> triggers. With a per-row trigger, the trigger function is invoked once for each row that is affected by the statement that fired the trigger. In contrast, a per-statement trigger is invoked only once when an appropriate statement is executed, regardless of the number of rows affected by that statement. In particular, a statement that affects zero rows will still result in the execution of any applicable per-statement triggers. These two types of triggers are sometimes called <firstterm>row-level</firstterm> triggers and <firstterm>statement-level</firstterm> triggers, respectively. Triggers on <command>TRUNCATE</command> may only be defined at statement level. On views, triggers that fire before or after may only be defined at statement level, while triggers that fire instead of an <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> may only be defined at row level.
ru: <productname>PostgreSQL</productname> предлагает как <firstterm>построчные</firstterm> триггеры, так и <firstterm>операторные</firstterm> триггеры. В случае построчного триггера, триггерная функция вызывается один раз для каждой строки, затронутой оператором, запустившим триггер. В противоположность этому, операторный триггер вызывается только один раз при выполнении соответствующего оператора, независимо от количества строк, которые он затрагивает. В частности оператор, который вообще не затрагивает строк, все равно приведёт к срабатыванию операторного триггера. Эти два типа триггеров иногда называют триггерами <firstterm>уровня строк </firstterm> и триггерами <firstterm>уровня оператора</firstterm> соответственно. Триггеры на <command>TRUNCATE</command> могут быть определены только на уровне оператора. Триггеры для представлений, срабатывающие до или после, могут быть определены только на уровне оператора, в то время как триггеры, срабатывающие вместо команд <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>, могут быть определены только на уровне строк.

source: Triggers are also classified according to whether they fire <firstterm>before</firstterm>, <firstterm>after</firstterm>, or <firstterm>instead of</firstterm> the operation. These are referred to as <literal>BEFORE</literal> triggers, <literal>AFTER</literal> triggers, and <literal>INSTEAD OF</literal> triggers respectively. Statement-level <literal>BEFORE</literal> triggers naturally fire before the statement starts to do anything, while statement-level <literal>AFTER</literal> triggers fire at the very end of the statement. These types of triggers may be defined on tables or views. Row-level <literal>BEFORE</literal> triggers fire immediately before a particular row is operated on, while row-level <literal>AFTER</literal> triggers fire at the end of the statement (but before any statement-level <literal>AFTER</literal> triggers). These types of triggers may only be defined on tables and foreign tables. Row-level <literal>INSTEAD OF</literal> triggers may only be defined on views, and fire immediately as each row in the view is identified as needing to be operated on.
ru: Триггеры также классифицируются в соответствии с тем, срабатывают ли они <firstterm>до</firstterm>, <firstterm>после</firstterm> или <firstterm>вместо</firstterm> операции. Они называются триггерами <literal>BEFORE</literal>, <literal>AFTER</literal> и <literal>INSTEAD OF</literal>, соответственно. Триггеры <literal>BEFORE</literal> уровня оператора срабатывают до того, как оператор начинает делать что-либо, в то время как триггеры <literal>AFTER</literal> уровня оператора срабатывают в самом конце работы оператора. Эти типы триггеров могут быть определены для таблиц или представлений. Триггеры <literal>BEFORE</literal> уровня строки срабатывают непосредственно перед обработкой конкретной строки, в то время как триггеры <literal>AFTER</literal> уровня строки срабатывают в конце работы всего оператора (но до любого из триггеров <literal>AFTER</literal> уровня оператора). Эти типы триггеров могут определяться только для таблиц и сторонних таблиц. Триггеры <literal>INSTEAD OF</literal> уровня строки могут определяться только для представлений и срабатывают для каждой строки, сразу после того как строка представления идентифицирована как нуждающаяся в обработке.

source: It can return <symbol>NULL</symbol> to skip the operation for the current row. This instructs the executor to not perform the row-level operation that invoked the trigger (the insertion, modification, or deletion of a particular table row).
ru: Можно вернуть <symbol>NULL</symbol>, чтобы пропустить операцию для текущей строки. Это указывает исполнителю запросов, что не нужно выполнять операцию со строкой вызвавшей триггер (вставку, изменение или удаление конкретной строки в таблице).

source: For row-level <command>INSERT</command> and <command>UPDATE</command> triggers only, the returned row becomes the row that will be inserted or will replace the row being updated. This allows the trigger function to modify the row being inserted or updated.
ru: Возвращаемая строка для триггеров <command>INSERT</command> или <command>UPDATE</command> будет именно той, которая будет вставлена или обновлена в таблице. Это позволяет триггерной функции изменять вставляемую или обновляемую строку.

source: Trigger functions invoked by per-statement triggers should always return <symbol>NULL</symbol>. Trigger functions invoked by per-row triggers can return a table row (a value of type <structname>HeapTuple</structname>) to the calling executor, if they choose. A row-level trigger fired before an operation has the following choices: <placeholder-1/> A row-level <literal>BEFORE</literal> trigger that does not intend to cause either of these behaviors must be careful to return as its result the same row that was passed in (that is, the <varname>NEW</varname> row for <command>INSERT</command> and <command>UPDATE</command> triggers, the <varname>OLD</varname> row for <command>DELETE</command> triggers).
ru: Триггерные функции, вызываемые триггерами операторов, должны всегда возвращать <symbol>NULL</symbol>. Триггерные функции, вызываемые триггерами строк, могут вернуть строку таблицы (значение типа <structname>HeapTuple</structname>). У триггера уровня строки, срабатывающего до операции, есть следующий выбор: <placeholder-1/> Если в триггере <literal>BEFORE</literal> уровня строки не планируется использовать любой из этих вариантов, то нужно аккуратно вернуть в качестве результата ту же строку, которая была передана на вход (то есть строку <varname>NEW</varname> для триггеров <command>INSERT</command> и <command>UPDATE</command>, или строку <varname>OLD</varname> для триггеров <command>DELETE</command>).

source: A row-level <literal>INSTEAD OF</literal> trigger should either return <symbol>NULL</symbol> to indicate that it did not modify any data from the view's underlying base tables, or it should return the view row that was passed in (the <varname>NEW</varname> row for <command>INSERT</command> and <command>UPDATE</command> operations, or the <varname>OLD</varname> row for <command>DELETE</command> operations). A nonnull return value is used to signal that the trigger performed the necessary data modifications in the view. This will cause the count of the number of rows affected by the command to be incremented. For <command>INSERT</command> and <command>UPDATE</command> operations, the trigger may modify the <varname>NEW</varname> row before returning it. This will change the data returned by <command>INSERT RETURNING</command> or <command>UPDATE RETURNING</command>, and is useful when the view will not show exactly the same data that was provided.
ru: <literal>INSTEAD OF</literal> триггер уровня строки должен вернуть либо <symbol>NULL</symbol>, чтобы указать, что он не модифицирует базовые таблицы представления, либо он должен вернуть строку представления, полученную на входе (строку <varname>NEW</varname> для операций <command>INSERT</command> и <command>UPDATE</command> или строку <varname>OLD</varname> для операций <command>DELETE</command>). Отличное от <symbol>NULL</symbol> возвращаемое значение сигнализирует, что триггер выполнил необходимые изменения данных в представлении. Это приведёт к увеличению счётчика количества строк, затронутых командой. Для операций <command>INSERT</command> и <command>UPDATE</command> триггер может изменить строку <varname>NEW</varname> перед тем как её вернуть. Это изменит данные, возвращаемые <command>INSERT RETURNING</command> или <command>UPDATE RETURNING</command>, и полезно для того, чтобы не показывать уже не актуальные первоначальные данные.

source: The return value is ignored for row-level triggers fired after an operation, and so they can return <symbol>NULL</symbol>.
ru: Возвращаемое значение игнорируется для триггеров уровня строки, вызываемых после операции, поэтому они могут возвращать <symbol>NULL</symbol>.

source: If more than one trigger is defined for the same event on the same relation, the triggers will be fired in alphabetical order by trigger name. In the case of <literal>BEFORE</literal> and <literal>INSTEAD OF</literal> triggers, the possibly-modified row returned by each trigger becomes the input to the next trigger. If any <literal>BEFORE</literal> or <literal>INSTEAD OF</literal> trigger returns <symbol>NULL</symbol>, the operation is abandoned for that row and subsequent triggers are not fired (for that row).
ru: Если есть несколько триггеров на одно и то же событие для одной и той же таблицы, то они будут вызываться в алфавитном порядке по имени триггера. Для триггеров <literal>BEFORE</literal> и <literal>INSTEAD OF</literal> потенциально изменённая строка, возвращаемая одним триггером, становится входящей строкой для следующего триггера. Если любой из триггеров <literal>BEFORE</literal> или <literal>INSTEAD OF</literal> возвращает <symbol>NULL</symbol>, операция для этой строки прекращается и последующие триггеры (для этой строки) не срабатывают.

source: A trigger definition can also specify a Boolean <literal>WHEN</literal> condition, which will be tested to see whether the trigger should be fired. In row-level triggers the <literal>WHEN</literal> condition can examine the old and/or new values of columns of the row. (Statement-level triggers can also have <literal>WHEN</literal> conditions, although the feature is not so useful for them.) In a <literal>BEFORE</literal> trigger, the <literal>WHEN</literal> condition is evaluated just before the function is or would be executed, so using <literal>WHEN</literal> is not materially different from testing the same condition at the beginning of the trigger function. However, in an <literal>AFTER</literal> trigger, the <literal>WHEN</literal> condition is evaluated just after the row update occurs, and it determines whether an event is queued to fire the trigger at the end of statement. So when an <literal>AFTER</literal> trigger's <literal>WHEN</literal> condition does not return true, it is not necessary to queue an event nor to re-fetch the row at end of statement. This can result in significant speedups in statements that modify many rows, if the trigger only needs to be fired for a few of the rows. <literal>INSTEAD OF</literal> triggers do not support <literal>WHEN</literal> conditions.
ru: В определении триггера можно указать логическое условие <literal>WHEN</literal>, которое будет проверяться, чтобы посмотреть, нужно ли запускать триггер. В триггерах уровня строки в условии <literal>WHEN</literal> можно проверять старые и/или новые значения столбцов строки. (В триггерах уровня оператора также можно использовать условие <literal>WHEN</literal>, хотя в этом случае это не так полезно.) В триггерах <literal>BEFORE</literal> условие <literal>WHEN</literal> вычисляется непосредственно перед тем, как триггерная функция будет выполнена, поэтому использование <literal>WHEN</literal> существенно не отличается от выполнения той же проверки в самом начале триггерной функции. Однако, в триггерах <literal>AFTER</literal> условие <literal>WHEN</literal> вычисляется сразу после обновления строки и от этого зависит, будет ли поставлено в очередь событие запуска триггера в конце оператора или нет. Поэтому, когда условие <literal>WHEN</literal> в триггере <literal>AFTER</literal> не возвращает истину, не требуется ни постановка события в очередь, ни повторная выборка этой строки в конце оператора. Это может существенно ускорить работу операторов, изменяющих большое количество строк, с триггером, который должен сработать только для нескольких. В триггерах <literal>INSTEAD OF</literal> не поддерживается использование условий <literal>WHEN</literal>.

source: Typically, row-level <literal>BEFORE</literal> triggers are used for checking or modifying the data that will be inserted or updated. For example, a <literal>BEFORE</literal> trigger might be used to insert the current time into a <type>timestamp</type> column, or to check that two elements of the row are consistent. Row-level <literal>AFTER</literal> triggers are most sensibly used to propagate the updates to other tables, or make consistency checks against other tables. The reason for this division of labor is that an <literal>AFTER</literal> trigger can be certain it is seeing the final value of the row, while a <literal>BEFORE</literal> trigger cannot; there might be other <literal>BEFORE</literal> triggers firing after it. If you have no specific reason to make a trigger <literal>BEFORE</literal> or <literal>AFTER</literal>, the <literal>BEFORE</literal> case is more efficient, since the information about the operation doesn't have to be saved until end of statement.
ru: Как правило, триггеры <literal>BEFORE</literal> уровня строки используются для проверки или модификации данных, которые будут вставлены или изменены. Например, триггер <literal>BEFORE</literal> можно использовать для вставки текущего времени в столбец <type>timestamp</type> или проверки, что два элемента строки согласованы между собой. Триггеры <literal>AFTER</literal> уровня строки наиболее разумно использовать для каскадного обновления данных в других таблицах или проверки согласованности сделанных изменений с данными в других таблицах. Причина для такого разделения работы в том, что триггер <literal>AFTER</literal> видит окончательное значение строки, в то время как для триггера <literal>BEFORE</literal> это не так, ведь могут быть другие триггеры <literal>BEFORE</literal>, которые сработают позже. Если нет особых причин для выбора между триггерами <literal>BEFORE</literal> или <literal>AFTER</literal>, то триггер <literal>BEFORE</literal> предпочтительнее, так как не требует сохранения информации об операции до конца работы оператора.

source: If a trigger function executes SQL commands then these commands might fire triggers again. This is known as cascading triggers. There is no direct limitation on the number of cascade levels. It is possible for cascades to cause a recursive invocation of the same trigger; for example, an <command>INSERT</command> trigger might execute a command that inserts an additional row into the same table, causing the <command>INSERT</command> trigger to be fired again. It is the trigger programmer's responsibility to avoid infinite recursion in such scenarios.
ru: Если триггерная функция выполняет команды SQL, эти команды могут заново запускать триггеры. Это известно как каскадные триггеры. Прямых ограничений на количество каскадных уровней не существует. Вполне возможно, что каскадные вызовы приведут к рекурсивному срабатыванию одного и того же триггера. Например, в триггере <command>INSERT</command> может выполняться команда, которая добавляет строку в эту же таблицу, тем самым опять вызывая триггер на <command>INSERT</command>. Обязанность программиста не допускать бесконечную рекурсию в таких случаях.

source: <primary>trigger</primary> <secondary>arguments for trigger functions</secondary>
ru: <primary>Триггер</primary> <secondary>Аргументы для триггерных функций</secondary>
