Repository: pluzanov/pg-doc-ru
Catalog: 9.6/trigger.po
Languages: ru

source: <placeholder-1/> When a trigger is being defined, arguments can be specified for it. The purpose of including arguments in the trigger definition is to allow different triggers with similar requirements to call the same function. As an example, there could be a generalized trigger function that takes as its arguments two column names and puts the current user in one and the current time stamp in the other. Properly written, this trigger function would be independent of the specific table it is triggering on. So the same function could be used for <command>INSERT</command> events on any table with suitable columns, to automatically track creation of records in a transaction table for example. It could also be used to track last-update events if defined as an <command>UPDATE</command> trigger.
ru: <placeholder-1/> При определении триггера можно указывать аргументы. Цель включения аргументов в определение триггера в том, чтобы позволить разным триггерам с аналогичными требованиями вызывать одну и ту же функцию. В качестве примера можно создать обобщенную триггерную функцию, которая принимает два аргумента с именами столбцов и записывает текущего пользователя в первый аргумент и текущий штамп времени во второй. При правильном написании такая триггерная функция будет независима от конкретной таблицы, для которой она будет запускаться. Таким образом, одна и та же функция может использоваться при выполнении <command>INSERT</command> в любую таблицу с соответствующими столбцами, чтобы, например, автоматически отслеживать создание записей в транзакционной таблице. Для триггеров <command>UPDATE</command> аргументы также могут использоваться для отслеживания последних сделанных изменений.

source: Each programming language that supports triggers has its own method for making the trigger input data available to the trigger function. This input data includes the type of trigger event (e.g., <command>INSERT</command> or <command>UPDATE</command>) as well as any arguments that were listed in <command>CREATE TRIGGER</command>. For a row-level trigger, the input data also includes the <varname>NEW</varname> row for <command>INSERT</command> and <command>UPDATE</command> triggers, and/or the <varname>OLD</varname> row for <command>UPDATE</command> and <command>DELETE</command> triggers. Statement-level triggers do not currently have any way to examine the individual row(s) modified by the statement.
ru: У каждого языка программирования, поддерживающего триггеры, есть свой собственный метод доступа из триггерной функции к входным данным триггера. Входные данные триггера включают в себя тип события (например, <command>INSERT</command> или <command>UPDATE</command>), а также любые аргументы, перечисленные в <command>CREATE TRIGGER</command>. Для триггеров уровня строки входные данные также включают строку <varname>NEW</varname> для триггеров <command>INSERT</command> и <command>UPDATE</command>, и/или строку <varname>OLD</varname> для триггеров <command>UPDATE</command> и <command>DELETE</command>. Триггеры уровня оператора в настоящее время не имеют возможностей для проверки отдельных строк, модифицированных оператором.

source: Visibility of Data Changes
ru: Видимость изменений в данных

source: Statement-level triggers follow simple visibility rules: none of the changes made by a statement are visible to statement-level <literal>BEFORE</literal> triggers, whereas all modifications are visible to statement-level <literal>AFTER</literal> triggers.
ru: Триггеры уровня оператора следуют простым правилам видимости: никакие из изменений, произведённых оператором, не видны в триггерах <literal>BEFORE</literal>, тогда как в триггерах <literal>AFTER</literal> видны все изменения.

source: The data change (insertion, update, or deletion) causing the trigger to fire is naturally <emphasis>not</emphasis> visible to SQL commands executed in a row-level <literal>BEFORE</literal> trigger, because it hasn't happened yet.
ru: Изменение данных (вставка, обновление или удаление), заставляющее сработать триггер, <emphasis>не видно</emphasis> для команд SQL, выполняемых в триггере <literal>BEFORE</literal> уровня строки, потому что это изменение ещё не произошло.

source: However, SQL commands executed in a row-level <literal>BEFORE</literal> trigger <emphasis>will</emphasis> see the effects of data changes for rows previously processed in the same outer command. This requires caution, since the ordering of these change events is not in general predictable; a SQL command that affects multiple rows can visit the rows in any order.
ru: Тем не менее, команды SQL, выполняемые в триггере <literal>BEFORE</literal> уровня строки, <emphasis>будут</emphasis> видеть изменения данных в строках, которые уже были обработаны в этом операторе. Это требует осторожности, так как порядок обработки строк в целом непредсказуемый; команда SQL, обрабатывающая множество строк, может делать это в любом порядке.

source: Similarly, a row-level <literal>INSTEAD OF</literal> trigger will see the effects of data changes made by previous firings of <literal>INSTEAD OF</literal> triggers in the same outer command.
ru: Аналогично, триггер <literal>INSTEAD OF</literal> уровня строки увидит изменения данных, внесённые при предыдущих вызовах триггера <literal>INSTEAD OF</literal> для этой же внешней команды.

source: When a row-level <literal>AFTER</literal> trigger is fired, all data changes made by the outer command are already complete, and are visible to the invoked trigger function.
ru: Когда срабатывает триггер <literal>AFTER</literal> уровня строки, все изменения сделанные оператором уже выполнены и видны в вызываемой триггерной функции.

source: If you execute SQL commands in your trigger function, and these commands access the table that the trigger is for, then you need to be aware of the data visibility rules, because they determine whether these SQL commands will see the data change that the trigger is fired for. Briefly: <placeholder-1/>
ru: Если в триггерной функции выполняются SQL-команды и эти команды обращаются к таблице, на которую создан триггер, то необходимо знать правила видимости данных, потому что они определяют, будут ли видеть эти SQL-команды изменения в данных, для которых сработал триггер. Кратко: <placeholder-1/>

source: If your trigger function is written in any of the standard procedural languages, then the above statements apply only if the function is declared <literal>VOLATILE</literal>. Functions that are declared <literal>STABLE</literal> or <literal>IMMUTABLE</literal> will not see changes made by the calling command in any case.
ru: Если триггерная функция написана на одном из стандартных процедурных языков, вышеприведённые утверждения применимы, только если функция объявлена как <literal>VOLATILE</literal>. Функции объявленные как <literal>STABLE</literal> или <literal>IMMUTABLE</literal> в любом случае не будут видеть изменений, сделанных вызывающим оператором.

source: Further information about data visibility rules can be found in <xref linkend="spi-visibility"/>. The example in <xref linkend="trigger-example"/> contains a demonstration of these rules.
ru: Дополнительную информацию о правилах видимости данных можно найти в <xref remap="6" linkend="spi-visibility"/>. Пример в <xref remap="6" linkend="trigger-example"/> содержит демонстрацию этих правил.

source: Writing Trigger Functions in C
ru: Триггерные функции на языке C

source: <primary>trigger</primary> <secondary>in C</secondary>
ru: <primary>Триггер</primary> <secondary>на C</secondary>

source: This section describes the low-level details of the interface to a trigger function. This information is only needed when writing trigger functions in C. If you are using a higher-level language then these details are handled for you. In most cases you should consider using a procedural language before writing your triggers in C. The documentation of each procedural language explains how to write a trigger in that language.
ru: Этот раздел описывает низкоуровневые детали интерфейса для триггерной функции. Эта информация необходима только при разработке триггерных функций на C. При использовании языка более высокого уровня эти детали обрабатываются автоматически. В большинстве случаев необходимо рассмотреть использование процедурного языка, прежде чем начать разрабатывать триггеры на C. В документации по каждому процедурному языку объясняется как создавать триггеры на этом языке.

source: Trigger functions must use the <quote>version 1</quote> function manager interface.
ru: Триггерные функции должны использовать интерфейс функций <quote>версии 1</quote>.

source: When a function is called by the trigger manager, it is not passed any normal arguments, but it is passed a <quote>context</quote> pointer pointing to a <structname>TriggerData</structname> structure. C functions can check whether they were called from the trigger manager or not by executing the macro: <placeholder-1/> which expands to: <placeholder-2/> If this returns true, then it is safe to cast <literal>fcinfo-&gt;context</literal> to type <literal>TriggerData *</literal> and make use of the pointed-to <structname>TriggerData</structname> structure. The function must <emphasis>not</emphasis> alter the <structname>TriggerData</structname> structure or any of the data it points to.
ru: Когда функция вызывается диспетчером триггеров, ей не передаются обычные аргументы, но передаётся указатель <quote>context</quote>, ссылающийся на структуру <structname>TriggerData</structname>. Функции на C могут проверить, вызваны ли они диспетчером триггеров или нет, выполнив макрос: <placeholder-1/> который разворачивается в: <placeholder-2/> Если возвращается истина, то <literal>fcinfo-&gt;context</literal> можно безопасно привести к типу <literal>TriggerData *</literal> и использовать указатель на структуру <structname>TriggerData</structname>. Функция <emphasis>не</emphasis> должна изменять структуру <structname>TriggerData</structname> или любые данные, которые на неё указывают.

source: Always <literal>T_TriggerData</literal>.
ru: Всегда <literal>T_TriggerData</literal>.

source: Returns true if the trigger fired before the operation.
ru: Возвращает истину, если триггер сработал до операции.

source: Returns true if the trigger fired after the operation.
ru: Возвращает истину, если триггер сработал после операции.

source: Returns true if the trigger fired instead of the operation.
ru: Возвращает истину, если триггер сработал вместо операции.

source: Returns true if the trigger fired for a row-level event.
ru: Возвращает истину, если триггер сработал на уровне строки.

source: Returns true if the trigger fired for a statement-level event.
ru: Возвращает истину, если триггер сработал на уровне оператора.

source: Returns true if the trigger was fired by an <command>INSERT</command> command.
ru: Возвращает истину, если триггер сработал для операции <command>INSERT</command>.

source: Returns true if the trigger was fired by an <command>UPDATE</command> command.
ru: Возвращает истину, если триггер сработал для операции <command>UPDATE</command>.

source: Returns true if the trigger was fired by a <command>DELETE</command> command.
ru: Возвращает истину, если триггер сработал для операции <command>DELETE</command>.

source: Returns true if the trigger was fired by a <command>TRUNCATE</command> command.
ru: Возвращает истину, если триггер сработал для операции <command>TRUNCATE</command>.

source: Describes the event for which the function is called. You can use the following macros to examine <literal>tg_event</literal>: <placeholder-1/>
ru: Описывает событие, для которого вызывается функция. Можно использовать следующие макросы для получения информации о <literal>tg_event</literal>: <placeholder-1/>

source: A pointer to a structure describing the relation that the trigger fired for. Look at <filename>utils/rel.h</filename> for details about this structure. The most interesting things are <literal>tg_relation-&gt;rd_att</literal> (descriptor of the relation tuples) and <literal>tg_relation-&gt;rd_rel-&gt;relname</literal> (relation name; the type is not <type>char*</type> but <type>NameData</type>; use <literal>SPI_getrelname(tg_relation)</literal> to get a <type>char*</type> if you need a copy of the name).
ru: Указатель на структуру, описывающую таблицу, для которой сработал триггер. Подробнее об этой структуре в <filename>utils/rel.h</filename>. Самое интересное здесь это <literal>tg_relation-&gt;rd_att</literal> (дескриптор записей таблицы) и <literal>tg_relation-&gt;rd_rel-&gt;relname</literal> (имя таблицы; имеет тип <type>NameData</type>, а не <type>char*</type>; используйте <literal>SPI_getrelname(tg_relation)</literal>, чтобы получить тип <type>char*</type> если потребуется копия имени).

source: A pointer to the row for which the trigger was fired. This is the row being inserted, updated, or deleted. If this trigger was fired for an <command>INSERT</command> or <command>DELETE</command> then this is what you should return from the function if you don't want to replace the row with a different one (in the case of <command>INSERT</command>) or skip the operation. For triggers on foreign tables, values of system columns herein are unspecified.
ru: Указатель на строку, для которой сработал триггер. Это строка, которая вставляется, обновляется или удаляется. При срабатывании триггера для <command>INSERT</command> или <command>DELETE</command> это значение нужно вернуть из функции, только если не планируется изменять строку (в случае <command>INSERT</command>) или пропускать операцию для этой строки.

source: A pointer to the new version of the row, if the trigger was fired for an <command>UPDATE</command>, and <symbol>NULL</symbol> if it is for an <command>INSERT</command> or a <command>DELETE</command>. This is what you have to return from the function if the event is an <command>UPDATE</command> and you don't want to replace this row by a different one or skip the operation. For triggers on foreign tables, values of system columns herein are unspecified.
ru: Для триггера на <command>UPDATE</command> это указатель на новую версию строки либо <symbol>NULL</symbol>, если триггер на <command>INSERT</command> или <command>DELETE</command>. Это значение нужно вернуть из функции в случае <command>UPDATE</command>, если не планируется изменять строку или пропускать операцию для этой строки.

source: A pointer to a structure of type <structname>Trigger</structname>, defined in <filename>utils/reltrigger.h</filename>: <placeholder-1/> where <structfield>tgname</structfield> is the trigger's name, <structfield>tgnargs</structfield> is the number of arguments in <structfield>tgargs</structfield>, and <structfield>tgargs</structfield> is an array of pointers to the arguments specified in the <command>CREATE TRIGGER</command> statement. The other members are for internal use only.
ru: Указатель на структуру с типом <structname>Trigger</structname>, определённую в <filename>utils/reltrigger.h</filename>: <placeholder-1/> где <structfield>tgname</structfield> — имя триггера, <structfield>tgnargs</structfield> — количество аргументов в <structfield>tgargs</structfield>, и <structfield>tgargs</structfield> — массив указателей на аргументы, указанные в команде <command>CREATE TRIGGER</command>. Остальные члены структуры предназначены для внутреннего использования.

source: The buffer containing <structfield>tg_trigtuple</structfield>, or <symbol>InvalidBuffer</symbol> if there is no such tuple or it is not stored in a disk buffer.
ru: Буфер, содержащий <structfield>tg_trigtuple</structfield>, или содержащий <symbol>InvalidBuffer</symbol> — если нет такой строки или она не хранится в дисковом буфере.

source: The buffer containing <structfield>tg_newtuple</structfield>, or <symbol>InvalidBuffer</symbol> if there is no such tuple or it is not stored in a disk buffer.
ru: Буфер, содержащий <structfield>tg_newtuple</structfield>, или содержащий <symbol>InvalidBuffer</symbol> — если нет такой строки или она не хранится в дисковом буфере.

source: <structname>struct TriggerData</structname> is defined in <filename>commands/trigger.h</filename>: <placeholder-1/> where the members are defined as follows: <placeholder-2/>
ru: <structname>struct TriggerData</structname> определяется в <filename>commands/trigger.h</filename>: <placeholder-1/> где элементы определяются следующим образом: <placeholder-2/>

source: A trigger function must return either a <structname>HeapTuple</structname> pointer or a <symbol>NULL</symbol> pointer (<emphasis>not</emphasis> an SQL null value, that is, do not set <parameter>isNull</parameter> true). Be careful to return either <structfield>tg_trigtuple</structfield> or <structfield>tg_newtuple</structfield>, as appropriate, if you don't want to modify the row being operated on.
ru: Триггерная функция должна возвращать указатель <structname>HeapTuple</structname> или указатель <symbol>NULL</symbol> (но <emphasis>не</emphasis> SQL значение <literal>null</literal>, то есть не нужно устанавливать <parameter>isNull</parameter> в истину). Не забудьте, что если не планируете менять обрабатываемую триггером строку, то нужно вернуть либо <structfield>tg_trigtuple</structfield>, либо <structfield>tg_newtuple</structfield>.

source: A Complete Trigger Example
ru: Полный пример триггера

source: Here is a very simple example of a trigger function written in C. (Examples of triggers written in procedural languages can be found in the documentation of the procedural languages.)
ru: Вот очень простой пример триггерной функции, написанной на C. (Примеры триггеров для процедурных языков могут быть найдены в документации на процедурные языки.)

source: The function <function>trigf</function> reports the number of rows in the table <structname>ttest</structname> and skips the actual operation if the command attempts to insert a null value into the column <structfield>x</structfield>. (So the trigger acts as a not-null constraint but doesn't abort the transaction.)
ru: Функция <function>trigf</function> сообщает количество строк в таблице <structname>ttest</structname> и пропускает операцию для строки при попытке вставить пустое значение в столбец <structfield>x</structfield>. (Таким образом, триггер действует как ограничение <literal>NOT NULL</literal>, но не прерывает транзакцию.)

source: First, the table definition: <placeholder-1/>
ru: Вначале определение таблицы: <placeholder-1/>

source: This is the source code of the trigger function: <placeholder-1/>
ru: Теперь исходный код триггерной функции: <placeholder-1/>

source: After you have compiled the source code (see <xref linkend="dfunc"/>), declare the function and the triggers: <placeholder-1/>
ru: После компиляции исходного кода (см. <xref remap="4" linkend="dfunc"/>) объявляем функцию и триггеры: <placeholder-1/>

source: Now you can test the operation of the trigger: <screen> =&gt; INSERT INTO ttest VALUES (NULL); INFO: trigf (fired before): there are 0 rows in ttest INSERT 0 0 -- Insertion skipped and AFTER trigger is not fired =&gt; SELECT * FROM ttest; x --- (0 rows) =&gt; INSERT INTO ttest VALUES (1); INFO: trigf (fired before): there are 0 rows in ttest INFO: trigf (fired after ): there are 1 rows in ttest ^^^^^^^^ remember what we said about visibility. INSERT 167793 1 vac=&gt; SELECT * FROM ttest; x --- 1 (1 row) =&gt; INSERT INTO ttest SELECT x * 2 FROM ttest; INFO: trigf (fired before): there are 1 rows in ttest INFO: trigf (fired after ): there are 2 rows in ttest ^^^^^^ remember what we said about visibility. INSERT 167794 1 =&gt; SELECT * FROM ttest; x --- 1 2 (2 rows) =&gt; UPDATE ttest SET x = NULL WHERE x = 2; INFO: trigf (fired before): there are 2 rows in ttest UPDATE 0 =&gt; UPDATE ttest SET x = 4 WHERE x = 2; INFO: trigf (fired before): there are 2 rows in ttest INFO: trigf (fired after ): there are 2 rows in ttest UPDATE 1 vac=&gt; SELECT * FROM ttest; x --- 1 4 (2 rows) =&gt; DELETE FROM ttest; INFO: trigf (fired before): there are 2 rows in ttest INFO: trigf (fired before): there are 1 rows in ttest INFO: trigf (fired after ): there are 0 rows in ttest INFO: trigf (fired after ): there are 0 rows in ttest ^^^^^^ remember what we said about visibility. DELETE 2 =&gt; SELECT * FROM ttest; x --- (0 rows) </screen>
ru: Теперь можно проверить работу триггера: <screen> =&gt; INSERT INTO ttest VALUES (NULL); INFO: trigf (fired before): there are 0 rows in ttest INSERT 0 0 -- Вставка записи пропущена (NULL значение), поэтому AFTER триггер не сработал =&gt; SELECT * FROM ttest; x --- (0 rows) =&gt; INSERT INTO ttest VALUES (1); INFO: trigf (fired before): there are 0 rows in ttest INFO: trigf (fired after ): there are 1 rows in ttest ^^^^^^^ вспомним, что говорили о видимости INSERT 167793 1 vac=&gt; SELECT * FROM ttest; x --- 1 (1 row) =&gt; INSERT INTO ttest SELECT x * 2 FROM ttest; INFO: trigf (fired before): there are 1 rows in ttest INFO: trigf (fired after ): there are 2 rows in ttest ^^^^^^^ вспомним, что говорили о видимости INSERT 167794 1 =&gt; SELECT * FROM ttest; x --- 1 2 (2 rows) =&gt; UPDATE ttest SET x = NULL WHERE x = 2; INFO: trigf (fired before): there are 2 rows in ttest UPDATE 0 =&gt; UPDATE ttest SET x = 4 WHERE x = 2; INFO: trigf (fired before): there are 2 rows in ttest INFO: trigf (fired after ): there are 2 rows in ttest UPDATE 1 vac=&gt; SELECT * FROM ttest; x --- 1 4 (2 rows) =&gt; DELETE FROM ttest; INFO: trigf (fired before): there are 2 rows in ttest INFO: trigf (fired before): there are 1 rows in ttest INFO: trigf (fired after ): there are 0 rows in ttest INFO: trigf (fired after ): there are 0 rows in ttest ^^^^^^^ вспомним, что говорили о видимости DELETE 2 =&gt; SELECT * FROM ttest; x --- (0 rows) </screen>

source: There are more complex examples in <filename>src/test/regress/regress.c</filename> and in <xref linkend="contrib-spi"/>.
ru: Более сложные примеры можно найти в <filename>src/test/regress/regress.c</filename> и в <xref remap="6" linkend="contrib-spi"/>.
