Repository: pluzanov/pg-doc-ru
Catalog: 9.6/tsearch2.po
Languages: ru

source: The <application>tsearch2</application> module provides backwards-compatible text search functionality for applications that used <application>tsearch2</application> before text searching was integrated into core <productname>PostgreSQL</productname> in release 8.3.
ru: Модуль <application>tsearch2</application> предоставляет функциональность текстового поиска для обратной совместимости с приложениями, которые использовали <application>tsearch2</application> до того, как текстовый поиск был интегрирован в ядро <productname>PostgreSQL</productname> в версии 8.3.

source: Portability Issues
ru: Вопросы переносимости

source: Although the built-in text search features were based on <application>tsearch2</application> and are largely similar to it, there are numerous small differences that will create portability issues for existing applications:
ru: Хотя встроенные функции текстового поиска были основаны на функциях <application>tsearch2</application> и во многом похожи, есть ряд небольших различий, из-за которых возникают вопросы переносимости с существующими приложениями:

source: Some functions' names were changed, for example <function>rank</function> to <function>ts_rank</function>. The replacement <literal>tsearch2</literal> module provides aliases having the old names.
ru: Были изменены имена некоторых функций, например функция <function>rank</function> стала <function>ts_rank</function>. Модуль замены <literal>tsearch2</literal> предоставляет псевдонимы для старых имён.

source: The built-in text search data types and functions all exist within the system schema <literal>pg_catalog</literal>. In an installation using <application>tsearch2</application>, these objects would usually have been in the <literal>public</literal> schema, though some users chose to place them in a separate schema of their own. Explicitly schema-qualified references to the objects will therefore fail in either case. The replacement <literal>tsearch2</literal> module provides alias objects that are stored in <literal>public</literal> (or another schema if necessary) so that such references will still work.
ru: Все типы данных и функции встроенного текстового поиска существуют в системной схеме <literal>pg_catalog</literal>. При установке из <application>tsearch2</application> эти объекты обычно помещались в схему <literal>public</literal>, хотя некоторые пользователи могли поместить их в специальную отдельную схему. Таким образом, ссылки на объекты, дополненные схемой, окажутся нерабочими в любом случае. Модуль замены <literal>tsearch2</literal> предоставляет для этих объектов псевдонимы, которые помещаются в схему <literal>public</literal> (или другую, если это требуется), чтобы такие ссылки продолжали работать.

source: There is no concept of a <quote>current parser</quote> or <quote>current dictionary</quote> in the built-in text search features, only of a current search configuration (set by the <varname>default_text_search_config</varname> parameter). While the current parser and current dictionary were used only by functions intended for debugging, this might still pose a porting obstacle in some cases. The replacement <literal>tsearch2</literal> module emulates these additional state variables and provides backwards-compatible functions for setting and retrieving them.
ru: Для встроенных функций текстового поиска отсутствуют понятия <quote>текущий анализатор</quote> и <quote>текущий словарь</quote>, есть только текущая конфигурация поиска (она задаётся параметром <varname>default_text_search_config</varname>). Хотя текущий анализатор и текущий словарь использовались раньше только функциями, предназначенными для отладки, это всё же может мешать переносимости в некоторых случаях. Модуль замены <literal>tsearch2</literal> имитирует эти дополнительные переменные состояния и предоставляет обратно-совместимые функции, позволяющие задать и прочитать их.

source: There are some issues that are not addressed by the replacement <literal>tsearch2</literal> module, and will therefore require application code changes in any case:
ru: Есть ряд проблем, решения которых не предлагает модуль <literal>tsearch2</literal>, так что код приложения придётся корректировать в любом случае:

source: The old <function>tsearch2</function> trigger function allowed items in its argument list to be names of functions to be invoked on the text data before it was converted to <type>tsvector</type> format. This was removed as being a security hole, since it was not possible to guarantee that the function invoked was the one intended. The recommended approach if the data must be massaged before being indexed is to write a custom trigger that does the work for itself.
ru: Старая триггерная функция <function>tsearch2</function> могла принимать в списке аргументов имена функций, вызываемых с текстовыми данными до того, как они были преобразованы в формат <type>tsvector</type>. Эта возможность была ликвидирована как угроза безопасности, так как нельзя гарантировать, что вызываться будет именно запланированная функция. Если данные нужно как-то обработать перед индексацией, рекомендуется написать дополнительный триггер, который будет делать это сам.

source: Text search configuration information has been moved into core system catalogs that are noticeably different from the tables used by <application>tsearch2</application>. Any applications that examined or modified those tables will need adjustment.
ru: Информация о конфигурации текстового поиска была перенесена в системные каталоги, которые значительно отличаются от таблиц аналогичного предназначения в <application>tsearch2</application>. Все приложения, анализирующие или модифицирующие эти таблицы, нуждаются в корректировке.

source: If an application used any custom text search configurations, those will need to be set up in the core catalogs using the new text search configuration SQL commands. The replacement <literal>tsearch2</literal> module offers a little bit of support for this by making it possible to load an old set of <application>tsearch2</application> configuration tables into <productname>PostgreSQL</productname> 8.3. (Without the module, it is not possible to load the configuration data because values in the <type>regprocedure</type> columns cannot be resolved to functions.) While those configuration tables won't actually <emphasis>do</emphasis> anything, at least their contents will be available to be consulted while setting up an equivalent custom configuration in 8.3.
ru: Ели приложение использует какие-либо нестандартные конфигурации текстового поиска, их нужно будет настроить в системных каталогах, применив новые SQL-команды конфигурирования текстового поиска. Модуль замены <literal>tsearch2</literal> предлагает небольшую помощь в этом, позволяя загружать старый набор конфигурационных таблиц <application>tsearch2</application> в <productname>PostgreSQL</productname> 8.3. (Без этого модуля загрузить данные конфигурации невозможно, так как значения в столбцах <type>regprocedure</type> нельзя сопоставить с функциями.) Эти таблицы конфигурации на самом деле не будут ничего <emphasis>делать</emphasis>, но их содержимое будет полезно хотя бы для того, чтобы получить аналогичную конфигурацию в 8.3.

source: The old <function>reset_tsearch()</function> and <function>get_covers()</function> functions are not supported.
ru: Старые функции <function>reset_tsearch()</function> и <function>get_covers()</function> не поддерживаются.

source: The replacement <literal>tsearch2</literal> module does not define any alias operators, relying entirely on the built-in ones. This would only pose an issue if an application used explicitly schema-qualified operator names, which is very uncommon.
ru: Модуль замены <literal>tsearch2</literal> не определяет никакие псевдонимы операторов, полностью рассчитывая на встроенные. Это может вызвать проблемы, если в приложении использовались имена операторов с явным указанием схемы, что встречается очень редко.

source: Converting a pre-8.3 Installation
ru: Преобразование инсталляции версии до 8.3

source: The recommended way to update a pre-8.3 installation that uses <application>tsearch2</application> is:
ru: Обновлять инсталляцию версии до 8.3, в которой использовалось расширение <application>tsearch2</application>, рекомендуется следующим образом:

source: Make a dump from the old installation in the usual way, but be sure not to use <literal>-c</literal> (<literal>--clean</literal>) option of <application>pg_dump</application> or <application>pg_dumpall</application>.
ru: Выгрузите данные старой инсталляции обычным способом, не используя ключ <literal>-c</literal> (<literal>--clean</literal>) программы <application>pg_dump</application> или <application>pg_dumpall</application>.

source: In the new installation, create empty database(s) and install the replacement <literal>tsearch2</literal> module into each database that will use text search. This must be done <emphasis>before</emphasis> loading the dump data! If your old installation had the <application>tsearch2</application> objects in a schema other than <literal>public</literal>, be sure to adjust the <command>CREATE EXTENSION</command> command so that the replacement objects are created in that same schema.
ru: В новой инсталляции создайте пустые базы данных и установите модуль замены <literal>tsearch2</literal> в каждую базу, где будет использоваться текстовый поиск. Это нужно сделать <emphasis>до</emphasis> загрузки данных в базу! Если в старой инсталляции объекты <application>tsearch2</application> содержались в схеме, отличной от <literal>public</literal>, обязательно отразите это в команде <command>CREATE EXTENSION</command>, чтобы заменяющие объекты создавались в той же схеме.

source: Load the dump data. There will be quite a few errors reported due to failure to recreate the original <application>tsearch2</application> objects. These errors can be ignored, but this means you cannot restore the dump in a single transaction (eg, you cannot use <application>pg_restore</application>'s <option>-1</option> switch).
ru: Загрузите выгруженные данные. При этом могут возникнуть ошибки из-за невозможности воссоздать первоначальные объекты <application>tsearch2</application>. Хотя их можно игнорировать, это значит, что вы не сможете восстановить выгруженные данные в одной транзакции (то есть, нельзя использовать ключ <option>-1</option> команды <application>pg_restore</application>).

source: Examine the contents of the restored <application>tsearch2</application> configuration tables (<structname>pg_ts_cfg</structname> and so on), and create equivalent built-in text search configurations as needed. You may drop the old configuration tables once you've extracted all the useful information from them.
ru: Изучите содержимое восстановленных конфигурационных таблиц <application>tsearch2</application> (<structname>pg_ts_cfg</structname> и т. д.) и создайте аналогичные конфигурации текстового поиска по потребности. Получив из старых конфигурационных таблиц всю полезную информацию, вы можете удалить их.

source: Test your application.
ru: Протестируйте работу приложения.

source: At a later time you may wish to rename application references to the alias text search objects, so that you can eventually uninstall the replacement <literal>tsearch2</literal> module.
ru: Позже вы можете поменять ссылки в приложении на псевдонимы объектов текстового поиска, что позволит в конце концов удалить модуль замены <literal>tsearch2</literal>.

source: References
ru: Ссылки

source: Tsearch2 Development Site <ulink url="http://www.sai.msu.su/~megera/postgres/gist/tsearch/V2/"/>
ru: Сайт разработки Tsearch2 <ulink url="http://www.sai.msu.su/~megera/postgres/gist/tsearch/V2/"/>
