Repository: pluzanov/pg-doc-ru
Catalog: 9.6/typeconv.po
Languages: ru

source: Type Conversion
ru: Преобразование типов

source: <primary>data type</primary><secondary>conversion</secondary>
ru: <primary>тип данных</primary><secondary>преобразование</secondary>

source: <acronym>SQL</acronym> statements can, intentionally or not, require the mixing of different data types in the same expression. <productname>PostgreSQL</productname> has extensive facilities for evaluating mixed-type expressions.
ru: <acronym>SQL</acronym>-операторы, намеренно или нет, требуют совмещать данные разных типов в одном выражении. Для вычисления подобных выражений со смешанными типами <productname>PostgreSQL</productname> предоставляет широкий набор возможностей.

source: In many cases a user does not need to understand the details of the type conversion mechanism. However, implicit conversions done by <productname>PostgreSQL</productname> can affect the results of a query. When necessary, these results can be tailored by using <emphasis>explicit</emphasis> type conversion.
ru: Очень часто пользователю не нужно понимать все тонкости механизма преобразования. Однако следует учитывать, что неявные преобразования, производимые <productname>PostgreSQL</productname>, могут влиять на результат запроса. Поэтому при необходимости нужные результаты можно получить, применив <emphasis>явное</emphasis> преобразование типов.

source: This chapter introduces the <productname>PostgreSQL</productname> type conversion mechanisms and conventions. Refer to the relevant sections in <xref linkend="datatype"/> and <xref linkend="functions"/> for more information on specific data types and allowed functions and operators.
ru: В этой главе описываются общие механизмы преобразования типов и соглашения, принятые в <productname>PostgreSQL</productname>. За дополнительной информацией о конкретных типах данных и разрешённых для них функциях и операторах обратитесь к соответствующим разделам в <xref remap="6" linkend="datatype"/> и <xref remap="6" linkend="functions"/>.

source: Overview
ru: Обзор

source: <acronym>SQL</acronym> is a strongly typed language. That is, every data item has an associated data type which determines its behavior and allowed usage. <productname>PostgreSQL</productname> has an extensible type system that is more general and flexible than other <acronym>SQL</acronym> implementations. Hence, most type conversion behavior in <productname>PostgreSQL</productname> is governed by general rules rather than by <foreignphrase>ad hoc</foreignphrase> heuristics. This allows the use of mixed-type expressions even with user-defined types.
ru: <acronym>SQL</acronym> &mdash; язык со строгой типизацией. То есть каждый элемент данных в нём имеет некоторый тип, определяющий его поведение и допустимое использование. <productname>PostgreSQL</productname> наделён расширяемой системой типов, более универсальной и гибкой по сравнению с другими реализациями <acronym>SQL</acronym>. При этом преобразования типов в <productname>PostgreSQL</productname> в основном подчиняются определённым общим правилам, для их понимания не нужен <foreignphrase>эвристический</foreignphrase> анализ. Благодаря этому в выражениях со смешанными типами можно использовать даже типы, определённые пользователями.

source: The <productname>PostgreSQL</productname> scanner/parser divides lexical elements into five fundamental categories: integers, non-integer numbers, strings, identifiers, and key words. Constants of most non-numeric types are first classified as strings. The <acronym>SQL</acronym> language definition allows specifying type names with strings, and this mechanism can be used in <productname>PostgreSQL</productname> to start the parser down the correct path. For example, the query: <screen>SELECT text 'Origin' AS "label", point '(0,0)' AS "value"; label | value --------+------- Origin | (0,0) (1 row)</screen> has two literal constants, of type <type>text</type> and <type>point</type>. If a type is not specified for a string literal, then the placeholder type <type>unknown</type> is assigned initially, to be resolved in later stages as described below.
ru: Анализатор выражений <productname>PostgreSQL</productname> разделяет их лексические элементы на пять основных категорий: целые числа, другие числовые значения, текстовые строки, идентификаторы и ключевые слова. Константы большинства не числовых типов сначала классифицируются как строки. В определении языка <acronym>SQL</acronym> допускается указывать имена типов в строках и это можно использовать в <productname>PostgreSQL</productname>, чтобы направить анализатор по верному пути. Например, запрос: <screen>SELECT text 'Origin' AS "label", point '(0,0)' AS "value"; label | value --------+------- Origin | (0,0) (1 row)</screen> содержит две строковых константы, типа <type>text</type> и типа <type>point</type>. Если для такой константы не указан тип, для неё первоначально предполагается тип <type>unknown</type>, который затем может быть уточнён, как описано ниже.

source: Function calls
ru: Вызовы функций

source: Much of the <productname>PostgreSQL</productname> type system is built around a rich set of functions. Functions can have one or more arguments. Since <productname>PostgreSQL</productname> permits function overloading, the function name alone does not uniquely identify the function to be called; the parser must select the right function based on the data types of the supplied arguments.
ru: Система типов <productname>PostgreSQL</productname> во многом построена как дополнение к богатым возможностям функций. Функции могут иметь один или несколько аргументов, и при этом <productname>PostgreSQL</productname> разрешает перегружать имена функций, так что имя функции само по себе не идентифицирует вызываемую функцию; анализатор выбирает правильную функцию в зависимости от типов переданных аргументов.

# term
source: Operators
ru: Операторы

source: <productname>PostgreSQL</productname> allows expressions with prefix and postfix unary (one-argument) operators, as well as binary (two-argument) operators. Like functions, operators can be overloaded, so the same problem of selecting the right operator exists.
ru: <productname>PostgreSQL</productname> позволяет использовать в выражениях префиксные и постфиксные операторы с одним аргументом, а также операторы с двумя аргументами. Как и функции, операторы можно перегружать, так что и с ними существует проблема выбора правильного оператора.

# term
source: Value Storage
ru: Сохранение значений

source: <acronym>SQL</acronym> <command>INSERT</command> and <command>UPDATE</command> statements place the results of expressions into a table. The expressions in the statement must be matched up with, and perhaps converted to, the types of the target columns.
ru: <acronym>SQL</acronym>-операторы <command>INSERT</command> и <command>UPDATE</command> помещают результаты выражений в таблицы. При этом получаемые значения должны соответствовать типам целевых столбцов или, возможно, приводиться к ним.

source: <literal>UNION</literal>, <literal>CASE</literal>, and related constructs
ru: <literal>UNION</literal>, <literal>CASE</literal> и связанные конструкции

source: Since all query results from a unionized <command>SELECT</command> statement must appear in a single set of columns, the types of the results of each <command>SELECT</command> clause must be matched up and converted to a uniform set. Similarly, the result expressions of a <literal>CASE</literal> construct must be converted to a common type so that the <literal>CASE</literal> expression as a whole has a known output type. The same holds for <literal>ARRAY</literal> constructs, and for the <function>GREATEST</function> and <function>LEAST</function> functions.
ru: Так как все результаты запроса объединяющего оператора <command>SELECT</command> должны оказаться в одном наборе столбцов, результаты каждого подзапроса <command>SELECT</command> должны приводиться к одному набору типов. Подобным образом, результирующие выражения конструкции <literal>CASE</literal> должны приводиться к общему типу, так как выражение <literal>CASE</literal> в целом должно иметь определённый выходной тип. То же справедливо в отношении конструкций <literal>ARRAY</literal> и функций <function>GREATEST</function> и <function>LEAST</function>.

source: There are four fundamental <acronym>SQL</acronym> constructs requiring distinct type conversion rules in the <productname>PostgreSQL</productname> parser: <placeholder-1/>
ru: В <acronym>SQL</acronym> есть четыре фундаментальных фактора, определяющих правила преобразования типов для анализатора выражений <productname>PostgreSQL</productname>: <placeholder-1/>

source: The system catalogs store information about which conversions, or <firstterm>casts</firstterm>, exist between which data types, and how to perform those conversions. Additional casts can be added by the user with the <xref linkend="sql-createcast"/> command. (This is usually done in conjunction with defining new data types. The set of casts between built-in types has been carefully crafted and is best not altered.)
ru: Информация о существующих преобразованиях или <firstterm>приведениях</firstterm> типов, для каких типов они определены и как их выполнять, хранится в системных каталогах. Пользователь также может добавить дополнительные преобразования с помощью команды <xref linkend="sql-createcast"/>. (Обычно это делается, когда определяются новые типы данных. Набор приведений для встроенных типов достаточно хорошо проработан, так что его лучше не менять.)

source: <primary>data type</primary><secondary>category</secondary>
ru: <primary>тип данных</primary><secondary>категория</secondary>

source: An additional heuristic provided by the parser allows improved determination of the proper casting behavior among groups of types that have implicit casts. Data types are divided into several basic <firstterm>type categories</firstterm>, including <type>boolean</type>, <type>numeric</type>, <type>string</type>, <type>bitstring</type>, <type>datetime</type>, <type>timespan</type>, <type>geometric</type>, <type>network</type>, and user-defined. (For a list see <xref linkend="catalog-typcategory-table"/>; but note it is also possible to create custom type categories.) Within each category there can be one or more <firstterm>preferred types</firstterm>, which are preferred when there is a choice of possible types. With careful selection of preferred types and available implicit casts, it is possible to ensure that ambiguous expressions (those with multiple candidate parsing solutions) can be resolved in a useful way.
ru: Дополнительная логика анализа помогает выбрать оптимальное приведение в группах типов, допускающих неявные преобразования. Для этого типы данных разделяются на несколько базовых <firstterm>категорий</firstterm>, которые включают: <type>boolean</type>, <type>numeric</type>, <type>string</type>, <type>bitstring</type>, <type>datetime</type>, <type>timespan</type>, <type>geometric</type>, <type>network</type> и пользовательские типы. (Полный список категорий приведён в <xref remap="6" linkend="catalog-typcategory-table"/>; хотя его тоже можно расширить, определив свои категории.) В каждой категории могут быть выбраны один или несколько <firstterm>предпочитаемых типов</firstterm>, которые будут считаться наиболее подходящими при рассмотрении нескольких вариантов. Аккуратно выбирая предпочитаемые типы и допустимые неявные преобразования, можно добиться того, что выражения с неоднозначностями (в которых возможны разные решения задачи преобразования) будут разрешаться наилучшим образом.

source: Implicit conversions should never have surprising or unpredictable outcomes.
ru: Результат неявных преобразованиях всегда должен быть предсказуемым и понятным.

source: There should be no extra overhead in the parser or executor if a query does not need implicit type conversion. That is, if a query is well-formed and the types already match, then the query should execute without spending extra time in the parser and without introducing unnecessary implicit conversion calls in the query.
ru: Если в неявном преобразовании нет нужды, анализатор и исполнитель запроса не должны тратить лишнее время на это. То есть, если запрос хорошо сформулирован и типы значений совпадают, он должен выполняться без дополнительной обработки в анализаторе и без лишних вызовов неявных преобразований.

source: Additionally, if a query usually requires an implicit conversion for a function, and if then the user defines a new function with the correct argument types, the parser should use this new function and no longer do implicit conversion to use the old function.
ru: Кроме того, если запрос изначально требовал неявного преобразования для функции, а пользователь определил новую функцию с точно совпадающими типами аргументов, анализатор должен переключиться на новую функцию и больше не выполнять преобразование для вызова старой.

source: All type conversion rules are designed with several principles in mind: <placeholder-1/>
ru: Все правила преобразования типов разработаны с учётом следующих принципов: <placeholder-1/>

# title
source: Operators
ru: Операторы

source: <primary>operator</primary><secondary>type resolution in an invocation</secondary>
ru: <primary>оператор</primary><secondary>разрешение типов при вызове</secondary>

source: The specific operator that is referenced by an operator expression is determined using the following procedure. Note that this procedure is indirectly affected by the precedence of the operators involved, since that will determine which sub-expressions are taken to be the inputs of which operators. See <xref linkend="sql-precedence"/> for more information.
ru: При выборе конкретного оператора, задействованного в выражении, <productname>PostgreSQL</productname> следует описанному ниже алгоритму. Заметьте, что на этот выбор могут неявно влиять приоритеты остальных операторов в данном выражении, так как они определяют, какие подвыражения будут аргументами операторов. Подробнее об этом рассказывается в <xref remap="6" linkend="sql-precedence"/>.

source: Operator Type Resolution
ru: Выбор оператора по типу

source: Select the operators to be considered from the <classname>pg_operator</classname> system catalog. If a non-schema-qualified operator name was used (the usual case), the operators considered are those with the matching name and argument count that are visible in the current search path (see <xref linkend="ddl-schemas-path"/>). If a qualified operator name was given, only operators in the specified schema are considered.
ru: Выбрать операторы для рассмотрения из системного каталога <classname>pg_operator</classname>. Если имя оператора не дополнено именем схемы (обычно это так), будут рассматриваться все операторы с подходящим именем и числом аргументов, видимые в текущем пути поиска (см. <xref remap="4" linkend="ddl-schemas-path"/>). Если имя оператора определено полностью, в рассмотрение принимаются только операторы из указанной схемы.

source: If the search path finds multiple operators with identical argument types, only the one appearing earliest in the path is considered. Operators with different argument types are considered on an equal footing regardless of search path position.
ru: Если в пути поиска оказывается несколько операторов с одинаковыми типами аргументов, учитываются только те из них, которые находятся в пути раньше. Операторы с разными типами аргументов рассматриваются на равных правах вне зависимости от их положения в пути поиска.

source: Check for an operator accepting exactly the input argument types. If one exists (there can be only one exact match in the set of operators considered), use it.
ru: Проверить, нет ли среди них оператора с точно совпадающими типами аргументов. Если такой оператор есть (он может быть только одним в отобранном ранее наборе), использовать его.

source: If one argument of a binary operator invocation is of the <type>unknown</type> type, then assume it is the same type as the other argument for this check. Invocations involving two <type>unknown</type> inputs, or a unary operator with an <type>unknown</type> input, will never find a match at this step.
ru: Если один аргумент при вызове бинарного оператора имеет тип <type>unknown</type>, для данной проверки предполагается, что он имеет тот же тип, что и второй его аргумент. При вызове бинарного оператора с двумя аргументами <type>unknown</type> или унарного с одним <type>unknown</type>, оператор не будет выбран на этом шаге.

source: If one argument of a binary operator invocation is of the <type>unknown</type> type and the other is of a domain type, next check to see if there is an operator accepting exactly the domain's base type on both sides; if so, use it.
ru: Если один аргумент при вызове бинарного оператора имеет тип <type>unknown</type>, а другой &mdash; домен, проверить, есть ли оператор, принимающий базовый тип домена с обеих сторон; если таковой находится, использовать его.

source: Look for the best match.
ru: Найти самый подходящий.

source: Discard candidate operators for which the input types do not match and cannot be converted (using an implicit conversion) to match. <type>unknown</type> literals are assumed to be convertible to anything for this purpose. If only one candidate remains, use it; else continue to the next step.
ru: Отбросить кандидаты, для которых входные типы не совпадают и не могут быть преобразованы (неявным образом) так, чтобы они совпали. В данном случае считается, что константы типа <type>unknown</type> можно преобразовать во что угодно. Если остаётся только один кандидат, использовать его, в противном случае перейти к следующему шагу.

source: If any input argument is of a domain type, treat it as being of the domain's base type for all subsequent steps. This ensures that domains act like their base types for purposes of ambiguous-operator resolution.
ru: Если один из аргументов имеет тип домен, далее считать его типом базовый тип домена. Благодаря этому при поиске неоднозначно заданного оператора домены будут подобны свои базовым типам.

source: Run through all candidates and keep those with the most exact matches on input types. Keep all candidates if none have exact matches. If only one candidate remains, use it; else continue to the next step.
ru: Просмотреть все кандидаты и оставить только те, для которых точно совпадают как можно больше типов аргументов. Оставить все кандидаты, если точных совпадений нет. Если остаётся только один кандидат, использовать его, в противном случае перейти к следующему шагу.

source: Run through all candidates and keep those that accept preferred types (of the input data type's type category) at the most positions where type conversion will be required. Keep all candidates if none accept preferred types. If only one candidate remains, use it; else continue to the next step.
ru: Просмотреть все кандидаты и оставить только те, которые принимают предпочитаемые типы (из категории типов входных значений) в наибольшем числе позиций, где требуется преобразование типов. Оставить все кандидаты, если ни один не принимает предпочитаемые типы. Если остаётся только один кандидат, использовать его, в противном случае перейти к следующему шагу.

source: If any input arguments are <type>unknown</type>, check the type categories accepted at those argument positions by the remaining candidates. At each position, select the <type>string</type> category if any candidate accepts that category. (This bias towards string is appropriate since an unknown-type literal looks like a string.) Otherwise, if all the remaining candidates accept the same type category, select that category; otherwise fail because the correct choice cannot be deduced without more clues. Now discard candidates that do not accept the selected type category. Furthermore, if any candidate accepts a preferred type in that category, discard candidates that accept non-preferred types for that argument. Keep all candidates if none survive these tests. If only one candidate remains, use it; else continue to the next step.
ru: Если какие-либо значения имеют тип <type>unknown</type>, проверить категории типов, принимаемых в данных позициях аргументов оставшимися кандидатами. Для каждой позиции выбрать категорию <type>string</type>, если какой-либо кандидат принимает эту категорию. (Эта склонность к строкам объясняется тем, что константа типа unknown выглядит как строка.) Если эта категория не подходит, но все оставшиеся кандидаты принимают одну категорию, выбрать её; в противном случае констатировать неудачу &mdash; сделать правильный выбор без дополнительных подсказок нельзя. Затем отбросить кандидаты, которые не принимают типы выбранной категории. Далее, если какой-либо кандидат принимает предпочитаемый тип из этой категории, отбросить кандидаты, принимающие другие, не предпочитаемые типы для данного аргумента. Оставить все кандидаты, если эти проверки не прошёл ни один. Если остаётся только один кандидат, использовать его, в противном случае перейти к следующему шагу.

source: If there are both <type>unknown</type> and known-type arguments, and all the known-type arguments have the same type, assume that the <type>unknown</type> arguments are also of that type, and check which candidates can accept that type at the <type>unknown</type>-argument positions. If exactly one candidate passes this test, use it. Otherwise, fail.
ru: Если в списке аргументов есть аргументы и типа <type>unknown</type>, и известного типа, и этот известный тип один для всех аргументов, предположить, что аргументы типа <type>unknown</type> также имеют этот тип, и проверить, какие кандидаты могут принимать этот тип в позиции аргумента <type>unknown</type>. Если остаётся только один кандидат, использовать его, в противном случае констатировать неудачу.

source: Some examples follow.
ru: Ниже это проиллюстрировано на примерах.

source: Factorial Operator Type Resolution
ru: Разрешение оператора факториала

source: There is only one factorial operator (postfix <literal>!</literal>) defined in the standard catalog, and it takes an argument of type <type>bigint</type>. The scanner assigns an initial type of <type>integer</type> to the argument in this query expression: <screen>SELECT 40 ! AS "40 factorial"; 40 factorial -------------------------------------------------- 815915283247897734345611269596115894272000000000 (1 row)</screen> So the parser does a type conversion on the operand and the query is equivalent to: <screen>SELECT CAST(40 AS bigint) ! AS "40 factorial";</screen>
ru: В стандартном каталоге определён только один оператор факториала (постфиксный <literal>!</literal>) и он принимает аргумент типа <type>bigint</type>. При просмотре следующего выражения его аргументу изначально назначается тип <type>integer</type>: <screen>SELECT 40 ! AS "40 factorial"; 40 factorial -------------------------------------------------- 815915283247897734345611269596115894272000000000 (1 row)</screen> Анализатор выполняет преобразование типа для этого операнда и запрос становится равносильным: <screen>SELECT CAST(40 AS bigint) ! AS "40 factorial";</screen>

source: String Concatenation Operator Type Resolution
ru: Разрешение оператора конкатенации строк

source: A string-like syntax is used for working with string types and for working with complex extension types. Strings with unspecified type are matched with likely operator candidates.
ru: Синтаксис текстовых строк используется как для записи строковых типов, так и для сложных типов расширений. Если тип не указан явно, такие строки сопоставляются по тому же алгоритму с наиболее подходящими операторами.
