Repository: pluzanov/pg-doc-ru
Catalog: 9.6/typeconv.po
Languages: ru

source: And, if the function is called with an argument of type <type>integer</type>, the parser will try to convert that to <type>text</type>: <screen>SELECT substr(1234, 3); ERROR: function substr(integer, integer) does not exist HINT: No function matches the given name and argument types. You might need to add explicit type casts.</screen> This does not work because <type>integer</type> does not have an implicit cast to <type>text</type>. An explicit cast will work, however: <screen>SELECT substr(CAST (1234 AS text), 3); substr -------- 34 (1 row)</screen>
ru: И если функция вызывается с аргументом типа <type>integer</type>, анализатор попытается преобразовать его в тип <type>text</type>: <screen>SELECT substr(1234, 3); ОШИБКА: функция substr(integer, integer) не существует ПОДСКАЗКА: Функция с данными именем и типами аргументов не найдена. Возможно, вам следует добавить явные преобразования типов.</screen> Этот вариант не работает, так как <type>integer</type> нельзя неявно преобразовать в <type>text</type>. Однако с явным преобразованием запрос выполняется: <screen>SELECT substr(CAST (1234 AS text), 3); substr -------- 34 (1 row)</screen>

# title
source: Value Storage
ru: Хранимое значение

source: Values to be inserted into a table are converted to the destination column's data type according to the following steps.
ru: Значения, вставляемые в таблицу, преобразуется в тип данных целевого столбца по следующему алгоритму.

source: Value Storage Type Conversion
ru: Преобразование по типу хранения

source: Check for an exact match with the target.
ru: Проверить точное совпадение с целевым типом.

source: Otherwise, try to convert the expression to the target type. This is possible if an <firstterm>assignment cast</firstterm> between the two types is registered in the <structname>pg_cast</structname> catalog (see <xref linkend="sql-createcast"/>). Alternatively, if the expression is an unknown-type literal, the contents of the literal string will be fed to the input conversion routine for the target type.
ru: Если типы не совпадают, попытаться привести тип к целевому. Это возможно, если в каталоге <structname>pg_cast</structname> (см. <xref remap="4" linkend="sql-createcast"/>) зарегистрировано <firstterm>приведение присваивания</firstterm> между двумя типами. Если же результат выражения &mdash; строка неизвестного типа, содержимое этой строки будет подано на вход процедуре ввода целевого типа.

source: Check to see if there is a sizing cast for the target type. A sizing cast is a cast from that type to itself. If one is found in the <structname>pg_cast</structname> catalog, apply it to the expression before storing into the destination column. The implementation function for such a cast always takes an extra parameter of type <type>integer</type>, which receives the destination column's <structfield>atttypmod</structfield> value (typically its declared length, although the interpretation of <structfield>atttypmod</structfield> varies for different data types), and it may take a third <type>boolean</type> parameter that says whether the cast is explicit or implicit. The cast function is responsible for applying any length-dependent semantics such as size checking or truncation.
ru: Проверить, не требуется ли приведение размера для целевого типа. Приведение размера &mdash; это преобразование типа к такому же. Если это приведение описано в каталоге <structname>pg_cast</structname>, применить к его к результату выражения, прежде чем сохранить в целевом столбце. Функция, реализующая такое приведение, всегда принимает дополнительный параметр типа <type>integer</type>, в котором передаётся значение <structfield>atttypmod</structfield> для целевого столбца (обычно это её объявленный размер, хотя интерпретироваться значение <structfield>atttypmod</structfield> для разных типов данных может по-разному), и третий параметр типа <type>boolean</type>, передающий признак явное/неявное преобразование. Функция приведения отвечает за все операции с длиной, включая её проверку и усечение данных.

source: <type>character</type> Storage Type Conversion
ru: Преобразование для типа хранения <type>character</type>

source: For a target column declared as <type>character(20)</type> the following statement shows that the stored value is sized correctly: <screen>CREATE TABLE vv (v character(20)); INSERT INTO vv SELECT 'abc' || 'def'; SELECT v, octet_length(v) FROM vv; v | octet_length ----------------------+-------------- abcdef | 20 (1 row)</screen>
ru: Следующие запросы показывают, что сохраняемое значение подгоняется под размер целевого столбца, объявленного как <type>character(20)</type>: <screen>CREATE TABLE vv (v character(20)); INSERT INTO vv SELECT 'abc' || 'def'; SELECT v, octet_length(v) FROM vv; v | octet_length ----------------------+-------------- abcdef | 20 (1 row)</screen>

source: What has really happened here is that the two unknown literals are resolved to <type>text</type> by default, allowing the <literal>||</literal> operator to be resolved as <type>text</type> concatenation. Then the <type>text</type> result of the operator is converted to <type>bpchar</type> (<quote>blank-padded char</quote>, the internal name of the <type>character</type> data type) to match the target column type. (Since the conversion from <type>text</type> to <type>bpchar</type> is binary-coercible, this conversion does not insert any real function call.) Finally, the sizing function <literal>bpchar(bpchar, integer, boolean)</literal> is found in the system catalog and applied to the operator's result and the stored column length. This type-specific function performs the required length check and addition of padding spaces.
ru: Суть происходящего здесь в том, что две константы неизвестного типа по умолчанию воспринимаются как значения <type>text</type>, что позволяет применить к ним оператор <literal>||</literal> как оператор конкатенации значений <type>text</type>. Затем результат оператора, имеющий тип <type>text</type>, приводится к типу <type>bpchar</type> (<quote>blank-padded char</quote> (символы, дополненные пробелами), внутреннее имя типа <type>character</type>) в соответствии с типом целевого столбца. (Так как типы <type>text</type> и <type>bpchar</type> двоично-совместимы, при этом преобразовании реальный вызов функции не добавляется.) Наконец, в системном каталоге находится функция изменения размера <literal>bpchar(bpchar, integer, boolean)</literal> и применяется для результата оператора и длины столбца. Эта связанная с типом функция проверяет длину данных и добавляет недостающие пробелы.

source: <literal>UNION</literal>, <literal>CASE</literal>, and Related Constructs
ru: <literal>UNION</literal>, <literal>CASE</literal> и связанные конструкции

source: <primary>UNION</primary><secondary>determination of result type</secondary>
ru: <primary>UNION</primary><secondary>определение типа результата</secondary>

source: <primary>CASE</primary><secondary>determination of result type</secondary>
ru: <primary>CASE</primary><secondary>определение типа результата</secondary>

source: <primary>ARRAY</primary><secondary>determination of result type</secondary>
ru: <primary>ARRAY</primary><secondary>определение типа результата</secondary>

source: <primary>VALUES</primary><secondary>determination of result type</secondary>
ru: <primary>VALUES</primary><secondary>определение типа результата</secondary>

source: <primary>GREATEST</primary><secondary>determination of result type</secondary>
ru: <primary>GREATEST</primary><secondary>определение типа результата</secondary>

source: <primary>LEAST</primary><secondary>determination of result type</secondary>
ru: <primary>LEAST</primary><secondary>определение типа результата</secondary>

source: SQL <literal>UNION</literal> constructs must match up possibly dissimilar types to become a single result set. The resolution algorithm is applied separately to each output column of a union query. The <literal>INTERSECT</literal> and <literal>EXCEPT</literal> constructs resolve dissimilar types in the same way as <literal>UNION</literal>. The <literal>CASE</literal>, <literal>ARRAY</literal>, <literal>VALUES</literal>, <function>GREATEST</function> and <function>LEAST</function> constructs use the identical algorithm to match up their component expressions and select a result data type.
ru: SQL-конструкция <literal>UNION</literal> взаимодействует с системой типов, так как ей приходится объединять значения возможно различных типов в единый результирующий набор. Алгоритм разрешения типов при этом применяется независимо к каждому отдельному столбцу запроса. Подобным образом различные типы сопоставляются при выполнении <literal>INTERSECT</literal> и <literal>EXCEPT</literal> сопоставляют различные типы подобно <literal>UNION</literal>. По такому же алгоритму сопоставляют типы выражений и определяют тип своего результата конструкции <literal>CASE</literal>, <literal>ARRAY</literal>, <literal>VALUES</literal>, <function>GREATEST</function> и <function>LEAST</function>.

source: Type Resolution for <literal>UNION</literal>, <literal>CASE</literal>, and Related Constructs
ru: Разрешение типов для <literal>UNION</literal>, <literal>CASE</literal> и связанных конструкций

source: If all inputs are of the same type, and it is not <type>unknown</type>, resolve as that type.
ru: Если все данные одного типа и это не тип <type>unknown</type>, выбрать его.

source: Somewhat like the treatment of domain inputs for operators and functions, this behavior allows a domain type to be preserved through a <literal>UNION</literal> or similar construct, so long as the user is careful to ensure that all inputs are implicitly or explicitly of that exact type. Otherwise the domain's base type will be preferred.
ru: Так же, как домены воспринимаются при выборе операторов и функций, доменные типы могут сохраняться в конструкции <literal>UNION</literal> или подобной, если пользователь позаботится о том, чтобы все входные данные приводились к этому типу явно или неявно. В противном случае предпочтение будет отдано базовому типу домена.

source: If any input is of a domain type, treat it as being of the domain's base type for all subsequent steps. <placeholder-1/>
ru: Если тип данных &mdash; домен, далее считать их типом базовый тип домена. <placeholder-1/>

source: If all inputs are of type <type>unknown</type>, resolve as type <type>text</type> (the preferred type of the string category). Otherwise, <type>unknown</type> inputs are ignored.
ru: Если все данные типа <type>unknown</type>, выбрать для результата тип <type>text</type> (предпочитаемый для категории string). В противном случае игнорировать значения <type>unknown</type>.

source: If the non-unknown inputs are not all of the same type category, fail.
ru: Если известные типы входных данных оказываются не из одной категории, констатировать неудачу.

source: Choose the first non-unknown input type which is a preferred type in that category, if there is one.
ru: Выбрать первый известный предпочитаемый тип из этой категории, если такой есть.

source: Otherwise, choose the last non-unknown input type that allows all the preceding non-unknown inputs to be implicitly converted to it. (There always is such a type, since at least the first type in the list must satisfy this condition.)
ru: В противном случае выбрать последний известный тип, в который можно неявно преобразовать все данные предшествующих известных типов. (Такой тип есть всегда, в крайнем случае этому условию удовлетворяет первый тип.)

source: Convert all inputs to the selected type. Fail if there is not a conversion from a given input to the selected type.
ru: Привести все данные к выбранном типу. Констатировать неудачу, если для каких-либо данных преобразование в этот тип невозможно.

source: Type Resolution with Underspecified Types in a Union
ru: Разрешение типов с частичным определением в Union

source: <screen>SELECT text 'a' AS "text" UNION SELECT 'b'; text ------ a b (2 rows)</screen> Here, the unknown-type literal <literal>'b'</literal> will be resolved to type <type>text</type>.
ru: <screen>SELECT text 'a' AS "text" UNION SELECT 'b'; text ------ a b (2 rows)</screen> В данном случае константа <literal>'b'</literal> неизвестного типа будет преобразована в тип <type>text</type>.

source: Type Resolution in a Simple Union
ru: Разрешение типов в простом объединении

source: <screen>SELECT 1.2 AS "numeric" UNION SELECT 1; numeric --------- 1 1.2 (2 rows)</screen> The literal <literal>1.2</literal> is of type <type>numeric</type>, and the <type>integer</type> value <literal>1</literal> can be cast implicitly to <type>numeric</type>, so that type is used.
ru: <screen>SELECT 1.2 AS "numeric" UNION SELECT 1; numeric --------- 1 1.2 (2 rows)</screen> Константа <literal>1.2</literal> имеет тип <type>numeric</type> и целочисленное значение <literal>1</literal> может быть неявно приведено к типу <type>numeric</type>, так что используется этот тип.

source: Type Resolution in a Transposed Union
ru: Разрешение типов в противоположном объединении

source: <screen>SELECT 1 AS "real" UNION SELECT CAST('2.2' AS REAL); real ------ 1 2.2 (2 rows)</screen> Here, since type <type>real</type> cannot be implicitly cast to <type>integer</type>, but <type>integer</type> can be implicitly cast to <type>real</type>, the union result type is resolved as <type>real</type>.
ru: <screen>SELECT 1 AS "real" UNION SELECT CAST('2.2' AS REAL); real ------ 1 2.2 (2 rows)</screen> Здесь значение типа <type>real</type> нельзя неявно привести к <type>integer</type>, но <type>integer</type> можно неявно привести к <type>real</type>, поэтому типом результата объединения будет <type>real</type>.
