Repository: pluzanov/pg-doc-ru
Catalog: 9.6/typeconv.po
Languages: ru

source: An example with one unspecified argument: <screen>SELECT text 'abc' || 'def' AS "text and unknown"; text and unknown ------------------ abcdef (1 row)</screen>
ru: Пример с одним неопределённым аргументом: <screen>SELECT text 'abc' || 'def' AS "text and unknown"; text and unknown ------------------ abcdef (1 row)</screen>

source: In this case the parser looks to see if there is an operator taking <type>text</type> for both arguments. Since there is, it assumes that the second argument should be interpreted as type <type>text</type>.
ru: В этом случае анализатор смотрит, есть ли оператор, у которого оба аргумента имеют тип <type>text</type>. Такой оператор находится, поэтому предполагается, что второй аргумент следует воспринимать как аргумент типа <type>text</type>.

source: Here is a concatenation of two values of unspecified types: <screen>SELECT 'abc' || 'def' AS "unspecified"; unspecified ------------- abcdef (1 row)</screen>
ru: Конкатенация двух значений неопределённых типов: <screen>SELECT 'abc' || 'def' AS "unspecified"; unspecified ------------- abcdef (1 row)</screen>

source: In this case there is no initial hint for which type to use, since no types are specified in the query. So, the parser looks for all candidate operators and finds that there are candidates accepting both string-category and bit-string-category inputs. Since string category is preferred when available, that category is selected, and then the preferred type for strings, <type>text</type>, is used as the specific type to resolve the unknown-type literals as.
ru: В данном случае нет подсказки для выбора типа, так как в данном запросе никакие типы не указаны. Поэтому анализатор просматривает все возможные операторы и находит в них кандидаты, принимающие аргументы категорий string и bit-string. Так как категория string является предпочтительной, выбирается она, а затем для разрешения типа не типизированной константы выбирается предпочтительный тип этой категории, <type>text</type>.

source: Absolute-Value and Negation Operator Type Resolution
ru: Разрешение оператора абсолютного значения и отрицания

source: The <productname>PostgreSQL</productname> operator catalog has several entries for the prefix operator <literal>@</literal>, all of which implement absolute-value operations for various numeric data types. One of these entries is for type <type>float8</type>, which is the preferred type in the numeric category. Therefore, <productname>PostgreSQL</productname> will use that entry when faced with an <type>unknown</type> input: <screen>SELECT @ '-4.5' AS "abs"; abs ----- 4.5 (1 row)</screen> Here the system has implicitly resolved the unknown-type literal as type <type>float8</type> before applying the chosen operator. We can verify that <type>float8</type> and not some other type was used: <screen>SELECT @ '-4.5e500' AS "abs"; ERROR: "-4.5e500" is out of range for type double precision</screen>
ru: В каталоге операторов <productname>PostgreSQL</productname> для префиксного оператора <literal>@</literal> есть несколько записей, описывающих операции получения абсолютного значения для различных числовых типов данных. Одна из записей соответствует типу <type>float8</type>, предпочтительного в категории числовых типов. Таким образом, столкнувшись со значением типа <type>unknown</type>, <productname>PostgreSQL</productname> выберет эту запись: <screen>SELECT @ '-4.5' AS "abs"; abs ----- 4.5 (1 row)</screen> Здесь система неявно привела константу неизвестного типа к типу <type>float8</type>, прежде чем применять выбранный оператор. Можно убедиться в том, что выбран именно тип <type>float8</type>, а не какой-то другой: <screen>SELECT @ '-4.5e500' AS "abs"; ОШИБКА: "-4.5e500" вне диапазона для типа double precision</screen>

source: On the other hand, the prefix operator <literal>~</literal> (bitwise negation) is defined only for integer data types, not for <type>float8</type>. So, if we try a similar case with <literal>~</literal>, we get: <screen>SELECT ~ '20' AS "negation"; ERROR: operator is not unique: ~ "unknown" HINT: Could not choose a best candidate operator. You might need to add explicit type casts.</screen> This happens because the system cannot decide which of the several possible <literal>~</literal> operators should be preferred. We can help it out with an explicit cast: <screen>SELECT ~ CAST('20' AS int8) AS "negation"; negation ---------- -21 (1 row)</screen>
ru: С другой стороны, префиксный оператор <literal>~</literal> (побитовое отрицание) определён только для целочисленных типов данных, но не для <type>float8</type>. Поэтому, если попытаться выполнить похожий запрос с <literal>~</literal>, мы получаем: <screen>SELECT ~ '20' AS "negation"; ОШИБКА: оператор не уникален: ~ "unknown" ПОДСКАЗКА: Не удалось выбрать лучшую кандидатуру оператора. Возможно, вам следует добавить явные преобразования типов.</screen> Это происходит оттого, что система не может решить, какой оператор предпочесть из нескольких возможных вариантов <literal>~</literal>. Мы можем облегчить её задачу, добавив явное преобразование: <screen>SELECT ~ CAST('20' AS int8) AS "negation"; negation ---------- -21 (1 row)</screen>

source: Array Inclusion Operator Type Resolution
ru: Разрешение оператора включения в массив

source: Here is another example of resolving an operator with one known and one unknown input: <screen>SELECT array[1,2] &lt;@ '{1,2,3}' as "is subset"; is subset ----------- t (1 row)</screen> The <productname>PostgreSQL</productname> operator catalog has several entries for the infix operator <literal>&lt;@</literal>, but the only two that could possibly accept an integer array on the left-hand side are array inclusion (<type>anyarray</type> <literal>&lt;@</literal> <type>anyarray</type>) and range inclusion (<type>anyelement</type> <literal>&lt;@</literal> <type>anyrange</type>). Since none of these polymorphic pseudo-types (see <xref linkend="datatype-pseudo"/>) are considered preferred, the parser cannot resolve the ambiguity on that basis. However, <xref linkend="op-resol-last-unknown"/> tells it to assume that the unknown-type literal is of the same type as the other input, that is, integer array. Now only one of the two operators can match, so array inclusion is selected. (Had range inclusion been selected, we would have gotten an error, because the string does not have the right format to be a range literal.)
ru: Ещё один пример разрешения оператора с одним аргументом известного типа и другим неизвестного: <screen>SELECT array[1,2] &lt;@ '{1,2,3}' as "is subset"; is subset ----------- t (1 row)</screen> В каталоге операторов <productname>PostgreSQL</productname> есть несколько записей для инфиксного оператора <literal>&lt;@</literal>, но только два из них могут принять целочисленный массива слева: оператор включения массива (<type>anyarray</type><literal>&lt;@</literal><type>anyarray</type>) и оператор включения диапазона (<type>anyelement</type><literal>&lt;@</literal><type>anyrange</type>). Так как ни один из этих полиморфных псевдотипов (см. <xref remap="4" linkend="datatype-pseudo"/>) не считается предпочтительным, анализатор не может избавиться от неоднозначности на данном этапе. Однако, в <xref remap="6" linkend="op-resol-last-unknown"/> говорится, что константа неизвестного типа должна рассматриваться как значение типа другого аргумента, в данном случае это целочисленный массив. После этого подходящим считается только один из двух операторов, так что выбирается оператор с целочисленными массивами. (Если бы был выбран оператор включения диапазона, мы получили бы ошибку, так как значение в строке не соответствует формату значений диапазона.)

source: Custom Operator on a Domain Type
ru: Нестандартный оператор с доменом

source: Users sometimes try to declare operators applying just to a domain type. This is possible but is not nearly as useful as it might seem, because the operator resolution rules are designed to select operators applying to the domain's base type. As an example consider <screen>CREATE DOMAIN mytext AS text CHECK(...); CREATE FUNCTION mytext_eq_text (mytext, text) RETURNS boolean AS ...; CREATE OPERATOR = (procedure=mytext_eq_text, leftarg=mytext, rightarg=text); CREATE TABLE mytable (val mytext); SELECT * FROM mytable WHERE val = 'foo';</screen> This query will not use the custom operator. The parser will first see if there is a <type>mytext</type> <literal>=</literal> <type>mytext</type> operator (<xref linkend="op-resol-exact-unknown"/>), which there is not; then it will consider the domain's base type <type>text</type>, and see if there is a <type>text</type> <literal>=</literal> <type>text</type> operator (<xref linkend="op-resol-exact-domain"/>), which there is; so it resolves the <type>unknown</type>-type literal as <type>text</type> and uses the <type>text</type> <literal>=</literal> <type>text</type> operator. The only way to get the custom operator to be used is to explicitly cast the literal: <screen>SELECT * FROM mytable WHERE val = text 'foo';</screen> so that the <type>mytext</type> <literal>=</literal> <type>text</type> operator is found immediately according to the exact-match rule. If the best-match rules are reached, they actively discriminate against operators on domain types. If they did not, such an operator would create too many ambiguous-operator failures, because the casting rules always consider a domain as castable to or from its base type, and so the domain operator would be considered usable in all the same cases as a similarly-named operator on the base type.
ru: Иногда пользователи пытаются ввести операторы, применимые только к определённому домену. Это возможно, но вовсе не так полезно, как может показаться, ведь правила разрешения операторов применяются к базовому типу домена. Взгляните на этот пример: <screen>CREATE DOMAIN mytext AS text CHECK(...); CREATE FUNCTION mytext_eq_text (mytext, text) RETURNS boolean AS ...; CREATE OPERATOR = (procedure=mytext_eq_text, leftarg=mytext, rightarg=text); CREATE TABLE mytable (val mytext); SELECT * FROM mytable WHERE val = 'foo';</screen> В этом запросе не будет использоваться нововведённый оператор. При разборе запроса сначала будет проверено, есть ли оператор <type>mytext</type> <literal>=</literal> <type>mytext</type> (см. <xref remap="4" linkend="op-resol-exact-unknown"/>), но это не так; затем будет рассмотрен базовый тип домена (<type>text</type>) и проверено наличие оператора <type>text</type> <literal>=</literal> <type>text</type> (см. <xref remap="4" linkend="op-resol-exact-domain"/>), и таковой действительно есть; в итоге строковое значение типа <type>unknown</type> будет воспринято как <type>text</type> и будет применён оператор <type>text</type> <literal>=</literal> <type>text</type>. Единственный вариант задействовать нововведённый оператор &mdash; добавить явное приведение: <screen>SELECT * FROM mytable WHERE val = text 'foo';</screen> так, чтобы оператор <type>mytext</type> <literal>=</literal> <type>text</type> был найден сразу, согласно правилу точного совпадения. Если дело доходит до правил наибольшего соответствия, они активно дискредитируют операторы доменных типов. Если бы они этого не делали, с таким оператором возникало бы слишком много ошибок разрешения операторов, потому что правила приведения всегда считают домен приводимым к базовому типу и наоборот, так что доменный оператор применялся бы во всех случаях, где применяется одноимённый оператор с базовым типом.

source: Functions
ru: Функции

source: <primary>function</primary><secondary>type resolution in an invocation</secondary>
ru: <primary>функции</primary><secondary>разрешение типов при вызове</secondary>

source: The specific function that is referenced by a function call is determined using the following procedure.
ru: При выборе конкретной функции, задействованной в выражении, <productname>PostgreSQL</productname> следует описанному ниже алгоритму.

source: Function Type Resolution
ru: Разрешение функции по типу

source: Select the functions to be considered from the <classname>pg_proc</classname> system catalog. If a non-schema-qualified function name was used, the functions considered are those with the matching name and argument count that are visible in the current search path (see <xref linkend="ddl-schemas-path"/>). If a qualified function name was given, only functions in the specified schema are considered.
ru: Выбрать функции для рассмотрения из системного каталога <classname>pg_proc</classname>. Если имя функции не дополнено именем схемы, будут рассматриваться все функции с подходящим именем и числом аргументов, видимые в текущем пути поиска (см. <xref remap="4" linkend="ddl-schemas-path"/>). Если имя функции определено полностью, в рассмотрение принимаются только функции из указанной схемы.

source: If the search path finds multiple functions of identical argument types, only the one appearing earliest in the path is considered. Functions of different argument types are considered on an equal footing regardless of search path position.
ru: Если в пути поиска оказывается несколько функций с одинаковыми типами аргументов, учитываются только те из них, которые находятся в пути раньше. Функции с разными типами аргументов рассматриваются на равных правах вне зависимости от их положения в пути поиска.

source: If a function is declared with a <literal>VARIADIC</literal> array parameter, and the call does not use the <literal>VARIADIC</literal> keyword, then the function is treated as if the array parameter were replaced by one or more occurrences of its element type, as needed to match the call. After such expansion the function might have effective argument types identical to some non-variadic function. In that case the function appearing earlier in the search path is used, or if the two functions are in the same schema, the non-variadic one is preferred.
ru: Если в числе параметров функции есть массив <literal>VARIADIC</literal> и при вызове не указывается ключевое слово <literal>VARIADIC</literal>, функция обрабатывается, как если бы этот параметр был заменён одним или несколькими параметрами типа элементов массива, по числу аргументов при вызове. После такого расширения по фактическим типам аргументов она может совпасть с некоторой функцией с постоянным числом аргументов. В этом случае используется функция, которая находится в пути раньше, а если они оказываются в одной схеме, предпочитается вариант с постоянными аргументами.

source: Functions that have default values for parameters are considered to match any call that omits zero or more of the defaultable parameter positions. If more than one such function matches a call, the one appearing earliest in the search path is used. If there are two or more such functions in the same schema with identical parameter types in the non-defaulted positions (which is possible if they have different sets of defaultable parameters), the system will not be able to determine which to prefer, and so an <quote>ambiguous function call</quote> error will result if no better match to the call can be found.
ru: Функции, для которых определены значения параметров по умолчанию, считаются совпадающими с вызовом, в котором опущено ноль или более параметров в соответствующих позициях. Если для вызова подходят несколько функций, используется та, что обнаруживается в пути поиска раньше. Если в одной схеме оказываются несколько функций с одинаковыми типами в позициях обязательных параметров (что возможно, если в них определены разные наборы пропускаемых параметров), система не сможет выбрать оптимальную, и выдаст ошибку <quote>неоднозначный вызов функции</quote>, если лучшее соответствие для вызова не будет найдено.

source: Check for a function accepting exactly the input argument types. If one exists (there can be only one exact match in the set of functions considered), use it. (Cases involving <type>unknown</type> will never find a match at this step.)
ru: Проверить, нет ли среди них функций с точно совпадающими типами аргументов. Если такая функция есть (она может быть только одной в отобранном ранее наборе), использовать её. (В случаях с типами <type>unknown</type> функция не будет выбрана на этом шаге.)

source: The reason for this step is to support function-style cast specifications in cases where there is not an actual cast function. If there is a cast function, it is conventionally named after its output type, and so there is no need to have a special case. See <xref linkend="sql-createcast"/> for additional commentary.
ru: Этот шаг нужен для поддержки приведений типов в стиле вызова функции, когда на самом деле соответствующей функции приведения нет. Если такая функция приведения есть, она обычно называется именем выходного типа и необходимости в особом подходе нет. За дополнительными комментариями обратитесь к <xref remap="3" linkend="sql-createcast"/>.

source: If no exact match is found, see if the function call appears to be a special type conversion request. This happens if the function call has just one argument and the function name is the same as the (internal) name of some data type. Furthermore, the function argument must be either an unknown-type literal, or a type that is binary-coercible to the named data type, or a type that could be converted to the named data type by applying that type's I/O functions (that is, the conversion is either to or from one of the standard string types). When these conditions are met, the function call is treated as a form of <literal>CAST</literal> specification. <placeholder-1/>
ru: Если точное совпадение не найдено, проверить, не похож ли вызов функции на особую форму преобразования типов. Это имеет место, когда при вызове функции передаётся всего один аргумент и имя функции совпадает с именем (внутренним) некоторого типа данных. Более того, аргументом функции должна быть либо строка неопределённого типа, либо значение типа, двоично-совместимого с указанным или приводимого к нему с помощью функций ввода/вывода типа (то есть, преобразований в стандартный строковый тип и обратно). Если эти условия выполняются, вызов функции воспринимается как особая форма конструкции <literal>CAST</literal>. <placeholder-1/>

source: Discard candidate functions for which the input types do not match and cannot be converted (using an implicit conversion) to match. <type>unknown</type> literals are assumed to be convertible to anything for this purpose. If only one candidate remains, use it; else continue to the next step.
ru: Отбросить кандидаты, для которых входные типы не совпадают и не могут быть преобразованы (неявным образом) так, чтобы они совпали. В данном случае считается, что константы типа <type>unknown</type> можно преобразовать во что угодно. Если остаётся только один кандидат, использовать его, в противном случае перейти к следующему шагу.

source: If any input argument is of a domain type, treat it as being of the domain's base type for all subsequent steps. This ensures that domains act like their base types for purposes of ambiguous-function resolution.
ru: Если один из аргументов имеет тип домен, далее считать его типом базовый тип домена. Благодаря этому при поиске неоднозначно заданной функции домены будут подобны свои базовым типам.

source: Note that the <quote>best match</quote> rules are identical for operator and function type resolution. Some examples follow.
ru: Заметьте, что для функций действуют те же правила <quote>оптимального соответствия</quote>, что и для операторов. Они проиллюстрированы следующими примерами.

source: Rounding Function Argument Type Resolution
ru: Разрешение функции округления по типам аргументов

source: There is only one <function>round</function> function that takes two arguments; it takes a first argument of type <type>numeric</type> and a second argument of type <type>integer</type>. So the following query automatically converts the first argument of type <type>integer</type> to <type>numeric</type>: <screen>SELECT round(4, 4); round -------- 4.0000 (1 row)</screen> That query is actually transformed by the parser to: <screen>SELECT round(CAST (4 AS numeric), 4);</screen>
ru: В <productname>PostgreSQL</productname> есть только одна функция <function>round</function>, принимающая два аргумента: первый типа <type>numeric</type>, а второй &mdash; <type>integer</type>. Поэтому в следующем запросе первый аргумент <type>integer</type> автоматически приводится к типу <type>numeric</type>: <screen>SELECT round(4, 4); round -------- 4.0000 (1 row)</screen> Таким образом, анализатор преобразует этот запрос в: <screen>SELECT round(CAST (4 AS numeric), 4);</screen>

source: Since numeric constants with decimal points are initially assigned the type <type>numeric</type>, the following query will require no type conversion and therefore might be slightly more efficient: <screen>SELECT round(4.0, 4);</screen>
ru: Та как числовые константы с десятичными точками изначально относятся к типу <type>numeric</type>, для следующего запроса преобразование типов не потребуется, так что он немного эффективнее: <screen>SELECT round(4.0, 4);</screen>

source: Substring Function Type Resolution
ru: Разрешение функции извлечения подстроки

source: There are several <function>substr</function> functions, one of which takes types <type>text</type> and <type>integer</type>. If called with a string constant of unspecified type, the system chooses the candidate function that accepts an argument of the preferred category <literal>string</literal> (namely of type <type>text</type>). <screen>SELECT substr('1234', 3); substr -------- 34 (1 row)</screen>
ru: В <productname>PostgreSQL</productname> есть несколько вариантов функции <function>substr</function>, и один из них принимает аргументы типов <type>text</type> и <type>integer</type>. Если эта функция вызывается со строковой константой неопределённого типа, система выбирает функцию, принимающую аргумент предпочитаемой категории <literal>string</literal> (а конкретнее, типа <type>text</type>). <screen>SELECT substr('1234', 3); substr -------- 34 (1 row)</screen>

source: If the string is declared to be of type <type>varchar</type>, as might be the case if it comes from a table, then the parser will try to convert it to become <type>text</type>: <screen>SELECT substr(varchar '1234', 3); substr -------- 34 (1 row)</screen> This is transformed by the parser to effectively become: <screen>SELECT substr(CAST (varchar '1234' AS text), 3);</screen>
ru: Если текстовая строка имеет тип <type>varchar</type>, например когда данные поступают из таблицы, анализатор попытается привести её к типу <type>text</type>: <screen>SELECT substr (varchar '1234', 3); substr -------- 34 (1 row)</screen> Этот запрос анализатор фактически преобразует в: <screen>SELECT substr(CAST (varchar '1234' AS text), 3);</screen>

source: The parser learns from the <structname>pg_cast</structname> catalog that <type>text</type> and <type>varchar</type> are binary-compatible, meaning that one can be passed to a function that accepts the other without doing any physical conversion. Therefore, no type conversion call is really inserted in this case.
ru: Анализатор узнаёт из каталога <structname>pg_cast</structname>, что типы <type>text</type> и <type>varchar</type> двоично-совместимы, что означает, что один тип можно передать функции, принимающей другой, не выполняя физического преобразования. Таким образом, в данном случае операция преобразования на самом не добавляется.
