Repository: pluzanov/pg-doc-ru
Catalog: 9.6/unaccent.po
Languages: ru

source: <filename>unaccent</filename> is a text search dictionary that removes accents (diacritic signs) from lexemes. It's a filtering dictionary, which means its output is always passed to the next dictionary (if any), unlike the normal behavior of dictionaries. This allows accent-insensitive processing for full text search.
ru: Модуль <filename>unaccent</filename> представляет словарь текстового поиска, который убирает надстрочные (диакритические) знаки из лексем. Это фильтрующий словарь, что значит, что выводимые им данные всегда передаются следующему словарю (если он есть), в отличие от нормальных словарей. Применяя его, можно выполнить полнотекстовый поиск без учёта ударений (диакритики).

source: The current implementation of <filename>unaccent</filename> cannot be used as a normalizing dictionary for the <filename>thesaurus</filename> dictionary.
ru: Текущую реализацию <filename>unaccent</filename> нельзя использовать в качестве нормализующего словаря для словаря <filename>thesaurus</filename>.

source: Configuration
ru: Конфигурирование

source: An <literal>unaccent</literal> dictionary accepts the following options:
ru: Словарь <literal>unaccent</literal> принимает следующие параметры:

source: <literal>RULES</literal> is the base name of the file containing the list of translation rules. This file must be stored in <filename>$SHAREDIR/tsearch_data/</filename> (where <literal>$SHAREDIR</literal> means the <productname>PostgreSQL</productname> installation's shared-data directory). Its name must end in <literal>.rules</literal> (which is not to be included in the <literal>RULES</literal> parameter).
ru: Параметр <literal>RULES</literal> задаёт базовое имя файла со списком правил преобразования. Этот файл должен находиться в каталоге <filename>$SHAREDIR/tsearch_data/</filename> (где под <literal>$SHAREDIR</literal> понимается каталог с общими данными инсталляции <productname>PostgreSQL</productname>). Имя файла должно заканчиваться расширением <literal>.rules</literal> (которое не нужно указывать в параметре <literal>RULES</literal>).

source: The rules file has the following format:
ru: Файл правил имеет следующий формат:

source: Each line represents one translation rule, consisting of a character with accent followed by a character without accent. The first is translated into the second. For example, <placeholder-1/> The two characters must be separated by whitespace, and any leading or trailing whitespace on a line is ignored.
ru: Каждая строка представляет одно правило перевода, состоящее из символа с диакритикой, за которым следует символ без диакритики. Первый символ переводится во второй. Например, <placeholder-1/> Эти два символа должны разделяться пробельным символом, а любые начальные или конечные пробельные символы в этой строке игнорируются.

source: Alternatively, if only one character is given on a line, instances of that character are deleted; this is useful in languages where accents are represented by separate characters.
ru: В качестве альтернативного варианта, если в строке задан всего один символ, вхождения этого символа будут удаляться; это полезно для языков, в которых диакритика представляется отдельными символами.

source: Actually, each <quote>character</quote> can be any string not containing whitespace, so <filename>unaccent</filename> dictionaries could be used for other sorts of substring substitutions besides diacritic removal.
ru: На самом деле роль <quote>символа</quote> может играть любая строка, не содержащая пробельные символы, так что словари <filename>unaccent</filename> могут быть полезны и для другого рода замены подстрок, а не только для удаления диакритик.

source: As with other <productname>PostgreSQL</productname> text search configuration files, the rules file must be stored in UTF-8 encoding. The data is automatically translated into the current database's encoding when loaded. Any lines containing untranslatable characters are silently ignored, so that rules files can contain rules that are not applicable in the current encoding.
ru: Как и другие файлы конфигурации текстового поиска в <productname>PostgreSQL</productname>, файл правил должен иметь кодировку UTF-8. При загрузке данные из него будут автоматически преобразованы в кодировку текущей базы данных. Все строки в нём, содержащие непереводимые символы, просто игнорируются, так что файлы правил могут содержать правила, неприменимые в текущей кодировке.

source: A more complete example, which is directly useful for most European languages, can be found in <filename>unaccent.rules</filename>, which is installed in <filename>$SHAREDIR/tsearch_data/</filename> when the <filename>unaccent</filename> module is installed. This rules file translates characters with accents to the same characters without accents, and it also expands ligatures into the equivalent series of simple characters (for example, &AElig; to AE).
ru: Более полный набор правил, непосредственно пригодный для большинства европейских языков, можно найти в файле <filename>unaccent.rules</filename>, который помещается в <filename>$SHAREDIR/tsearch_data/</filename>, когда устанавливается модуль <filename>unaccent</filename>. Этот файл правил переводит буквы с диакритикой в те же буквы без диакритики, а также разворачивает лигатуры в равнозначные последовательности простых символов (например, &AElig; в AE).

source: Usage
ru: Использование

source: Installing the <literal>unaccent</literal> extension creates a text search template <literal>unaccent</literal> and a dictionary <literal>unaccent</literal> based on it. The <literal>unaccent</literal> dictionary has the default parameter setting <literal>RULES='unaccent'</literal>, which makes it immediately usable with the standard <filename>unaccent.rules</filename> file. If you wish, you can alter the parameter, for example <placeholder-1/> or create new dictionaries based on the template.
ru: При установке расширения <literal>unaccent</literal> в базе создаётся шаблон текстового поиска <literal>unaccent</literal> и словарь <literal>unaccent</literal> на его основе. Для словаря <literal>unaccent</literal> по умолчанию определяется параметр <literal>RULES='unaccent'</literal>, благодаря чему его можно сразу использовать со стандартным файлом <filename>unaccent.rules</filename>. При желании вы можете изменить этот параметр, например, так <placeholder-1/> или создать новые словари на основе этого шаблона.

source: To test the dictionary, you can try: <placeholder-1/>
ru: Протестировать этот словарь можно так: <placeholder-1/>

source: Here is an example showing how to insert the <filename>unaccent</filename> dictionary into a text search configuration: <placeholder-1/>
ru: Следующий пример показывает, как вставить словарь <filename>unaccent</filename> в конфигурацию текстового поиска: <placeholder-1/>

source: Functions
ru: Функции

source: The <function>unaccent()</function> function removes accents (diacritic signs) from a given string. Basically, it's a wrapper around <filename>unaccent</filename>-type dictionaries, but it can be used outside normal text search contexts.
ru: Функция <function>unaccent()</function> удаляет надстрочные (диакритические) знаки из заданной строки. По сути она представляет собой обёртку вокруг словарей в стиле <filename>unaccent</filename>, но может вызываться и вне обычного контекста текстового поиска.

source: dictionary
ru: словарь

source: string
ru: строка

source: If the <replaceable class="parameter">dictionary</replaceable> argument is omitted, <literal>unaccent</literal> is assumed.
ru: Если аргумент <replaceable class="parameter">словарь</replaceable> опущен, подразумевается словарь <literal>unaccent</literal>.

source: For example: <placeholder-1/>
ru: Пример: <placeholder-1/>
