Repository: pluzanov/pg-doc-ru
Catalog: 9.6/user-manag.po
Languages: ru

source: The members of a group role can use the privileges of the role in two ways. First, every member of a group can explicitly do <xref linkend="sql-set-role"/> to temporarily <quote>become</quote> the group role. In this state, the database session has access to the privileges of the group role rather than the original login role, and any database objects created are considered owned by the group role not the login role. Second, member roles that have the <literal>INHERIT</literal> attribute automatically have use of the privileges of roles of which they are members, including any privileges inherited by those roles. As an example, suppose we have done: <placeholder-1/> Immediately after connecting as role <literal>joe</literal>, a database session will have use of privileges granted directly to <literal>joe</literal> plus any privileges granted to <literal>admin</literal>, because <literal>joe</literal> <quote>inherits</quote> <literal>admin</literal>'s privileges. However, privileges granted to <literal>wheel</literal> are not available, because even though <literal>joe</literal> is indirectly a member of <literal>wheel</literal>, the membership is via <literal>admin</literal> which has the <literal>NOINHERIT</literal> attribute. After: <placeholder-2/> the session would have use of only those privileges granted to <literal>admin</literal>, and not those granted to <literal>joe</literal>. After: <placeholder-3/> the session would have use of only those privileges granted to <literal>wheel</literal>, and not those granted to either <literal>joe</literal> or <literal>admin</literal>. The original privilege state can be restored with any of: <placeholder-4/>
ru: Члены групповой роли могут использовать её привилегии двумя способами. Во-первых, каждый член группы может явно выполнить <xref linkend="sql-set-role"/>, чтобы временно <quote>стать</quote> групповой ролью. В этом состоянии, сессия базы данных использует полномочия групповой роли, вместо оригинальной роли, под которой был выполнен вход в систему. При этом для всех создаваемых объектов базы данных владельцем считается групповая, а не оригинальная роль. Во-вторых, роли, имеющие атрибут <literal>INHERIT</literal>, автоматически используют привилегии всех ролей, членами которых они являются, в том числе и унаследованными этими ролями привилегиями. Например: <placeholder-1/> После подключения с ролью <literal>joe</literal>, сессия базы данных будет использовать полномочия выданные напрямую <literal>joe</literal> и привилегии выданные <literal>admin</literal>, так как <literal>joe</literal> "наследует" привилегии <literal>admin</literal>. Однако привилегии выданные <literal>wheel</literal> не будут доступны, потому что, хотя <literal>joe</literal> неявно и является членом <literal>wheel</literal>, это членство получено через роль <literal>admin</literal>, которая имеет атрибут <literal>NOINHERIT</literal>. После выполнения команды: <placeholder-2/> сессия будет использовать только привилегии выданные <literal>admin</literal>, привилегии выданные <literal>joe</literal> не будут доступны. После выполнения команды: <placeholder-3/> сессия будет использовать только привилегии выданные <literal>wheel</literal>, привилегии <literal>joe</literal> и <literal>admin</literal> не будут доступны. Начальный набор привилегий можно вернуть любой из команд: <placeholder-4/>

source: The <command>SET ROLE</command> command always allows selecting any role that the original login role is directly or indirectly a member of. Thus, in the above example, it is not necessary to become <literal>admin</literal> before becoming <literal>wheel</literal>.
ru: Команда <command>SET ROLE</command> в любой момент разрешает выбрать любую роль, прямым или косвенным членом которой является оригинальная роль, под которой был выполнен вход в систему. Поэтому, в примере выше, не обязательно сначала становиться <literal>admin</literal>, перед тем как стать <literal>wheel</literal>.

source: In the SQL standard, there is a clear distinction between users and roles, and users do not automatically inherit privileges while roles do. This behavior can be obtained in <productname>PostgreSQL</productname> by giving roles being used as SQL roles the <literal>INHERIT</literal> attribute, while giving roles being used as SQL users the <literal>NOINHERIT</literal> attribute. However, <productname>PostgreSQL</productname> defaults to giving all roles the <literal>INHERIT</literal> attribute, for backward compatibility with pre-8.1 releases in which users always had use of permissions granted to groups they were members of.
ru: В стандарте SQL есть чёткое различие между пользователями и ролями. При этом пользователи не наследуют автоматически привилегии, а роли наследуют автоматически. Такое поведение может быть получено в <productname>PostgreSQL</productname>, если для ролей, используемых как роли в стандарте SQL, устанавливать атрибут <literal>INHERIT</literal>, а для ролей, используемых как пользователи в стандарте SQL, устанавливать атрибут <literal>NOINHERIT</literal>. Однако, в <productname>PostgreSQL</productname> все роли по умолчанию имеют атрибут <literal>INHERIT</literal>. Это сделано для обратной совместимости с версиями предшествующими 8.1, в которых пользователи всегда могли использовать привилегии групп, членами которых они являются.

source: The role attributes <literal>LOGIN</literal>, <literal>SUPERUSER</literal>, <literal>CREATEDB</literal>, and <literal>CREATEROLE</literal> can be thought of as special privileges, but they are never inherited as ordinary privileges on database objects are. You must actually <command>SET ROLE</command> to a specific role having one of these attributes in order to make use of the attribute. Continuing the above example, we might choose to grant <literal>CREATEDB</literal> and <literal>CREATEROLE</literal> to the <literal>admin</literal> role. Then a session connecting as role <literal>joe</literal> would not have these privileges immediately, only after doing <command>SET ROLE admin</command>.
ru: Атрибуты роли <literal>LOGIN</literal>, <literal>SUPERUSER</literal>, <literal>CREATEDB</literal> и <literal>CREATEROLE</literal> можно рассматривать как особые привилегии, но они никогда не наследуются, как обычные привилегии на объекты базы данных. Необходимо через <command>SET ROLE</command> установить роль, имеющую один из этих атрибутов, чтобы им воспользоваться. Продолжая предыдущий пример, можно установить атрибуты <literal>CREATEDB</literal> и <literal>CREATEROLE</literal> для роли <literal>admin</literal>. Затем при входе с ролью <literal>joe</literal>, получить доступ к этим привилегиям будет возможно только после выполнения <command>SET ROLE admin</command>.

source: To destroy a group role, use <xref linkend="sql-droprole"/>: <synopsis>DROP ROLE <replaceable>name</replaceable>;</synopsis> Any memberships in the group role are automatically revoked (but the member roles are not otherwise affected).
ru: Для удаления групповой роли используется <xref linkend="sql-droprole"/>: <synopsis>DROP ROLE <replaceable>имя</replaceable>;</synopsis> Любое членство в групповой роли будет автоматически отозвано (в остальном на членов этой роли это никак не повлияет).

source: Dropping Roles
ru: Удаление ролей

source: Because roles can own database objects and can hold privileges to access other objects, dropping a role is often not just a matter of a quick <xref linkend="sql-droprole"/>. Any objects owned by the role must first be dropped or reassigned to other owners; and any permissions granted to the role must be revoked.
ru: Так как роли могут владеть объектами баз данных и иметь права доступа к объектам других, удаление роли не сводится к немедленному действию <xref linkend="sql-droprole"/>. Сначала должны быть удалены и переданы другим владельцами все объекты, принадлежащие роли; также должны быть отозваны все права, данные роли.

source: Ownership of objects can be transferred one at a time using <command>ALTER</command> commands, for example: <placeholder-1/> Alternatively, the <xref linkend="sql-reassign-owned"/> command can be used to reassign ownership of all objects owned by the role-to-be-dropped to a single other role. Because <command>REASSIGN OWNED</command> cannot access objects in other databases, it is necessary to run it in each database that contains objects owned by the role. (Note that the first such <command>REASSIGN OWNED</command> will change the ownership of any shared-across-databases objects, that is databases or tablespaces, that are owned by the role-to-be-dropped.)
ru: Владение объектами можно передавать в индивидуальном порядке, применяя команду <command>ALTER</command>, например: <placeholder-1/> Кроме того, для переназначения какой-либо другой роли владения сразу всеми объектами, принадлежащих удаляемой роли, можно применить команду <xref linkend="sql-reassign-owned"/>. Так как <command>REASSIGN OWNED</command> не может обращаться к объектам в других базах данных, её необходимо выполнить в каждой базе, которая содержит объекты, принадлежащие этой роли. (Заметьте, что первая такая команда <command>REASSIGN OWNED</command> изменит владельца для всех разделяемых между базами объектов, то есть для баз данных или табличных пространств, принадлежащих удаляемой роли.)

source: Once any valuable objects have been transferred to new owners, any remaining objects owned by the role-to-be-dropped can be dropped with the <xref linkend="sql-drop-owned"/> command. Again, this command cannot access objects in other databases, so it is necessary to run it in each database that contains objects owned by the role. Also, <command>DROP OWNED</command> will not drop entire databases or tablespaces, so it is necessary to do that manually if the role owns any databases or tablespaces that have not been transferred to new owners.
ru: После того, как все ценные объекты будут переданы новым владельцам, все оставшиеся объекты, принадлежащие удаляемой роли, могут быть удалены с помощью команды <xref linkend="sql-drop-owned"/>. И эта команда не может обращаться к объектам в других базах данных, так что её нужно запускать в каждой базе, которая содержит объекты, принадлежащие роли. Также заметьте, что <command>DROP OWNED</command> не удаляет табличные пространства или базы данных целиком, так что это необходимо сделать вручную, если роли принадлежат базы или табличные пространства, не переданные новым владельцам.

source: <command>DROP OWNED</command> also takes care of removing any privileges granted to the target role for objects that do not belong to it. Because <command>REASSIGN OWNED</command> does not touch such objects, it's typically necessary to run both <command>REASSIGN OWNED</command> and <command>DROP OWNED</command> (in that order!) to fully remove the dependencies of a role to be dropped.
ru: <command>DROP OWNED</command> также удаляет все права, которые даны целевой роли для объектов, не принадлежащих ей. Так как <command>REASSIGN OWNED</command> такие объекты не затрагивает, обычно необходимо запустить и <command>REASSIGN OWNED</command>, и <command>DROP OWNED</command> (в этом порядке!), чтобы полностью ликвидировать зависимости удаляемой роли.

source: In short then, the most general recipe for removing a role that has been used to own objects is:
ru: С учётом этого, общий рецепт удаления роли, которая владела объектами, вкратце таков:

source: REASSIGN OWNED BY doomed_role TO successor_role; DROP OWNED BY doomed_role; -- repeat the above commands in each database of the cluster DROP ROLE doomed_role;
ru: REASSIGN OWNED BY doomed_role TO successor_role; DROP OWNED BY doomed_role; -- повторить предыдущие команды для каждой базы в кластере DROP ROLE doomed_role;

source: When not all owned objects are to be transferred to the same successor owner, it's best to handle the exceptions manually and then perform the above steps to mop up.
ru: Когда не все объекты нужно передать одному новому владельцу, лучше сначала вручную отработать исключения, а в завершение выполнить показанные выше действия.

source: If <command>DROP ROLE</command> is attempted while dependent objects still remain, it will issue messages identifying which objects need to be reassigned or dropped.
ru: При попытке выполнить <command>DROP ROLE</command> для роли, у которой сохраняются зависимые объекты, будут выданы сообщения, говорящие, какие объекты нужно передать другому владельцу или удалить.

source: Default Roles
ru: Предопределённые роли

source: <productname>PostgreSQL</productname> provides a set of default roles which provide access to certain, commonly needed, privileged capabilities and information. Administrators can GRANT these roles to users and/or other roles in their environment, providing those users with access to the specified capabilities and information.
ru: В <productname>PostgreSQL</productname> имеется набор предопределённых ролей, которые дают доступ к некоторым часто востребованным, но не общедоступным функциям и данным. Администраторы могут назначать (GRANT) эти роли пользователям и/или ролям в своей среде, таким образом открывая этим пользователям доступ к указанной функциональности и информации.

source: The default roles are described in <xref linkend="default-roles-table"/>. Note that the specific permissions for each of the default roles may change in the future as additional capabilities are added. Administrators should monitor the release notes for changes.
ru: Имеющиеся предопределённые роли описаны в <xref remap="6" linkend="default-roles-table"/>. Заметьте, что конкретные разрешения для каждой из предопределённых ролей в будущем могут изменяться по мере добавления дополнительной функциональности. Администраторы должны следить за этими изменениями, просматривая замечания к выпускам.

source: Role
ru: Роль

source: Allowed Access
ru: Разрешаемый доступ

source: Send signals to other backends (eg: cancel query, terminate).
ru: Передавать сигналы другим обслуживающим процессам (например, отменять запрос, завершать процесс).

source: Administrators can grant access to these roles to users using the GRANT command: <placeholder-1/>
ru: Администраторы могут давать пользователям доступ к этим ролям, используя команду GRANT: <placeholder-1/>

source: Function and Trigger Security
ru: Безопасность функций и триггеров

source: Functions and triggers allow users to insert code into the backend server that other users might execute unintentionally. Hence, both mechanisms permit users to <quote>Trojan horse</quote> others with relative ease. The only real protection is tight control over who can define functions.
ru: Функции и триггеры дают возможность пользователям добавить на сервер программный код, который другие пользователи могут непреднамеренно выполнить. Таким образом, оба механизма позволяют относительно легко атаковать других пользователей, внедряя <quote>троянских коней</quote>. Единственной реальной защитой может быть жёсткое ограничение круга лиц, имеющих право создавать функции.

source: Functions run inside the backend server process with the operating system permissions of the database server daemon. If the programming language used for the function allows unchecked memory accesses, it is possible to change the server's internal data structures. Hence, among many other things, such functions can circumvent any system access controls. Function languages that allow such access are considered <quote>untrusted</quote>, and <productname>PostgreSQL</productname> allows only superusers to create functions written in those languages.
ru: Функции выполняются внутри серверного процесса с полномочиями пользователя операционной системы, запускающего сервер базы данных. Если используемый для функций язык программирования разрешает неконтролируемый доступ к памяти, то это даёт возможность изменить внутренние структуры данных сервера. Таким образом, помимо всего прочего, такие функции могут обойти ограничения доступа к системе. Языки программирования, допускающие такой доступ, считаются <quote>недоверенными</quote> и создавать функции на этих языках <productname>PostgreSQL</productname> разрешает только суперпользователям.
