Repository: pluzanov/pg-doc-ru
Catalog: 9.6/user-manag.po
Languages: ru

source: Database Roles
ru: Роли базы данных

source: <productname>PostgreSQL</productname> manages database access permissions using the concept of <firstterm>roles</firstterm>. A role can be thought of as either a database user, or a group of database users, depending on how the role is set up. Roles can own database objects (for example, tables and functions) and can assign privileges on those objects to other roles to control who has access to which objects. Furthermore, it is possible to grant <firstterm>membership</firstterm> in a role to another role, thus allowing the member role to use privileges assigned to another role.
ru: <productname>PostgreSQL</productname> использует концепцию ролей (<firstterm>roles</firstterm>) для управления разрешениями на доступ к базе данных. Роль можно рассматривать как пользователя базы данных или как группу пользователей, в зависимости от того, как роль настроена. Роли могут владеть объектами базы данных (например, таблицами и функциями) и выдавать другим ролям разрешения на доступ к этим объектам, управляя тем, кто имеет доступ и к каким объектам. Кроме того, можно предоставить одной роли <firstterm>членство</firstterm> в другой роли, таким образом одна роль может использовать привилегии других ролей.

source: The concept of roles subsumes the concepts of <quote>users</quote> and <quote>groups</quote>. In <productname>PostgreSQL</productname> versions before 8.1, users and groups were distinct kinds of entities, but now there are only roles. Any role can act as a user, a group, or both.
ru: Концепция ролей включает в себя концепцию пользователей (<quote>users</quote>) и групп (<quote>groups</quote>). До версии 8.1 в <productname>PostgreSQL</productname> пользователи и группы были отдельными сущностями, но теперь есть только роли. Любая роль может использоваться в качестве пользователя, группы, и того и другого.

source: This chapter describes how to create and manage roles. More information about the effects of role privileges on various database objects can be found in <xref linkend="ddl-priv"/>.
ru: В этой главе описывается как создавать и управлять ролями. Дополнительную информацию о привилегиях для ролей на различные объекты базы данных можно найти в <xref remap="6" linkend="ddl-priv"/>.

source: <primary>role</primary>
ru: <primary>роль</primary>

source: <primary>user</primary>
ru: <primary>пользователь</primary>

source: Database roles are conceptually completely separate from operating system users. In practice it might be convenient to maintain a correspondence, but this is not required. Database roles are global across a database cluster installation (and not per individual database). To create a role use the <xref linkend="sql-createrole"/> SQL command: <synopsis>CREATE ROLE <replaceable>name</replaceable>;</synopsis> <replaceable>name</replaceable> follows the rules for SQL identifiers: either unadorned without special characters, or double-quoted. (In practice, you will usually want to add additional options, such as <literal>LOGIN</literal>, to the command. More details appear below.) To remove an existing role, use the analogous <xref linkend="sql-droprole"/> command: <synopsis>DROP ROLE <replaceable>name</replaceable>;</synopsis>
ru: Роли базы данных концептуально полностью отличаются от пользователей операционной системы. На практике поддержание соответствия между ними может быть удобным, но не является обязательным. Роли базы данных являются глобальными для всей установки кластера базы данных (не для отдельной базы данных). Для создания роли используется команда SQL <xref linkend="sql-createrole"/>: <synopsis>CREATE ROLE <replaceable>name</replaceable>;</synopsis> <replaceable>name</replaceable> соответствует правилам именования идентификаторов SQL: либо обычное, без специальных символов, либо в двойных кавычках. (На практике, к команде обычно добавляются другие указания, такие как <literal>LOGIN</literal>. Подробнее об этом ниже.) Для удаления роли используется команда <xref linkend="sql-droprole"/> : <synopsis>DROP ROLE <replaceable>name</replaceable>;</synopsis>

source: For convenience, the programs <xref linkend="app-createuser"/> and <xref linkend="app-dropuser"/> are provided as wrappers around these SQL commands that can be called from the shell command line: <synopsis>createuser <replaceable>name</replaceable> dropuser <replaceable>name</replaceable></synopsis>
ru: Для удобства поставляются программы <xref linkend="app-createuser"/> и <xref linkend="app-dropuser"/>, которые являются обёртками для этих команд SQL и вызываются из командной строки оболочки ОС: <synopsis>createuser <replaceable>name</replaceable> dropuser <replaceable>name</replaceable></synopsis>

source: To determine the set of existing roles, examine the <structname>pg_roles</structname> system catalog, for example <synopsis>SELECT rolname FROM pg_roles;</synopsis> The <xref linkend="app-psql"/> program's <literal>\du</literal> meta-command is also useful for listing the existing roles.
ru: Для получения списка существующих ролей, рассмотрите <structname>pg_roles</structname> системного каталога, например: <synopsis>SELECT rolname FROM pg_roles;</synopsis> Метакоманда <literal>\du</literal> программы <xref linkend="app-psql"/> также полезна для получения списка существующих ролей.

source: In order to bootstrap the database system, a freshly initialized system always contains one predefined role. This role is always a <quote>superuser</quote>, and by default (unless altered when running <command>initdb</command>) it will have the same name as the operating system user that initialized the database cluster. Customarily, this role will be named <literal>postgres</literal>. In order to create more roles you first have to connect as this initial role.
ru: Для начальной настройки кластера базы данных, система сразу после инициализации всегда содержит одну предопределённую роль. Эта роль является суперпользователем (<quote>superuser</quote>) и по умолчанию (если не изменено при запуске <command>initdb</command>) имеет такое же имя, как и пользователь операционной системы, инициализирующий кластер баз данных. Обычно эта роль называется <literal>postgres</literal>. Для создания других ролей, вначале нужно подключиться с этой ролью.

source: Every connection to the database server is made using the name of some particular role, and this role determines the initial access privileges for commands issued in that connection. The role name to use for a particular database connection is indicated by the client that is initiating the connection request in an application-specific fashion. For example, the <command>psql</command> program uses the <option>-U</option> command line option to indicate the role to connect as. Many applications assume the name of the current operating system user by default (including <command>createuser</command> and <command>psql</command>). Therefore it is often convenient to maintain a naming correspondence between roles and operating system users.
ru: Каждое подключение к серверу базы данных выполняется под именем конкретной роли и эта роль определяет начальные привилегии доступа для команд выполняемых в этом соединении. Имя роли для конкретного подключения к базе данных указывается клиентской программой характерным для неё способом, таким образом инициируя запрос на подключение. Например, программа <command>psql</command> для указания роли использует аргумент командной строки <option>-U</option>. Многие приложения предполагают, что по умолчанию нужно использовать имя пользователя операционной системы (включая <command>createuser</command> и <command>psql</command>). Поэтому часто бывает удобным поддерживать соответствие между именами ролей и именами пользователей операционной системы.

source: The set of database roles a given client connection can connect as is determined by the client authentication setup, as explained in <xref linkend="client-authentication"/>. (Thus, a client is not limited to connect as the role matching its operating system user, just as a person's login name need not match his or her real name.) Since the role identity determines the set of privileges available to a connected client, it is important to carefully configure privileges when setting up a multiuser environment.
ru: Список доступных для подключения ролей, который могут использовать клиенты, определяется конфигурацией аутентификации, как описывалось в <xref remap="6" linkend="client-authentication"/>. (Поэтому, клиент не ограничен только ролью, соответствующей имени пользователя операционной системы, также как и имя для входа может не соответствовать реальному имени.) Так как роль определяет набор доступных привилегий, очень важно тщательно настраивать привилегии в многопользовательской среде.

source: Role Attributes
ru: Атрибуты ролей

source: <primary>login privilege</primary>
ru: <primary>право подключения</primary>

source: login privilege<placeholder-1/>
ru: Право подключения<placeholder-1/>

source: Only roles that have the <literal>LOGIN</literal> attribute can be used as the initial role name for a database connection. A role with the <literal>LOGIN</literal> attribute can be considered the same as a <quote>database user</quote>. To create a role with login privilege, use either: <placeholder-1/> (<command>CREATE USER</command> is equivalent to <command>CREATE ROLE</command> except that <command>CREATE USER</command> assumes <literal>LOGIN</literal> by default, while <command>CREATE ROLE</command> does not.)
ru: Только роли с атрибутом <literal>LOGIN</literal> могут использоваться для начального подключения к базе данных. Роль с атрибутом <literal>LOGIN</literal> можно рассматривать как пользователя базы данных. Для создания роли такой роли можно использовать любой из вариантов: <placeholder-1/> (Команда <command>CREATE USER</command> эквивалентна <command>CREATE ROLE</command> за исключением того, что <command>CREATE USER</command> по умолчанию предполагает атрибут <literal>LOGIN</literal>, в то время как <command>CREATE ROLE</command> нет.)

source: <primary>superuser</primary>
ru: <primary>суперпользователь</primary>

source: superuser status<placeholder-1/>
ru: Статус суперпользователя<placeholder-1/>

source: A database superuser bypasses all permission checks, except the right to log in. This is a dangerous privilege and should not be used carelessly; it is best to do most of your work as a role that is not a superuser. To create a new database superuser, use <literal>CREATE ROLE <replaceable>name</replaceable> SUPERUSER</literal>. You must do this as a role that is already a superuser.
ru: Суперпользователь базы данных обходит все проверки прав доступа, за исключением права на вход в систему. Это опасная привилегия и она не должна использоваться небрежно. Лучше всего выполнять большую часть работы не как суперпользователь. Для создания нового суперпользователя используется <literal>CREATE ROLE <replaceable>name</replaceable> SUPERUSER</literal>. Это нужно выполнить из под роли, которая также является суперпользователем.

source: <primary>database</primary><secondary>privilege to create</secondary>
ru: <primary>баз данных</primary><secondary>право для создания</secondary>

source: database creation<placeholder-1/>
ru: Создание базы данных<placeholder-1/>

source: A role must be explicitly given permission to create databases (except for superusers, since those bypass all permission checks). To create such a role, use <literal>CREATE ROLE <replaceable>name</replaceable> CREATEDB</literal>.
ru: Роль должна явно иметь разрешение на создание базы данных (за исключением суперпользователей, которые пропускают все проверки). Для создания такой роли используется <literal>CREATE ROLE <replaceable>name</replaceable> CREATEDB</literal>.

source: <primary>role</primary><secondary>privilege to create</secondary>
ru: <primary>роль</primary><secondary>право для создания</secondary>

source: role creation<placeholder-1/>
ru: Создание роли<placeholder-1/>

source: A role must be explicitly given permission to create more roles (except for superusers, since those bypass all permission checks). To create such a role, use <literal>CREATE ROLE <replaceable>name</replaceable> CREATEROLE</literal>. A role with <literal>CREATEROLE</literal> privilege can alter and drop other roles, too, as well as grant or revoke membership in them. However, to create, alter, drop, or change membership of a superuser role, superuser status is required; <literal>CREATEROLE</literal> is insufficient for that.
ru: Роль должна явно иметь разрешение на создание других ролей (за исключением суперпользователей, которые пропускают все проверки). Для создания такой роли используется <literal>CREATE ROLE <replaceable>name</replaceable> CREATEROLE</literal>. Роль с привилегией <literal>CREATEROLE</literal> может также изменять и удалять другие роли, а также выдавать и отзывать членство в ролях. Однако, для создания, изменения, удаления суперпользовательских ролей, а также изменения в них членства, требуется иметь статус суперпользователя; привилегии <literal>CREATEROLE</literal> в таких случаях недостаточно.

source: <primary>role</primary><secondary>privilege to initiate replication</secondary>
ru: <primary>роль</primary><secondary>право для запуска репликации</secondary>

source: initiating replication<placeholder-1/>
ru: Запуск репликации<placeholder-1/>

source: A role must explicitly be given permission to initiate streaming replication (except for superusers, since those bypass all permission checks). A role used for streaming replication must have <literal>LOGIN</literal> permission as well. To create such a role, use <literal>CREATE ROLE <replaceable>name</replaceable> REPLICATION LOGIN</literal>.
ru: Роль должна иметь явное разрешение на запуск потоковой репликации (за исключением суперпользователей, которые пропускают все проверки). Роль, используемая для потоковой репликации, также должна иметь атрибут <literal>LOGIN</literal>. Для создания такой роли используется <literal>CREATE ROLE <replaceable>имя</replaceable> REPLICATION LOGIN</literal>.

source: <primary>password</primary>
ru: <primary>пароль</primary>

source: password<placeholder-1/>
ru: Пароль<placeholder-1/>

source: A password is only significant if the client authentication method requires the user to supply a password when connecting to the database. The <option>password</option> and <option>md5</option> authentication methods make use of passwords. Database passwords are separate from operating system passwords. Specify a password upon role creation with <literal>CREATE ROLE <replaceable>name</replaceable> PASSWORD '<replaceable>string</replaceable>'</literal>.
ru: Пароль имеет значение, если метод аутентификации клиентов требует, чтобы пользователи предоставляли пароль при подключении к базе данных. Методы аутентификации <option>password</option> и <option>md5</option> используют пароли. База данных и операционная система используют раздельные пароли. Пароль указывается при создании роли: <literal>CREATE ROLE <replaceable>name</replaceable> PASSWORD '<replaceable>string</replaceable>'</literal>.

source: A database role can have a number of attributes that define its privileges and interact with the client authentication system. <placeholder-1/> A role's attributes can be modified after creation with <command>ALTER ROLE</command>.<placeholder-2/> See the reference pages for the <xref linkend="sql-createrole"/> and <xref linkend="sql-alterrole"/> commands for details.
ru: Роль базы данных может иметь атрибуты, определяющие её полномочия и взаимодействие с системой аутентификации клиентов. <placeholder-1/> Атрибуты ролей могут быть изменены после создания командой <command>ALTER ROLE</command>.<placeholder-2/> Более детальная информация в справке по командам <xref linkend="sql-createrole"/> и <xref linkend="sql-alterrole"/>.

source: It is good practice to create a role that has the <literal>CREATEDB</literal> and <literal>CREATEROLE</literal> privileges, but is not a superuser, and then use this role for all routine management of databases and roles. This approach avoids the dangers of operating as a superuser for tasks that do not really require it.
ru: Рекомендуется создать роль с привилегиями <literal>CREATEDB</literal> и <literal>CREATEROLE</literal>, но не суперпользователя и в последующем использовать её для управления базами данных и ролями. Такой подход позволит избежать опасностей, связанных с использованием полномочий суперпользователя для задач, которые их не требуют.

source: A role can also have role-specific defaults for many of the run-time configuration settings described in <xref linkend="runtime-config"/>. For example, if for some reason you want to disable index scans (hint: not a good idea) anytime you connect, you can use: <placeholder-1/> This will save the setting (but not set it immediately). In subsequent connections by this role it will appear as though <literal>SET enable_indexscan TO off</literal> had been executed just before the session started. You can still alter this setting during the session; it will only be the default. To remove a role-specific default setting, use <literal>ALTER ROLE <replaceable>rolename</replaceable> RESET <replaceable>varname</replaceable></literal>. Note that role-specific defaults attached to roles without <literal>LOGIN</literal> privilege are fairly useless, since they will never be invoked.
ru: На уровне ролей можно устанавливать многие конфигурационные параметры времени выполнения, описанные в <xref remap="6" linkend="runtime-config"/>. Например, если по некоторым причинам всякий раз при подключении к базе данных требуется отключить использование индексов (подсказка: плохая идея) можно выполнить: <placeholder-1/> Установленное значение параметра будет сохранено (но не будет применено сразу). Для последующих подключений с этой ролью это будет выглядеть как выполнение команды <literal>SET enable_indexscan TO off</literal> перед началом сессии. Но это только значение по умолчанию, в течение сессии эту установку можно изменить. Для удаления установок на уровне ролей для параметров конфигурации используется <literal>ALTER ROLE <replaceable>rolename</replaceable> RESET <replaceable>varname</replaceable></literal>. Обратите внимание, что установка параметров конфигурации на уровне роли без привилегии <literal>LOGIN</literal> лишено смысла, т. к. они никогда не будут применены,

source: Role Membership
ru: Членство в роли

source: <primary>role</primary><secondary>membership in</secondary>
ru: <primary>роль</primary><secondary>членство</secondary>

source: It is frequently convenient to group users together to ease management of privileges: that way, privileges can be granted to, or revoked from, a group as a whole. In <productname>PostgreSQL</productname> this is done by creating a role that represents the group, and then granting <firstterm>membership</firstterm> in the group role to individual user roles.
ru: Часто бывает удобным сгруппировать пользователей для упрощения администрирования привилегий: привилегии выдаются или отзываются на всю группу. В <productname>PostgreSQL</productname> для этого создаётся роль, которая представляет группу, а затем членство (<firstterm>membership</firstterm>) в этой группе выдаётся ролям индивидуальных пользователей.

source: To set up a group role, first create the role: <synopsis>CREATE ROLE <replaceable>name</replaceable>;</synopsis> Typically a role being used as a group would not have the <literal>LOGIN</literal> attribute, though you can set it if you wish.
ru: Для настройки групповой роли, сначала нужно создать саму роль:<synopsis>CREATE ROLE <replaceable>name</replaceable>;</synopsis> Обычно групповая роль не имеет атрибута <literal>LOGIN</literal>, хотя при желании его можно установить.

source: Once the group role exists, you can add and remove members using the <xref linkend="sql-grant"/> and <xref linkend="sql-revoke"/> commands: <synopsis>GRANT <replaceable>group_role</replaceable> TO <replaceable>role1</replaceable>, ... ; REVOKE <replaceable>group_role</replaceable> FROM <replaceable>role1</replaceable>, ... ;</synopsis> You can grant membership to other group roles, too (since there isn't really any distinction between group roles and non-group roles). The database will not let you set up circular membership loops. Also, it is not permitted to grant membership in a role to <literal>PUBLIC</literal>.
ru: После того как групповая роль создана, в неё можно добавлять или удалять членов, используя команды <xref linkend="sql-grant"/> и <xref linkend="sql-revoke"/>:<synopsis>GRANT <replaceable>group_role</replaceable> TO <replaceable>role1</replaceable>, ... ; REVOKE <replaceable>group_role</replaceable> FROM <replaceable>role1</replaceable>, ... ;</synopsis> Можно выдавать членство в групповой роли другим групповым ролям (потому что в действительности нет никаких различий между групповыми и не групповыми ролями). База данных не позволит замкнуть предоставление членства по кругу. Также, не допускается выдача членства в роли для <literal>PUBLIC</literal>.
