Repository: pluzanov/pg-doc-ru
Catalog: 9.6/vacuumlo.po
Languages: ru

source: Application
ru: Приложение

source: remove orphaned large objects from a <placeholder-1/> database
ru: удалить потерянные большие объекты из базы данных <placeholder-1/>

source: option
ru: параметр

source: dbname
ru: имя_бд

source: Description
ru: Описание

source: <application>vacuumlo</application> is a simple utility program that will remove any <quote>orphaned</quote> large objects from a <productname>PostgreSQL</productname> database. An orphaned large object (LO) is considered to be any LO whose OID does not appear in any <type>oid</type> or <type>lo</type> data column of the database.
ru: Программа <application>vacuumlo</application> представляет собой простую утилиту, которая удаляет все <quote>потерянные</quote> большие объекты из базы данных <productname>PostgreSQL</productname>. Потерянным большим объектом (БО) считается такой БО, OID которого не фигурирует ни в каком столбце <type>oid</type> или <type>lo</type> в базе данных.

source: If you use this, you may also be interested in the <function>lo_manage</function> trigger in the <xref linkend="lo"/> module. <function>lo_manage</function> is useful to try to avoid creating orphaned LOs in the first place.
ru: Если вы применяете эту утилиту, вас также может заинтересовать триггер <function>lo_manage</function> в модуле <xref linkend="lo"/>. Триггер <function>lo_manage</function> полезен тем, что стремится предотвратить образование потерянных БО.

source: All databases named on the command line are processed.
ru: Обработке подвергаются все базы данных, перечисленные в командной строке.

source: Options
ru: Параметры

source: limit
ru: предел

source: Remove no more than <replaceable>limit</replaceable> large objects per transaction (default 1000). Since the server acquires a lock per LO removed, removing too many LOs in one transaction risks exceeding <xref linkend="guc-max-locks-per-transaction"/>. Set the limit to zero if you want all removals done in a single transaction.
ru: Удалять в одной транзакции ограниченное количество больших объектов (максимальное количество задаёт <replaceable>предел</replaceable>, по умолчанию 1000). Так как сервер запрашивает блокировку для каждого удаляемого БО, удаление слишком большого количества БО в одной транзакции чревато превышением лимита <xref linkend="guc-max-locks-per-transaction"/>. Если вы всё же хотите, чтобы все удаления происходили в одной транзакции, установите этот предел, равным нулю.

source: Don't remove anything, just show what would be done.
ru: Не удалять ничего, только показать, какие операции должны были выполняться.

source: Write a lot of progress messages.
ru: Выводить подробные сообщения о прогрессе.

source: Print the <application>vacuumlo</application> version and exit.
ru: Вывести версию <application>vacuumlo</application> и завершиться.

source: Show help about <application>vacuumlo</application> command line arguments, and exit.
ru: Вывести справку об аргументах командной строки <application>vacuumlo</application> и завершиться.

source: <application>vacuumlo</application> accepts the following command-line arguments: <placeholder-1/>
ru: <application>vacuumlo</application> принимает следующие аргументы командной строки: <placeholder-1/>

source: hostname
ru: компьютер

source: Database server's host.
ru: Адрес сервера баз данных.

source: port
ru: порт

source: Database server's port.
ru: Порт сервера баз данных.

source: username
ru: имя_пользователя

source: User name to connect as.
ru: Имя пользователя, под которым производится подключение.

source: Never issue a password prompt. If the server requires password authentication and a password is not available by other means such as a <filename>.pgpass</filename> file, the connection attempt will fail. This option can be useful in batch jobs and scripts where no user is present to enter a password.
ru: Не выдавать запрос на ввод пароля. Если сервер требует аутентификацию по паролю и пароль не доступен с помощью других средств, таких как файл <filename>.pgpass</filename>, попытка соединения не удастся. Этот параметр может быть полезен в пакетных заданиях и скриптах, где нет пользователя, который вводит пароль.

source: Force <application>vacuumlo</application> to prompt for a password before connecting to a database.
ru: Принудительно запрашивать пароль перед подключением к базе данных.

source: This option is never essential, since <application>vacuumlo</application> will automatically prompt for a password if the server demands password authentication. However, <application>vacuumlo</application> will waste a connection attempt finding out that the server wants a password. In some cases it is worth typing <option>-W</option> to avoid the extra connection attempt.
ru: Это несущественный параметр, так как <application>vacuumlo</application> запрашивает пароль автоматически, если сервер проверяет подлинность по паролю. Однако, чтобы понять это, <application>vacuumlo</application> лишний раз подключается к серверу. Поэтому иногда имеет смысл ввести <option>-W</option>, чтобы исключить эту ненужную попытку подключения.

source: <application>vacuumlo</application> also accepts the following command-line arguments for connection parameters: <placeholder-1/>
ru: <application>vacuumlo</application> также принимает в командной строке следующие аргументы, задающие параметры подключения: <placeholder-1/>

source: Notes
ru: Замечания

source: <application>vacuumlo</application> works by the following method: First, <application>vacuumlo</application> builds a temporary table which contains all of the OIDs of the large objects in the selected database. It then scans through all columns in the database that are of type <type>oid</type> or <type>lo</type>, and removes matching entries from the temporary table. (Note: Only types with these names are considered; in particular, domains over them are not considered.) The remaining entries in the temporary table identify orphaned LOs. These are removed.
ru: Программа <application>vacuumlo</application> работает следующим образом: сначала <application>vacuumlo</application> строит временную таблицу, содержащую все OID больших объектов в выбранной базе данных. Затем она сканирует все столбцы в базе данных, имеющие тип <type>oid</type> или <type>lo</type>, и удаляет соответствующие записи из временной таблицы. (Замечание: рассматриваются только типы именно с такими именами, а не, например, домены на их базе.) Оставшиеся записи во временной таблице указывают на потерянные БО, которые затем и удаляются.

source: Author
ru: Автор

source: Peter Mount <email>peter@retep.org.uk</email>
ru: Питер Маунт <email>peter@retep.org.uk</email>
