Repository: pluzanov/pg-doc-ru
Catalog: 9.6/xindex.po
Languages: ru

source: return internal information describing the indexed columns' summary data
ru: возвращает внутреннюю информацию, описывающую сводные данные по индексированным столбцам

source: add a new value to an existing summary index tuple
ru: добавляет новое значение в существующий сводный кортеж индекса

source: determine whether value matches query condition
ru: определяет, удовлетворяет ли значение условию запроса

source: compute union of two summary tuples
ru: вычисляет объединение двух обобщающих кортежей

source: Unlike search operators, support functions return whichever data type the particular index method expects; for example in the case of the comparison function for B-trees, a signed integer. The number and types of the arguments to each support function are likewise dependent on the index method. For B-tree and hash the comparison and hashing support functions take the same input data types as do the operators included in the operator class, but this is not the case for most GiST, SP-GiST, GIN, and BRIN support functions.
ru: В отличие от операторов поиска, опорные функции возвращают тот тип данных, который ожидает конкретный метод индекса; например, функция сравнения для B-деревьев возвращает знаковое целое. Количество и типы аргументов для каждой опорной функции так же зависят от метода индекса. Для методов B-дерева и хеша функции сравнения и хеширования принимают те же типы данных, что и операторы, включённые в класс операторов, но для большинства опорных функций GiST, SP-GiST, GIN и BRIN это не так.

source: An Example
ru: Пример

source: absolute-value less-than (strategy 1)
ru: абсолютное-значение меньше (стратегия 1)

source: absolute-value less-than-or-equal (strategy 2)
ru: абсолютное-значение меньше-или-равно (стратегия 2)

source: absolute-value equal (strategy 3)
ru: абсолютное-значение равно (стратегия 3)

source: absolute-value greater-than-or-equal (strategy 4)
ru: абсолютное-значение больше-или-равно (стратегия 4)

source: absolute-value greater-than (strategy 5)
ru: абсолютное-значение больше (стратегия 5)

source: Now that we have seen the ideas, here is the promised example of creating a new operator class. (You can find a working copy of this example in <filename>src/tutorial/complex.c</filename> and <filename>src/tutorial/complex.sql</filename> in the source distribution.) The operator class encapsulates operators that sort complex numbers in absolute value order, so we choose the name <literal>complex_abs_ops</literal>. First, we need a set of operators. The procedure for defining operators was discussed in <xref linkend="xoper"/>. For an operator class on B-trees, the operators we require are: <placeholder-1/>
ru: Теперь, когда мы познакомились с основными идеями, мы можем перейти к обещанному примеру создания нового класса операторов. (Рабочую копию этого примера можно найти в <filename>src/tutorial/complex.c</filename> и <filename>src/tutorial/complex.sql</filename> в пакете исходного кода.) Класс операторов включает операторы, сортирующие комплексные числа по порядку абсолютных значений, поэтому мы выбрали для него имя <literal>complex_abs_ops</literal>. Во-первых, нам понадобится набор операторов. Процедура определения операторов была рассмотрена в <xref remap="6" linkend="xoper"/>. Для класса операторов B-деревьев нам понадобятся операторы: <placeholder-1/>

source: The least error-prone way to define a related set of comparison operators is to write the B-tree comparison support function first, and then write the other functions as one-line wrappers around the support function. This reduces the odds of getting inconsistent results for corner cases. Following this approach, we first write: <placeholder-1/> Now the less-than function looks like: <placeholder-2/> The other four functions differ only in how they compare the internal function's result to zero.
ru: Чтобы не провоцировать ошибки при определении связанного набора операторов сравнения, лучше всего сначала написать вспомогательную функцию сравнения для B-дерева, а затем написать другие функции как однострочные оболочки этой вспомогательной функции. Это уменьшит вероятность получения несогласованных результатов в исключительных случаях. Следуя этому подходу, мы сначала напишем: <placeholder-1/> Теперь функция &laquo;меньше&raquo; будет выглядеть так: <placeholder-2/> Остальные четыре функции отличаются от неё только тем, как сравнивают результат внутренней функции с нулём.

source: CREATE FUNCTION complex_abs_lt(complex, complex) RETURNS bool AS '<replaceable>filename</replaceable>', 'complex_abs_lt' LANGUAGE C IMMUTABLE STRICT; CREATE OPERATOR &lt; ( leftarg = complex, rightarg = complex, procedure = complex_abs_lt, commutator = &gt; , negator = &gt;= , restrict = scalarltsel, join = scalarltjoinsel );
ru: CREATE FUNCTION complex_abs_lt(complex, complex) RETURNS bool AS '<replaceable>имя_файла</replaceable>', 'complex_abs_lt' LANGUAGE C IMMUTABLE STRICT; CREATE OPERATOR &lt; ( leftarg = complex, rightarg = complex, procedure = complex_abs_lt, commutator = &gt; , negator = &gt;= , restrict = scalarltsel, join = scalarltjoinsel );

source: Next we declare the functions and the operators based on the functions to SQL: <placeholder-1/> It is important to specify the correct commutator and negator operators, as well as suitable restriction and join selectivity functions, otherwise the optimizer will be unable to make effective use of the index. Note that the less-than, equal, and greater-than cases should use different selectivity functions.
ru: Затем мы объявим в SQL функции и операторы на основе этих функций: <placeholder-1/> Важно правильно определить обратные и коммутирующие операторы, а также подходящие функции избирательности ограничения и соединения; иначе оптимизатор не сможет использовать наш индекс эффективно. Заметьте, что для случаев меньше, равно и больше следует использовать другие функции оценки избирательности.

source: There can only be one operator named, say, <literal>=</literal> and taking type <type>complex</type> for both operands. In this case we don't have any other operator <literal>=</literal> for <type>complex</type>, but if we were building a practical data type we'd probably want <literal>=</literal> to be the ordinary equality operation for complex numbers (and not the equality of the absolute values). In that case, we'd need to use some other operator name for <function>complex_abs_eq</function>.
ru: Учтите, что может быть только один оператор с именем, например, <literal>=</literal>, который будет принимать тип <type>complex</type> с двух сторон. В этом случае у нас не будет другого оператора <literal>=</literal> для <type>complex</type>, но если мы создаём практически полезный тип данных, вероятно, мы захотим, чтобы оператор <literal>=</literal> проверял обычное равенство двух комплексных чисел (а не равенство их абсолютных значений). В этом случае, для <function>complex_abs_eq</function> нужно выбрать какое-то другое имя оператора.

source: Although <productname>PostgreSQL</productname> can cope with functions having the same SQL name as long as they have different argument data types, C can only cope with one global function having a given name. So we shouldn't name the C function something simple like <filename>abs_eq</filename>. Usually it's a good practice to include the data type name in the C function name, so as not to conflict with functions for other data types.
ru: Хотя в <productname>PostgreSQL</productname> разные функции могут иметь одинаковые имена SQL, если у них различные типы аргументов, в C только одна глобальная функция может иметь заданное имя. Поэтому не следует давать функции на C имя вроде <filename>abs_eq</filename>. Во избежание конфликтов с функциями для других типов данных, в имя функции на C обычно включается имя конкретного типа данных.

source: We could have made the SQL name of the function <filename>abs_eq</filename>, relying on <productname>PostgreSQL</productname> to distinguish it by argument data types from any other SQL function of the same name. To keep the example simple, we make the function have the same names at the C level and SQL level.
ru: Мы могли быть дать нашей функции имя <filename>abs_eq</filename> в SQL, рассчитывая на то, что <productname>PostgreSQL</productname> отличит её от любых других одноимённых функций SQL по типам аргументов. Но в данном случае для упрощения примера мы дали ей одинаковые имена на уровне C и уровне SQL.

source: Other things worth noting are happening here: <placeholder-1/>
ru: Здесь также стоит обратить внимание на следующее: <placeholder-1/>

source: CREATE FUNCTION complex_abs_cmp(complex, complex) RETURNS integer AS '<replaceable>filename</replaceable>' LANGUAGE C IMMUTABLE STRICT;
ru: CREATE FUNCTION complex_abs_cmp(complex, complex) RETURNS integer AS '<replaceable>имя_файла</replaceable>' LANGUAGE C IMMUTABLE STRICT;

source: The next step is the registration of the support routine required by B-trees. The example C code that implements this is in the same file that contains the operator functions. This is how we declare the function: <placeholder-1/>
ru: На следующем этапе регистрируется опорная процедура, необходимая для B-деревьев. В нашем примере код C, реализующий её, находится в том же файле, что и функции операторов. Мы объявляем эту процедуру так: <placeholder-1/>

source: Now that we have the required operators and support routine, we can finally create the operator class: <placeholder-1/>
ru: Теперь, когда мы объявили требуемые операторы и опорную функцию, мы наконец можем создать класс операторов: <placeholder-1/>

source: And we're done! It should now be possible to create and use B-tree indexes on <type>complex</type> columns.
ru: Вот и всё! Теперь должно быть возможно создавать и использовать индексы-B-деревья по столбцам <type>complex</type>.

source: We could have written the operator entries more verbosely, as in: <placeholder-1/> but there is no need to do so when the operators take the same data type we are defining the operator class for.
ru: Операторы можно было записать более многословно, например, так: <placeholder-1/> но в этом необходимости, так как эти операторы принимают тот же тип данных, для которого определяется класс операторов.

source: The above example assumes that you want to make this new operator class the default B-tree operator class for the <type>complex</type> data type. If you don't, just leave out the word <literal>DEFAULT</literal>.
ru: В приведённом примере предполагается, что этот класс операторов будет классом операторов B-дерева по умолчанию для типа <type>complex</type>. Если вам это не нужно, просто опустите слово <literal>DEFAULT</literal>.

source: Operator Classes and Operator Families
ru: Семейства и классы операторов

source: So far we have implicitly assumed that an operator class deals with only one data type. While there certainly can be only one data type in a particular index column, it is often useful to index operations that compare an indexed column to a value of a different data type. Also, if there is use for a cross-data-type operator in connection with an operator class, it is often the case that the other data type has a related operator class of its own. It is helpful to make the connections between related classes explicit, because this can aid the planner in optimizing SQL queries (particularly for B-tree operator classes, since the planner contains a great deal of knowledge about how to work with them).
ru: До этого мы неявно полагали, что класс операторов работает только с одним типом данных. Хотя в конкретном индексируемом столбце, определённо, может быть только один тип данных, часто бывает полезно индексировать операции, сравнивающие значение столбца со значением другого типа. Также, если в сочетании с классом операторов возможно применение оператора, работающего с двумя типами, для другого типа данных обычно тоже создаётся собственный класс. В таких случаях полезно установить явную связь между связанными классами, так как это поможет планировщику оптимизировать SQL-запросы (особенно для классов операторов B-дерева, потому что планировщик хорошо знает, как работать с ними).

source: <primary>operator family</primary>
ru: <primary>семейство операторов</primary>

source: To handle these needs, <productname>PostgreSQL</productname> uses the concept of an <firstterm>operator family</firstterm><placeholder-1/>. An operator family contains one or more operator classes, and can also contain indexable operators and corresponding support functions that belong to the family as a whole but not to any single class within the family. We say that such operators and functions are <quote>loose</quote> within the family, as opposed to being bound into a specific class. Typically each operator class contains single-data-type operators while cross-data-type operators are loose in the family.
ru: Для удовлетворения этих потребностей в <productname>PostgreSQL</productname> введена концепция <firstterm>семейства операторов</firstterm><placeholder-1/>. Семейство операторов содержит один или несколько классов операторов и может также содержать индексируемые операторы и соответствующие опорные функции, принадлежащие к семейству в целом, но не к какому-то одному классу в нём. Мы называем такую связь операторов и функций с семейством <quote>слабой</quote>, в отличие от обычной связи с определённым классом. Как правило, классы содержат операторы с операндами одного типа, тогда как межтиповые операторы слабо связываются с семейством.

source: All the operators and functions in an operator family must have compatible semantics, where the compatibility requirements are set by the index method. You might therefore wonder why bother to single out particular subsets of the family as operator classes; and indeed for many purposes the class divisions are irrelevant and the family is the only interesting grouping. The reason for defining operator classes is that they specify how much of the family is needed to support any particular index. If there is an index using an operator class, then that operator class cannot be dropped without dropping the index &mdash; but other parts of the operator family, namely other operator classes and loose operators, could be dropped. Thus, an operator class should be specified to contain the minimum set of operators and functions that are reasonably needed to work with an index on a specific data type, and then related but non-essential operators can be added as loose members of the operator family.
ru: Все операторы и функции в семействе операторов должны иметь совместимую семантику; требования к совместимости устанавливаются методом индекса. Вы можете спросить, зачем в таком случае вообще выделять конкретные подмножества семейства в виде классов операторов; и на самом деле во многих случаях деление на классы не имеет значения, важно только связывание с семейством. Смысл классов операторов в том, что они определяют, какая часть семейства необходима для поддержки некоторого индекса. Если существует индекс, использующий класс операторов, этот класс нельзя будет удалить, не удалив индекс &mdash; но другие части семейства, а именно, другие классы операторов и слабосвязанные операторы, удалить можно. Таким образом, класс операторов должен определяться так, чтобы он содержал минимальный набор операторов и функций, обоснованно требующихся для работы с индексом по определённому типу данных, а связанные, но не существенные операторы могут добавляться в качестве слабосвязанных членов в семейство операторов.

source: As an example, <productname>PostgreSQL</productname> has a built-in B-tree operator family <literal>integer_ops</literal>, which includes operator classes <literal>int8_ops</literal>, <literal>int4_ops</literal>, and <literal>int2_ops</literal> for indexes on <type>bigint</type> (<type>int8</type>), <type>integer</type> (<type>int4</type>), and <type>smallint</type> (<type>int2</type>) columns respectively. The family also contains cross-data-type comparison operators allowing any two of these types to be compared, so that an index on one of these types can be searched using a comparison value of another type. The family could be duplicated by these definitions: <placeholder-1/> Notice that this definition <quote>overloads</quote> the operator strategy and support function numbers: each number occurs multiple times within the family. This is allowed so long as each instance of a particular number has distinct input data types. The instances that have both input types equal to an operator class's input type are the primary operators and support functions for that operator class, and in most cases should be declared as part of the operator class rather than as loose members of the family.
ru: В качестве примера, в <productname>PostgreSQL</productname> есть встроенное семейство операторов B-дерева <literal>integer_ops</literal>, включающее классы операторов <literal>int8_ops</literal>, <literal>int4_ops</literal> и <literal>int2_ops</literal> для индексов по столбцам <type>bigint</type> (<type>int8</type>), <type>integer</type> (<type>int4</type>) и <type>smallint</type> (<type>int2</type>), соответственно. В этом семействе также содержатся операторы межтипового сравнения, позволяющие сравнивать значения любых двух этих типов, так что индексом по любому из этих типов можно пользоваться, выполняя сравнение с другим типом. Это семейство можно представить такими определениями: <placeholder-1/> Заметьте, что в определении семейства <quote>перегружаются</quote> номера стратегий операторов и опорных функций: каждый номер фигурирует в семействе неоднократно. Это допускается, если для каждого экземпляра определённого номера задаются свои типы данных. Экземпляры, у которых оба входных типа совпадают с входным типом класса операторов, являются первичными операторами и опорными функциями для этого класса, и в большинстве случаев они должны объявляться в составе класса операторов, а не быть слабосвязанными членами семейства.

source: In a B-tree operator family, all the operators in the family must sort compatibly, meaning that the transitive laws hold across all the data types supported by the family: <quote>if A = B and B = C, then A = C</quote>, and <quote>if A &lt; B and B &lt; C, then A &lt; C</quote>. Moreover, implicit or binary coercion casts between types represented in the operator family must not change the associated sort ordering. For each operator in the family there must be a support function having the same two input data types as the operator. It is recommended that a family be complete, i.e., for each combination of data types, all operators are included. Each operator class should include just the non-cross-type operators and support function for its data type.
ru: В семействе операторов B-дерева все операторы должны быть совместимыми в контексте сортировки, то есть для всех типов данных, поддерживаемых семейством, должны действовать транзитивные законы: <quote>если A = B и B = C, то A = C</quote>, и <quote>если A &lt; B и B &lt; C, то A &lt; C</quote>. Более того, неявное или двоичное приведение типов, представленных в семействе операторов, не должно влиять на порядок сортировки. Для каждого оператора в семействе должна существовать опорная функция, принимающая на вход те же два типа, что и оператор. Семейство рекомендуется делать полным, то есть включить в него все операторы для каждого сочетания типов данных. В классы операторов следует включать только однотиповые операторы и опорные функции для определённого типа данных.

source: To build a multiple-data-type hash operator family, compatible hash support functions must be created for each data type supported by the family. Here compatibility means that the functions are guaranteed to return the same hash code for any two values that are considered equal by the family's equality operators, even when the values are of different types. This is usually difficult to accomplish when the types have different physical representations, but it can be done in some cases. Furthermore, casting a value from one data type represented in the operator family to another data type also represented in the operator family via an implicit or binary coercion cast must not change the computed hash value. Notice that there is only one support function per data type, not one per equality operator. It is recommended that a family be complete, i.e., provide an equality operator for each combination of data types. Each operator class should include just the non-cross-type equality operator and the support function for its data type.
ru: Чтобы создать семейство операторов хеширования для нескольких типов данных, необходимо создать совместимые функции поддержки хеша для каждого типа данных, который будет поддерживать семейство. Здесь под совместимостью понимается гарантия получения одного хеш-кода для любых двух значений, которые операторы сравнения в этом семействе считают равными, даже если они имеют разные типы. Обычно это сложно осуществить, когда типы имеют разное физическое представление, но в некоторых случаях всё же возможно. Более того, преобразование значения одного типа данных, представленного в семействе операторов, к другому типу, также представленному в этом семействе, путём неявного или двоичного сведения не должно менять значение вычисляемого хеша. Заметьте, что единственная опорная функция задаётся для типа данных, а не для оператора равенства. Семейство рекомендуется делать полным, то есть включить в него оператор равенства для всех сочетаний типов данных. В классы операторов следует включать только однотиповый оператор равенства и опорную функция для определённого типа данных.

source: GiST, SP-GiST, and GIN indexes do not have any explicit notion of cross-data-type operations. The set of operators supported is just whatever the primary support functions for a given operator class can handle.
ru: В индексах GiST, SP-GiST и GIN межтиповые операции явно не выражены. Множество поддерживаемых операторов определяется только теми операциями, которые могут выполнять основные опорные функции заданного класса операторов.

source: In BRIN, the requirements depends on the framework that provides the operator classes. For operator classes based on <literal>minmax</literal>, the behavior required is the same as for B-tree operator families: all the operators in the family must sort compatibly, and casts must not change the associated sort ordering.
ru: В BRIN требования зависят от инфраструктуры, предоставляющей классы операторов. Для классов операторов, построенных на инфраструктуре <literal>minmax</literal>, требуется то же поведение, что и для семейств операторов B-дерева: все операторы в семействе должны поддерживать совместимый порядок, а приведения не должны влиять на установленный порядок сортировки.

source: Prior to <productname>PostgreSQL</productname> 8.3, there was no concept of operator families, and so any cross-data-type operators intended to be used with an index had to be bound directly into the index's operator class. While this approach still works, it is deprecated because it makes an index's dependencies too broad, and because the planner can handle cross-data-type comparisons more effectively when both data types have operators in the same operator family.
ru: До версии 8.3 в <productname>PostgreSQL</productname> не было понятия семейства операторов, поэтому любые межтиповые операторы, предназначенные для применения с индексом, должны были привязываться непосредственно к классу оператора индекса. Хотя этот подход по-прежнему работает, он считается устаревшим, потому что он создаёт слишком много зависимостей для индекса, а также потому, что планировщик может выполнять межтиповые сравнения более эффективно, когда для обоих типов данных определены операторы в одном семействе.
