Repository: pluzanov/pg-doc-ru
Catalog: 9.6/xindex.po
Languages: ru

source: Interfacing Extensions To Indexes
ru: Интерфейсы расширений для индексов

source: <primary>index</primary><secondary>for user-defined data type</secondary>
ru: <primary>индекс</primary><secondary>для пользовательского типа данных</secondary>

source: The procedures described thus far let you define new types, new functions, and new operators. However, we cannot yet define an index on a column of a new data type. To do this, we must define an <firstterm>operator class</firstterm> for the new data type. Later in this section, we will illustrate this concept in an example: a new operator class for the B-tree index method that stores and sorts complex numbers in ascending absolute value order.
ru: Описанные до этого процедуры позволяли определять новые типы, функции и операторы. Однако, мы ещё не можем определить индекс по столбцу нового типа данных. Для этого нам потребуется создать <firstterm>класс операторов</firstterm> для нового типа данных. Далее в этом разделе мы продемонстрируем эту концепцию на примере: мы создадим новый класс операторов для метода индекса-B-дерева, в котором будут храниться комплексные числа и сортироваться по возрастанию абсолютного значения.

source: Operator classes can be grouped into <firstterm>operator families</firstterm> to show the relationships between semantically compatible classes. When only a single data type is involved, an operator class is sufficient, so we'll focus on that case first and then return to operator families.
ru: Классы операторов могут объединяться в <firstterm>семейства операторов</firstterm>, выражающие зависимости между семантически совместимыми классами. Когда вводится один тип данных, достаточно класса операторов, так что мы начнём с него, а к семействам операторов вернёмся позже.

source: Index Methods and Operator Classes
ru: Методы индексов и классы операторов

source: The <classname>pg_am</classname> table contains one row for every index method (internally known as access method). Support for regular access to tables is built into <productname>PostgreSQL</productname>, but all index methods are described in <classname>pg_am</classname>. It is possible to add a new index access method by writing the necessary code and then creating a row in <classname>pg_am</classname> &mdash; but that is beyond the scope of this chapter (see <xref linkend="indexam"/>).
ru: В системном каталоге есть таблица <classname>pg_am</classname>, содержащая записи для каждого метода индекса (внутри называемого методом доступа). Поддержка обычного доступа к таблицам встроена в <productname>PostgreSQL</productname>, но все методы доступа описываются в <classname>pg_am</classname>. Система позволяет добавлять новые методы доступа — для этого нужно написать необходимый код, а затем добавить запись в <classname>pg_am</classname>, но это выходит за рамки данной главы (см. <xref remap="4" linkend="indexam"/>).

source: <primary>operator class</primary>
ru: <primary>класс операторов</primary>

source: The routines for an index method do not directly know anything about the data types that the index method will operate on. Instead, an <firstterm>operator class</firstterm><placeholder-1/> identifies the set of operations that the index method needs to use to work with a particular data type. Operator classes are so called because one thing they specify is the set of <literal>WHERE</literal>-clause operators that can be used with an index (i.e., can be converted into an index-scan qualification). An operator class can also specify some <firstterm>support procedures</firstterm> that are needed by the internal operations of the index method, but do not directly correspond to any <literal>WHERE</literal>-clause operator that can be used with the index.
ru: Процедуры метода индекса непосредственно ничего не знают о типах данных, с которыми будет применяться этот метод. Вместо этого, набор операций, которые нужны методу индекса для работы с конкретным типом данных, определяется <firstterm>классом операторов</firstterm><placeholder-1/>. Классы операторов называются так потому, что они определяют множество операторов в предложении <literal>WHERE</literal>, которые могут использоваться с индексом (т. е. могут быть сведены к сканированию индекса). В классе операторов могут также определяться некоторые <firstterm>опорные процедуры</firstterm>, которые нужны для внутренних операций метода индекса, но они не соответствуют напрямую каким-либо операторам предложения <literal>WHERE</literal>, которые могут обрабатываться с индексом.

source: It is possible to define multiple operator classes for the same data type and index method. By doing this, multiple sets of indexing semantics can be defined for a single data type. For example, a B-tree index requires a sort ordering to be defined for each data type it works on. It might be useful for a complex-number data type to have one B-tree operator class that sorts the data by complex absolute value, another that sorts by real part, and so on. Typically, one of the operator classes will be deemed most commonly useful and will be marked as the default operator class for that data type and index method.
ru: Для одного типа данных и метода индекса можно определить несколько классов операторов. Благодаря этому, для одного типа данных можно использовать несколько семантически разных вариантов индексирования. Например, индекс-B-дерево требует, чтобы для каждого типа данных, с которым он работает, определялся порядок сортировки. Для типа комплексных чисел может быть полезен класс операторов B-дерева, сортирующий данные по модулю комплексного числа, и ещё один, сортирующий по вещественной части, и т. п. Обычно предполагается, что один из классов операторов будет применяться чаще других, и тогда он помечается как класс по умолчанию для данного типа и метода индекса.

source: The same operator class name can be used for several different index methods (for example, both B-tree and hash index methods have operator classes named <literal>int4_ops</literal>), but each such class is an independent entity and must be defined separately.
ru: Одно и то же имя класса операторов может использоваться для разных методов индекса (например, для методов индекса-B-дерева или хеш-индекса применяются классы операторов <literal>int4_ops</literal>), но все такие классы являются независимыми и должны определяться отдельно.

source: Index Method Strategies
ru: Стратегии методов индексов

source: The operators associated with an operator class are identified by <quote>strategy numbers</quote>, which serve to identify the semantics of each operator within the context of its operator class. For example, B-trees impose a strict ordering on keys, lesser to greater, and so operators like <quote>less than</quote> and <quote>greater than or equal to</quote> are interesting with respect to a B-tree. Because <productname>PostgreSQL</productname> allows the user to define operators, <productname>PostgreSQL</productname> cannot look at the name of an operator (e.g., <literal>&lt;</literal> or <literal>&gt;=</literal>) and tell what kind of comparison it is. Instead, the index method defines a set of <quote>strategies</quote>, which can be thought of as generalized operators. Each operator class specifies which actual operator corresponds to each strategy for a particular data type and interpretation of the index semantics.
ru: Операторам, которые связываются с классом операторов, назначаются <quote>номера стратегий</quote>, определяющие роль каждого оператора в контексте его класса. Например, в B-дереве должен быть строгий порядок ключей с отношениями меньше/больше, так что в данном контексте представляют интерес операторы <quote>меньше</quote> и <quote>больше или равно</quote>. Так как <productname>PostgreSQL</productname> позволяет пользователям определять операторы произвольным образом, <productname>PostgreSQL</productname> не может просто посмотреть на имя оператора (<literal>&lt;</literal> или <literal>&gt;=</literal>) и сказать, какое сравнение он выполняет. Вместо этого для метода индекса определяется набор <quote>стратегий</quote>, которые можно считать обобщёнными операторами. Каждый класс операторов устанавливает, какие фактические операторы соответствуют стратегиям для определённого типа данных и интерпретации семантики индекса.

source: The B-tree index method defines five strategies, shown in <xref linkend="xindex-btree-strat-table"/>.
ru: Для метода индекса-B-дерева определены пять стратегий, описанных в <xref remap="6" linkend="xindex-btree-strat-table"/>.

source: B-tree Strategies
ru: Стратегии B-дерева

source: Operation
ru: Операция

source: Strategy Number
ru: Номер стратегии

source: less than
ru: меньше

source: less than or equal
ru: меньше или равно

# entry
source: equal
ru: равно

source: greater than or equal
ru: больше или равно

source: greater than
ru: больше

source: Hash indexes support only equality comparisons, and so they use only one strategy, shown in <xref linkend="xindex-hash-strat-table"/>.
ru: Индексы по хешу поддерживают только сравнение на равенство, так что они используют только одну стратегию, показанную в <xref remap="6" linkend="xindex-hash-strat-table"/>.

source: Hash Strategies
ru: Стратегии хеша

source: GiST indexes are more flexible: they do not have a fixed set of strategies at all. Instead, the <quote>consistency</quote> support routine of each particular GiST operator class interprets the strategy numbers however it likes. As an example, several of the built-in GiST index operator classes index two-dimensional geometric objects, providing the <quote>R-tree</quote> strategies shown in <xref linkend="xindex-rtree-strat-table"/>. Four of these are true two-dimensional tests (overlaps, same, contains, contained by); four of them consider only the X direction; and the other four provide the same tests in the Y direction.
ru: Индексы GiST более гибкие: для них вообще нет фиксированного набора стратегий. Вместо этого опорная процедура <quote>согласованности</quote> каждого конкретного класса операторов GiST интерпретирует номера стратегий как ей угодно. Например, некоторые из встроенных классов операторов для индексов GiST индексируют двумерные геометрические объекты, и реализуют стратегии <quote>R-дерева</quote>, показанные в <xref remap="6" linkend="xindex-rtree-strat-table"/>. Четыре из них являются истинно двумерными проверками (overlaps, same, contains, contained by); другие четыре учитывают только ординаты, а ещё четыре проводят же проверки только с абсциссами.

source: GiST Two-Dimensional <quote>R-tree</quote> Strategies
ru: Стратегии двумерного <quote>R-дерева</quote> индекса GiST

source: strictly left of
ru: строго слева от

source: does not extend to right of
ru: не простирается правее

source: overlaps
ru: пересекается с

source: does not extend to left of
ru: не простирается левее

source: strictly right of
ru: строго справа от

source: same
ru: одинаковы

source: contains
ru: содержит

source: contained by
ru: содержится в

source: does not extend above
ru: не простирается выше

source: strictly below
ru: строго ниже

source: strictly above
ru: строго выше

source: does not extend below
ru: не простирается ниже

source: SP-GiST indexes are similar to GiST indexes in flexibility: they don't have a fixed set of strategies. Instead the support routines of each operator class interpret the strategy numbers according to the operator class's definition. As an example, the strategy numbers used by the built-in operator classes for points are shown in <xref linkend="xindex-spgist-point-strat-table"/>.
ru: Индексы SP-GiST такие же гибкие, как и индексы GiST: для них не задаётся фиксированный набор стратегий. Вместо этого опорные процедуры каждого класса операторов интерпретируют номера стратегий в соответствии с определением класса операторов. В качестве примера, в <xref remap="6" linkend="xindex-spgist-point-strat-table"/> приведены номера стратегий, установленные для встроенных классов операторов для точек.

source: SP-GiST Point Strategies
ru: Стратегии SP-GiST для точек

source: GIN indexes are similar to GiST and SP-GiST indexes, in that they don't have a fixed set of strategies either. Instead the support routines of each operator class interpret the strategy numbers according to the operator class's definition. As an example, the strategy numbers used by the built-in operator classes for arrays are shown in <xref linkend="xindex-gin-array-strat-table"/>.
ru: Индексы GIN такие же гибкие, как и индексы GiST и SP-GiST: для них не задаётся фиксированный набор стратегий. Вместо этого опорные процедуры каждого класса операторов интерпретируют номера стратегий в соответствии с определением класса операторов. В качестве примера, в <xref remap="6" linkend="xindex-gin-array-strat-table"/> приведены номера стратегий, установленные для встроенных классов операторов для массивов.

source: GIN Array Strategies
ru: Стратегии GIN для массивов

source: overlap
ru: пересекается с

source: is contained by
ru: содержится в

source: BRIN indexes are similar to GiST, SP-GiST and GIN indexes in that they don't have a fixed set of strategies either. Instead the support routines of each operator class interpret the strategy numbers according to the operator class's definition. As an example, the strategy numbers used by the built-in <literal>Minmax</literal> operator classes are shown in <xref linkend="xindex-brin-minmax-strat-table"/>.
ru: Индексы BRIN такие же гибкие, как и индексы GiST, SP-GiST и GIN: для них не задаётся фиксированный набор стратегий. Вместо этого опорные процедуры каждого класса операторов интерпретируют номера стратегий в соответствии с определением класса операторов. В качестве примера, в <xref remap="6" linkend="xindex-brin-minmax-strat-table"/> приведены номера стратегий, используемые встроенными классами операторов <literal>Minmax</literal>.

source: BRIN Minmax Strategies
ru: Стратегии BRIN Minmax

source: Notice that all the operators listed above return Boolean values. In practice, all operators defined as index method search operators must return type <type>boolean</type>, since they must appear at the top level of a <literal>WHERE</literal> clause to be used with an index. (Some index access methods also support <firstterm>ordering operators</firstterm>, which typically don't return Boolean values; that feature is discussed in <xref linkend="xindex-ordering-ops"/>.)
ru: Заметьте, что все вышеперечисленные операторы возвращают булевы значения. На практике все операторы, определённые как операторы поиска для метода индекса, должны возвращать тип <type>boolean</type>, так как они должны находиться на верхнем уровне предложения <literal>WHERE</literal>, чтобы для них применялся индекс. (Некоторые методы доступа по индексу также поддерживают <firstterm>операторы упорядочивания</firstterm>, которые обычно не возвращают булевы значения; это обсуждается в <xref remap="6" linkend="xindex-ordering-ops"/>.)

source: Index Method Support Routines
ru: Опорные процедуры метода индекса

source: Strategies aren't usually enough information for the system to figure out how to use an index. In practice, the index methods require additional support routines in order to work. For example, the B-tree index method must be able to compare two keys and determine whether one is greater than, equal to, or less than the other. Similarly, the hash index method must be able to compute hash codes for key values. These operations do not correspond to operators used in qualifications in SQL commands; they are administrative routines used by the index methods, internally.
ru: Стратегии обычно не дают системе достаточно информации, чтобы понять, как использовать индекс. На практике, чтобы методы индекса работали, необходимы дополнительные опорные процедуры. Например, метод индекса-B-дерева должен уметь сравнивать два ключа и определять, больше, равен или меньше ли первый второго. Аналогично, метод индекса по хешу должен уметь сравнивать хеш-коды значений ключа. Эти операции не соответствуют операторам, которые применяются в условиях в командах SQL; это внутрисистемные подпрограммы, используемые методами индекса.

source: Just as with strategies, the operator class identifies which specific functions should play each of these roles for a given data type and semantic interpretation. The index method defines the set of functions it needs, and the operator class identifies the correct functions to use by assigning them to the <quote>support function numbers</quote> specified by the index method.
ru: Так же, как и со стратегиями, класс операторов определяет, какие конкретные функции должны играть каждую из ролей для определённого типа данных и интерпретации семантики индекса. Для метода индекса определяется набор нужных ему функций, а класс оператора выбирает нужные функции для применения, назначая им <quote>номера опорных функций</quote>, определяемые методом индекса.

source: B-trees require a single support function, and allow a second one to be supplied at the operator class author's option, as shown in <xref linkend="xindex-btree-support-table"/>.
ru: Для B-деревьев требуется одна опорная функция, а вторая задаётся по выбору автора класса операторов, как показано в <xref remap="6" linkend="xindex-btree-support-table"/>.

source: B-tree Support Functions
ru: Опорные функции B-деревьев

source: Function
ru: Функция

source: Support Number
ru: Номер опорной функции

source: Compare two keys and return an integer less than zero, zero, or greater than zero, indicating whether the first key is less than, equal to, or greater than the second
ru: Сравнивает два ключа и возвращает целое меньше нуля, ноль или целое больше нуля, показывающее, что первый ключ меньше, равен или больше второго

source: Return the addresses of C-callable sort support function(s), as documented in <filename>utils/sortsupport.h</filename> (optional)
ru: Возвращает адрес вызываемой из C функции(й), поддерживающей сортировку, как описано в <filename>utils/sortsupport.h</filename> (необязательно)

source: Hash indexes require one support function, shown in <xref linkend="xindex-hash-support-table"/>.
ru: Для хеш-индексов требуется одна опорная функция, указанная в <xref remap="6" linkend="xindex-hash-support-table"/>.

source: Hash Support Functions
ru: Опорные функции хеша

source: Compute the hash value for a key
ru: Вычисляет значение хеша для ключа

source: GiST indexes have nine support functions, two of which are optional, as shown in <xref linkend="xindex-gist-support-table"/>. (For more information see <xref linkend="gist"/>.)
ru: Для индексов GiST требуются девять опорных функций, две из которых необязательны; они описаны в <xref remap="6" linkend="xindex-gist-support-table"/>. (За дополнительными сведениями обратитесь к <xref remap="3" linkend="gist"/>.)

source: GiST Support Functions
ru: Опорные функции GiST

source: Description
ru: Описание

source: determine whether key satisfies the query qualifier
ru: определяет, удовлетворяет ли ключ условию запроса

source: compute union of a set of keys
ru: вычисляет объединение набора ключей

source: compute a compressed representation of a key or value to be indexed
ru: вычисляет сжатое представление ключа или индексируемого значения

source: compute a decompressed representation of a compressed key
ru: вычисляет развёрнутое представление сжатого ключа

source: compute penalty for inserting new key into subtree with given subtree's key
ru: вычисляет стоимость добавления нового ключа в поддерево с заданным ключом

source: determine which entries of a page are to be moved to the new page and compute the union keys for resulting pages
ru: определяет, какие записи страницы должны быть перемещены в новую страницу, и вычисляет ключи объединения для результирующих страниц

source: compare two keys and return true if they are equal
ru: сравнивает два ключа и возвращает true, если они равны

source: determine distance from key to query value (optional)
ru: определяет дистанцию от ключа до искомого значения (необязательно)

source: compute original representation of a compressed key for index-only scans (optional)
ru: вычисляет исходное представление сжатого ключа для сканирования только по индексу (необязательно)

source: SP-GiST indexes require five support functions, as shown in <xref linkend="xindex-spgist-support-table"/>. (For more information see <xref linkend="spgist"/>.)
ru: Для индексов SP-GiST требуются пять опорных функций, описанных в <xref remap="6" linkend="xindex-spgist-support-table"/>. (За дополнительными сведениями обратитесь к <xref remap="3" linkend="spgist"/>.)

source: SP-GiST Support Functions
ru: Опорные функции SP-GiST

source: provide basic information about the operator class
ru: предоставляет основную информацию о классе операторов

source: determine how to insert a new value into an inner tuple
ru: определяет, как вставить новое значение во внутренний элемент

source: determine how to partition a set of values
ru: определяет, как разделить множество значений

source: determine which sub-partitions need to be searched for a query
ru: определяет, в каких внутренних ветвях нужно искать заданное значение

source: GIN indexes have six support functions, three of which are optional, as shown in <xref linkend="xindex-gin-support-table"/>. (For more information see <xref linkend="gin"/>.)
ru: Для индексов GIN требуются шесть опорных функций, три из которых необязательны; они описаны в <xref remap="6" linkend="xindex-gin-support-table"/>. (За дополнительными сведениями обратитесь к <xref remap="3" linkend="gin"/>.)

source: GIN Support Functions
ru: Опорные функции GIN

source: compare two keys and return an integer less than zero, zero, or greater than zero, indicating whether the first key is less than, equal to, or greater than the second
ru: сравнивает два ключа и возвращает целое меньше нуля, ноль или целое больше нуля, показывающее, что первый ключ меньше, равен или больше второго

source: extract keys from a value to be indexed
ru: извлекает ключи из индексируемого значения

source: extract keys from a query condition
ru: извлекает ключи из условия запроса

source: determine whether value matches query condition (Boolean variant) (optional if support function 6 is present)
ru: определяет, соответствует ли значение условию запроса (булевская вариация) (не требуется, если присутствует опорная функция 6)

source: compare partial key from query and key from index, and return an integer less than zero, zero, or greater than zero, indicating whether GIN should ignore this index entry, treat the entry as a match, or stop the index scan (optional)
ru: сравнивает частичный ключ из запроса с ключом из индекса и возвращает целое число меньше нуля, ноль или больше нуля, показывающее, что GIN должен игнорировать эту запись индекса, принять её как соответствующую или прекратить сканирование индекса (необязательно)

source: determine whether value matches query condition (ternary variant) (optional if support function 4 is present)
ru: определяет, соответствует ли значение условию запроса (троичная вариация) (не требуется, если присутствует опорная функция 4)

source: BRIN indexes have four basic support functions, as shown in <xref linkend="xindex-brin-support-table"/>; those basic functions may require additional support functions to be provided. (For more information see <xref linkend="brin-extensibility"/>.)
ru: Для индексов BRIN требуются четыре базовые опорные функции, перечисленные в <xref remap="6" linkend="xindex-brin-support-table"/>; для этих базовых функций может потребоваться предоставить дополнительные опорные функции. (За дополнительными сведениями обратитесь к <xref remap="3" linkend="brin-extensibility"/>.)

source: BRIN Support Functions
ru: Опорные функции BRIN
