Repository: pluzanov/pg-doc-ru
Catalog: 9.6/xindex.po
Languages: ru

source: System Dependencies on Operator Classes
ru: Системные зависимости от классов операторов

source: <primary>ordering operator</primary>
ru: <primary>оператор упорядочивания</primary>

source: <productname>PostgreSQL</productname> uses operator classes to infer the properties of operators in more ways than just whether they can be used with indexes. Therefore, you might want to create operator classes even if you have no intention of indexing any columns of your data type.
ru: <productname>PostgreSQL</productname> использует классы операторов для наделения операторов такими свойствами, которые могут быть полезны не только для индексов. Поэтому классы операторов могут быть полезны, даже если вы не намерены индексировать столбцы со значениями определённого вами типа.

source: In particular, there are SQL features such as <literal>ORDER BY</literal> and <literal>DISTINCT</literal> that require comparison and sorting of values. To implement these features on a user-defined data type, <productname>PostgreSQL</productname> looks for the default B-tree operator class for the data type. The <quote>equals</quote> member of this operator class defines the system's notion of equality of values for <literal>GROUP BY</literal> and <literal>DISTINCT</literal>, and the sort ordering imposed by the operator class defines the default <literal>ORDER BY</literal> ordering.
ru: В частности, это касается SQL-конструкций <literal>ORDER BY</literal> и <literal>DISTINCT</literal>, для которых требуется сравнивать и упорядочивать значения. Чтобы эти конструкции работали с определённым пользователем типом данных, <productname>PostgreSQL</productname> задействует класс операторов B-дерева по умолчанию для этого типа. Член <quote>равно</quote> этого класса определяет, как система будет понимать равенство значений для <literal>GROUP BY</literal> и <literal>DISTINCT</literal>, а порядок сортировки, задаваемый классом операторов, определяет порядок <literal>ORDER BY</literal> по умолчанию.

source: Comparison of arrays of user-defined types also relies on the semantics defined by the default B-tree operator class.
ru: Сравнение массивов пользовательских типов также зависит от семантики, определённой классом операторов B-дерева по умолчанию.

source: If there is no default B-tree operator class for a data type, the system will look for a default hash operator class. But since that kind of operator class only provides equality, in practice it is only enough to support array equality.
ru: Если класс операторов B-дерева по умолчанию для типа данных не определён, система будет искать класс операторов хеша по умолчанию. Но так как этот вид класса поддерживает только равенство, на практике его достаточно только для проверки равенства массивов.

source: When there is no default operator class for a data type, you will get errors like <quote>could not identify an ordering operator</quote> if you try to use these SQL features with the data type.
ru: Если для типа не определён класс операторов по умолчанию, попытавшись использовать эти конструкции SQL с данным типом, вы получите ошибку вида <quote>не удалось найти оператор сортировки</quote>.

source: In <productname>PostgreSQL</productname> versions before 7.4, sorting and grouping operations would implicitly use operators named <literal>=</literal>, <literal>&lt;</literal>, and <literal>&gt;</literal>. The new behavior of relying on default operator classes avoids having to make any assumption about the behavior of operators with particular names.
ru: До версии <productname>PostgreSQL</productname> 7.4, в операциях сортировки и группировки неявно использовались операторы с именами <literal>=</literal>, <literal>&lt;</literal> и <literal>&gt;</literal>. С новым подходом, опирающимся на классы операторов по умолчанию, система не делает никаких предположений о поведении операторов по их именам.

source: Another important point is that an operator that appears in a hash operator family is a candidate for hash joins, hash aggregation, and related optimizations. The hash operator family is essential here since it identifies the hash function(s) to use.
ru: Также важно отметить, что оператор, указанный в семействе операторов хеширования, является кандидатом для применения при слиянии и агрегации по хешу, а также связанной оптимизации. В данном случае от семейства операторов зависит, какую функцию хеширования использовать.

source: Ordering Operators
ru: Операторы упорядочивания

source: Some index access methods (currently, only GiST) support the concept of <firstterm>ordering operators</firstterm>. What we have been discussing so far are <firstterm>search operators</firstterm>. A search operator is one for which the index can be searched to find all rows satisfying <literal>WHERE</literal> <replaceable>indexed_column</replaceable> <replaceable>operator</replaceable> <replaceable>constant</replaceable>. Note that nothing is promised about the order in which the matching rows will be returned. In contrast, an ordering operator does not restrict the set of rows that can be returned, but instead determines their order. An ordering operator is one for which the index can be scanned to return rows in the order represented by <literal>ORDER BY</literal> <replaceable>indexed_column</replaceable> <replaceable>operator</replaceable> <replaceable>constant</replaceable>. The reason for defining ordering operators that way is that it supports nearest-neighbor searches, if the operator is one that measures distance. For example, a query like <placeholder-1/> finds the ten places closest to a given target point. A GiST index on the location column can do this efficiently because <literal>&lt;-&gt;</literal> is an ordering operator.
ru: Некоторые методы доступа индексов (в настоящее время только GiST) поддерживают концепцию <firstterm>операторов упорядочивания</firstterm>. Операторы, которые мы обсуждали до этого, были <firstterm>операторами поиска</firstterm>. Оператором поиска называется такой оператор, для которого можно выполнить поиск по индексу и найти все строки, удовлетворяющие условию <literal>WHERE</literal> <replaceable>индексированный_столбец</replaceable> <replaceable>оператор</replaceable> <replaceable>константа</replaceable>. Заметьте, что при этом ничего не говорится о порядке, в котором будут возвращены подходящие строки. Оператор упорядочивания, напротив, не ограничивает набор возвращаемых строк, но определяет их порядок. С таким оператором, просканировав индекс, можно получить строки в порядке, заданным указанием <literal>ORDER BY</literal> <replaceable>индексированный_столбец</replaceable> <replaceable>оператор</replaceable> <replaceable>константа</replaceable>. Такое определение объясняется тем, что оно поддерживает поиск ближайшего соседа, если этот оператор вычисляет расстояние. Например, запрос <placeholder-1/> находит десять ближайших к заданной точке мест. Индекс GiST по столбцу location может сделать это эффективно, так как <literal>&lt;-&gt;</literal> — это оператор упорядочивания.

source: While search operators have to return Boolean results, ordering operators usually return some other type, such as float or numeric for distances. This type is normally not the same as the data type being indexed. To avoid hard-wiring assumptions about the behavior of different data types, the definition of an ordering operator is required to name a B-tree operator family that specifies the sort ordering of the result data type. As was stated in the previous section, B-tree operator families define <productname>PostgreSQL</productname>'s notion of ordering, so this is a natural representation. Since the point <literal>&lt;-&gt;</literal> operator returns <type>float8</type>, it could be specified in an operator class creation command like this: <placeholder-1/> where <literal>float_ops</literal> is the built-in operator family that includes operations on <type>float8</type>. This declaration states that the index is able to return rows in order of increasing values of the <literal>&lt;-&gt;</literal> operator.
ru: Тогда как операторы поиска должны возвращать булевские результаты, операторы упорядочивания обычно возвращают другой тип, например, float или numeric для расстояний. Этот тип, как правило, отличается от типа индексируемых данных. Чтобы избежать жёстко запрограммированных предположений о поведении различных типов данных, при объявлении оператора упорядочивания должно указываться семейство операторов B-дерева, определяющее порядок сортировки результирующего типа данных. Как было отмечено в предыдущем разделе, семейства операторов B-дерева определяют понятие упорядочивания для <productname>PostgreSQL</productname>, так что такое объявление оказывается естественным. Так как оператор <literal>&lt;-&gt;</literal> для точек возвращает <type>float8</type>, его можно включить в команду создания класса операторов так: <placeholder-1/> где <literal>float_ops</literal> — встроенное семейство операторов, включающее операции с <type>float8</type>. Это объявление означает, что индекс может возвращать строки в порядке увеличения значений оператора <literal>&lt;-&gt;</literal>.

source: Special Features of Operator Classes
ru: Особенности классов операторов

source: There are two special features of operator classes that we have not discussed yet, mainly because they are not useful with the most commonly used index methods.
ru: Есть ещё две особенности классов операторов, которые мы до этого не обсуждали, в первую очередь потому, что они не востребованы для наиболее часто применяемых методов индексов.

source: Normally, declaring an operator as a member of an operator class (or family) means that the index method can retrieve exactly the set of rows that satisfy a <literal>WHERE</literal> condition using the operator. For example: <placeholder-1/> can be satisfied exactly by a B-tree index on the integer column. But there are cases where an index is useful as an inexact guide to the matching rows. For example, if a GiST index stores only bounding boxes for geometric objects, then it cannot exactly satisfy a <literal>WHERE</literal> condition that tests overlap between nonrectangular objects such as polygons. Yet we could use the index to find objects whose bounding box overlaps the bounding box of the target object, and then do the exact overlap test only on the objects found by the index. If this scenario applies, the index is said to be <quote>lossy</quote> for the operator. Lossy index searches are implemented by having the index method return a <firstterm>recheck</firstterm> flag when a row might or might not really satisfy the query condition. The core system will then test the original query condition on the retrieved row to see whether it should be returned as a valid match. This approach works if the index is guaranteed to return all the required rows, plus perhaps some additional rows, which can be eliminated by performing the original operator invocation. The index methods that support lossy searches (currently, GiST, SP-GiST and GIN) allow the support functions of individual operator classes to set the recheck flag, and so this is essentially an operator-class feature.
ru: Обычно объявление оператора в качестве члена класса операторов (или семейства) означает, что метод индекса может получить точно набор строк, который удовлетворяет условию <literal>WHERE</literal> с этим оператором. Например, запрос: <placeholder-1/> может быть удовлетворён в точности индексом-B-деревом по целочисленному столбцу. Но бывают случаи, когда индекс полезен как приблизительный указатель на соответствующие строки. Например, если индекс GiST хранит только прямоугольники, описанные вокруг геометрических объектов, он не может точно удовлетворить условие <literal>WHERE</literal>, которое проверяет пересечение не прямоугольных объектов, а например, многоугольников. Однако этот индекс можно применить, чтобы найти объекты, для которых описанные вокруг прямоугольники пересекаются с прямоугольником, описанным вокруг целевого объекта, а затем провести точную проверку пересечения только для найденных по индексу объектов. Если это имеет место, такой индекс называется <quote>неточным</quote> для оператора. Для реализации поиска по неточному индексу метод индекса возвращает флаг <firstterm>recheck</firstterm> (перепроверить), когда строка может действительно удовлетворять, а может не удовлетворять условию запроса. Затем исполнитель запроса перепроверяет полученную строку по исходному условию запроса и определяет, должна ли она выдаваться как действительно соответствующая ему. Этот подход работает, если индекс гарантированно выдаёт все требуемые строки плюс, возможно, дополнительные строки, которые можно исключить, вызвав первоначальный оператор. Методы индексов, поддерживающие неточный поиск (в настоящее время, GiST, SP-GiST и GIN), позволяют устанавливать флаг recheck опорным функциям отдельных классов операторов, так что по сути это особенность класса операторов.

source: Consider again the situation where we are storing in the index only the bounding box of a complex object such as a polygon. In this case there's not much value in storing the whole polygon in the index entry &mdash; we might as well store just a simpler object of type <type>box</type>. This situation is expressed by the <literal>STORAGE</literal> option in <command>CREATE OPERATOR CLASS</command>: we'd write something like: <placeholder-1/> At present, only the GiST, GIN and BRIN index methods support a <literal>STORAGE</literal> type that's different from the column data type. The GiST <function>compress</function> and <function>decompress</function> support routines must deal with data-type conversion when <literal>STORAGE</literal> is used. In GIN, the <literal>STORAGE</literal> type identifies the type of the <quote>key</quote> values, which normally is different from the type of the indexed column &mdash; for example, an operator class for integer-array columns might have keys that are just integers. The GIN <function>extractValue</function> and <function>extractQuery</function> support routines are responsible for extracting keys from indexed values. BRIN is similar to GIN: the <literal>STORAGE</literal> type identifies the type of the stored summary values, and operator classes' support procedures are responsible for interpreting the summary values correctly.
ru: Вернёмся к ситуации, когда мы храним в индексе только прямоугольник, описанный вокруг сложного объекта, такого как многоугольник. В этом случае нет большого смысла хранить в элементе индекса весь многоугольник &mdash; мы можем с тем же успехом хранить более простой объект типа <type>box</type>. Это отклонение выражается указанием <literal>STORAGE</literal> в команде <command>CREATE OPERATOR CLASS</command>, которое записывается примерно так: <placeholder-1/> В настоящее время, только методы индексов GiST, GIN и BRIN позволяют задать в <literal>STORAGE</literal> тип, отличный от типа данных столбца. В GiST преобразованием данных, связанным с использованием <literal>STORAGE</literal>, должны заниматься опорные процедуры <function>compress</function> и <function>decompress</function>. В GIN тип <literal>STORAGE</literal> определяет тип значений <quote>ключа</quote>, который обычно отличается от типа индексируемого столбца &mdash; например, в классе операторов для столбцов с целочисленным массивом ключами могут быть просто целые числа. За извлечение ключей из индексированных значений в GIN отвечают опорные функции <function>extractValue</function> и <function>extractQuery</function>. BRIN похож на GIN: в нём тип <literal>STORAGE</literal> определяет тип хранимых обобщённых значений, а опорные процедуры классов операторов отвечают за правильное прочтение этих значений.
