Repository: pluzanov/pg-doc-ru
Catalog: 9.6/xoper.po
Languages: ru

source: The <literal>JOIN</literal> clause, if provided, names a join selectivity estimation function for the operator. (Note that this is a function name, not an operator name.) <literal>JOIN</literal> clauses only make sense for binary operators that return <type>boolean</type>. The idea behind a join selectivity estimator is to guess what fraction of the rows in a pair of tables will satisfy a <literal>WHERE</literal>-clause condition of the form: <placeholder-1/> for the current operator. As with the <literal>RESTRICT</literal> clause, this helps the optimizer very substantially by letting it figure out which of several possible join sequences is likely to take the least work.
ru: Предложение <literal>JOIN</literal>, если представлено, определяет функцию оценки избирательности соединения для оператора. (Заметьте, что в нём задаётся имя функции, а не оператора.) Предложения <literal>JOIN</literal> имеют смысл только для бинарных операторов, возвращающих <type>boolean</type>. Идея оценки избирательности соединения заключается в том, чтобы угадать, какой процент строк в паре таблиц будет удовлетворять условию <literal>WHERE</literal> следующего вида: <placeholder-1/> для текущего оператора. Как и <literal>RESTRICT</literal>, это предложение очень помогает оптимизатору, позволяя ему выяснить, какой из возможных вариантов соединения скорее всего окажется выгоднее.

source: <placeholder-1/> for 2D area-based comparisons
ru: <placeholder-1/> для сравнений областей в плоскости

source: <placeholder-1/> for 2D position-based comparisons
ru: <placeholder-1/> для сравнения положений в плоскости

source: <placeholder-1/> for 2D containment-based comparisons
ru: <placeholder-1/> для проверки на включение в плоскости

source: As before, this chapter will make no attempt to explain how to write a join selectivity estimator function, but will just suggest that you use one of the standard estimators if one is applicable: <placeholder-1/>
ru: Как и ранее, в этой главе мы не будем пытаться рассказать, как написать функцию оценивания избирательности соединения, а просто отметим, что вы можете использовать один из подходящих стандартных оценщиков: <placeholder-1/>

source: The <literal>HASHES</literal> clause, if present, tells the system that it is permissible to use the hash join method for a join based on this operator. <literal>HASHES</literal> only makes sense for a binary operator that returns <literal>boolean</literal>, and in practice the operator must represent equality for some data type or pair of data types.
ru: Предложение <literal>HASHES</literal>, если присутствует, говорит системе, что для соединений с применением этого оператора допустимо использовать метод соединения по хешу. <literal>HASHES</literal> имеет смысл только для бинарного оператора, который возвращает <literal>boolean</literal>, и на практике этот оператор должен выражать равенство значений некоторого типа данных или пары типов данных.

source: The assumption underlying hash join is that the join operator can only return true for pairs of left and right values that hash to the same hash code. If two values get put in different hash buckets, the join will never compare them at all, implicitly assuming that the result of the join operator must be false. So it never makes sense to specify <literal>HASHES</literal> for operators that do not represent some form of equality. In most cases it is only practical to support hashing for operators that take the same data type on both sides. However, sometimes it is possible to design compatible hash functions for two or more data types; that is, functions that will generate the same hash codes for <quote>equal</quote> values, even though the values have different representations. For example, it's fairly simple to arrange this property when hashing integers of different widths.
ru: Соединение по хешу базируется на том предположении, что оператор соединения возвращает истину только для таких пар значений слева и справа, для которых получается одинаковый хеш. Если два значения оказываются в разных ячейках хеша, операция соединения никогда не будет сравнивать их, неявно подразумевая, что результат оператора соединения в этом случае должен быть ложным. Поэтому не имеет никакого смысла указывать <literal>HASHES</literal> для операторов, которые не представляют какую-любо форму равенства. В большинстве случаев практический смысл в поддержке хеширования есть только для операторов, принимающих один тип данных с обеих сторон. Однако иногда возможно разработать хеш-функции, совместимые сразу с несколькими типами данных; то есть, функции, которые будут выдавать одинаковые хеш-коды для <quote>равных</quote> значений, несмотря на то, что эти значения будут представлены по-разному. Например, довольно легко функции с такой особенностью реализуются для хеширования целых чисел различного размера.

source: To be marked <literal>HASHES</literal>, the join operator must appear in a hash index operator family. This is not enforced when you create the operator, since of course the referencing operator family couldn't exist yet. But attempts to use the operator in hash joins will fail at run time if no such operator family exists. The system needs the operator family to find the data-type-specific hash function(s) for the operator's input data type(s). Of course, you must also create suitable hash functions before you can create the operator family.
ru: Чтобы оператор соединения имел характеристику <literal>HASHES</literal>, он должен входить в семейство операторов индексирования по хешу. Это требование откладывается, когда оператор только создаётся, ведь нужное семейство операторов, разумеется, ещё не может существовать. Но при попытке использовать такой оператор для соединения по хешу, возникнет ошибка во время выполнения, если такого семейства не окажется. Системе необходимо знать семейство операторов, чтобы найти функции для хеширования типа(ов) входных данных оператора. Конечно, вы должны также определить подходящие функции хеширования, прежде чем сможете создать семейство операторов.

source: Care should be exercised when preparing a hash function, because there are machine-dependent ways in which it might fail to do the right thing. For example, if your data type is a structure in which there might be uninteresting pad bits, you cannot simply pass the whole structure to <function>hash_any</function>. (Unless you write your other operators and functions to ensure that the unused bits are always zero, which is the recommended strategy.) Another example is that on machines that meet the <acronym>IEEE</acronym> floating-point standard, negative zero and positive zero are different values (different bit patterns) but they are defined to compare equal. If a float value might contain negative zero then extra steps are needed to ensure it generates the same hash value as positive zero.
ru: При подготовке функции хеширования обязательно позаботьтесь о том, чтобы она всегда выдавала нужный результат, вне зависимости от особенностей машинной архитектуры. Например, если ваш тип данных представлен в структуре, в которой есть незначащие дополняющие биты, нельзя просто передать всю структуру функции <function>hash_any</function>. (Это возможно, только если все ваши операторы и функции гарантированно очищают незначащие биты, что является рекомендуемой стратегией.) В качестве другого примера можно привести типы с плавающей точкой в стандарте <acronym>IEEE</acronym>, в которых отрицательный ноль и положительный ноль — различные значения (отличаются на уровне битов), но при сравнении они считаются равными. Если значение с плавающей точкой может содержать отрицательный ноль, требуются дополнительные действия, чтобы для него выдавался тот же хеш, что и для положительного нуля.

source: A hash-joinable operator must have a commutator (itself if the two operand data types are the same, or a related equality operator if they are different) that appears in the same operator family. If this is not the case, planner errors might occur when the operator is used. Also, it is a good idea (but not strictly required) for a hash operator family that supports multiple data types to provide equality operators for every combination of the data types; this allows better optimization.
ru: Оператор соединения по хешу должен иметь коммутирующий (это может быть тот же оператор, если у него два операнда одного типа, либо связанный оператор равенства, в противном случае), относящийся к тому же семейству операторов. В случае его отсутствия, при попытке использования оператора возможны ошибки планировщика. Также желательно (хотя это строго не требуется), чтобы в семействе операторов хеширования, поддерживающем несколько типов данных, определялись операторы равенства для всех комбинаций этих типов данных; это способствует лучшей оптимизации.

source: The function underlying a hash-joinable operator must be marked immutable or stable. If it is volatile, the system will never attempt to use the operator for a hash join.
ru: Функция, реализующая оператор соединения по хешу, должна быть постоянной (IMMUTABLE) или стабильной (STABLE). Если эта функция изменчивая (VOLATILE), система никогда не будет применять этот оператор для соединения по хешу.

source: If a hash-joinable operator has an underlying function that is marked strict, the function must also be complete: that is, it should return true or false, never null, for any two nonnull inputs. If this rule is not followed, hash-optimization of <literal>IN</literal> operations might generate wrong results. (Specifically, <literal>IN</literal> might return false where the correct answer according to the standard would be null; or it might yield an error complaining that it wasn't prepared for a null result.)
ru: Если оператор соединения по хешу реализуется строгой функцией (STRICT), эта функция также должна быть полной: то есть она должна возвращать true или false, но не NULL, для любых двух аргументов, отличных от NULL. Если это правило не соблюдается, оптимизация операций <literal>IN</literal> с хешем может приводить к неверным результатам. (В частности, выражение <literal>IN</literal> может вернуть false, когда правильным ответом, согласно стандарту, должен быть NULL, либо выдать ошибку с сообщением о том, что оно не готов к результату NULL.)

source: The <literal>MERGES</literal> clause, if present, tells the system that it is permissible to use the merge-join method for a join based on this operator. <literal>MERGES</literal> only makes sense for a binary operator that returns <literal>boolean</literal>, and in practice the operator must represent equality for some data type or pair of data types.
ru: Предложение <literal>MERGES</literal>, если присутствует, говорит системе, что для соединений с применением этого оператора допустимо использовать метод соединения слиянием. <literal>MERGES</literal> имеет смысл только для бинарного оператора, который возвращает <literal>boolean</literal>, и на практике этот оператор должен выражать равенство значений некоторого типа данных или пары типов данных.

source: Merge join is based on the idea of sorting the left- and right-hand tables into order and then scanning them in parallel. So, both data types must be capable of being fully ordered, and the join operator must be one that can only succeed for pairs of values that fall at the <quote>same place</quote> in the sort order. In practice this means that the join operator must behave like equality. But it is possible to merge-join two distinct data types so long as they are logically compatible. For example, the <type>smallint</type>-versus-<type>integer</type> equality operator is merge-joinable. We only need sorting operators that will bring both data types into a logically compatible sequence.
ru: Идея объединения слиянием заключается в упорядочивании таблиц слева и справа и затем параллельном сканировании их. Поэтому оба типа данных должны поддерживать сортировку в полном объёме, а оператор соединения должен давать положительный результат только для пар значений, оказавшихся в <quote>одном месте</quote> при определённом порядке сортировки. На практике это означает, что оператор соединения должен работать как проверка на равенство. Но при этом возможно объединить слиянием два различных типа данных, если они совместимы логически. Например, оператор проверки равенства <type>smallint</type> и <type>integer</type> может применяться для соединений слиянием; понадобятся только операторы сортировки, приводящие оба типа данных в логически совместимые последовательности.

source: To be marked <literal>MERGES</literal>, the join operator must appear as an equality member of a <literal>btree</literal> index operator family. This is not enforced when you create the operator, since of course the referencing operator family couldn't exist yet. But the operator will not actually be used for merge joins unless a matching operator family can be found. The <literal>MERGES</literal> flag thus acts as a hint to the planner that it's worth looking for a matching operator family.
ru: Чтобы оператор соединения имел характеристику <literal>MERGES</literal>, он должен являться членом семейства операторов индекса <literal>btree</literal>, реализующим равенство. Это требование откладывается, когда оператор только создаётся, ведь нужное семейство операторов, разумеется, ещё не может существовать. Но этот оператор не будет фактически применяться для соединений слиянием, пока не будет найдено соответствующее семейство операторов. Таким образом, флаг <literal>MERGES</literal> только подсказывает планировщику, что стоит обратиться к соответствующему семейству.

source: A merge-joinable operator must have a commutator (itself if the two operand data types are the same, or a related equality operator if they are different) that appears in the same operator family. If this is not the case, planner errors might occur when the operator is used. Also, it is a good idea (but not strictly required) for a <literal>btree</literal> operator family that supports multiple data types to provide equality operators for every combination of the data types; this allows better optimization.
ru: Оператор соединения слиянием должен иметь коммутирующий (это может быть тот же оператор, если у него два операнда одного типа, либо связанный оператор равенства, в противном случае), относящийся к тому же семейству операторов. В случае его отсутствия, при попытке использования оператора возможны ошибки планировщика. Также желательно (хотя это строго не требуется), чтобы в семействе операторов <literal>btree</literal>, поддерживающем несколько типов данных, определялись операторы равенства для всех комбинаций этих типов данных; это способствует лучшей оптимизации.

source: The function underlying a merge-joinable operator must be marked immutable or stable. If it is volatile, the system will never attempt to use the operator for a merge join.
ru: Функция, реализующая оператор соединения слиянием, должна быть постоянной (IMMUTABLE) или стабильной (STABLE). Если эта функция изменчивая (VOLATILE), система никогда не будет применять этот оператор для соединения слиянием.
