Repository: pluzanov/pg-doc-ru
Catalog: 9.6/xoper.po
Languages: ru

source: User-defined Operators
ru: Пользовательские операторы

source: <primary>operator</primary><secondary>user-defined</secondary>
ru: <primary>оператор</primary><secondary>пользовательский</secondary>

source: Every operator is <quote>syntactic sugar</quote> for a call to an underlying function that does the real work; so you must first create the underlying function before you can create the operator. However, an operator is <emphasis>not merely</emphasis> syntactic sugar, because it carries additional information that helps the query planner optimize queries that use the operator. The next section will be devoted to explaining that additional information.
ru: Любой оператор представляет собой <quote>синтаксический сахар</quote> для вызова нижележащей функции, выполняющей реальную работу; поэтому прежде чем вы сможете создать оператор, необходимо создать нижележащую функцию. Однако оператор — <emphasis>не исключительно</emphasis> синтаксический сахар, так как он несёт и дополнительную информацию, помогающую планировщику запросов оптимизировать запросы с этим оператором. Рассмотрению этой дополнительной информации будет посвящён следующий раздел.

source: <primary>overloading</primary><secondary>operators</secondary>
ru: <primary>перегрузка</primary><secondary>операторов</secondary>

source: <productname>PostgreSQL</productname> supports left unary, right unary, and binary operators. Operators can be overloaded;<placeholder-1/> that is, the same operator name can be used for different operators that have different numbers and types of operands. When a query is executed, the system determines the operator to call from the number and types of the provided operands.
ru: <productname>PostgreSQL</productname> поддерживает левые унарные, правые унарные и бинарные операторы. Операторы могут быть перегружены;<placeholder-1/> то есть одно имя оператора могут иметь различные операторы с разным количеством и типами операндов. Когда выполняется запрос, система определяет, какой оператор вызвать, по количеству и типам предоставленных операндов.

source: CREATE FUNCTION complex_add(complex, complex) RETURNS complex AS '<replaceable>filename</replaceable>', 'complex_add' LANGUAGE C IMMUTABLE STRICT; CREATE OPERATOR + ( leftarg = complex, rightarg = complex, procedure = complex_add, commutator = + );
ru: CREATE FUNCTION complex_add(complex, complex) RETURNS complex AS '<replaceable>имя_файла</replaceable>', 'complex_add' LANGUAGE C IMMUTABLE STRICT; CREATE OPERATOR + ( leftarg = complex, rightarg = complex, procedure = complex_add, commutator = + );

source: Here is an example of creating an operator for adding two complex numbers. We assume we've already created the definition of type <type>complex</type> (see <xref linkend="xtypes"/>). First we need a function that does the work, then we can define the operator: <placeholder-1/>
ru: В следующем примере создаётся оператор сложения двух комплексных чисел. Предполагается, что мы уже создали определение типа <type>complex</type> (см. <xref remap="4" linkend="xtypes"/>). Сначала нам нужна функция, собственно выполняющая операцию, а затем мы сможем определить оператор: <placeholder-1/>

source: Now we could execute a query like this: <screen>SELECT (a + b) AS c FROM test_complex; c ----------------- (5.2,6.05) (133.42,144.95)</screen>
ru: Теперь мы можем выполнить такой запрос: <screen>SELECT (a + b) AS c FROM test_complex; c ----------------- (5.2,6.05) (133.42,144.95)</screen>

source: We've shown how to create a binary operator here. To create unary operators, just omit one of <literal>leftarg</literal> (for left unary) or <literal>rightarg</literal> (for right unary). The <literal>procedure</literal> clause and the argument clauses are the only required items in <command>CREATE OPERATOR</command>. The <literal>commutator</literal> clause shown in the example is an optional hint to the query optimizer. Further details about <literal>commutator</literal> and other optimizer hints appear in the next section.
ru: Мы продемонстрировали создание бинарного оператора. Чтобы создать унарный оператор, просто опустите <literal>leftarg</literal> (для левого унарного) или <literal>rightarg</literal> (для правого унарного). Обязательными в <command>CREATE OPERATOR</command> являются только предложение <literal>procedure</literal> и объявления аргументов. Предложение <literal>commutator</literal>, добавленное в данном примере, представляет необязательную подсказку для оптимизатора запросов. Подробнее о <literal>commutator</literal> и других подсказках для оптимизатора рассказывается в следующем разделе.

source: Operator Optimization Information
ru: Информация для оптимизации операторов

source: A <productname>PostgreSQL</productname> operator definition can include several optional clauses that tell the system useful things about how the operator behaves. These clauses should be provided whenever appropriate, because they can make for considerable speedups in execution of queries that use the operator. But if you provide them, you must be sure that they are right! Incorrect use of an optimization clause can result in slow queries, subtly wrong output, or other Bad Things. You can always leave out an optimization clause if you are not sure about it; the only consequence is that queries might run slower than they need to.
ru: Определение оператора в <productname>PostgreSQL</productname> может включать различные дополнительные предложения, которые сообщают системе полезные сведения о поведении оператора. Старайтесь задавать эти предложения при возможности, так как они могут значительно ускорить выполнение запросов, использующих данный оператор. Но если вы задаёте их, убедитесь, что они корректны! Неправильное применение предложений оптимизации может привести к замедлению запросов, неочевидным ошибочным результатам и другим неприятностям. Если вы не уверены в правильности предложения оптимизации, лучше вовсе не использовать его; единственным последствием будет то, что запросы будут работать медленнее, чем могли бы.

source: Additional optimization clauses might be added in future versions of <productname>PostgreSQL</productname>. The ones described here are all the ones that release &version; understands.
ru: В будущих версиях <productname>PostgreSQL</productname> могут быть добавлены и другие предложения. Здесь описываются те, что поддерживаются версией &version;.

source: The <literal>COMMUTATOR</literal> clause, if provided, names an operator that is the commutator of the operator being defined. We say that operator A is the commutator of operator B if (x A y) equals (y B x) for all possible input values x, y. Notice that B is also the commutator of A. For example, operators <literal>&lt;</literal> and <literal>&gt;</literal> for a particular data type are usually each others' commutators, and operator <literal>+</literal> is usually commutative with itself. But operator <literal>-</literal> is usually not commutative with anything.
ru: Предложение <literal>COMMUTATOR</literal>, если представлено, задаёт оператор, коммутирующий для определяемого. Оператор A является коммутирующим для оператора B, если (x A y) равняется (y B x) для всех возможных значений x, y. Заметьте, что B также будет коммутирующим для A. Например, операторы <literal>&lt;</literal> и <literal>&gt;</literal> для конкретного типа данных обычно являются коммутирующими друг для друга, а оператор <literal>+</literal> — коммутирующий для себя. Но традиционный оператор <literal>-</literal> коммутирующего не имеет.

source: The left operand type of a commutable operator is the same as the right operand type of its commutator, and vice versa. So the name of the commutator operator is all that <productname>PostgreSQL</productname> needs to be given to look up the commutator, and that's all that needs to be provided in the <literal>COMMUTATOR</literal> clause.
ru: Тип левого операнда оператора должен совпадать с типом правого операнда коммутирующего для него оператора, и наоборот. Поэтому имя коммутирующего оператора — это всё, что <productname>PostgreSQL</productname> должен знать, чтобы найти коммутатор, и всё, что нужно указать в предложении <literal>COMMUTATOR</literal>.

source: It's critical to provide commutator information for operators that will be used in indexes and join clauses, because this allows the query optimizer to <quote>flip around</quote> such a clause to the forms needed for different plan types. For example, consider a query with a WHERE clause like <literal>tab1.x = tab2.y</literal>, where <literal>tab1.x</literal> and <literal>tab2.y</literal> are of a user-defined type, and suppose that <literal>tab2.y</literal> is indexed. The optimizer cannot generate an index scan unless it can determine how to flip the clause around to <literal>tab2.y = tab1.x</literal>, because the index-scan machinery expects to see the indexed column on the left of the operator it is given. <productname>PostgreSQL</productname> will <emphasis>not</emphasis> simply assume that this is a valid transformation &mdash; the creator of the <literal>=</literal> operator must specify that it is valid, by marking the operator with commutator information.
ru: Информация о коммутирующих операторах крайне важна для операторов, которые будут применяться в индексах и условиях соединения, так как, используя её, оптимизатор запросов может <quote>переворачивать</quote> такие выражения и получать формы, необходимые для разных типов планов. Например, рассмотрим запрос с предложением WHERE <literal>tab1.x = tab2.y</literal>, где <literal>tab1.x</literal> и <literal>tab2.y</literal> имеют пользовательский тип, и предположим, что у нас есть индекс по столбцу <literal>tab2.y</literal>. Оптимизатор сможет задействовать сканирование по индексу, только если ему удастся перевернуть выражение <literal>tab2.y = tab1.x</literal>, так как механизм сканирования по индексу ожидает, что индексируемый столбец находится слева от оператора. <productname>PostgreSQL</productname> сам по себе <emphasis>не</emphasis> будет полагать, что такое преобразование возможно &mdash; это должен определить создатель оператора <literal>=</literal>, добавив информацию о коммутирующем операторе.

source: One way is to omit the <literal>COMMUTATOR</literal> clause in the first operator that you define, and then provide one in the second operator's definition. Since <productname>PostgreSQL</productname> knows that commutative operators come in pairs, when it sees the second definition it will automatically go back and fill in the missing <literal>COMMUTATOR</literal> clause in the first definition.
ru: Во-первых, можно опустить предложение <literal>COMMUTATOR</literal> для первого оператора, который вы определяете, а затем добавить его в определении второго. Так как <productname>PostgreSQL</productname> знает, что коммутирующие операторы связаны парами, встречая второе определение, он автоматически возвращается к первому и добавляет в него недостающее предложение <literal>COMMUTATOR</literal>.

source: The other, more straightforward way is just to include <literal>COMMUTATOR</literal> clauses in both definitions. When <productname>PostgreSQL</productname> processes the first definition and realizes that <literal>COMMUTATOR</literal> refers to a nonexistent operator, the system will make a dummy entry for that operator in the system catalog. This dummy entry will have valid data only for the operator name, left and right operand types, and result type, since that's all that <productname>PostgreSQL</productname> can deduce at this point. The first operator's catalog entry will link to this dummy entry. Later, when you define the second operator, the system updates the dummy entry with the additional information from the second definition. If you try to use the dummy operator before it's been filled in, you'll just get an error message.
ru: Во-вторых, можно добавить предложение <literal>COMMUTATOR</literal> в оба определения. Когда <productname>PostgreSQL</productname> обрабатывает первое определение и видит, что <literal>COMMUTATOR</literal> ссылается на несуществующий оператор, в системном каталоге создаётся фиктивная запись для этого оператора. В этой фиктивной записи актуальны будут только имя оператора, типы левого и правого операндов, а также тип результата, так как это всё, что <productname>PostgreSQL</productname> может определить в этот момент. Запись первого оператора будет связана с этой фиктивной записью. Затем, когда вы определите второй оператор, система внесёт в эту фиктивную запись дополнительную информацию из второго определения. Если вы попытаетесь применить фиктивный оператор, прежде чем он будет полностью определён, вы просто получите сообщение об ошибке.

source: When you are defining a self-commutative operator, you just do it. When you are defining a pair of commutative operators, things are a little trickier: how can the first one to be defined refer to the other one, which you haven't defined yet? There are two solutions to this problem: <placeholder-1/>
ru: Когда вы определяете оператор, коммутирующий сам для себя, вы делаете именно это. Если же вы определяете пару коммутирующих операторов, возникает небольшое затруднение: как оператор, определяемый первым, может ссылаться на другой, ещё не определённый? Есть два решения этой проблемы: <placeholder-1/>

source: The <literal>NEGATOR</literal> clause, if provided, names an operator that is the negator of the operator being defined. We say that operator A is the negator of operator B if both return Boolean results and (x A y) equals NOT (x B y) for all possible inputs x, y. Notice that B is also the negator of A. For example, <literal>&lt;</literal> and <literal>&gt;=</literal> are a negator pair for most data types. An operator can never validly be its own negator.
ru: Предложение <literal>NEGATOR</literal>, если присутствует, задаёт оператор, обратный к определяемому. Оператор A является обратным к оператору B, если они оба возвращают булевский результат и (x A y) равняется NOT (x B y) для всех возможных x, y. Заметьте, что B так же является обратным к A. Например, операторы <literal>&lt;</literal> и <literal>&gt;=</literal> составляют пару обратных друг к другу для большинства типов данных. Никакой оператор не может быть обратным к себе же.

source: Unlike commutators, a pair of unary operators could validly be marked as each other's negators; that would mean (A x) equals NOT (B x) for all x, or the equivalent for right unary operators.
ru: В отличие от коммутирующих операторов, два унарных оператора вполне могут быть обратными к друг другу; это будет означать, что (A x) равняется NOT (B x) для всех x (и для правых унарных операторов аналогично).

source: An operator's negator must have the same left and/or right operand types as the operator to be defined, so just as with <literal>COMMUTATOR</literal>, only the operator name need be given in the <literal>NEGATOR</literal> clause.
ru: У оператора, обратного данному, типы левого и/или правого операнда должны соответствовать типам данного оператора, так же как и с предложением <literal>COMMUTATOR</literal>; отличие только в том, что имя оператора задаётся в предложении <literal>NEGATOR</literal>.

source: Providing a negator is very helpful to the query optimizer since it allows expressions like <literal>NOT (x = y)</literal> to be simplified into <literal>x &lt;&gt; y</literal>. This comes up more often than you might think, because <literal>NOT</literal> operations can be inserted as a consequence of other rearrangements.
ru: Указание обратного оператора очень полезно для оптимизатора запросов, так как это позволяет упростить выражение вида <literal>NOT (x = y)</literal> до <literal>x &lt;&gt; y</literal>. Такие выражения не так редки, как может показаться, так как операции <literal>NOT</literal> могут добавляться автоматически в результате реорганизаций выражений.

source: Pairs of negator operators can be defined using the same methods explained above for commutator pairs.
ru: Пару обратных операторов можно определить теми же способами, что были описаны ранее для пары коммутирующих.

source: The <literal>RESTRICT</literal> clause, if provided, names a restriction selectivity estimation function for the operator. (Note that this is a function name, not an operator name.) <literal>RESTRICT</literal> clauses only make sense for binary operators that return <type>boolean</type>. The idea behind a restriction selectivity estimator is to guess what fraction of the rows in a table will satisfy a <literal>WHERE</literal>-clause condition of the form: <placeholder-1/> for the current operator and a particular constant value. This assists the optimizer by giving it some idea of how many rows will be eliminated by <literal>WHERE</literal> clauses that have this form. (What happens if the constant is on the left, you might be wondering? Well, that's one of the things that <literal>COMMUTATOR</literal> is for...)
ru: Предложение <literal>RESTRICT</literal>, если представлено, определяет функцию оценки избирательности ограничения для оператора. (Заметьте, что в нём задаётся имя функции, а не оператора.) Предложения <literal>RESTRICT</literal> имеют смысл только для бинарных операторов, возвращающих <type>boolean</type>. Идея оценки избирательности ограничения заключается в том, чтобы определить, какой процент строк в таблице будет удовлетворять условию <literal>WHERE</literal> вида: <placeholder-1/> для текущего оператора и определённого значения константы. Это помогает оптимизатору примерно определить, сколько строк будет исключено предложениями <literal>WHERE</literal> такого вида. (ВЫ спросите, а что если константа находится слева? Ну, собственно для таких случаев и задаётся <literal>COMMUTATOR</literal>...)

source: <placeholder-1/> for <placeholder-2/>
ru: <placeholder-1/> для <placeholder-2/>

source: <placeholder-1/> for <placeholder-2/> or <placeholder-3/>
ru: <placeholder-1/> для <placeholder-2/> или <placeholder-3/>

source: Writing new restriction selectivity estimation functions is far beyond the scope of this chapter, but fortunately you can usually just use one of the system's standard estimators for many of your own operators. These are the standard restriction estimators: <placeholder-1/> It might seem a little odd that these are the categories, but they make sense if you think about it. <literal>=</literal> will typically accept only a small fraction of the rows in a table; <literal>&lt;&gt;</literal> will typically reject only a small fraction. <literal>&lt;</literal> will accept a fraction that depends on where the given constant falls in the range of values for that table column (which, it just so happens, is information collected by <command>ANALYZE</command> and made available to the selectivity estimator). <literal>&lt;=</literal> will accept a slightly larger fraction than <literal>&lt;</literal> for the same comparison constant, but they're close enough to not be worth distinguishing, especially since we're not likely to do better than a rough guess anyhow. Similar remarks apply to <literal>&gt;</literal> and <literal>&gt;=</literal>.
ru: Разработка новых функций оценки избирательности ограничения выходит за рамки данной главы, но обычно можно использовать один из стандартных системных оценщиков для большинства дополнительных операторов. Стандартные оценщики ограничений следующие: <placeholder-1/> Может показаться немного странным, что выбраны именно эти категории, но если подумать, это имеет смысл. Оператор <literal>=</literal> обычно оставляет только небольшой процент строк в таблице, а <literal>&lt;&gt;</literal> отбрасывает то же количество. Оператор <literal>&lt;</literal> оставляет процент, зависящий от того, в какой диапазон значений определённого столбца таблицы попадает заданная константа (информация об этих диапазонах собирается командой <command>ANALYZE</command> и предоставляется оценщику избирательности). Оператор <literal>&lt;=</literal> оставляет чуть больший процент, чем <literal>&lt;</literal>, при сравнении с той же константой, но они настолько близки, что различать их не имеет смысла, так как это не даст лучшего результата, чем просто угадывание. Подобные замечания применимы и к операторам <literal>&gt;</literal> и <literal>&gt;=</literal>.

source: You can frequently get away with using either <function>eqsel</function> or <function>neqsel</function> for operators that have very high or very low selectivity, even if they aren't really equality or inequality. For example, the approximate-equality geometric operators use <function>eqsel</function> on the assumption that they'll usually only match a small fraction of the entries in a table.
ru: Часто вы можете обойтись функциями <function>eqsel</function> и <function>neqsel</function> для операторов с очень высокой или низкой избирательностью, даже если это не операторы собственно равенства или неравенства. Например, геометрические операторы приблизительного равенства используют <function>eqsel</function> в предположении, что соответствующие (равные) элементы будут составлять только небольшой процент от всех записей таблицы.

source: You can use <function>scalarltsel</function> and <function>scalargtsel</function> for comparisons on data types that have some sensible means of being converted into numeric scalars for range comparisons. If possible, add the data type to those understood by the function <function>convert_to_scalar()</function> in <filename>src/backend/utils/adt/selfuncs.c</filename>. (Eventually, this function should be replaced by per-data-type functions identified through a column of the <classname>pg_type</classname> system catalog; but that hasn't happened yet.) If you do not do this, things will still work, but the optimizer's estimates won't be as good as they could be.
ru: Функции <function>scalarltsel</function> и <function>scalargtsel</function> можно использовать для сравнений с типами данных, которые могут быть каким-либо осмысленным образом преобразованы в числовые скалярные значения для сравнения диапазонов. Если возможно, добавьте свой тип данных в число тех, что понимает функция <function>convert_to_scalar()</function> в <filename>src/backend/utils/adt/selfuncs.c</filename>. (Когда-нибудь эта функция должна быть заменена специализированными функциями, которые будут устанавливаться для конкретных типов в определённом столбце системного каталога <classname>pg_type</classname>; но сейчас это не так.) Если вы этого не сделаете, всё будет работать, но оценки оптимизатора будут не так хороши, как могли бы быть.

source: There are additional selectivity estimation functions designed for geometric operators in <filename>src/backend/utils/adt/geo_selfuncs.c</filename>: <function>areasel</function>, <function>positionsel</function>, and <function>contsel</function>. At this writing these are just stubs, but you might want to use them (or even better, improve them) anyway.
ru: Для геометрических операторов разработаны дополнительные функции оценки избирательности в <filename>src/backend/utils/adt/geo_selfuncs.c</filename>: <function>areasel</function>, <function>positionsel</function> и <function>contsel</function>. На момент написания документации это просто заглушки, но вы, тем не менее, вполне можете использовать (или ещё лучше, доработать) их.
