Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/btree-gist.po
Languages: ru

source: <filename>btree_gist</filename> provides GiST index operator classes that implement B-tree equivalent behavior for the data types <type>int2</type>, <type>int4</type>, <type>int8</type>, <type>float4</type>, <type>float8</type>, <type>numeric</type>, <type>timestamp with time zone</type>, <type>timestamp without time zone</type>, <type>time with time zone</type>, <type>time without time zone</type>, <type>date</type>, <type>interval</type>, <type>oid</type>, <type>money</type>, <type>char</type>, <type>varchar</type>, <type>text</type>, <type>bytea</type>, <type>bit</type>, <type>varbit</type>, <type>macaddr</type>, <type>macaddr8</type>, <type>inet</type>, <type>cidr</type>, <type>uuid</type>, and all <type>enum</type> types.
ru: Модуль <filename>btree_gist</filename> предоставляет показательные классы операторов GiST, реализующие поведение, подобное тому, что реализуют обычные классы B-дерева, для типов данных <type>int2</type>, <type>int4</type>, <type>int8</type>, <type>float4</type>, <type>float8</type>, <type>numeric</type>, <type>timestamp with time zone</type>, <type>timestamp without time zone</type>, <type>time with time zone</type>, <type>time without time zone</type>, <type>date</type>, <type>interval</type>, <type>oid</type>, <type>money</type>, <type>char</type>, <type>varchar</type>, <type>text</type>, <type>bytea</type>, <type>bit</type>, <type>varbit</type>, <type>macaddr</type>, <type>macaddr8</type>, <type>inet</type>, <type>cidr</type>, <type>uuid</type> и всех типов <type>enum</type>.

source: <filename>btree_gist</filename> provides GiST index operator classes that implement B-tree equivalent behavior for the data types <type>int2</type>, <type>int4</type>, <type>int8</type>, <type>float4</type>, <type>float8</type>, <type>numeric</type>, <type>timestamp with time zone</type>, <type>timestamp without time zone</type>, <type>time with time zone</type>, <type>time without time zone</type>, <type>date</type>, <type>interval</type>, <type>oid</type>, <type>money</type>, <type>char</type>, <type>varchar</type>, <type>text</type>, <type>bytea</type>, <type>bit</type>, <type>varbit</type>, <type>macaddr</type>, <type>inet</type>, and <type>cidr</type>.
ru: Модуль <filename>btree_gist</filename> предоставляет показательные классы операторов GiST, реализующие поведение, подобное тому, что реализуют обычные классы B-дерева, для типов данных <type>int2</type>, <type>int4</type>, <type>int8</type>, <type>float4</type>, <type>float8</type>, <type>numeric</type>, <type>timestamp with time zone</type>, <type>timestamp without time zone</type>, <type>time with time zone</type>, <type>time without time zone</type>, <type>date</type>, <type>interval</type>, <type>oid</type>, <type>money</type>, <type>char</type>, <type>varchar</type>, <type>text</type>, <type>bytea</type>, <type>bit</type>, <type>varbit</type>, <type>macaddr</type>, <type>inet</type> и <type>cidr</type>.

source: In general, these operator classes will not outperform the equivalent standard B-tree index methods, and they lack one major feature of the standard B-tree code: the ability to enforce uniqueness. However, they provide some other features that are not available with a B-tree index, as described below. Also, these operator classes are useful when a multicolumn GiST index is needed, wherein some of the columns are of data types that are only indexable with GiST but other columns are just simple data types. Lastly, these operator classes are useful for GiST testing and as a base for developing other GiST operator classes.
ru: Вообще говоря, эти классы операторов не будут работать быстрее аналогичных стандартных методов индекса-B-дерева, и им не хватает одной важной возможности стандартной реализации B-дерева: возможности ограничивать уникальность. Однако они предлагают несколько других возможностей, описанных ниже. Также эти классы операторов полезны, когда требуется составной индекс GiST, в котором некоторые столбцы имеют типы данных, индексируемые только с GiST, а другие — простые типы. Наконец, эти классы операторов можно применять для тестирования GiST или взять за основу для разработки других классов операторов GiST.

source: In addition to the typical B-tree search operators, <filename>btree_gist</filename> also provides index support for <literal>&lt;&gt;</literal> (<quote>not equals</quote>). This may be useful in combination with an <link linkend="sql-createtable-exclude">exclusion constraint</link>, as described below.
ru: Помимо типичных операторов поиска по B-дереву, <filename>btree_gist</filename> также поддерживает использование индекса для операции <literal>&lt;&gt;</literal> (<quote>не равно</quote>). Это может быть полезно в сочетании с <link linkend="sql-createtable-exclude">ограничением-исключением</link>, как описано ниже.

source: Also, for data types for which there is a natural distance metric, <filename>btree_gist</filename> defines a distance operator <literal>&lt;-&gt;</literal>, and provides GiST index support for nearest-neighbor searches using this operator. Distance operators are provided for <type>int2</type>, <type>int4</type>, <type>int8</type>, <type>float4</type>, <type>float8</type>, <type>timestamp with time zone</type>, <type>timestamp without time zone</type>, <type>time without time zone</type>, <type>date</type>, <type>interval</type>, <type>oid</type>, and <type>money</type>.
ru: Также, для типов данных, имеющих естественную метрику расстояния, <filename>btree_gist</filename> определяет оператор расстояния <literal>&lt;-&gt;</literal> и поддерживает использование индексов GiST для поиска ближайших соседей с применением этого оператора. Операторы расстояния определены для типов <type>int2</type>, <type>int4</type>, <type>int8</type>, <type>float4</type>, <type>float8</type>, <type>timestamp with time zone</type>, <type>timestamp without time zone</type>, <type>time without time zone</type>, <type>date</type>, <type>interval</type>, <type>oid</type> и <type>money</type>.

source: Example Usage
ru: Пример использования

source: Simple example using <literal>btree_gist</literal> instead of <literal>btree</literal>:
ru: Простой пример использования <literal>btree_gist</literal> вместо <literal>btree</literal>:

source: CREATE TABLE test (a int4); -- create index CREATE INDEX testidx ON test USING GIST (a); -- query SELECT * FROM test WHERE a &lt; 10; -- nearest-neighbor search: find the ten entries closest to "42" SELECT *, a &lt;-&gt; 42 AS dist FROM test ORDER BY a &lt;-&gt; 42 LIMIT 10;
ru: CREATE TABLE test (a int4); -- создать индекс CREATE INDEX testidx ON test USING GIST (a); -- запрос SELECT * FROM test WHERE a &lt; 10; -- поиск ближайших соседей: найти десять записей, ближайших к "42" SELECT *, a &lt;-&gt; 42 AS dist FROM test ORDER BY a &lt;-&gt; 42 LIMIT 10;

source: Use an <link linkend="sql-createtable-exclude">exclusion constraint</link> to enforce the rule that a cage at a zoo can contain only one kind of animal:
ru: Так можно использовать <link linkend="sql-createtable-exclude">ограничение-исключение</link>, состоящее в том, что в клетке в зоопарке могут содержаться животные только одного типа:

source: Authors
ru: Авторы

source: Teodor Sigaev (<email>teodor@stack.net</email>), Oleg Bartunov (<email>oleg@sai.msu.su</email>), Janko Richter (<email>jankorichter@yahoo.de</email>), and Paul Jungwirth (<email>pj@illuminatedcomputing.com</email>). See <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/> for additional information.
ru: Фёдор Сигаев (<email>teodor@stack.net</email>), Олег Бартунов (<email>oleg@sai.msu.su</email>), Янко Рихтер (<email>jankorichter@yahoo.de</email>) и Пол Юнгвирт (<email>pj@illuminatedcomputing.com</email>). Подробности можно найти на странице <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/>.

source: Teodor Sigaev (<email>teodor@stack.net</email>), Oleg Bartunov (<email>oleg@sai.msu.su</email>), and Janko Richter (<email>jankorichter@yahoo.de</email>). See <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/> for additional information.
ru: Фёдор Сигаев (<email>teodor@stack.net</email>), Олег Бартунов (<email>oleg@sai.msu.su</email>) и Янко Рихтер (<email>jankorichter@yahoo.de</email>). Подробности можно найти на странице <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/>.
