Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/custom-scan.po
Languages: ru

source: <placeholder-1/> Re-initialize the dynamic shared memory required for parallel operation when the custom-scan plan node is about to be re-scanned. This callback is optional, and need only be supplied if this custom scan provider supports parallel execution. Recommended practice is that this callback reset only shared state, while the <function>ReScanCustomScan</function> callback resets only local state. Currently, this callback will be called before <function>ReScanCustomScan</function>, but it's best not to rely on that ordering.
ru: <placeholder-1/> Заново инициализирует динамическую разделяемую память, требуемую для параллельной операции, перед тем как будет повторно прочитан узел нестандартного сканирования. Этот обработчик является необязательным и должен устанавливаться, только если провайдер нестандартного сканирования поддерживает параллельное выполнение. В этом обработчике рекомендуется сбрасывать только общее состояние, а в обработчике <function>ReScanCustomScan</function> сбрасывать только локальное. В настоящее время этот обработчик будет вызываться перед <function>ReScanCustomScan</function>, но лучше на этот порядок не рассчитывать.

source: <placeholder-1/> Initialize a parallel worker's custom state based on the shared state set up in the leader by <literal>InitializeDSMCustomScan</literal>. This callback is optional, and needs only be supplied if this custom path supports parallel execution.
ru: <placeholder-1/> Инициализирует собственное состояние параллельного исполнителя на основе общего состояния, заданного ведущим исполнителем при вызове <literal>InitializeDSMCustomScan</literal>. Этот обработчик является необязательным и должен устанавливаться, только если провайдер нестандартного сканирования поддерживает параллельное выполнение.

source: <placeholder-1/> Initialize a parallel worker's local state based on the shared state set up by the leader during <function>InitializeDSMCustomScan</function>. This callback is optional, and need only be supplied if this custom scan provider supports parallel execution.
ru: <placeholder-1/> Инициализирует локальное состояние параллельного исполнителя на основе общего состояния, заданного ведущим исполнителем во время <function>InitializeDSMCustomScan</function>. Этот обработчик является необязательным и должен устанавливаться, только если провайдер нестандартного сканирования поддерживает параллельное выполнение.

source: <placeholder-1/> Release resources when it is anticipated the node will not be executed to completion. This is not called in all cases; sometimes, <literal>EndCustomScan</literal> may be called without this function having been called first. Since the DSM segment used by parallel query is destroyed just after this callback is invoked, custom scan providers that wish to take some action before the DSM segment goes away should implement this method.
ru: <placeholder-1/> Освобождает ресурсы, когда становится понятно, что этот узел больше не будет выполняться. Этот обработчик вызывается не во всех случаях; иногда может вызываться только <literal>EndCustomScan</literal>. Так как сегмент DSM, используемый параллельным запросом, освобождается сразу после вызова этого обработчика, провайдеры нестандартного сканирования, которым нужно выполнять некоторые действия до ликвидации сегмента DSM, должны реализовывать этот метод.

source: <placeholder-1/> Output additional information for <command>EXPLAIN</command> of a custom-scan plan node. This callback is optional. Common data stored in the <structname>ScanState</structname>, such as the target list and scan relation, will be shown even without this callback, but the callback allows the display of additional, private state.
ru: <placeholder-1/> Выводит дополнительную информацию для <command>EXPLAIN</command> об узле нестандартного сканирования. Этот обработчик является необязательным. Общие данные, сохранённые в <structname>ScanState</structname>, такие как целевой список и сканируемое отношение, будут выводиться и без этого обработчика, но с помощью этого обработчика можно выдать дополнительные, внутренние сведения.
