Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/datetime.po
Languages: ru

source: Date/Time Support
ru: Поддержка даты и времени

source: <productname>PostgreSQL</productname> uses an internal heuristic parser for all date/time input support. Dates and times are input as strings, and are broken up into distinct fields with a preliminary determination of what kind of information can be in the field. Each field is interpreted and either assigned a numeric value, ignored, or rejected. The parser contains internal lookup tables for all textual fields, including months, days of the week, and time zones.
ru: <productname>PostgreSQL</productname> использует внутренний эвристический анализатор для поддержки всех значений даты и времени. Дата и время вводятся как строки и разделяются на различные поля, при этом предварительно определяется, какого рода информация содержится в конкретном поле. Каждое поле интерпретируется и получает числовое значение, игнорируется или отклоняется. Анализатор содержит внутренние справочные таблицы для текстовых полей, включая месяцы, дни недели и часовые пояса.

source: This appendix includes information on the content of these lookup tables and describes the steps used by the parser to decode dates and times.
ru: Данное приложение включает информацию о содержании справочных таблиц и описывает этапы, необходимые анализатору для распознавания даты и времени.

source: Date/Time Input Interpretation
ru: Интерпретация данных даты и времени

source: The date/time type inputs are all decoded using the following procedure.
ru: Все значения даты и времени расшифровываются при помощи следующей процедуры.

source: Break the input string into tokens and categorize each token as a string, time, time zone, or number.
ru: Разделить входную строку на фрагменты и определить каждый фрагмент как строку, время, часовой пояс или цифру.

source: If the numeric token contains a colon (<literal>:</literal>), this is a time string. Include all subsequent digits and colons.
ru: Если числовой фрагмент содержит двоеточие (<literal>:</literal>), значит эта строка представляет время. Включаются все последующие цифры и двоеточия.

source: If the numeric token contains a dash (<literal>-</literal>), slash (<literal>/</literal>), or two or more dots (<literal>.</literal>), this is a date string which might have a text month. If a date token has already been seen, it is instead interpreted as a time zone name (e.g., <literal>America/New_York</literal>).
ru: Если числовой фрагмент содержит тире (<literal>-</literal>), косую черту (<literal>/</literal>) или две и более точек (<literal>.</literal>), то это строка даты, которая, возможно, включает название месяца. Если фрагмент даты уже встречался, он интерпретируется как название часового пояса (например, <literal>America/New_York</literal>).

source: If the token is numeric only, then it is either a single field or an ISO 8601 concatenated date (e.g., <literal>19990113</literal> for January 13, 1999) or time (e.g., <literal>141516</literal> for 14:15:16).
ru: Если этот фрагмент является лишь числом, он представляет собой отдельное поле или составную дату ISO 8601 (например, <literal>19990113</literal> для 13 января 1999 года) или время (например, <literal>141516</literal> для 14:15:16).

source: If the token starts with a plus (<literal>+</literal>) or minus (<literal>-</literal>), then it is either a numeric time zone or a special field.
ru: Если фрагмент начинается с плюса (<literal>+</literal>) или минуса (<literal>-</literal>), то это или числовой часовой пояс или специальное поле.

source: If the token is a text string, match up with possible strings:
ru: Если фрагмент является текстовой строкой, сопоставить его с возможными строками:

source: Do a binary-search table lookup for the token as a time zone abbreviation.
ru: Выполнить двоичный поиск в справочной таблице соответствующего фрагмента в виде аббревиатуры часового пояса.

source: If not found, do a similar binary-search table lookup to match the token as either a special string (e.g., <literal>today</literal>), day (e.g., <literal>Thursday</literal>), month (e.g., <literal>January</literal>), or noise word (e.g., <literal>at</literal>, <literal>on</literal>).
ru: Если фрагмент не найден, выполнить подобный просмотр в таблице двоичного поиска, чтобы определить фрагмент как специальную строку (например, <literal>today</literal>), день (например, <literal>Thursday</literal>), месяц (например, <literal>January</literal>) или неучитываемое слово (например, <literal>at</literal>, <literal>on</literal>).

source: If still not found, throw an error.
ru: Если фрагмент всё же не найден, выдать ошибку.

source: When the token is a number or number field:
ru: Когда фрагмент является числом или числовым полем:

source: If there are eight or six digits, and if no other date fields have been previously read, then interpret as a <quote>concatenated date</quote> (e.g., <literal>19990118</literal> or <literal>990118</literal>). The interpretation is <literal>YYYYMMDD</literal> or <literal>YYMMDD</literal>.
ru: Если получено восемь или шесть цифр и никакое другое поле даты ранее не было прочитано, интерпретировать их как <quote>составленную дату</quote> (например, <literal>19990118</literal> или <literal>990118</literal>). Такая дата интерпретируется как <literal>ГГГГММДД</literal> или <literal>ГГММДД</literal>.

source: If the token is three digits and a year has already been read, then interpret as day of year.
ru: Если фрагмент представляет собой трёхзначное число, и год уже был прочитан, интерпретировать как день года.

source: If four or six digits and a year has already been read, then interpret as a time (<literal>HHMM</literal> or <literal>HHMMSS</literal>).
ru: Если это четыре или шесть цифр и год уже был прочитан, интерпретировать как время (<literal>ЧЧММ</literal> или <literal>ЧЧММСС</literal>).

source: If three or more digits and no date fields have yet been found, interpret as a year (this forces yy-mm-dd ordering of the remaining date fields).
ru: Если найдены три или более цифр, а поля даты ещё не были найдены, интерпретировать как год (это ведёт к установке порядка гг-мм-дд для оставшихся полей даты).

source: Otherwise the date field ordering is assumed to follow the <varname>DateStyle</varname> setting: mm-dd-yy, dd-mm-yy, or yy-mm-dd. Throw an error if a month or day field is found to be out of range.
ru: В противном случае подразумевается, что порядок сортировки полей даты определяется значением <varname>DateStyle</varname>: мм-дд-гг, дд-мм-гг или гг-мм-дд. Выдать ошибку, если оказалось, что поле месяца или дня вышло за пределы диапазона.

source: If BC has been specified, negate the year and add one for internal storage. (There is no year zero in the Gregorian calendar, so numerically 1 BC becomes year zero.)
ru: Если указан год до н. э., отнять год и добавить единицу для внутреннего хранения. (В григорианском календаре отсутствует нулевой год, поэтому 1 год до н. э. становится нулевым.)

source: Gregorian years AD 1-99 can be entered by using 4 digits with leading zeros (e.g., <literal>0099</literal> is AD 99).
ru: Годы с 1 по 99 н. э. по григорианскому календарю могут вводится при помощи четырёхзначного числа с начальными нулями (например, <literal>0099</literal> это год 99 н. э.).

source: If BC was not specified, and if the year field was two digits in length, then adjust the year to four digits. If the field is less than 70, then add 2000, otherwise add 1900. <placeholder-1/>
ru: Если год до н. э. не был указан, и если поле года имело два разряда, установить для записи года четыре разряда. Если поле меньше 70, добавить 2000, в противном случае добавить 1900. <placeholder-1/>

source: Date/Time Key Words
ru: Ключевые слова для обозначения даты и времени

source: <xref linkend="datetime-month-table"/> shows the tokens that are recognized as names of months.
ru: <xref linkend="datetime-month-table"/> показывает фрагменты, которые распознаются как названия месяцев.

source: Month Names
ru: Названия месяцев

source: Month
ru: Месяц

source: Abbreviations
ru: Аббревиатуры

source: <xref linkend="datetime-dow-table"/> shows the tokens that are recognized as names of days of the week.
ru: <xref linkend="datetime-dow-table"/> показывает фрагменты, которые распознаются как названия дней недели.

source: Day of the Week Names
ru: Названия дней недели

source: Day
ru: День

source: <xref linkend="datetime-mod-table"/> shows the tokens that serve various modifier purposes.
ru: <xref linkend="datetime-mod-table"/> показывает фрагменты, которые выполняют различные функции модификаторов.

source: Date/Time Field Modifiers
ru: Модификаторы поля даты/времени

source: Identifier
ru: Идентификатор

source: Description
ru: Описание

source: Time is before 12:00
ru: Время до 12:00

source: Ignored
ru: игнорируется

source: Next field is Julian Date
ru: Следующее поле является юлианской датой

source: Time is on or after 12:00
ru: Время 12:00 и более позднее

source: Next field is time
ru: Следующее поле указывает на время

source: Date/Time Configuration Files
ru: Файлы конфигурации даты/времени

source: <primary>time zone</primary> <secondary>input abbreviations</secondary>
ru: <primary>часовой пояс</primary> <secondary>ввод аббревиатур</secondary>

source: Since timezone abbreviations are not well standardized, <productname>PostgreSQL</productname> provides a means to customize the set of abbreviations accepted by the server. The <xref linkend="guc-timezone-abbreviations"/> run-time parameter determines the active set of abbreviations. While this parameter can be altered by any database user, the possible values for it are under the control of the database administrator &mdash; they are in fact names of configuration files stored in <filename>.../share/timezonesets/</filename> of the installation directory. By adding or altering files in that directory, the administrator can set local policy for timezone abbreviations.
ru: Поскольку аббревиатуры часовых поясов недостаточно стандартизированы, <productname>PostgreSQL</productname> предлагает средства для определения набора аббревиатур, принимаемых сервером. Параметром выполнения <xref linkend="guc-timezone-abbreviations"/> определяется активный набор аббревиатур. Хотя данный параметр может быть изменён любым пользователем базы данных, возможные значения для него контролируются администратором базы данных и являются именами конфигурационных файлов, хранящихся в <filename>.../share/timezonesets/</filename> каталога установки. Добавляя или изменяя файлы в этом каталоге, администратор может определить местную специфику выбора аббревиатур часовых поясов.

source: <varname>timezone_abbreviations</varname> can be set to any file name found in <filename>.../share/timezonesets/</filename>, if the file's name is entirely alphabetic. (The prohibition against non-alphabetic characters in <varname>timezone_abbreviations</varname> prevents reading files outside the intended directory, as well as reading editor backup files and other extraneous files.)
ru: Значение <varname>timezone_abbreviations</varname> может быть установлено в любое имя файла, находящегося в <filename>.../share/timezonesets/</filename>, если имя файла состоит только из букв. (Запрет на использование небуквенных символов в <varname>timezone_abbreviations</varname> делает невозможным чтение файлов, находящихся вне заданного каталога, а также резервных файлов редактора и прочих внешних файлов.)

source: A timezone abbreviation file can contain blank lines and comments beginning with <literal>#</literal>. Non-comment lines must have one of these formats: <synopsis> <replaceable>zone_abbreviation</replaceable> <replaceable>offset</replaceable> <replaceable>zone_abbreviation</replaceable> <replaceable>offset</replaceable> D <replaceable>zone_abbreviation</replaceable> <replaceable>time_zone_name</replaceable> @INCLUDE <replaceable>file_name</replaceable> @OVERRIDE </synopsis>
ru: Файл аббревиатур часовых поясов может содержать пустые строки и комментарии, начинающиеся с <literal>#</literal>. Строки, не имеющие комментариев, должны иметь один из следующих форматов: <synopsis> <replaceable>аббревиатура_пояса</replaceable> <replaceable>смещение</replaceable> <replaceable>аббревиатура_пояса</replaceable> <replaceable>смещение</replaceable> D <replaceable>аббревиатура_пояса</replaceable> <replaceable>имя_часового_пояса</replaceable> @INCLUDE <replaceable>имя_файла</replaceable> @OVERRIDE </synopsis>

source: A <replaceable>zone_abbreviation</replaceable> is just the abbreviation being defined. An <replaceable>offset</replaceable> is an integer giving the equivalent offset in seconds from UTC, positive being east from Greenwich and negative being west. For example, -18000 would be five hours west of Greenwich, or North American east coast standard time. <literal>D</literal> indicates that the zone name represents local daylight-savings time rather than standard time.
ru: Поле <replaceable>аббревиатура_пояса</replaceable> лишь задаёт определяемую аббревиатуру. <replaceable>Смещение</replaceable> — это целое число, задающее эквивалентное смещение от UTC в секундах, положительное — к востоку от Гринвичского меридиана, а отрицательное — к западу. Например, -18000 означало бы пять часов к западу от Гринвича, или Североамериканское восточное время. <literal>D</literal> указывает, что название пояса представляет местное летнее, а не поясное время.

source: Alternatively, a <replaceable>time_zone_name</replaceable> can be given, referencing a zone name defined in the IANA timezone database. The zone's definition is consulted to see whether the abbreviation is or has been in use in that zone, and if so, the appropriate meaning is used &mdash; that is, the meaning that was currently in use at the timestamp whose value is being determined, or the meaning in use immediately before that if it wasn't current at that time, or the oldest meaning if it was used only after that time. This behavior is essential for dealing with abbreviations whose meaning has historically varied. It is also allowed to define an abbreviation in terms of a zone name in which that abbreviation does not appear; then using the abbreviation is just equivalent to writing out the zone name.
ru: В качестве альтернативы может быть задано <replaceable>имя_часового_пояса</replaceable>, определённое в базе данных часовых поясов IANA. В этом случае система обращается к определению пояса, чтобы выяснить, используется или использовалась ли аббревиатура для этого пояса, и если да, действовать будет соответствующее значение &mdash; то есть, значение, действовавшее в указанный момент времени, или действовавшее непосредственно перед ним, если текущее на тот момент неизвестно, либо самое старое значение, если первое определение появилось после этого момента. Это поведение важно для тех аббревиатур, значение которых менялось в ходе истории. Также допускается определение аббревиатуры через имя часового пояса, с которым эта аббревиатура не связана; в таком случае использование аббревиатуры равнозначно написанию просто имени пояса.

source: Using a simple integer <replaceable>offset</replaceable> is preferred when defining an abbreviation whose offset from UTC has never changed, as such abbreviations are much cheaper to process than those that require consulting a time zone definition.
ru: Простое целочисленное <replaceable>смещение</replaceable> предпочтительнее использовать, когда определяется аббревиатура, смещение которой от UTC никогда не менялось, так как обрабатывать подобные аббревиатуры гораздо легче, чем те, что требуют обращения к определению часового пояса.

source: The <literal>@INCLUDE</literal> syntax allows inclusion of another file in the <filename>.../share/timezonesets/</filename> directory. Inclusion can be nested, to a limited depth.
ru: Использование <literal>@INCLUDE</literal> позволяет включить другой файл в каталоге <filename>.../share/timezonesets/</filename>. Включение может быть вложенным до ограниченной глубины.

source: The <literal>@OVERRIDE</literal> syntax indicates that subsequent entries in the file can override previous entries (typically, entries obtained from included files). Without this, conflicting definitions of the same timezone abbreviation are considered an error.
ru: Использование <literal>@OVERRIDE</literal> указывает, что последующие записи в файле могут переопределять предыдущие (как правило, это записи, полученные из включённых файлов). Без этого указания конфликтующие определения аббревиатуры одного и того же часового пояса считаются ошибкой.

source: In an unmodified installation, the file <filename>Default</filename> contains all the non-conflicting time zone abbreviations for most of the world. Additional files <filename>Australia</filename> and <filename>India</filename> are provided for those regions: these files first include the <literal>Default</literal> file and then add or modify abbreviations as needed.
ru: При установке без внесения изменений, файл <filename>Default</filename> содержит все неконфликтующие аббревиатуры часовых поясов для большей части земного шара. Дополнительные файлы <filename>Australia</filename> и <filename>India</filename> предоставляются для данных регионов. Эти файлы сначала включают файл <literal>Default</literal>, а затем добавляют и изменяют аббревиатуры по мере необходимости.

source: For reference purposes, a standard installation also contains files <filename>Africa.txt</filename>, <filename>America.txt</filename>, etc, containing information about every time zone abbreviation known to be in use according to the IANA timezone database. The zone name definitions found in these files can be copied and pasted into a custom configuration file as needed. Note that these files cannot be directly referenced as <varname>timezone_abbreviations</varname> settings, because of the dot embedded in their names.
ru: В качестве справочной информации стандартная установка также содержит файлы <filename>Africa.txt</filename>, <filename>America.txt</filename> и т. д., содержащие информацию о каждой используемой аббревиатуре часового пояса, включённой в базу данных часовых поясов IANA. Определения названий часовых поясов, находящиеся в этих файлах, можно копировать и помещать в файл с нестандартной конфигурацией по мере необходимости. Заметьте, что данные файлы нельзя указывать непосредственно в значении <varname>timezone_abbreviations</varname>, так как их имена включают точку.

source: If an error occurs while reading the time zone abbreviation set, no new value is applied and the old set is kept. If the error occurs while starting the database, startup fails.
ru: Если при чтении набора аббревиатур часовых поясов возникает ошибка, новое значение не применяется и сохраняется старый набор. Если ошибка возникает при запуске базы данных, происходит сбой.

source: Time zone abbreviations defined in the configuration file override non-timezone meanings built into <productname>PostgreSQL</productname>. For example, the <filename>Australia</filename> configuration file defines <literal>SAT</literal> (for South Australian Standard Time). When this file is active, <literal>SAT</literal> will not be recognized as an abbreviation for Saturday.
ru: Аббревиатуры часового пояса, определённые в файле конфигурации, переопределяют не относящиеся к часовому поясу значения, встроенные в <productname>PostgreSQL</productname>. Например, файл конфигурации <filename>Australia</filename> определяет <literal>SAT</literal> (для Южноавстралийского стандартного времени, South Australian Standard Time). Когда этот файл активен, <literal>SAT</literal> не будет распознаваться как сокращение слова "суббота".

source: If you modify files in <filename>.../share/timezonesets/</filename>, it is up to you to make backups &mdash; a normal database dump will not include this directory.
ru: Если вы модифицируете файлы в <filename>.../share/timezonesets/</filename>, вы можете сами выполнить резервное копирование, так как обычный дамп базы данных не содержит этот каталог.

source: History of Units
ru: История единиц измерения времени

source: <primary>Gregorian calendar</primary>
ru: <primary>Григорианский календарь </primary>

source: <primary>Julian date</primary>
ru: <primary>Юлианская дата</primary>

source: The SQL standard states that <quote>Within the definition of a <quote>datetime literal</quote>, the <quote>datetime values</quote> are constrained by the natural rules for dates and times according to the Gregorian calendar</quote>. <productname>PostgreSQL</productname> follows the SQL standard's lead by counting dates exclusively in the Gregorian calendar, even for years before that calendar was in use. This rule is known as the <firstterm>proleptic Gregorian calendar</firstterm>.
ru: Стандарт SQL устанавливает, что <quote>В определении <quote>литерала типа дата-время</quote>, <quote>значения типа дата-время</quote> ограничены естественными правилами, касающимися дат и времени согласно григорианскому календарю</quote>. Следуя стандарту SQL, <productname>PostgreSQL</productname> подсчитывает даты исключительно в григорианском календаре, включая годы, когда этот календарь ещё не использовался. Это правило известно как <firstterm>пролептический григорианский календарь</firstterm>.

source: The Julian calendar was introduced by Julius Caesar in 45 BC. It was in common use in the Western world until the year 1582, when countries started changing to the Gregorian calendar. In the Julian calendar, the tropical year is approximated as 365 1/4 days = 365.25 days. This gives an error of about 1 day in 128 years.
ru: Юлианский календарь был введён Юлием Цезарем в 45 г. до н. э. Он широко использовался западной цивилизацией до 1582 года, когда страны начали переходить на григорианский календарь. В юлианском календаре тропический год длится приблизительно 365 1/4 дня = 365,25 дня. Каждые 128 лет накапливается примерно 1 день.

source: The accumulating calendar error prompted Pope Gregory XIII to reform the calendar in accordance with instructions from the Council of Trent. In the Gregorian calendar, the tropical year is approximated as 365 + 97 / 400 days = 365.2425 days. Thus it takes approximately 3300 years for the tropical year to shift one day with respect to the Gregorian calendar.
ru: Накапливающаяся погрешность побудила папу Григория XIII реформировать календарь в соответствии с постановлениями Тридентского собора. В григорианском календаре тропический год длится приблизительно 365 + 97 / 400 дней = 365,2425 дней. Таком образом, погрешность в один день тропического года накапливается примерно за 3300 лет.

source: Every year divisible by 4 is a leap year.
ru: Каждый год кратный 4 является високосным.

source: However, every year divisible by 100 is not a leap year.
ru: Однако каждый год кратный 100 не является високосным.

source: However, every year divisible by 400 is a leap year after all.
ru: Тем не менее, каждый год кратный 400 всё же является високосным.

source: The approximation 365+97/400 is achieved by having 97 leap years every 400 years, using the following rules: <placeholder-1/> So, 1700, 1800, 1900, 2100, and 2200 are not leap years. But 1600, 2000, and 2400 are leap years. By contrast, in the older Julian calendar all years divisible by 4 are leap years.
ru: Приблизительное число 365+97/400 получается из-за того, что из каждых 400 лет 97 високосные. При этом действуют следующие правила: <placeholder-1/> Таким образом, 1700, 1800, 1900, 2100 и 2200 не являются високосными годами. Но 1600, 2000 и 2400 — високосные. А в юлианском календаре високосными считаются все годы, кратные 4.
