Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/fdwhandler.po
Languages: ru

source: The <literal>rowid</literal> is the <structfield>ctid</structfield> value previously read for the row to be re-fetched. Although the <literal>rowid</literal> value is passed as a <type>Datum</type>, it can currently only be a <type>tid</type>. The function API is chosen in hopes that it may be possible to allow other data types for row IDs in future.
ru: В <literal>rowid</literal> передаётся значение <structfield>ctid</structfield>, полученное ранее для строки, которую нужно считать повторно. Хотя значение <literal>rowid</literal> передаётся в виде <type>Datum</type>, в настоящее время это может быть только <type>tid</type>. Такой интерфейс функции выбран с расчётом на то, чтобы в будущем в качестве идентификаторов строк могли приниматься и другие типы данных.

source: If the <function>RefetchForeignRow</function> pointer is set to <literal>NULL</literal>, attempts to re-fetch rows will fail with an error message.
ru: Если указатель на <function>RefetchForeignRow</function> равен <literal>NULL</literal>, повторно выбрать данные не удастся, в ответ будет выдаваться сообщение об ошибке.

source: <placeholder-1/> Recheck that a previously-returned tuple still matches the relevant scan and join qualifiers, and possibly provide a modified version of the tuple. For foreign data wrappers which do not perform join pushdown, it will typically be more convenient to set this to <literal>NULL</literal> and instead set <structfield>fdw_recheck_quals</structfield> appropriately. When outer joins are pushed down, however, it isn't sufficient to reapply the checks relevant to all the base tables to the result tuple, even if all needed attributes are present, because failure to match some qualifier might result in some attributes going to NULL, rather than in no tuple being returned. <literal>RecheckForeignScan</literal> can recheck qualifiers and return true if they are still satisfied and false otherwise, but it can also store a replacement tuple into the supplied slot.
ru: <placeholder-1/> Перепроверяет, соответствует ли по-прежнему ранее возвращённый кортеж применимым условиям сканирования и соединения, и возможно выдаёт изменённую версию кортежа. Для обёрток сторонних данных, которые не выносят соединение наружу, обычно удобнее присвоить этому указателю <literal>NULL</literal> и задать <structfield>fdw_recheck_quals</structfield>. Однако, когда внешние соединения выносятся наружу, недостаточно повторно применить к результирующему кортежу проверки, относящиеся ко всем базовым таблицам, даже если присутствуют все атрибуты, так как невыполнение некоторого условия может приводить и к обнулению некоторых атрибутов, а не только исключению этого кортежа. <literal>RecheckForeignScan</literal> может перепроверить условия и возвратить true, если они по-прежнему выполняются, или false в противном случае, но также она может записать в переданный слот кортеж на замену предыдущему.

source: To implement join pushdown, a foreign data wrapper will typically construct an alternative local join plan which is used only for rechecks; this will become the outer subplan of the <literal>ForeignScan</literal>. When a recheck is required, this subplan can be executed and the resulting tuple can be stored in the slot. This plan need not be efficient since no base table will return more than one row; for example, it may implement all joins as nested loops. The function <literal>GetExistingLocalJoinPath</literal> may be used to search existing paths for a suitable local join path, which can be used as the alternative local join plan. <literal>GetExistingLocalJoinPath</literal> searches for an unparameterized path in the path list of the specified join relation. (If it does not find such a path, it returns NULL, in which case a foreign data wrapper may build the local path by itself or may choose not to create access paths for that join.)
ru: Чтобы вынести соединение наружу, обёртка сторонних данных обычно конструирует альтернативный план локального соединения, применяемый только для перепроверок; он становится внешним подпланом узла <literal>ForeignScan</literal>. Когда требуется перепроверка, может быть выполнен этот подплан и результирующий кортеж сохранён в слоте. Этот план может не быть эффективным, так как ни одна базовая таблица не выдаст больше одной строки; например, он может реализовывать все соединения в виде вложенных циклов. Для поиска подходящего локального пути соединения в существующих путях можно воспользоваться функцией <literal>GetExistingLocalJoinPath</literal>. Функция <literal>GetExistingLocalJoinPath</literal> ищет непараметризованный путь в списке путей заданного отношения соединения. (Если такой путь не находится, она возвращает NULL, и в этом случае обёртка сторонних данных может построить локальный путь сама или решить не создавать пути доступа для этого соединения.)

source: FDW Routines for <command>EXPLAIN</command>
ru: Подпрограммы FDW для <command>EXPLAIN</command>

source: <placeholder-1/> Print additional <command>EXPLAIN</command> output for a foreign table scan. This function can call <function>ExplainPropertyText</function> and related functions to add fields to the <command>EXPLAIN</command> output. The flag fields in <literal>es</literal> can be used to determine what to print, and the state of the <structname>ForeignScanState</structname> node can be inspected to provide run-time statistics in the <command>EXPLAIN ANALYZE</command> case.
ru: <placeholder-1/> Дополняет вывод <command>EXPLAIN</command> для сканирования сторонней таблицы. Эта функция может вызывать <function>ExplainPropertyText</function> и связанные функции и добавлять поля в вывод <command>EXPLAIN</command>. Поля флагов в <literal>es</literal> позволяют определить, что именно выводить, а для выдачи статистики времени выполнения в случае с <command>EXPLAIN ANALYZE</command> можно проанализировать состояние узла <structname>ForeignScanState</structname>.

source: If the <function>ExplainForeignScan</function> pointer is set to <literal>NULL</literal>, no additional information is printed during <command>EXPLAIN</command>.
ru: Если указатель <function>ExplainForeignScan</function> равен <literal>NULL</literal>, никакая дополнительная информация при <command>EXPLAIN</command> не выводится.

source: <placeholder-1/> Print additional <command>EXPLAIN</command> output for a foreign table update. This function can call <function>ExplainPropertyText</function> and related functions to add fields to the <command>EXPLAIN</command> output. The flag fields in <literal>es</literal> can be used to determine what to print, and the state of the <structname>ModifyTableState</structname> node can be inspected to provide run-time statistics in the <command>EXPLAIN ANALYZE</command> case. The first four arguments are the same as for <function>BeginForeignModify</function>.
ru: <placeholder-1/> Дополняет вывод <command>EXPLAIN</command> для изменений в сторонней таблице. Эта функция может вызывать <function>ExplainPropertyText</function> и связанные функции и добавлять поля в вывод <command>EXPLAIN</command>. Поля флагов в <literal>es</literal> позволяют определить, что именно выводить, а для выдачи статистики времени выполнения в случае с <command>EXPLAIN ANALYZE</command> можно проанализировать состояние узла <structname>ModifyTableState</structname>. Первые четыре аргумента у этой функции те же, что и у <function>BeginForeignModify</function>.

source: If the <function>ExplainForeignModify</function> pointer is set to <literal>NULL</literal>, no additional information is printed during <command>EXPLAIN</command>.
ru: Если указатель <function>ExplainForeignModify</function> равен <literal>NULL</literal>, никакая дополнительная информация при <command>EXPLAIN</command> не выводится.

source: <placeholder-1/> Print additional <command>EXPLAIN</command> output for a direct modification on the remote server. This function can call <function>ExplainPropertyText</function> and related functions to add fields to the <command>EXPLAIN</command> output. The flag fields in <literal>es</literal> can be used to determine what to print, and the state of the <structname>ForeignScanState</structname> node can be inspected to provide run-time statistics in the <command>EXPLAIN ANALYZE</command> case.
ru: <placeholder-1/> Дополняет вывод <command>EXPLAIN</command> для прямой модификации данных на удалённом сервере. Эта функция может вызывать <function>ExplainPropertyText</function> и связанные функции и добавлять поля в вывод <command>EXPLAIN</command>. Поля флагов в <literal>es</literal> позволяют определить, что именно выводить, а для выдачи статистики времени выполнения в случае <command>EXPLAIN ANALYZE</command> можно проанализировать состояние узла <structname>ForeignScanState</structname>.

source: If the <function>ExplainDirectModify</function> pointer is set to <literal>NULL</literal>, no additional information is printed during <command>EXPLAIN</command>.
ru: Если указатель <function>ExplainDirectModify</function> равен <literal>NULL</literal>, никакая дополнительная информация при <command>EXPLAIN</command> не выводится.

source: FDW Routines for <command>ANALYZE</command>
ru: Подпрограммы FDW для <command>ANALYZE</command>

source: <placeholder-1/> This function is called when <xref linkend="sql-analyze"/> is executed on a foreign table. If the FDW can collect statistics for this foreign table, it should return <literal>true</literal>, and provide a pointer to a function that will collect sample rows from the table in <parameter>func</parameter>, plus the estimated size of the table in pages in <parameter>totalpages</parameter>. Otherwise, return <literal>false</literal>.
ru: <placeholder-1/> Эта функция вызывается, когда для сторонней таблицы выполняется <xref linkend="sql-analyze"/>. Если FDW может собрать статистику для этой сторонней таблицы, эта функция должна вернуть <literal>true</literal> и передать в <parameter>func</parameter> указатель на функцию, которая будет выдавать строки выборки из таблицы, а в <parameter>totalpages</parameter> ожидаемый размер таблицы в страницах. В противном случае эта функция должна вернуть <literal>false</literal>.

source: If the FDW does not support collecting statistics for any tables, the <function>AnalyzeForeignTable</function> pointer can be set to <literal>NULL</literal>.
ru: Если FDW не поддерживает сбор статистики ни для каких таблиц, в <function>AnalyzeForeignTable</function> можно установить значение <literal>NULL</literal>.

source: If provided, the sample collection function must have the signature <placeholder-1/> A random sample of up to <parameter>targrows</parameter> rows should be collected from the table and stored into the caller-provided <parameter>rows</parameter> array. The actual number of rows collected must be returned. In addition, store estimates of the total numbers of live and dead rows in the table into the output parameters <parameter>totalrows</parameter> and <parameter>totaldeadrows</parameter>. (Set <parameter>totaldeadrows</parameter> to zero if the FDW does not have any concept of dead rows.)
ru: Функция выдачи выборки, если она предоставляется, должна иметь следующую сигнатуру: <placeholder-1/> Она должна выбирать из таблицы максимум <parameter>targrows</parameter> строк и помещать их в переданный вызывающим кодом массив <parameter>rows</parameter>. Возвращать она должна фактическое число выбранных строк. Кроме того, эта функция должна сохранить общее количество актуальных и &laquo;мёртвых&raquo;строк в таблице в выходных параметрах <parameter>totalrows</parameter> и <parameter>totaldeadrows</parameter>, соответственно. (Если для данной FDW нет понятия &laquo;мёртвых&raquo; строк, в <parameter>totaldeadrows</parameter> нужно записать 0.)

source: FDW Routines For <command>IMPORT FOREIGN SCHEMA</command>
ru: Подпрограммы FDW для <command>IMPORT FOREIGN SCHEMA</command>

source: <placeholder-1/> Obtain a list of foreign table creation commands. This function is called when executing <xref linkend="sql-importforeignschema"/>, and is passed the parse tree for that statement, as well as the OID of the foreign server to use. It should return a list of C strings, each of which must contain a <xref linkend="sql-createforeigntable"/> command. These strings will be parsed and executed by the core server.
ru: <placeholder-1/> Получает список команд, создающих сторонние таблицы. Эта функция вызывается при выполнении команды <xref linkend="sql-importforeignschema"/>; ей передаётся дерево разбора этого оператора и OID целевого стороннего сервера. Она должна вернуть набор строк C, в каждой из которых должна содержаться команда <xref linkend="sql-createforeigntable"/>. Эти строки будут разобраны и выполнены ядром сервера.

source: Within the <structname>ImportForeignSchemaStmt</structname> struct, <structfield>remote_schema</structfield> is the name of the remote schema from which tables are to be imported. <structfield>list_type</structfield> identifies how to filter table names: <literal>FDW_IMPORT_SCHEMA_ALL</literal> means that all tables in the remote schema should be imported (in this case <structfield>table_list</structfield> is empty), <literal>FDW_IMPORT_SCHEMA_LIMIT_TO</literal> means to include only tables listed in <structfield>table_list</structfield>, and <literal>FDW_IMPORT_SCHEMA_EXCEPT</literal> means to exclude the tables listed in <structfield>table_list</structfield>. <structfield>options</structfield> is a list of options used for the import process. The meanings of the options are up to the FDW. For example, an FDW could use an option to define whether the <literal>NOT NULL</literal> attributes of columns should be imported. These options need not have anything to do with those supported by the FDW as database object options.
ru: В структуре <structname>ImportForeignSchemaStmt</structname> поле <structfield>remote_schema</structfield> задаёт имя удалённой схемы, из которой импортируются таблицы. Поле <structfield>list_type</structfield> устанавливает, как фильтровать имена таблиц: вариант <literal>FDW_IMPORT_SCHEMA_ALL</literal> означает, что нужно импортировать все таблицы в удалённой схеме (в этом случае поле <structfield>table_list</structfield> пустое), <literal>FDW_IMPORT_SCHEMA_LIMIT_TO</literal> означает, что нужно импортировать только таблицы, перечисленные в <structfield>table_list</structfield>, и <literal>FDW_IMPORT_SCHEMA_EXCEPT</literal> означает, что нужно исключить таблицы, перечисленные в списке <structfield>table_list</structfield>. В поле <structfield>options</structfield> передаётся список параметров для процесса импорта. Значение этих параметров определяется самой FDW. Например, у FDW может быть параметр, определяющий, нужно ли сохранять у импортируемых столбцов атрибут <literal>NOT NULL</literal>. Эти параметры могут не иметь ничего общего с параметрами, которые принимает FDW в качестве параметров объектов базы.

source: The FDW may ignore the <structfield>local_schema</structfield> field of the <structname>ImportForeignSchemaStmt</structname>, because the core server will automatically insert that name into the parsed <command>CREATE FOREIGN TABLE</command> commands.
ru: FDW может игнорировать поле <structfield>local_schema</structfield> в <structname>ImportForeignSchemaStmt</structname>, так как ядро сервера само вставит это имя в разобранные команды <command>CREATE FOREIGN TABLE</command>.

source: The FDW does not have to concern itself with implementing the filtering specified by <structfield>list_type</structfield> and <structfield>table_list</structfield>, either, as the core server will automatically skip any returned commands for tables excluded according to those options. However, it's often useful to avoid the work of creating commands for excluded tables in the first place. The function <function>IsImportableForeignTable()</function> may be useful to test whether a given foreign-table name will pass the filter.
ru: Также, FDW может не выполнять сама фильтрацию по полям <structfield>list_type</structfield> и <structfield>table_list</structfield>, так как ядро сервера автоматически пропустит все возвращённые команды для таблиц, исключённых по заданным критериям. Однако часто лучше сразу избежать лишней работы, не формируя команды для исключаемых таблиц. Для проверки, удовлетворяет ли фильтру заданное имя сторонней таблицы, может быть полезна функция <function>IsImportableForeignTable()</function>.

source: If the FDW does not support importing table definitions, the <function>ImportForeignSchema</function> pointer can be set to <literal>NULL</literal>.
ru: Если FDW не поддерживает импорт определений таблиц, указателю <function>ImportForeignSchema</function> можно присвоить <literal>NULL</literal>.

source: FDW Routines for Parallel Execution
ru: Подпрограммы FDW для параллельного выполнения

source: A <structname>ForeignScan</structname> node can, optionally, support parallel execution. A parallel <structname>ForeignScan</structname> will be executed in multiple processes and must return each row exactly once across all cooperating processes. To do this, processes can coordinate through fixed-size chunks of dynamic shared memory. This shared memory is not guaranteed to be mapped at the same address in every process, so it must not contain pointers. The following functions are all optional, but most are required if parallel execution is to be supported.
ru: Узел <structname>ForeignScan</structname> может, хотя это не требуется, поддерживать параллельное выполнение. Параллельный <structname>ForeignScan</structname> будет выполняться в нескольких процессах и должен возвращать одну строку только единожды. Для этого взаимодействующие процессы могут координировать свои действия через фиксированного размера блоки в динамической разделяемой памяти. Эта разделяемая память не будет гарантированно отображаться по одному адресу в разных процессах, так что она не может содержать указатели. Все следующие функции являются необязательными, но большинство из них необходимы при реализации поддержки параллельного выполнения.

source: A <structname>ForeignScan</structname> node can, optionally, support parallel execution. A parallel <structname>ForeignScan</structname> will be executed in multiple processes and should return each row only once across all cooperating processes. To do this, processes can coordinate through fixed size chunks of dynamic shared memory. This shared memory is not guaranteed to be mapped at the same address in every process, so pointers may not be used. The following callbacks are all optional in general, but required if parallel execution is to be supported.
ru: Узел <structname>ForeignScan</structname> может, хотя это не требуется, поддерживать параллельное выполнение. Параллельный <structname>ForeignScan</structname> будет выполняться в нескольких процессах и должен возвращать одну строку только единожды. Для этого взаимодействующие процессы могут координировать свои действия через фиксированного размера блоки в динамической разделяемой памяти. Эта разделяемая память не будет гарантированно отображаться по одному адресу в разных процессах, так что указатели на неё использовать нельзя. Следующие обработчики в принципе не являются обязательными, но они требуются, если реализуется поддержка параллельного выполнения.

source: <placeholder-1/> Test whether a scan can be performed within a parallel worker. This function will only be called when the planner believes that a parallel plan might be possible, and should return true if it is safe for that scan to run within a parallel worker. This will generally not be the case if the remote data source has transaction semantics, unless the worker's connection to the data can somehow be made to share the same transaction context as the leader.
ru: <placeholder-1/> Проверяет, будет ли сканирование выполняться параллельным исполнителем. Эта функция будет вызываться, только когда планировщик считает, что параллельный план принципиально возможен, и должна возвращать true, если такое сканирование может безопасно выполняться параллельным исполнителем. Обычно это не так, если удалённый источник данных является транзакционным. Но возможно исключение, когда в подключении рабочего процесса к этому источнику каким-то образом используется тот же транзакционный контекст, что и в ведущем процессе.

source: If this function is not defined, it is assumed that the scan must take place within the parallel leader. Note that returning true does not mean that the scan itself can be done in parallel, only that the scan can be performed within a parallel worker. Therefore, it can be useful to define this method even when parallel execution is not supported.
ru: Если эта функция не определена, считается, что сканирование должно происходить в ведущем процессе. Заметьте, что возвращённое значение true не означает, что само сканирование может выполняться в параллельном режиме, а только то, что сканирование будет производится в параллельном исполнителе. Таким образом, может быть полезно определить этот обработчик, даже если параллельное выполнение не поддерживается.

source: If this callback is not defined, it is assumed that the scan must take place within the parallel leader. Note that returning true does not mean that the scan itself can be done in parallel, only that the scan can be performed within a parallel worker. Therefore, it can be useful to define this method even when parallel execution is not supported.
ru: Если этот обработчик не определён, считается, что сканирование должно происходить в ведущем процессе. Заметьте, что возвращённое значение true не означает, что само сканирование может выполняться в параллельном режиме, а только то, что сканирование будет производится в параллельном исполнителе. Таким образом, может быть полезно определить этот обработчик, даже если параллельное выполнение не поддерживается.

source: <placeholder-1/> Estimate the amount of dynamic shared memory that will be required for parallel operation. This may be higher than the amount that will actually be used, but it must not be lower. The return value is in bytes. This function is optional, and can be omitted if not needed; but if it is omitted, the next three functions must be omitted as well, because no shared memory will be allocated for the FDW's use.
ru: <placeholder-1/> Оценивает объём динамической разделяемой памяти, которая потребуется для параллельной операции. Это значение может превышать объём, который будет занят фактически, но не должно быть меньше. Возвращаемое значение задаётся в байтах. Эта функция является необязательной и может быть опущена, если не требуется; но в этом случае должны быть также опущены следующие три функции, так как для FDW не будет выделена разделяемая память.

source: <placeholder-1/> Estimate the amount of dynamic shared memory that will be required for parallel operation. This may be higher than the amount that will actually be used, but it must not be lower. The return value is in bytes.
ru: <placeholder-1/> Оценивает объём динамической разделяемой памяти, которая потребуется для параллельной операции. Это значение может превышать объём, который будет занят фактически, но не должно быть меньше. Возвращаемое значение задаётся в байтах.
