Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/fdwhandler.po
Languages: ru

source: <placeholder-1/> Delete one tuple from the foreign table. <literal>estate</literal> is global execution state for the query. <literal>rinfo</literal> is the <structname>ResultRelInfo</structname> struct describing the target foreign table. <literal>slot</literal> contains nothing useful upon call, but can be used to hold the returned tuple. <literal>planSlot</literal> contains the tuple that was generated by the <structname>ModifyTable</structname> plan node's subplan; in particular, it will carry any junk columns that were requested by <function>AddForeignUpdateTargets</function>. The junk column(s) must be used to identify the tuple to be deleted.
ru: <placeholder-1/> Удаляет один кортеж из сторонней таблицы. В <literal>estate</literal> передаётся глобальное состояние выполнения запроса, а в <literal>rinfo</literal> — структура <structname>ResultRelInfo</structname>, описывающая целевую стороннюю таблицу. Параметр <literal>slot</literal> при вызове не содержит ничего полезного, но в эту структуру можно поместить возвращаемый кортеж. Параметр <literal>planSlot</literal> содержит кортеж, сформированный вложенным планом узла <structname>ModifyTable</structname>; в частности, в нём могут содержаться отбросовые столбцы, запрошенные в <function>AddForeignUpdateTargets</function>. Отбросовые столбцы необходимы, чтобы определить, какой именно кортеж удалять.

source: The return value is either a slot containing the row that was deleted, or NULL if no row was deleted (typically as a result of triggers). The passed-in <literal>slot</literal> can be used to hold the tuple to be returned.
ru: Возвращаемым значением будет либо слот, содержащий строку, которая была удалена, либо NULL, если не удалена никакая строка (обычно в результате действия триггеров). Для размещения возвращаемого кортежа можно использовать передаваемый на вход <literal>slot</literal>.

source: The data in the returned slot is used only if the <command>DELETE</command> query has a <literal>RETURNING</literal> clause or the foreign table has an <literal>AFTER ROW</literal> trigger. Triggers require all columns, but the FDW could choose to optimize away returning some or all columns depending on the contents of the <literal>RETURNING</literal> clause. Regardless, some slot must be returned to indicate success, or the query's reported row count will be wrong.
ru: Данные в возвращаемом слоте используются, только если запрос <command>DELETE</command> содержит предложение <literal>RETURNING</literal> или для сторонней таблицы определён триггер <literal>AFTER ROW</literal>. Триггерам нужны все столбцы, но для предложения <literal>RETURNING</literal> FDW может ради оптимизации не возвращать некоторые или все столбцы, в зависимости от его содержания. Так или иначе, какой-либо слот необходимо вернуть, чтобы отметить, что операция успешна, иначе возвращённое число строк будет неверным.

source: If the <function>ExecForeignDelete</function> pointer is set to <literal>NULL</literal>, attempts to delete from the foreign table will fail with an error message.
ru: Если указатель на <function>ExecForeignDelete</function> равен <literal>NULL</literal>, удалить данные из сторонней таблицы не удастся, а в ответ будет выдаваться сообщение об ошибке.

source: <placeholder-1/> End the table update and release resources. It is normally not important to release palloc'd memory, but for example open files and connections to remote servers should be cleaned up.
ru: <placeholder-1/> Завершает изменение данных в таблице и освобождает ресурсы. Обычно при этом не нужно освобождать память, выделенную через palloc, но например, открытые файлы и подключения к удалённым серверам следует закрыть.

source: If the <function>EndForeignModify</function> pointer is set to <literal>NULL</literal>, no action is taken during executor shutdown.
ru: Если указатель на <function>EndForeignModify</function> равен <literal>NULL</literal>, никакое действие при завершении исполнителя не выполняется.

source: <placeholder-1/> Report which update operations the specified foreign table supports. The return value should be a bit mask of rule event numbers indicating which operations are supported by the foreign table, using the <literal>CmdType</literal> enumeration; that is, <literal>(1 &lt;&lt; CMD_UPDATE) = 4</literal> for <command>UPDATE</command>, <literal>(1 &lt;&lt; CMD_INSERT) = 8</literal> for <command>INSERT</command>, and <literal>(1 &lt;&lt; CMD_DELETE) = 16</literal> for <command>DELETE</command>.
ru: <placeholder-1/> Сообщает, какие операции изменения данных поддерживает указанная сторонняя таблица. Возвращаемое значение должно быть битовой маской кодов событий, обозначающих операции, поддерживаемые таблицей, и заданных в перечислении <literal>CmdType</literal>; то есть, <literal>(1 &lt;&lt; CMD_UPDATE) = 4</literal> для <command>UPDATE</command>, <literal>(1 &lt;&lt; CMD_INSERT) = 8</literal> для <command>INSERT</command> и <literal>(1 &lt;&lt; CMD_DELETE) = 16</literal> для <command>DELETE</command>.

source: If the <function>IsForeignRelUpdatable</function> pointer is set to <literal>NULL</literal>, foreign tables are assumed to be insertable, updatable, or deletable if the FDW provides <function>ExecForeignInsert</function>, <function>ExecForeignUpdate</function>, or <function>ExecForeignDelete</function> respectively. This function is only needed if the FDW supports some tables that are updatable and some that are not. (Even then, it's permissible to throw an error in the execution routine instead of checking in this function. However, this function is used to determine updatability for display in the <literal>information_schema</literal> views.)
ru: Если указатель на <function>IsForeignRelUpdatable</function> равен <literal>NULL</literal>, предполагается, что сторонние таблицы позволяют добавлять, изменять и удалять строки, если FDW предоставляет процедуры для функций <function>ExecForeignInsert</function>, <function>ExecForeignUpdate</function> или <function>ExecForeignDelete</function>, соответственно. Данная функция необходима, только если FDW поддерживает операции изменения для одних таблиц и не поддерживает для других. (Хотя для этого можно выдать ошибку в подпрограмме, выполняющей операцию, а не задействовать эту функцию. Однако данная функция позволяет корректно отражать поддержку изменений в представлениях <literal>information_schema</literal>.)

source: Some inserts, updates, and deletes to foreign tables can be optimized by implementing an alternative set of interfaces. The ordinary interfaces for inserts, updates, and deletes fetch rows from the remote server and then modify those rows one at a time. In some cases, this row-by-row approach is necessary, but it can be inefficient. If it is possible for the foreign server to determine which rows should be modified without actually retrieving them, and if there are no local triggers which would affect the operation, then it is possible to arrange things so that the entire operation is performed on the remote server. The interfaces described below make this possible.
ru: Некоторые операции добавления, изменений и удаления данных в сторонних таблицах можно соптимизировать, применив альтернативный набор интерфейсов. Обычные интерфейсы для операций добавления, изменения и удаления выбирают строки с удалённого сервера, а затем модифицируют их по одной. В некоторых случаях такой подход &laquo;строка-за-строкой&raquo; необходим, но он может быть не самым эффективным. Если есть возможность определить на стороннем сервере, какие строки должны модифицироваться, собственно не считывая их, и если никакие локальные триггеры этой операцией не затрагиваются, то возможно организовать операцию так, чтобы она выполнялась целиком на удалённом сервере. Это становится возможным благодаря описанным ниже интерфейсам.

source: <placeholder-1/> Decide whether it is safe to execute a direct modification on the remote server. If so, return <literal>true</literal> after performing planning actions needed for that. Otherwise, return <literal>false</literal>. This optional function is called during query planning. If this function succeeds, <function>BeginDirectModify</function>, <function>IterateDirectModify</function> and <function>EndDirectModify</function> will be called at the execution stage, instead. Otherwise, the table modification will be executed using the table-updating functions described above. The parameters are the same as for <function>PlanForeignModify</function>.
ru: <placeholder-1/> Определяет, возможно ли безопасно выполнить прямую модификацию на удалённом сервере. Если да, возвращает <literal>true</literal>, произведя требуемые для этого операции планирования. В противном случае возвращает <literal>false</literal>. Эта необязательная функция вызывается во время планирования запроса. Если результат этой функции положительный, на стадии выполнения будут вызываться <function>BeginDirectModify</function>, <function>IterateDirectModify</function> и <function>EndDirectModify</function>. Иначе модификация таблиц будет осуществляться посредством функций изменения, описанных выше. Данная функция принимает те же параметры, что и <function>PlanForeignModify</function>.

source: To execute the direct modification on the remote server, this function must rewrite the target subplan with a <structname>ForeignScan</structname> plan node that executes the direct modification on the remote server. The <structfield>operation</structfield> field of the <structname>ForeignScan</structname> must be set to the <literal>CmdType</literal> enumeration appropriately; that is, <literal>CMD_UPDATE</literal> for <command>UPDATE</command>, <literal>CMD_INSERT</literal> for <command>INSERT</command>, and <literal>CMD_DELETE</literal> for <command>DELETE</command>.
ru: Для осуществления прямой модификации на удалённом сервере эта функция должна подставить в целевой подплан узел <structname>ForeignScan</structname>, выполняющий прямую модификацию на удалённом сервере. В поле <structfield>operation</structfield> структуры <structname>ForeignScan</structname> должно быть установлено соответствующее значение перечисления <literal>CmdType</literal>: то есть, <literal>CMD_UPDATE</literal> для <command>UPDATE</command>, <literal>CMD_INSERT</literal> для <command>INSERT</command> и <literal>CMD_DELETE</literal> для <command>DELETE</command>.

source: If the <function>PlanDirectModify</function> pointer is set to <literal>NULL</literal>, no attempts to execute a direct modification on the remote server are taken.
ru: Если указатель на <function>PlanDirectModify</function> равен <literal>NULL</literal>, сервер не будет пытаться произвести прямую модификацию.

source: <placeholder-1/> Prepare to execute a direct modification on the remote server. This is called during executor startup. It should perform any initialization needed prior to the direct modification (that should be done upon the first call to <function>IterateDirectModify</function>). The <structname>ForeignScanState</structname> node has already been created, but its <structfield>fdw_state</structfield> field is still NULL. Information about the table to modify is accessible through the <structname>ForeignScanState</structname> node (in particular, from the underlying <structname>ForeignScan</structname> plan node, which contains any FDW-private information provided by <function>PlanDirectModify</function>). <literal>eflags</literal> contains flag bits describing the executor's operating mode for this plan node.
ru: <placeholder-1/> Подготавливает прямую модификацию на удалённом сервере. Эта функция вызывается при запуске исполнителя. Она должна выполнить все подготовительные действия, необходимые для осуществления прямой модификации (модификация должна начаться с первым вызовом <function>IterateDirectModify</function>). Узел <structname>ForeignScanState</structname> уже был создан, но его поле <structfield>fdw_state</structfield> по-прежнему NULL. Информацию о модифицируемой таблице можно получить через узел <structname>ForeignScanState</structname> (в частности, из нижележащего узла <structname>ForeignScan</structname>, содержащего частную информацию FDW, заданную функцией <function>PlanDirectModify</function>). Параметр <literal>eflags</literal> содержит битовые флаги, описывающие режим работы исполнителя для этого узла плана.

source: Note that when <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> is true, this function should not perform any externally-visible actions; it should only do the minimum required to make the node state valid for <function>ExplainDirectModify</function> and <function>EndDirectModify</function>.
ru: Заметьте, что когда <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> не равно нулю, эта функция не должна выполнять какие-либо внешне проявляющиеся действия; она должна сделать только то, что необходимо для получения состояния узла, подходящего для <function>ExplainDirectModify</function> и <function>EndDirectModify</function>.

source: If the <function>BeginDirectModify</function> pointer is set to <literal>NULL</literal>, no attempts to execute a direct modification on the remote server are taken.
ru: Если указатель на <function>BeginDirectModify</function> равен <literal>NULL</literal>, сервер не будет пытаться произвести прямую модификацию.

source: <placeholder-1/> When the <command>INSERT</command>, <command>UPDATE</command> or <command>DELETE</command> query doesn't have a <literal>RETURNING</literal> clause, just return NULL after a direct modification on the remote server. When the query has the clause, fetch one result containing the data needed for the <literal>RETURNING</literal> calculation, returning it in a tuple table slot (the node's <structfield>ScanTupleSlot</structfield> should be used for this purpose). The data that was actually inserted, updated or deleted must be stored in the <literal>es_result_relation_info-&gt;ri_projectReturning-&gt;pi_exprContext-&gt;ecxt_scantuple</literal> of the node's <structname>EState</structname>. Return NULL if no more rows are available. Note that this is called in a short-lived memory context that will be reset between invocations. Create a memory context in <function>BeginDirectModify</function> if you need longer-lived storage, or use the <structfield>es_query_cxt</structfield> of the node's <structname>EState</structname>.
ru: <placeholder-1/> Когда в запросе <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command> отсутствует предложение <literal>RETURNING</literal>, просто возвращает NULL после прямой модификации на удалённом сервере. Когда в запросе есть это предложение, выбирает одну строку результата с данными, требующимися для вычисления <literal>RETURNING</literal>, и возвращает её в слоте таблицы кортежей (для этой цели следует использовать <structfield>ScanTupleSlot</structfield>, переданный с узлом). Данные, которые были фактически добавлены, изменены или удалены, нужно сохранить в <literal>es_result_relation_info-&gt;ri_projectReturning-&gt;pi_exprContext-&gt;ecxt_scantuple</literal> в структуре <structname>EState</structname>, переданной с узлом. Возвращает NULL, если строк больше нет. Заметьте, что эта функция вызывается в контексте кратковременной памяти, который будет сбрасываться между вызовами. Если вам нужна более долгоживущая память, создайте соответствующий контекст в <function>BeginDirectModify</function> либо используйте <structfield>es_query_cxt</structfield> из переданной с узлом структуры <structname>EState</structname>.

source: The rows returned must match the <structfield>fdw_scan_tlist</structfield> target list if one was supplied, otherwise they must match the row type of the foreign table being updated. If you choose to optimize away fetching columns that are not needed for the <literal>RETURNING</literal> calculation, you should insert nulls in those column positions, or else generate a <structfield>fdw_scan_tlist</structfield> list with those columns omitted.
ru: Возвращаемые строки должны соответствовать целевому списку <structfield>fdw_scan_tlist</structfield>, если он передаётся, а в противном случае — типу строки изменяемой сторонней таблицы. Если вы решите для оптимизации не возвращать ненужные столбцы, не требующиеся для получения <literal>RETURNING</literal>, в их позиции нужно вставить NULL, либо сформировать список <structfield>fdw_scan_tlist</structfield> без этих столбцов.

source: Whether the query has the clause or not, the query's reported row count must be incremented by the FDW itself. When the query doesn't have the clause, the FDW must also increment the row count for the <structname>ForeignScanState</structname> node in the <command>EXPLAIN ANALYZE</command> case.
ru: Независимо от того, есть ли в запросе это предложение или нет, число строк, возвращаемых запросом, должно увеличиваться самой FDW. Когда этого предложения в запросе нет, FDW должна также увеличивать число строк для узла <structname>ForeignScanState</structname> в случае <command>EXPLAIN ANALYZE</command>.

source: If the <function>IterateDirectModify</function> pointer is set to <literal>NULL</literal>, no attempts to execute a direct modification on the remote server are taken.
ru: Если указатель на <function>IterateDirectModify</function> равен <literal>NULL</literal>, сервер не будет пытаться произвести прямую модификацию.

source: <placeholder-1/> Clean up following a direct modification on the remote server. It is normally not important to release palloc'd memory, but for example open files and connections to the remote server should be cleaned up.
ru: <placeholder-1/> Очищает ресурсы после непосредственной модификации на удалённом сервере. Обычно при этом не нужно освобождать память, выделенную через palloc, но например, открытые файлы и подключения к удалённому серверу следует закрыть.

source: If the <function>EndDirectModify</function> pointer is set to <literal>NULL</literal>, no attempts to execute a direct modification on the remote server are taken.
ru: Если указатель на <function>EndDirectModify</function> равен <literal>NULL</literal>, сервер не будет пытаться произвести прямую модификацию.

source: FDW Routines For Row Locking
ru: Подпрограммы FDW для блокировки строк

source: If an FDW wishes to support <firstterm>late row locking</firstterm> (as described in <xref linkend="fdw-row-locking"/>), it must provide the following callback functions:
ru: Если FDW желает поддержать функцию <firstterm>поздней блокировки строк</firstterm> (описанную в <xref remap="6" linkend="fdw-row-locking"/>), она должна предоставить следующие реализующие подпрограммы:

source: <placeholder-1/> Report which row-marking option to use for a foreign table. <literal>rte</literal> is the <structname>RangeTblEntry</structname> node for the table and <literal>strength</literal> describes the lock strength requested by the relevant <literal>FOR UPDATE/SHARE</literal> clause, if any. The result must be a member of the <literal>RowMarkType</literal> enum type.
ru: <placeholder-1/> Сообщает, какой вариант пометки строк будет использоваться для сторонней таблицы. Здесь <literal>rte</literal> представляет узел <structname>RangeTblEntry</structname> для таблицы, а <literal>strength</literal> описывает силу блокировки, запрошенную соответствующим предложением <literal>FOR UPDATE/SHARE</literal>, если оно имеется. Результатом должно быть значение перечисления <literal>RowMarkType</literal>.

source: This function is called during query planning for each foreign table that appears in an <command>UPDATE</command>, <command>DELETE</command>, or <command>SELECT FOR UPDATE/SHARE</command> query and is not the target of <command>UPDATE</command> or <command>DELETE</command>.
ru: Эта функция вызывается в процессе планирования запроса для каждой сторонней таблицы, которая участвует в запросе <command>UPDATE</command>, <command>DELETE</command> или <command>SELECT FOR UPDATE/SHARE</command>, и не является целевой в запросе <command>UPDATE</command> или <command>DELETE</command>.

source: If the <function>GetForeignRowMarkType</function> pointer is set to <literal>NULL</literal>, the <literal>ROW_MARK_COPY</literal> option is always used. (This implies that <function>RefetchForeignRow</function> will never be called, so it need not be provided either.)
ru: Если указатель <function>GetForeignRowMarkType</function> равен <literal>NULL</literal>, всегда выбирается вариант <literal>ROW_MARK_COPY</literal>. (Вследствие этого, функция <function>RefetchForeignRow</function> никогда не будет вызываться, так что и её задавать не нужно.)

source: See <xref linkend="fdw-row-locking"/> for more information.
ru: За подробностями обратитесь к <xref remap="3" linkend="fdw-row-locking"/>.

source: <placeholder-1/> Re-fetch one tuple from the foreign table, after locking it if required. <literal>estate</literal> is global execution state for the query. <literal>erm</literal> is the <structname>ExecRowMark</structname> struct describing the target foreign table and the row lock type (if any) to acquire. <literal>rowid</literal> identifies the tuple to be fetched. <literal>updated</literal> is an output parameter.
ru: <placeholder-1/> Повторно считывает один кортеж из сторонней таблицы после блокировки, если она требуется. В <literal>estate</literal> передаётся глобальное состояние выполнения запроса. В <literal>erm</literal> передаётся структура <structname>ExecRowMark</structname>, описывающая целевую стороннюю таблицу и тип запрашиваемой блокировки (если требуется блокировка). Параметр <literal>rowid</literal> идентифицирует считываемый кортеж. Параметр <literal>updated</literal> используется как выходной.

source: This function should return a palloc'ed copy of the fetched tuple, or <literal>NULL</literal> if the row lock couldn't be obtained. The row lock type to acquire is defined by <literal>erm-&gt;markType</literal>, which is the value previously returned by <function>GetForeignRowMarkType</function>. (<literal>ROW_MARK_REFERENCE</literal> means to just re-fetch the tuple without acquiring any lock, and <literal>ROW_MARK_COPY</literal> will never be seen by this routine.)
ru: Эта функция должна вернуть копию выбранного кортежа (размещённую в памяти palloc) или <literal>NULL</literal>, если получить блокировку строки не удаётся. Тип запрашиваемой блокировки строки определяется значением <literal>erm-&gt;markType</literal>, которое было до этого возвращено функцией <function>GetForeignRowMarkType</function>. (Вариант <literal>ROW_MARK_REFERENCE</literal> означает, что нужно просто повторно выбрать кортеж, не запрашивая никакую блокировку, а <literal>ROW_MARK_COPY</literal> никогда не поступает в эту подпрограмму.)

source: In addition, <literal>*updated</literal> should be set to <literal>true</literal> if what was fetched was an updated version of the tuple rather than the same version previously obtained. (If the FDW cannot be sure about this, always returning <literal>true</literal> is recommended.)
ru: Кроме того, переменной <literal>*updated</literal> следует присвоить <literal>true</literal>, если была считана изменённая версия кортежа, а не версия, полученная ранее. (Если FDW не знает этого наверняка, рекомендуется всегда возвращать <literal>true</literal>.)

source: Note that by default, failure to acquire a row lock should result in raising an error; a <literal>NULL</literal> return is only appropriate if the <literal>SKIP LOCKED</literal> option is specified by <literal>erm-&gt;waitPolicy</literal>.
ru: Заметьте, что по умолчанию в случае неудачи при попытке получить блокировку строки должна выдаваться ошибка; значение <literal>NULL</literal> может возвращаться, только если в <literal>erm-&gt;waitPolicy</literal> выбран вариант <literal>SKIP LOCKED</literal>.
