Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/fdwhandler.po
Languages: ru

source: Writing A Foreign Data Wrapper
ru: Написание обёртки сторонних данных

source: <primary>foreign data wrapper</primary> <secondary>handler for</secondary>
ru: <primary>обёртка сторонних данных</primary> <secondary>обработчик</secondary>

source: All operations on a foreign table are handled through its foreign data wrapper, which consists of a set of functions that the core server calls. The foreign data wrapper is responsible for fetching data from the remote data source and returning it to the <productname>PostgreSQL</productname> executor. If updating foreign tables is to be supported, the wrapper must handle that, too. This chapter outlines how to write a new foreign data wrapper.
ru: Все операции со сторонней таблицей производятся через созданную для неё обёртку сторонних данных, представляющую собой набор подпрограмм, которые вызывает ядро сервера. Обёртка сторонних данных отвечает за получение данных из удалённого источника данных и передачу их исполнителю запросов <productname>PostgreSQL</productname>. Чтобы поддерживалось изменение данных в сторонних таблицах, эту операцию также должна выполнять обёртка. В данной главе освещается написание обёртки сторонних данных.

source: The foreign data wrappers included in the standard distribution are good references when trying to write your own. Look into the <filename>contrib</filename> subdirectory of the source tree. The <xref linkend="sql-createforeigndatawrapper"/> reference page also has some useful details.
ru: Реализация обёрток сторонних данных, включённых в стандартный дистрибутив, может послужить хорошим примером при написании собственных обёрток. Её вы можете найти в подкаталоге <filename>contrib</filename> дерева исходного кода. Некоторые полезные детали также можно узнать на странице справки <xref linkend="sql-createforeigndatawrapper"/>.

source: The SQL standard specifies an interface for writing foreign data wrappers. However, PostgreSQL does not implement that API, because the effort to accommodate it into PostgreSQL would be large, and the standard API hasn't gained wide adoption anyway.
ru: В стандарте SQL описан интерфейс для написания обёрток сторонних данных, но PostgreSQL не реализует его, так как это потребовало бы больших усилий, а данный стандартизированный API всё равно не получил широкого распространения.

source: Foreign Data Wrapper Functions
ru: Функции обёрток сторонних данных

source: The FDW author needs to implement a handler function, and optionally a validator function. Both functions must be written in a compiled language such as C, using the version-1 interface. For details on C language calling conventions and dynamic loading, see <xref linkend="xfunc-c"/>.
ru: Автор FDW (Foreign Data Wrapper, Обёртки сторонних данных) должен реализовать функцию-обработчик и может дополнительно добавить функцию проверки. Обе функции должны быть написаны на компилируемом языке, таком как C, и использовать интерфейс версии 1. Подробнее соглашение о вызовах и динамическая загрузка кода на C описывается в <xref remap="6" linkend="xfunc-c"/>.

source: The handler function simply returns a struct of function pointers to callback functions that will be called by the planner, executor, and various maintenance commands. Most of the effort in writing an FDW is in implementing these callback functions. The handler function must be registered with <productname>PostgreSQL</productname> as taking no arguments and returning the special pseudo-type <type>fdw_handler</type>. The callback functions are plain C functions and are not visible or callable at the SQL level. The callback functions are described in <xref linkend="fdw-callbacks"/>.
ru: Функция-обработчик просто возвращает структуру с указателями на реализующие подпрограммы, которые будут вызываться планировщиком, исполнителем и различными служебными командами. Основная часть разработки FDW заключается в написании этих реализующих подпрограмм. Функция-обработчик должна быть зарегистрирована в <productname>PostgreSQL</productname> как функция без аргументов, возвращающая специальный псевдотип <type>fdw_handler</type>. Реализующие подпрограммы представляют собой обычные функции на C, которые не видны и не могут вызываться на уровне SQL. Они описаны в <xref remap="6" linkend="fdw-callbacks"/>.

source: The validator function is responsible for validating options given in <command>CREATE</command> and <command>ALTER</command> commands for its foreign data wrapper, as well as foreign servers, user mappings, and foreign tables using the wrapper. The validator function must be registered as taking two arguments, a text array containing the options to be validated, and an OID representing the type of object the options are associated with (in the form of the OID of the system catalog the object would be stored in, either <literal>ForeignDataWrapperRelationId</literal>, <literal>ForeignServerRelationId</literal>, <literal>UserMappingRelationId</literal>, or <literal>ForeignTableRelationId</literal>). If no validator function is supplied, options are not checked at object creation time or object alteration time.
ru: Функция проверки отвечает за проверку параметров, передаваемых с командами <command>CREATE</command> и <command>ALTER</command> для этой обёртки сторонних данных, а также параметров сторонних серверов, сопоставлений пользователей и сторонних таблиц, доступных через эту обёртку. Эта функция должна быть зарегистрирована как принимающая два аргумента: текстовый массив, содержащий параметры для проверки, и OID, представляющий тип объекта, с которым связаны эти параметры (в виде OID системного каталога, в котором будет сохраняться объект: <literal>ForeignDataWrapperRelationId</literal>, <literal>ForeignServerRelationId</literal>, <literal>UserMappingRelationId</literal> или <literal>ForeignTableRelationId</literal>). Если функция проверки отсутствует, параметры не проверяются ни при создании, ни при изменении объекта.

source: Foreign Data Wrapper Callback Routines
ru: Подпрограммы обёртки сторонних данных

source: The FDW handler function returns a palloc'd <structname>FdwRoutine</structname> struct containing pointers to the callback functions described below. The scan-related functions are required, the rest are optional.
ru: Функция-обработчик FDW возвращает структуру <structname>FdwRoutine</structname> (выделенную с помощью palloc), содержащую указатели на подпрограммы, которые реализуют описанные ниже функции. Из всех функций обязательными являются только те, что касаются сканирования, а остальные могут отсутствовать.

source: The <structname>FdwRoutine</structname> struct type is declared in <filename>src/include/foreign/fdwapi.h</filename>, which see for additional details.
ru: Тип структуры <structname>FdwRoutine</structname> объявлен в <filename>src/include/foreign/fdwapi.h</filename>, там же можно узнать дополнительные подробности.

source: FDW Routines For Scanning Foreign Tables
ru: Подпрограммы FDW для сканирования сторонних таблиц

source: <placeholder-1/> Obtain relation size estimates for a foreign table. This is called at the beginning of planning for a query that scans a foreign table. <literal>root</literal> is the planner's global information about the query; <literal>baserel</literal> is the planner's information about this table; and <literal>foreigntableid</literal> is the <structname>pg_class</structname> OID of the foreign table. (<literal>foreigntableid</literal> could be obtained from the planner data structures, but it's passed explicitly to save effort.)
ru: <placeholder-1/> Выдаёт оценку размера отношения для сторонней таблицы. Она вызывается в начале планирования запроса, в котором сканируется сторонняя таблица. В параметре <literal>root</literal> передаётся общая информация планировщика о запросе, в <literal>baserel</literal> — информация о данной таблице, а в <literal>foreigntableid</literal> — OID записи в <structname>pg_class</structname> для данной таблицы. (Значение <literal>foreigntableid</literal> можно получить и из структуры данных планировщика, но простоты ради оно передаётся явно.)

source: This function should update <literal>baserel-&gt;rows</literal> to be the expected number of rows returned by the table scan, after accounting for the filtering done by the restriction quals. The initial value of <literal>baserel-&gt;rows</literal> is just a constant default estimate, which should be replaced if at all possible. The function may also choose to update <literal>baserel-&gt;width</literal> if it can compute a better estimate of the average result row width.
ru: Эта функция должна записать в <literal>baserel-&gt;rows</literal> ожидаемое число строк, которое будет получено при сканировании таблицы, с учётом фильтра, заданного ограничением выборки. Изначально в <literal>baserel-&gt;rows</literal> содержится просто постоянная оценка по умолчанию, которую следует заменить, если это вообще возможно. Функция также может поменять значение <literal>baserel-&gt;width</literal>, если она может дать лучшую оценку средней ширины строки результата.

source: See <xref linkend="fdw-planning"/> for additional information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="fdw-planning"/>.

source: <placeholder-1/> Create possible access paths for a scan on a foreign table. This is called during query planning. The parameters are the same as for <function>GetForeignRelSize</function>, which has already been called.
ru: <placeholder-1/> Формирует возможные пути доступа для сканирования сторонней таблицы. Эта функция вызывается при планировании запроса. Ей передаются те же параметры, что и функции <function>GetForeignRelSize</function>, которая к этому времени уже будет вызвана.

source: This function must generate at least one access path (<structname>ForeignPath</structname> node) for a scan on the foreign table and must call <function>add_path</function> to add each such path to <literal>baserel-&gt;pathlist</literal>. It's recommended to use <function>create_foreignscan_path</function> to build the <structname>ForeignPath</structname> nodes. The function can generate multiple access paths, e.g., a path which has valid <literal>pathkeys</literal> to represent a pre-sorted result. Each access path must contain cost estimates, and can contain any FDW-private information that is needed to identify the specific scan method intended.
ru: Эта функция должна выдать минимум один путь доступа (узел <structname>ForeignPath</structname>) для сканирования сторонней таблицы и должна вызвать <function>add_path</function>, чтобы добавить каждый такой путь в <literal>baserel-&gt;pathlist</literal>. Для формирования узлов <structname>ForeignPath</structname> рекомендуется вызывать <function>create_foreignscan_path</function>. Данная функция может выдавать несколько путей доступа, то есть путей, для которых по заданным <literal>pathkeys</literal> можно получить уже отсортированный результат. Каждый путь доступа должен содержать оценки стоимости и может содержать любую частную информацию FDW, необходимую для выбора целевого метода сканирования.

source: <placeholder-1/> Create a <structname>ForeignScan</structname> plan node from the selected foreign access path. This is called at the end of query planning. The parameters are as for <function>GetForeignRelSize</function>, plus the selected <structname>ForeignPath</structname> (previously produced by <function>GetForeignPaths</function>, <function>GetForeignJoinPaths</function>, or <function>GetForeignUpperPaths</function>), the target list to be emitted by the plan node, the restriction clauses to be enforced by the plan node, and the outer subplan of the <structname>ForeignScan</structname>, which is used for rechecks performed by <function>RecheckForeignScan</function>. (If the path is for a join rather than a base relation, <literal>foreigntableid</literal> is <literal>InvalidOid</literal>.)
ru: <placeholder-1/> Создаёт узел плана <structname>ForeignScan</structname> из выбранного пути доступа к сторонней таблице. Эта функция вызывается в конце планирования запроса. Ей передаются те же параметры, что и <function>GetForeignRelSize</function>, плюс выбранный путь <structname>ForeignPath</structname> (до этого сформированный функциями <function>GetForeignPaths</function>, <function>GetForeignJoinPaths</function> или <function>GetForeignUpperPaths</function>), целевой список, который должен быть выдан этим узлом плана, условия ограничения, которые должны применяться для данного узла, и внешний вложенный подплан <structname>ForeignScan</structname>, применяемый для перепроверок, выполняемых функцией <function>RecheckForeignScan</function>. (Если путь задаётся для соединения, а не для базового отношения, в <literal>foreigntableid</literal> передаётся <literal>InvalidOid</literal>.)

source: This function must create and return a <structname>ForeignScan</structname> plan node; it's recommended to use <function>make_foreignscan</function> to build the <structname>ForeignScan</structname> node.
ru: Эта функция должна создать и выдать узел плана <structname>ForeignScan</structname>; для формирования этого узла рекомендуется использовать <function>make_foreignscan</function>.

source: <placeholder-1/> Begin executing a foreign scan. This is called during executor startup. It should perform any initialization needed before the scan can start, but not start executing the actual scan (that should be done upon the first call to <function>IterateForeignScan</function>). The <structname>ForeignScanState</structname> node has already been created, but its <structfield>fdw_state</structfield> field is still NULL. Information about the table to scan is accessible through the <structname>ForeignScanState</structname> node (in particular, from the underlying <structname>ForeignScan</structname> plan node, which contains any FDW-private information provided by <function>GetForeignPlan</function>). <literal>eflags</literal> contains flag bits describing the executor's operating mode for this plan node.
ru: <placeholder-1/> Начинает сканирование сторонней таблицы. Эта функция вызывается при запуске исполнителя. Она должна выполнить все подготовительные действия, необходимые для осуществления сканирования, но не должна собственно производить сканирование (оно должно начаться с первым вызовом <function>IterateForeignScan</function>). Узел <structname>ForeignScanState</structname> уже был создан, но его поле <structfield>fdw_state</structfield> по-прежнему NULL. Информацию о сканируемой таблице можно получить через узел <structname>ForeignScanState</structname> (в частности, из нижележащего узла <structname>ForeignScan</structname>, содержащего частную информацию FDW, заданную функцией <function>GetForeignPlan</function>). Параметр <literal>eflags</literal> содержит битовые флаги, описывающие режим работы исполнителя для этого узла плана.

source: Note that when <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> is true, this function should not perform any externally-visible actions; it should only do the minimum required to make the node state valid for <function>ExplainForeignScan</function> and <function>EndForeignScan</function>.
ru: Заметьте, что когда <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> не равно нулю, эта функция не должна выполнять какие-либо внешне проявляющиеся действия; она должна сделать только то, что необходимо для получения состояния узла, подходящего для <function>ExplainForeignScan</function> и <function>EndForeignScan</function>.

source: <placeholder-1/> Fetch one row from the foreign source, returning it in a tuple table slot (the node's <structfield>ScanTupleSlot</structfield> should be used for this purpose). Return NULL if no more rows are available. The tuple table slot infrastructure allows either a physical or virtual tuple to be returned; in most cases the latter choice is preferable from a performance standpoint. Note that this is called in a short-lived memory context that will be reset between invocations. Create a memory context in <function>BeginForeignScan</function> if you need longer-lived storage, or use the <structfield>es_query_cxt</structfield> of the node's <structname>EState</structname>.
ru: <placeholder-1/> Выбирает одну строку из стороннего источника и возвращает её в слоте таблицы кортежей (для этой цели следует использовать <structfield>ScanTupleSlot</structfield>, переданный с узлом). Когда строки заканчиваются, возвращает NULL. Инфраструктура слотов таблицы кортежей позволяет возвращать как физические, так и виртуальные кортежи; в большинстве случаев второй вариант предпочтительнее с точки зрения производительности. Заметьте, что эта функция вызывается в контексте кратковременной памяти, который будет сбрасываться между вызовами. Если вам нужна более долгоживущая память, создайте соответствующий контекст в <function>BeginForeignScan</function> либо используйте <structfield>es_query_cxt</structfield> из структуры <structname>EState</structname>, переданной с узлом.

source: The rows returned must match the <structfield>fdw_scan_tlist</structfield> target list if one was supplied, otherwise they must match the row type of the foreign table being scanned. If you choose to optimize away fetching columns that are not needed, you should insert nulls in those column positions, or else generate a <structfield>fdw_scan_tlist</structfield> list with those columns omitted.
ru: Возвращаемые строки должны соответствовать целевому списку <structfield>fdw_scan_tlist</structfield>, если он передаётся, а в противном случае — типу строки сканируемой сторонней таблицы. Если вы решите для оптимизации не возвращать ненужные столбцы, в их позиции нужно вставить NULL, либо сформировать список <structfield>fdw_scan_tlist</structfield> без этих столбцов.

source: Note that <productname>PostgreSQL</productname>'s executor doesn't care whether the rows returned violate any constraints that were defined on the foreign table &mdash; but the planner does care, and may optimize queries incorrectly if there are rows visible in the foreign table that do not satisfy a declared constraint. If a constraint is violated when the user has declared that the constraint should hold true, it may be appropriate to raise an error (just as you would need to do in the case of a data type mismatch).
ru: Заметьте, что для исполнителя <productname>PostgreSQL</productname> не важно, удовлетворяют ли возвращаемые строки каким-либо ограничениям, определённым для сторонней таблицы &mdash; но это важно для планировщика, так что запросы могут оптимизироваться некорректно, если в сторонней таблице будут видны строки, не удовлетворяющие объявленному ограничению. Если ограничение нарушается, тогда как пользователь объявил, что оно должно выполняться, может быть уместно сообщить об ошибке (точно так же, как и при несовпадении типов данных).

source: <placeholder-1/> Restart the scan from the beginning. Note that any parameters the scan depends on may have changed value, so the new scan does not necessarily return exactly the same rows.
ru: <placeholder-1/> Перезапускает сканирование с начала. Заметьте, что значения параметров, от которых зависит сканирование, могли измениться, так что новое сканирование не обязательно вернёт те же строки.

source: <placeholder-1/> End the scan and release resources. It is normally not important to release palloc'd memory, but for example open files and connections to remote servers should be cleaned up.
ru: <placeholder-1/> Завершает сканирование и освобождает ресурсы. Обычно при этом не нужно освобождать память, выделенную через palloc, но например, открытые файлы и подключения к удалённым серверам следует закрыть.

source: FDW Routines For Scanning Foreign Joins
ru: Подпрограммы FDW для сканирования сторонних соединений

source: If an FDW supports performing foreign joins remotely (rather than by fetching both tables' data and doing the join locally), it should provide this callback function:
ru: Если FDW поддерживает соединения на удалённой стороне (вместо того, чтобы считывать данные обеих таблиц и выполнять соединения локально), она должна предоставить эту реализующую подпрограмму:

source: <placeholder-1/> Create possible access paths for a join of two (or more) foreign tables that all belong to the same foreign server. This optional function is called during query planning. As with <function>GetForeignPaths</function>, this function should generate <structname>ForeignPath</structname> path(s) for the supplied <literal>joinrel</literal>, and call <function>add_path</function> to add these paths to the set of paths considered for the join. But unlike <function>GetForeignPaths</function>, it is not necessary that this function succeed in creating at least one path, since paths involving local joining are always possible.
ru: <placeholder-1/> Формирует возможные пути доступа для соединения двух (и более) сторонних таблиц, принадлежащих одному стороннему серверу. Эта необязательная функция вызывается во время планирования запроса. Как и <function>GetForeignPaths</function>, эта функция должна построить путь(и) <structname>ForeignPath</structname> для переданного <literal>joinrel</literal> и вызвать <function>add_path</function>, чтобы добавить эти пути в набор путей, подходящих для соединения. Но, в отличие от <function>GetForeignPaths</function>, эта функция не обязательно должна возвращать минимум один путь, так как всегда возможен альтернативный путь с локальным соединением таблиц.

source: Note that this function will be invoked repeatedly for the same join relation, with different combinations of inner and outer relations; it is the responsibility of the FDW to minimize duplicated work.
ru: Заметьте, что эта функция будет вызываться неоднократно для одного и того же соединения с разными комбинациями внутреннего и внешнего отношений; минимизировать двойную работу должна сама FDW.
