Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/fdwhandler.po
Languages: ru

source: The FDW should always construct at least one path that depends only on the table's restriction clauses. In join queries, it might also choose to construct path(s) that depend on join clauses, for example <replaceable>foreign_variable</replaceable> <literal>=</literal> <replaceable>local_variable</replaceable>. Such clauses will not be found in <literal>baserel-&gt;baserestrictinfo</literal> but must be sought in the relation's join lists. A path using such a clause is called a <quote>parameterized path</quote>. It must identify the other relations used in the selected join clause(s) with a suitable value of <literal>param_info</literal>; use <function>get_baserel_parampathinfo</function> to compute that value. In <function>GetForeignPlan</function>, the <replaceable>local_variable</replaceable> portion of the join clause would be added to <structfield>fdw_exprs</structfield>, and then at run time the case works the same as for an ordinary restriction clause.
ru: FDW должна всегда строить минимум один путь, зависящий только от предложений ограничения таблицы. В запросах с соединением она может также построить пути, зависящие от ограничения соединения, например <replaceable>сторонняя_переменная</replaceable> <literal>=</literal> <replaceable>локальная_переменная</replaceable>. Такие предложения будут отсутствовать в <literal>baserel-&gt;baserestrictinfo</literal>; их нужно искать в списках соединений отношений. Путь, построенный с таким предложением, называется <quote>параметризованным</quote>. Другие отношения, задействованные в выбранном предложении соединения, должны связываться c этим путём соответствующим значением <literal>param_info</literal>; для получения этого значения используется <function>get_baserel_parampathinfo</function>. В <function>GetForeignPlan</function> часть <replaceable>локальная_переменная</replaceable> предложения соединения будет добавлена в <structfield>fdw_exprs</structfield>, и затем, во время выполнения, это будет работать так же, как и обычное предложение ограничения.

source: If an FDW supports remote joins, <function>GetForeignJoinPaths</function> should produce <structname>ForeignPath</structname>s for potential remote joins in much the same way as <function>GetForeignPaths</function> works for base tables. Information about the intended join can be passed forward to <function>GetForeignPlan</function> in the same ways described above. However, <structfield>baserestrictinfo</structfield> is not relevant for join relations; instead, the relevant join clauses for a particular join are passed to <function>GetForeignJoinPaths</function> as a separate parameter (<literal>extra-&gt;restrictlist</literal>).
ru: Если FDW поддерживает удалённые соединения, <function>GetForeignJoinPaths</function> должна выдавать пути <structname>ForeignPath</structname> для потенциально удалённых соединений почти так же, как это делает <function>GetForeignPaths</function> для базовых таблиц. Информация о выбранном соединении может быть передана функции <function>GetForeignPlan</function> так же, как было описано выше. Однако поле <structfield>baserestrictinfo</structfield> неприменимо к отношениям соединения; вместо этого соответствующие предложения соединения для конкретного соединения передаются в <function>GetForeignJoinPaths</function> в отдельном параметре (<literal>extra-&gt;restrictlist</literal>).

source: An FDW might additionally support direct execution of some plan actions that are above the level of scans and joins, such as grouping or aggregation. To offer such options, the FDW should generate paths and insert them into the appropriate <firstterm>upper relation</firstterm>. For example, a path representing remote aggregation should be inserted into the <literal>UPPERREL_GROUP_AGG</literal> relation, using <function>add_path</function>. This path will be compared on a cost basis with local aggregation performed by reading a simple scan path for the foreign relation (note that such a path must also be supplied, else there will be an error at plan time). If the remote-aggregation path wins, which it usually would, it will be converted into a plan in the usual way, by calling <function>GetForeignPlan</function>. The recommended place to generate such paths is in the <function>GetForeignUpperPaths</function> callback function, which is called for each upper relation (i.e., each post-scan/join processing step), if all the base relations of the query come from the same FDW.
ru: FDW может дополнительно поддерживать прямое выполнение некоторых действий плана, находящихся выше уровня сканирований и соединений, например, группировки или агрегирования. Для реализации этой возможности FDW должна сформировать пути и вставить их в соответствующее <firstterm>верхнее отношение</firstterm>. Например, путь, представляющий удалённое агрегирование, должен вставляться в отношение <literal>UPPERREL_GROUP_AGG</literal> с помощью <function>add_path</function>. Этот путь будет сравниваться по стоимости с локальным агрегированием, выполненным по результатам пути простого сканирования стороннего отношения (заметьте, что такой путь также должен быть сформирован, иначе во время планирования произойдёт ошибка). Если путь с удалённым агрегированием выигрывает, что, как правило, и происходит, он будет преобразован в план обычным образом, вызовом <function>GetForeignPlan</function>. Такие пути рекомендуется формировать в обработчике <function>GetForeignUpperPaths</function>, который вызывается для каждого верхнего отношения (то есть на каждом шаге обработки после сканирования/соединения), если все базовые отношения запроса выдаются одной обёрткой.

source: <function>PlanForeignModify</function> and the other callbacks described in <xref linkend="fdw-callbacks-update"/> are designed around the assumption that the foreign relation will be scanned in the usual way and then individual row updates will be driven by a local <literal>ModifyTable</literal> plan node. This approach is necessary for the general case where an update requires reading local tables as well as foreign tables. However, if the operation could be executed entirely by the foreign server, the FDW could generate a path representing that and insert it into the <literal>UPPERREL_FINAL</literal> upper relation, where it would compete against the <literal>ModifyTable</literal> approach. This approach could also be used to implement remote <literal>SELECT FOR UPDATE</literal>, rather than using the row locking callbacks described in <xref linkend="fdw-callbacks-row-locking"/>. Keep in mind that a path inserted into <literal>UPPERREL_FINAL</literal> is responsible for implementing <emphasis>all</emphasis> behavior of the query.
ru: <function>PlanForeignModify</function> и другие обработчики, описанные в <xref remap="6" linkend="fdw-callbacks-update"/>, рассчитаны на то, что стороннее отношение будет сканироваться обычным способом, а затем отдельные изменения строк будут обрабатываться локальным узлом плана <literal>ModifyTable</literal>. Этот подход необходим в общем случае, когда для такого изменения требуется прочитать не только сторонние, но и локальные таблицы. Однако, если операция может быть целиком выполнена сторонним сервером, FDW может построить путь, представляющий эту возможность, и вставить его в верхнее отношение <literal>UPPERREL_FINAL</literal>, где он будет конкурировать с подходом <literal>ModifyTable</literal>. Этот подход также должен применяться для реализации удалённого <literal>SELECT FOR UPDATE</literal>, вместо обработчиков блокировки строк, описанных <xref remap="6" linkend="fdw-callbacks-row-locking"/>. Учтите, что путь, вставляемый в <literal>UPPERREL_FINAL</literal>, отвечает за реализацию <emphasis>всех</emphasis> аспектов поведения запроса.

source: When planning an <command>UPDATE</command> or <command>DELETE</command>, <function>PlanForeignModify</function> and <function>PlanDirectModify</function> can look up the <structname>RelOptInfo</structname> struct for the foreign table and make use of the <literal>baserel-&gt;fdw_private</literal> data previously created by the scan-planning functions. However, in <command>INSERT</command> the target table is not scanned so there is no <structname>RelOptInfo</structname> for it. The <structname>List</structname> returned by <function>PlanForeignModify</function> has the same restrictions as the <structfield>fdw_private</structfield> list of a <structname>ForeignScan</structname> plan node, that is it must contain only structures that <function>copyObject</function> knows how to copy.
ru: При планировании запросов <command>UPDATE</command> или <command>DELETE</command> функции <function>PlanForeignModify</function> и <function>PlanDirectModify</function> могут обратиться к структуре <structname>RelOptInfo</structname> сторонней таблицы и воспользоваться информацией <literal>baserel-&gt;fdw_private</literal>, записанной ранее функциями планирования сканирования. Однако при запросе <command>INSERT</command> целевая таблица не сканируется, так что для неё <structname>RelOptInfo</structname> не заполняется. На список (<structname>List</structname>), возвращаемый функцией <function>PlanForeignModify</function>, накладываются те же ограничения, что и на список <structfield>fdw_private</structfield> в узле плана <structname>ForeignScan</structname>, то есть он должен содержать только такие структуры, которые способна копировать функция <function>copyObject</function>.

source: <command>INSERT</command> with an <literal>ON CONFLICT</literal> clause does not support specifying the conflict target, as unique constraints or exclusion constraints on remote tables are not locally known. This in turn implies that <literal>ON CONFLICT DO UPDATE</literal> is not supported, since the specification is mandatory there.
ru: Команда <command>INSERT</command> с предложением <literal>ON CONFLICT</literal> не поддерживает указание объекта конфликта, так как уникальные ограничения или ограничения-исключения в удалённых таблицах неизвестны локально. Из этого, в свою очередь, вытекает, что предложение <literal>ON CONFLICT DO UPDATE</literal> не поддерживается, так как в нём это указание является обязательным.

source: Row Locking in Foreign Data Wrappers
ru: Блокировка строк в обёртках сторонних данных

source: If an FDW's underlying storage mechanism has a concept of locking individual rows to prevent concurrent updates of those rows, it is usually worthwhile for the FDW to perform row-level locking with as close an approximation as practical to the semantics used in ordinary <productname>PostgreSQL</productname> tables. There are multiple considerations involved in this.
ru: Если нижележащий механизм хранения FDW поддерживает концепцию блокировки отдельных строк, предотвращающую одновременное изменение этих строк, обычно имеет смысл реализовать в FDW установление блокировок на уровне строк в приближении, настолько близком к обычным таблицам <productname>PostgreSQL</productname>, насколько это возможно и практично. При этом нужно учитывать ряд замечаний.

source: One key decision to be made is whether to perform <firstterm>early locking</firstterm> or <firstterm>late locking</firstterm>. In early locking, a row is locked when it is first retrieved from the underlying store, while in late locking, the row is locked only when it is known that it needs to be locked. (The difference arises because some rows may be discarded by locally-checked restriction or join conditions.) Early locking is much simpler and avoids extra round trips to a remote store, but it can cause locking of rows that need not have been locked, resulting in reduced concurrency or even unexpected deadlocks. Also, late locking is only possible if the row to be locked can be uniquely re-identified later. Preferably the row identifier should identify a specific version of the row, as <productname>PostgreSQL</productname> TIDs do.
ru: Первое важное решение, которое нужно принять — будет ли реализована <firstterm>ранняя блокировка</firstterm> или <firstterm>поздняя блокировка</firstterm>. С ранней блокировкой строка блокируется, когда впервые считывается из нижележащего хранилища, тогда как с поздней блокировкой строка блокируется, только когда известно, что её нужно заблокировать. (Различие возникает из-за того, что некоторые строки могут быть отброшены локально проверяемыми условиями ограничений или соединений.) Ранняя блокировка гораздо проще и не требует дополнительных обращений к удалённому хранилищу, но может вызывать блокировку строк, которые можно было бы не блокировать, что может повлечь учащение конфликтов и даже неожиданные взаимоблокировки. Кроме того, поздняя блокировка возможна, только если блокируемая строка может быть однозначно идентифицирована позже. Поэтому в идентификаторе строки следует идентифицировать определённую версию строки, как это делает TID в <productname>PostgreSQL</productname>.

source: By default, <productname>PostgreSQL</productname> ignores locking considerations when interfacing to FDWs, but an FDW can perform early locking without any explicit support from the core code. The API functions described in <xref linkend="fdw-callbacks-row-locking"/>, which were added in <productname>PostgreSQL</productname> 9.5, allow an FDW to use late locking if it wishes.
ru: По умолчанию <productname>PostgreSQL</productname> игнорирует возможности блокировки, обращаясь к FDW, но FDW может установить ранние блокировки и без явной поддержки со стороны ядра. Функции, описанные в <xref remap="6" linkend="fdw-callbacks-row-locking"/>, которые были добавлены в API в <productname>PostgreSQL</productname> 9.5, позволяют FDW применять поздние блокировки, если она этого пожелает.

source: An additional consideration is that in <literal>READ COMMITTED</literal> isolation mode, <productname>PostgreSQL</productname> may need to re-check restriction and join conditions against an updated version of some target tuple. Rechecking join conditions requires re-obtaining copies of the non-target rows that were previously joined to the target tuple. When working with standard <productname>PostgreSQL</productname> tables, this is done by including the TIDs of the non-target tables in the column list projected through the join, and then re-fetching non-target rows when required. This approach keeps the join data set compact, but it requires inexpensive re-fetch capability, as well as a TID that can uniquely identify the row version to be re-fetched. By default, therefore, the approach used with foreign tables is to include a copy of the entire row fetched from a foreign table in the column list projected through the join. This puts no special demands on the FDW but can result in reduced performance of merge and hash joins. An FDW that is capable of meeting the re-fetch requirements can choose to do it the first way.
ru: Также следует учесть, что в режиме изоляции <literal>READ COMMITTED</literal> серверу <productname>PostgreSQL</productname> может потребоваться перепроверить условия ограничений и соединения с изменённой версией некоторого целевого кортежа. Для перепроверки условий соединения требуется повторно получить копии исходных строк, которые ранее были соединены в целевой кортеж. В случае со стандартными таблицами <productname>PostgreSQL</productname> для этого в список столбцов, проходящих через соединение, включаются TID из исходных таблиц, а затем исходные строки извлекаются заново при необходимости. При таком подходе набор данных соединения остаётся компактным, но требуется недорогая операция повторного чтения строк, а также возможность однозначно идентифицировать повторно считываемую версию строки по TID. Поэтому по умолчанию при работе со сторонними таблицами в список столбцов, проходящих через соединение, включается копия всей строки, извлекаемой из сторонней таблицы. Это не накладывает специальных требований на FDW, но может привести к снижению производительности при соединении слиянием или по хешу. FDW, которая может удовлетворить требованиям повторного чтения, может реализовать первый вариант.

source: For an <command>UPDATE</command> or <command>DELETE</command> on a foreign table, it is recommended that the <literal>ForeignScan</literal> operation on the target table perform early locking on the rows that it fetches, perhaps via the equivalent of <command>SELECT FOR UPDATE</command>. An FDW can detect whether a table is an <command>UPDATE</command>/<command>DELETE</command> target at plan time by comparing its relid to <literal>root-&gt;parse-&gt;resultRelation</literal>, or at execution time by using <function>ExecRelationIsTargetRelation()</function>. An alternative possibility is to perform late locking within the <function>ExecForeignUpdate</function> or <function>ExecForeignDelete</function> callback, but no special support is provided for this.
ru: Для команд <command>UPDATE</command> или <command>DELETE</command> со сторонней таблицей рекомендуется, чтобы операция <literal>ForeignScan</literal> в целевой таблице выполняла раннюю блокировку строк, которые она выбирает, возможно, используя аналог <command>SELECT FOR UPDATE</command>. FDW может определить, является ли таблица целевой таблицей команд <command>UPDATE</command>/<command>DELETE</command>, во время планирования, сравнив её relid с <literal>root-&gt;parse-&gt;resultRelation</literal>, или во время планирования, вызвав <function>ExecRelationIsTargetRelation()</function>. Также возможно выполнять позднюю блокировку в обработчике <function>ExecForeignUpdate</function> или <function>ExecForeignDelete</function>, но специальной поддержки для этого нет.

source: For foreign tables that are specified to be locked by a <command>SELECT FOR UPDATE/SHARE</command> command, the <literal>ForeignScan</literal> operation can again perform early locking by fetching tuples with the equivalent of <command>SELECT FOR UPDATE/SHARE</command>. To perform late locking instead, provide the callback functions defined in <xref linkend="fdw-callbacks-row-locking"/>. In <function>GetForeignRowMarkType</function>, select rowmark option <literal>ROW_MARK_EXCLUSIVE</literal>, <literal>ROW_MARK_NOKEYEXCLUSIVE</literal>, <literal>ROW_MARK_SHARE</literal>, or <literal>ROW_MARK_KEYSHARE</literal> depending on the requested lock strength. (The core code will act the same regardless of which of these four options you choose.) Elsewhere, you can detect whether a foreign table was specified to be locked by this type of command by using <function>get_plan_rowmark</function> at plan time, or <function>ExecFindRowMark</function> at execution time; you must check not only whether a non-null rowmark struct is returned, but that its <structfield>strength</structfield> field is not <literal>LCS_NONE</literal>.
ru: Для сторонних таблиц, блокировка которых запрашивается командой <command>SELECT FOR UPDATE/SHARE</command>, операция <literal>ForeignScan</literal> так же может произвести раннюю блокировку, выбрав кортежи, используя аналог <command>SELECT FOR UPDATE/SHARE</command>. Чтобы вместо этого произвести позднюю блокировку, предоставьте подпрограммы-обработчики, описанные в <xref remap="6" linkend="fdw-callbacks-row-locking"/>. В <function>GetForeignRowMarkType</function> выберите вариант отметки строк <literal>ROW_MARK_EXCLUSIVE</literal>, <literal>ROW_MARK_NOKEYEXCLUSIVE</literal>, <literal>ROW_MARK_SHARE</literal> или <literal>ROW_MARK_KEYSHARE</literal>, в зависимости от запрошенной силы блокировки. (Код ядра будет работать одинаково при любом из этих четырёх вариантов.) Затем вы сможете определить, должна ли сторонняя таблица блокироваться командой этого типа, вызвав функцию <function>get_plan_rowmark</function> во время планирования либо <function>ExecFindRowMark</function> во время выполнения; нужно проверить не только, что возвращённая структура rowmark отлична от NULL, но и что её поле <structfield>strength</structfield> не равно <literal>LCS_NONE</literal>.

source: Lastly, for foreign tables that are used in an <command>UPDATE</command>, <command>DELETE</command> or <command>SELECT FOR UPDATE/SHARE</command> command but are not specified to be row-locked, you can override the default choice to copy entire rows by having <function>GetForeignRowMarkType</function> select option <literal>ROW_MARK_REFERENCE</literal> when it sees lock strength <literal>LCS_NONE</literal>. This will cause <function>RefetchForeignRow</function> to be called with that value for <structfield>markType</structfield>; it should then re-fetch the row without acquiring any new lock. (If you have a <function>GetForeignRowMarkType</function> function but don't wish to re-fetch unlocked rows, select option <literal>ROW_MARK_COPY</literal> for <literal>LCS_NONE</literal>.)
ru: Наконец, для сторонних таблиц, задействованных в командах <command>UPDATE</command>, <command>DELETE</command> или <command>SELECT FOR UPDATE/SHARE</command>, но не требующих блокировки строк, можно переопределить поведение по умолчанию, заключающееся в копировании строк целиком, выбрав в <function>GetForeignRowMarkType</function> вариант <literal>ROW_MARK_REFERENCE</literal>, получив значение силы блокировки <literal>LCS_NONE</literal>. В результате <function>RefetchForeignRow</function> будет вызываться с таким значением <structfield>markType</structfield>; она должна будет заново считывать строку, не запрашивая новую блокировку. (Если вы реализуете функцию <function>GetForeignRowMarkType</function>, но не хотите повторно считывать незаблокированные строки, выберите для <literal>LCS_NONE</literal> вариант <literal>ROW_MARK_COPY</literal>.)

source: See <filename>src/include/nodes/lockoptions.h</filename>, the comments for <type>RowMarkType</type> and <type>PlanRowMark</type> in <filename>src/include/nodes/plannodes.h</filename>, and the comments for <type>ExecRowMark</type> in <filename>src/include/nodes/execnodes.h</filename> for additional information.
ru: Дополнительные сведения можно получить в <filename>src/include/nodes/lockoptions.h</filename>, в комментариях к <type>RowMarkType</type> и <type>PlanRowMark</type> в <filename>src/include/nodes/plannodes.h</filename>, и в комментариях к <type>ExecRowMark</type> в <filename>src/include/nodes/execnodes.h</filename>.

source: <placeholder-1/> Initialize the dynamic shared memory that will be required for parallel operation; <literal>coordinate</literal> points to an amount of allocated space equal to the return value of <function>EstimateDSMForeignScan</function>.
ru: <placeholder-1/> Инициализирует динамическую разделяемую память, которая потребуется для параллельной операции; <literal>coordinate</literal> указывает на блок объёма, равного возвращаемому значению <function>EstimateDSMForeignScan</function>.

source: <placeholder-1/> Initialize a parallel worker's custom state based on the shared state set up in the leader by <literal>InitializeDSMForeignScan</literal>. This callback is optional, and needs only be supplied if this custom path supports parallel execution.
ru: <placeholder-1/> Инициализирует собственное состояние параллельного исполнителя на основе общего состояния, заданного ведущим при вызове <literal>InitializeDSMForeignScan</literal>. Этот обработчик является необязательным и должен устанавливаться, только если провайдер нестандартного сканирования поддерживает параллельное выполнение.
