Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/fdwhandler.po
Languages: ru

source: <placeholder-1/> Initialize the dynamic shared memory that will be required for parallel operation. <literal>coordinate</literal> points to a shared memory area of size equal to the return value of <function>EstimateDSMForeignScan</function>. This function is optional, and can be omitted if not needed.
ru: <placeholder-1/> Инициализирует динамическую разделяемую память, которая потребуется для параллельной операции. <literal>coordinate</literal> указывает на область разделяемой памяти размера, равного возвращаемому значению <function>EstimateDSMForeignScan</function>. Эта функция является необязательной и может быть опущена, если не требуется.

source: <placeholder-1/> Re-initialize the dynamic shared memory required for parallel operation when the foreign-scan plan node is about to be re-scanned. This function is optional, and can be omitted if not needed. Recommended practice is that this function reset only shared state, while the <function>ReScanForeignScan</function> function resets only local state. Currently, this function will be called before <function>ReScanForeignScan</function>, but it's best not to rely on that ordering.
ru: <placeholder-1/> Заново инициализирует динамическую разделяемую память, требуемую для параллельной операции, перед тем как будет повторно просканирован узел чтения сторонних данных. Эта функция является необязательной и может быть опущена, если не требуется. В этой функции рекомендуется сбрасывать только общее состояние, а в функции <function>ReScanForeignScan</function> сбрасывать только локальное. В настоящее время эта функция будет вызываться перед <function>ReScanForeignScan</function>, но лучше на этот порядок не рассчитывать.

source: <placeholder-1/> Initialize a parallel worker's local state based on the shared state set up by the leader during <function>InitializeDSMForeignScan</function>. This function is optional, and can be omitted if not needed.
ru: <placeholder-1/> Инициализирует локальное состояние параллельного исполнителя на основе общего состояния, заданного ведущим исполнителем во время <function>InitializeDSMForeignScan</function>. Эта функция является необязательной и может быть опущена, если не требуется.

source: <placeholder-1/> Release resources when it is anticipated the node will not be executed to completion. This is not called in all cases; sometimes, <literal>EndForeignScan</literal> may be called without this function having been called first. Since the DSM segment used by parallel query is destroyed just after this callback is invoked, foreign data wrappers that wish to take some action before the DSM segment goes away should implement this method.
ru: <placeholder-1/> Освобождает ресурсы, когда становится понятно, что этот узел больше не будет выполняться. Этот обработчик вызывается не во всех случаях; иногда может вызываться только <literal>EndForeignScan</literal>. Так как сегмент DSM, используемый параллельным запросом, освобождается сразу после вызова этого обработчика, обёртки сторонних данных, которым нужно выполнять некоторые действия до ликвидации сегмента DSM, должны реализовывать этот метод.

source: Foreign Data Wrapper Helper Functions
ru: Вспомогательные функции для обёрток сторонних данных

source: Several helper functions are exported from the core server so that authors of foreign data wrappers can get easy access to attributes of FDW-related objects, such as FDW options. To use any of these functions, you need to include the header file <filename>foreign/foreign.h</filename> in your source file. That header also defines the struct types that are returned by these functions.
ru: Ядро сервера экспортирует набор полезных вспомогательных функций, которые позволяют разработчикам обёрток сторонних данных легко обращаться к атрибутам объектов, связанных с FDW, например, к параметрам FDW. Чтобы использовать эти функции, необходимо включить в исходный файл заголовочный файл <filename>foreign/foreign.h</filename>. В этом заголовочном файле также определяются типы структур, возвращаемых этими функциями.

source: <placeholder-1/> This function returns a <structname>ForeignDataWrapper</structname> object for the foreign-data wrapper with the given OID. A <structname>ForeignDataWrapper</structname> object contains properties of the FDW (see <filename>foreign/foreign.h</filename> for details).
ru: <placeholder-1/> Эта функция возвращает объект <structname>ForeignDataWrapper</structname> для обёртки сторонних данных с указанным OID. Объект <structname>ForeignDataWrapper</structname> содержит свойства FDW (они описаны в <filename>foreign/foreign.h</filename>).

source: <placeholder-1/> This function returns a <structname>ForeignServer</structname> object for the foreign server with the given OID. A <structname>ForeignServer</structname> object contains properties of the server (see <filename>foreign/foreign.h</filename> for details).
ru: <placeholder-1/> Эта функция возвращает объект <structname>ForeignServer</structname> для стороннего сервера с указанным OID. Объект <structname>ForeignServer</structname> содержит свойства сервера (они описаны в <filename>foreign/foreign.h</filename>).

source: <placeholder-1/> This function returns a <structname>UserMapping</structname> object for the user mapping of the given role on the given server. (If there is no mapping for the specific user, it will return the mapping for <literal>PUBLIC</literal>, or throw error if there is none.) A <structname>UserMapping</structname> object contains properties of the user mapping (see <filename>foreign/foreign.h</filename> for details).
ru: <placeholder-1/> Эта функция возвращает объект <structname>UserMapping</structname> для сопоставления пользователя, которое определено для указанной роли на указанном сервере. (Если сопоставление для указанной роли отсутствует, она возвращает сопоставление для <literal>PUBLIC</literal> или выдаёт ошибку, если его нет.) Объект <structname>UserMapping</structname> содержит свойства сопоставления пользователя (они описаны в <filename>foreign/foreign.h</filename>).

source: <placeholder-1/> This function returns a <structname>ForeignTable</structname> object for the foreign table with the given OID. A <structname>ForeignTable</structname> object contains properties of the foreign table (see <filename>foreign/foreign.h</filename> for details).
ru: <placeholder-1/> Эта функция возвращает объект <structname>ForeignTable</structname> для сторонней таблицы с указанным OID. Объект <structname>ForeignTable</structname> содержит свойства сторонней таблицы (они описаны в <filename>foreign/foreign.h</filename>).

source: <placeholder-1/> This function returns the per-column FDW options for the column with the given foreign table OID and attribute number, in the form of a list of <structname>DefElem</structname>. NIL is returned if the column has no options.
ru: <placeholder-1/> Эта функция возвращает параметры FDW уровня столбцов для столбца из таблицы с указанным OID сторонней таблицы и указанным номером, в виде списка <structname>DefElem</structname>. Если для столбца не определены параметры, возвращается NULL.

source: Some object types have name-based lookup functions in addition to the OID-based ones:
ru: В дополнение к функциям, выбирающим объекты по OID, для некоторых объектов добавлены функции поиска по именам:

source: <placeholder-1/> This function returns a <structname>ForeignDataWrapper</structname> object for the foreign-data wrapper with the given name. If the wrapper is not found, return NULL if missing_ok is true, otherwise raise an error.
ru: <placeholder-1/> Эта функция возвращает объект <structname>ForeignDataWrapper</structname> для обёртки сторонних данных с указанным именем. В случае отсутствия такой обёртки возвращается NULL, если missing_ok равно true, а иначе выдаётся ошибка.

source: <placeholder-1/> This function returns a <structname>ForeignServer</structname> object for the foreign server with the given name. If the server is not found, return NULL if missing_ok is true, otherwise raise an error.
ru: <placeholder-1/> Эта функция возвращает объект <structname>ForeignServer</structname> для стороннего сервера с указанным именем. В случае отсутствия такого сервера возвращается NULL, если missing_ok равно true, а иначе выдаётся ошибка.

source: Foreign Data Wrapper Query Planning
ru: Планирование запросов с обёртками сторонних данных

source: The FDW callback functions <function>GetForeignRelSize</function>, <function>GetForeignPaths</function>, <function>GetForeignPlan</function>, <function>PlanForeignModify</function>, <function>GetForeignJoinPaths</function>, <function>GetForeignUpperPaths</function>, and <function>PlanDirectModify</function> must fit into the workings of the <productname>PostgreSQL</productname> planner. Here are some notes about what they must do.
ru: Процедуры в FDW, реализующие функции <function>GetForeignRelSize</function>, <function>GetForeignPaths</function>, <function>GetForeignPlan</function>, <function>PlanForeignModify</function>, <function>GetForeignJoinPaths</function>, <function>GetForeignUpperPaths</function> и <function>PlanDirectModify</function>, должны вписываться в работу планировщика <productname>PostgreSQL</productname>. Здесь даётся несколько замечаний о том, как это должно происходить.

source: The information in <literal>root</literal> and <literal>baserel</literal> can be used to reduce the amount of information that has to be fetched from the foreign table (and therefore reduce the cost). <literal>baserel-&gt;baserestrictinfo</literal> is particularly interesting, as it contains restriction quals (<literal>WHERE</literal> clauses) that should be used to filter the rows to be fetched. (The FDW itself is not required to enforce these quals, as the core executor can check them instead.) <literal>baserel-&gt;reltarget-&gt;exprs</literal> can be used to determine which columns need to be fetched; but note that it only lists columns that have to be emitted by the <structname>ForeignScan</structname> plan node, not columns that are used in qual evaluation but not output by the query.
ru: Для уменьшения объёма выбираемых из сторонней таблицы данных (и как следствие, сокращения стоимости) может использоваться информация, поступающая в <literal>root</literal> и <literal>baserel</literal>. Особый интерес представляет поле <literal>baserel-&gt;baserestrictinfo</literal>, так как оно содержит ограничивающие условия (предложение <literal>WHERE</literal>), по которым можно отфильтровать выбираемые строки. (Сама FDW не обязательно должна применять эти ограничения, так как их может проверить и ядро исполнителя.) Список <literal>baserel-&gt;reltarget-&gt;exprs</literal> позволяет определить, какие именно столбцы требуется выбрать; но учтите, что в нём перечисляются только те столбцы, которые выдаются узлом плана <structname>ForeignScan</structname>, но не столбцы, которые задействованы в ограничивающих условиях и при этом не выводятся запросом.

source: Various private fields are available for the FDW planning functions to keep information in. Generally, whatever you store in FDW private fields should be palloc'd, so that it will be reclaimed at the end of planning.
ru: Когда функциям планирования FDW требуется сохранять свою информацию, они могут использовать различные частные поля. Вообще, все структуры, которые FDW помещает в закрытые поля, должны выделяться функцией palloc, чтобы они автоматически освобождались при завершении планирования.

source: <literal>baserel-&gt;fdw_private</literal> is a <type>void</type> pointer that is available for FDW planning functions to store information relevant to the particular foreign table. The core planner does not touch it except to initialize it to NULL when the <literal>RelOptInfo</literal> node is created. It is useful for passing information forward from <function>GetForeignRelSize</function> to <function>GetForeignPaths</function> and/or <function>GetForeignPaths</function> to <function>GetForeignPlan</function>, thereby avoiding recalculation.
ru: Для хранения информации, относящейся к определённой сторонней таблице, функции планирования FDW могут использовать поле <literal>baserel-&gt;fdw_private</literal>, которое может содержать указатель на <type>void</type>. Ядро планировщика никак не касается его, кроме того, что записывает в него NULL при создании узла <literal>RelOptInfo</literal>. Оно полезно для передачи информации из <function>GetForeignRelSize</function> в <function>GetForeignPaths</function> и/или из <function>GetForeignPaths</function> в <function>GetForeignPlan</function> и позволяет избежать повторных вычислений.

source: <function>GetForeignPaths</function> can identify the meaning of different access paths by storing private information in the <structfield>fdw_private</structfield> field of <structname>ForeignPath</structname> nodes. <structfield>fdw_private</structfield> is declared as a <type>List</type> pointer, but could actually contain anything since the core planner does not touch it. However, best practice is to use a representation that's dumpable by <function>nodeToString</function>, for use with debugging support available in the backend.
ru: <function>GetForeignPaths</function> может обозначить свойства различных путей доступа, сохранив частную информацию в поле <structfield>fdw_private</structfield> узлов <structname>ForeignPath</structname>. Это поле <structfield>fdw_private</structfield> объявлено как указатель на список (<type>List</type>), но в принципе может содержать всё, что угодно, так как ядро планировщика его не касается. Однако лучше поместить в него данные, которые сможет представить функция <function>nodeToString</function>, для применения средств отладки, имеющихся на сервере.

source: <function>GetForeignPlan</function> can examine the <structfield>fdw_private</structfield> field of the selected <structname>ForeignPath</structname> node, and can generate <structfield>fdw_exprs</structfield> and <structfield>fdw_private</structfield> lists to be placed in the <structname>ForeignScan</structname> plan node, where they will be available at execution time. Both of these lists must be represented in a form that <function>copyObject</function> knows how to copy. The <structfield>fdw_private</structfield> list has no other restrictions and is not interpreted by the core backend in any way. The <structfield>fdw_exprs</structfield> list, if not NIL, is expected to contain expression trees that are intended to be executed at run time. These trees will undergo post-processing by the planner to make them fully executable.
ru: <function>GetForeignPlan</function> может изучить поле <structfield>fdw_private</structfield> выбранного узла <structname>ForeignPath</structname> и сформировать списки <structfield>fdw_exprs</structfield> и <structfield>fdw_private</structfield>, которые будут помещены в узел <structname>ForeignScan</structname>, где они будут находиться во время выполнения запроса. Оба эти списка должны быть представлены в форме, которую способна копировать функция <function>copyObject</function>. Список <structfield>fdw_private</structfield> не имеет других ограничений и никаким образом не интерпретируется ядром сервера. Список <structfield>fdw_exprs</structfield>, если этот указатель не NULL, предположительно содержит деревья выражений, которые должны быть вычислены при выполнении запроса. Затем планировщик обрабатывает эти деревья, чтобы они были полностью готовы к выполнению.

source: In <function>GetForeignPlan</function>, generally the passed-in target list can be copied into the plan node as-is. The passed <literal>scan_clauses</literal> list contains the same clauses as <literal>baserel-&gt;baserestrictinfo</literal>, but may be re-ordered for better execution efficiency. In simple cases the FDW can just strip <structname>RestrictInfo</structname> nodes from the <literal>scan_clauses</literal> list (using <function>extract_actual_clauses</function>) and put all the clauses into the plan node's qual list, which means that all the clauses will be checked by the executor at run time. More complex FDWs may be able to check some of the clauses internally, in which case those clauses can be removed from the plan node's qual list so that the executor doesn't waste time rechecking them.
ru: <function>GetForeignPlan</function> обычно может скопировать полученный целевой список в узел плана как есть. Передаваемый список <literal>scan_clauses</literal> содержит те же предложения, что и <literal>baserel-&gt;baserestrictinfo</literal>, но, возможно, в другом порядке для более эффективного выполнения. В простых случаях FDW может просто убрать узлы <structname>RestrictInfo</structname> из списка <literal>scan_clauses</literal> (используя функцию <function>extract_actual_clauses</function>) и поместить все предложения в список ограничений узла плана, что будет означать, что эти предложения будут проверяться исполнителем во время выполнения. Более сложные FDW могут самостоятельно проверять некоторые предложения, и в этом случае такие предложения можно удалить из списка ограничений узла, чтобы исполнитель не тратил время на их перепроверку.

source: As an example, the FDW might identify some restriction clauses of the form <replaceable>foreign_variable</replaceable> <literal>=</literal> <replaceable>sub_expression</replaceable>, which it determines can be executed on the remote server given the locally-evaluated value of the <replaceable>sub_expression</replaceable>. The actual identification of such a clause should happen during <function>GetForeignPaths</function>, since it would affect the cost estimate for the path. The path's <structfield>fdw_private</structfield> field would probably include a pointer to the identified clause's <structname>RestrictInfo</structname> node. Then <function>GetForeignPlan</function> would remove that clause from <literal>scan_clauses</literal>, but add the <replaceable>sub_expression</replaceable> to <structfield>fdw_exprs</structfield> to ensure that it gets massaged into executable form. It would probably also put control information into the plan node's <structfield>fdw_private</structfield> field to tell the execution functions what to do at run time. The query transmitted to the remote server would involve something like <literal>WHERE <replaceable>foreign_variable</replaceable> = $1</literal>, with the parameter value obtained at run time from evaluation of the <structfield>fdw_exprs</structfield> expression tree.
ru: Например, FDW может распознавать некоторые предложения ограничений вида <replaceable>сторонняя_переменная</replaceable> <literal>=</literal> <replaceable>подвыражение</replaceable>, которые, по её представлению, могут выполняться на удалённом сервере с локально вычисленным значением <replaceable>подвыражения</replaceable>. Собственно выявление такого предложения должно происходить в функции <function>GetForeignPaths</function>, так как это влияет на оценку стоимости пути. Эта функция может включить в поле <structfield>fdw_private</structfield> конкретного пути указатель на узел <structname>RestrictInfo</structname> этого предложения. Затем <function>GetForeignPlan</function> удалит это предложение из <literal>scan_clauses</literal>, но добавит <replaceable>подвыражение</replaceable> в <structfield>fdw_exprs</structfield>, чтобы оно было приведено к исполняемой форме. Она также может поместить управляющую информацию в поле <structfield>fdw_private</structfield> плана узла, которая скажет исполняющим функциям, что делать во время выполнения. Запрос, передаваемый удалённому серверу, будет содержать что-то вроде <literal>WHERE <replaceable>сторонняя_переменная</replaceable> = $1</literal>, а значение параметра будет получено во время выполнения в результате вычисления дерева выражения <structfield>fdw_exprs</structfield>.

source: Any clauses removed from the plan node's qual list must instead be added to <literal>fdw_recheck_quals</literal> or rechecked by <literal>RecheckForeignScan</literal> in order to ensure correct behavior at the <literal>READ COMMITTED</literal> isolation level. When a concurrent update occurs for some other table involved in the query, the executor may need to verify that all of the original quals are still satisfied for the tuple, possibly against a different set of parameter values. Using <literal>fdw_recheck_quals</literal> is typically easier than implementing checks inside <literal>RecheckForeignScan</literal>, but this method will be insufficient when outer joins have been pushed down, since the join tuples in that case might have some fields go to NULL without rejecting the tuple entirely.
ru: Все предложения, удаляемые из списка условий узла плана, должны быть добавлены в <literal>fdw_recheck_quals</literal> или перепроверены функцией <literal>RecheckForeignScan</literal> для обеспечения корректного поведения на уровне изоляции <literal>READ COMMITTED</literal>. Когда имеет место параллельное изменение в некоторой другой таблице, задействованной в запросе, исполнителю может потребоваться убедиться в том, что все исходные условия по-прежнему выполняются для кортежа, возможно, с другим набором значений параметров. Использовать <literal>fdw_recheck_quals</literal> обычно проще, чем реализовывать проверки внутри <literal>RecheckForeignScan</literal>, но этот метод недостаточен, когда внешние соединения выносятся наружу, так как вследствие перепроверки в соединённых кортежах могут обнуляться некоторые поля, но сами кортежи не будут исключаться.

source: Another <structname>ForeignScan</structname> field that can be filled by FDWs is <structfield>fdw_scan_tlist</structfield>, which describes the tuples returned by the FDW for this plan node. For simple foreign table scans this can be set to <literal>NIL</literal>, implying that the returned tuples have the row type declared for the foreign table. A non-<symbol>NIL</symbol> value must be a target list (list of <structname>TargetEntry</structname>s) containing Vars and/or expressions representing the returned columns. This might be used, for example, to show that the FDW has omitted some columns that it noticed won't be needed for the query. Also, if the FDW can compute expressions used by the query more cheaply than can be done locally, it could add those expressions to <structfield>fdw_scan_tlist</structfield>. Note that join plans (created from paths made by <function>GetForeignJoinPaths</function>) must always supply <structfield>fdw_scan_tlist</structfield> to describe the set of columns they will return.
ru: Ещё одно поле <structname>ForeignScan</structname>, которое могут заполнять FDW, это <structfield>fdw_scan_tlist</structfield>, описывающее кортежи, возвращаемые обёрткой для этого узла плана. Для простых сторонних таблиц в него можно записать <literal>NIL</literal>, из чего будет следовать, что возвращённые кортежи имеют тип, объявленный для сторонней таблицы. Отличное от <symbol>NIL</symbol> значение должно указывать на список целевых элементов (список структур <structname>TargetEntry</structname>), содержащий переменные и/или выражения, представляющие возвращаемые столбцы. Это можно использовать, например, чтобы показать, что FDW опустила некоторые столбцы, которые по её наблюдению не нужны для запроса. Также, если FDW может вычислить выражения, используемые в запросе, более эффективно, чем это можно сделать локально, она должна добавить эти выражения в список <structfield>fdw_scan_tlist</structfield>. Заметьте, что планы соединения (полученные из путей, созданных функцией <function>GetForeignJoinPaths</function>) должны всегда заполнять <structfield>fdw_scan_tlist</structfield>, описывая набор столбцов, которые они будут возвращать.
