Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/fdwhandler.po
Languages: ru

source: If a <structname>ForeignPath</structname> path is chosen for the join, it will represent the entire join process; paths generated for the component tables and subsidiary joins will not be used. Subsequent processing of the join path proceeds much as it does for a path scanning a single foreign table. One difference is that the <structfield>scanrelid</structfield> of the resulting <structname>ForeignScan</structname> plan node should be set to zero, since there is no single relation that it represents; instead, the <structfield>fs_relids</structfield> field of the <structname>ForeignScan</structname> node represents the set of relations that were joined. (The latter field is set up automatically by the core planner code, and need not be filled by the FDW.) Another difference is that, because the column list for a remote join cannot be found from the system catalogs, the FDW must fill <structfield>fdw_scan_tlist</structfield> with an appropriate list of <structfield>TargetEntry</structfield> nodes, representing the set of columns it will supply at run time in the tuples it returns.
ru: Если для соединения выбирается путь <structname>ForeignPath</structname>, он будет представлять весь процесс соединения; пути, сформированные для задействованных таблиц и подчинённых соединений, в нём применяться не будут. Далее этот путь соединения обрабатывается во многом так же, как и путь сканирования одной сторонней таблицы. Одно различие состоит в том, что <structfield>scanrelid</structfield> результирующего плана узла <structname>ForeignScan</structname> должно быть равно нулю, так как он не представляет какое-либо одно отношение; вместо этого набор соединяемых отношений представляется в поле <structfield>fs_relids</structfield> узла <structname>ForeignScan</structname>. (Это поле заполняется автоматически кодом ядра планировщика, так что FDW делать это не нужно.) Ещё одно отличие в том, что список столбцов для удалённого соединения нельзя получить из системных каталогов и поэтому FDW должна выдать в <structfield>fdw_scan_tlist</structfield> требуемый список узлов <structfield>TargetEntry</structfield>, представляющий набор столбцов, которые будут выдаваться во время выполнения в возвращаемых кортежах.

source: FDW Routines For Planning Post-Scan/Join Processing
ru: Подпрограммы FDW для планирования обработки после сканирования/соединения

source: If an FDW supports performing remote post-scan/join processing, such as remote aggregation, it should provide this callback function:
ru: Если FDW поддерживает удалённое выполнение операций после сканирования/соединения, например, удалённое агрегирование, она должна предоставить эту реализующую подпрограмму:

source: <placeholder-1/> Create possible access paths for <firstterm>upper relation</firstterm> processing, which is the planner's term for all post-scan/join query processing, such as aggregation, window functions, sorting, and table updates. This optional function is called during query planning. Currently, it is called only if all base relation(s) involved in the query belong to the same FDW. This function should generate <structname>ForeignPath</structname> path(s) for any post-scan/join processing that the FDW knows how to perform remotely, and call <function>add_path</function> to add these paths to the indicated upper relation. As with <function>GetForeignJoinPaths</function>, it is not necessary that this function succeed in creating any paths, since paths involving local processing are always possible.
ru: <placeholder-1/> Формирует возможные пути доступа для обработки <firstterm>верхнего отношения</firstterm>. Этот термин планировщика подразумевает любую обработку запросов после сканирования/соединения, в частности, агрегирование, вычисление оконных функций, сортировку и изменение таблиц. Эта необязательная функция вызывается во время планирования запроса. В настоящее время она вызывается, только если все базовые отношения, задействованные в запросе, относятся к одной FDW. Эта функция должна построить путь(и) <structname>ForeignPath</structname> для любых действий после сканирования/соединения, которые FDW умеет выполнять удалённо, и вызвать <function>add_path</function>, чтобы добавить эти пути к указанному верхнему отношению. Как и <function>GetForeignJoinPaths</function>, эта функция не обязательно должна возвращать какие-либо пути, так как всегда возможны пути с локальной обработкой.

source: The <literal>stage</literal> parameter identifies which post-scan/join step is currently being considered. <literal>output_rel</literal> is the upper relation that should receive paths representing computation of this step, and <literal>input_rel</literal> is the relation representing the input to this step. (Note that <structname>ForeignPath</structname> paths added to <literal>output_rel</literal> would typically not have any direct dependency on paths of the <literal>input_rel</literal>, since their processing is expected to be done externally. However, examining paths previously generated for the previous processing step can be useful to avoid redundant planning work.)
ru: Параметр <literal>stage</literal> определяет, какой шаг после сканирования/соединения рассматривается в данный момент. Параметр <literal>output_rel</literal> указывает на верхнее отношение, которое должно получить пути, представляющие вычисление этого шага, а <literal>input_rel</literal> — на отношение, представляющее входные данные для этого шага. (Заметьте, что пути <structname>ForeignPath</structname>, добавляемые в <literal>output_rel</literal>, обычно не будут напрямую зависеть от путей <literal>input_rel</literal>, так как ожидается, что они будут обрабатываться снаружи. Однако изучить пути, построенные для предыдущего шага обработки, может быть полезно для исключения лишних операций при планировании.)

source: FDW Routines For Updating Foreign Tables
ru: Подпрограммы FDW для изменения данных в сторонних таблицах

source: If an FDW supports writable foreign tables, it should provide some or all of the following callback functions depending on the needs and capabilities of the FDW:
ru: Если FDW поддерживает запись в сторонние таблицы, она должна предоставить некоторые или все подпрограммы, реализующие следующие функции, в зависимости от потребностей и возможностей FDW:

source: <placeholder-1/> <command>UPDATE</command> and <command>DELETE</command> operations are performed against rows previously fetched by the table-scanning functions. The FDW may need extra information, such as a row ID or the values of primary-key columns, to ensure that it can identify the exact row to update or delete. To support that, this function can add extra hidden, or <quote>junk</quote>, target columns to the list of columns that are to be retrieved from the foreign table during an <command>UPDATE</command> or <command>DELETE</command>.
ru: <placeholder-1/> Операции <command>UPDATE</command> и <command>DELETE</command> выполняются со строками, ранее выбранными функциями сканирования таблицы. FDW может потребоваться дополнительная информация, например, ID строки или значения столбцов первичного ключа, чтобы точно знать, какую именно строку нужно изменить или удалить. Для этого данная функция может добавить дополнительные скрытые или <quote>отбросовые</quote> целевые столбцы в список столбцов, которые должны быть получены из сторонней таблицы во время <command>UPDATE</command> или <command>DELETE</command>.

source: To do that, add <structname>TargetEntry</structname> items to <literal>parsetree-&gt;targetList</literal>, containing expressions for the extra values to be fetched. Each such entry must be marked <structfield>resjunk</structfield> = <literal>true</literal>, and must have a distinct <structfield>resname</structfield> that will identify it at execution time. Avoid using names matching <literal>ctid<replaceable>N</replaceable></literal>, <literal>wholerow</literal>, or <literal>wholerow<replaceable>N</replaceable></literal>, as the core system can generate junk columns of these names.
ru: Для этого добавьте в <literal>parsetree-&gt;targetList</literal> элементы <structname>TargetEntry</structname>, содержащие выражения для дополнительных выбираемых значений. У каждой такой записи должен быть признак <structfield>resjunk</structfield> = <literal>true</literal> и должно быть отдельное собственное имя <structfield>resname</structfield>, по которому она будет идентифицироваться во время выполнения. Избегайте использования имён вида <literal>ctid<replaceable>N</replaceable></literal>, <literal>wholerow</literal> или <literal>wholerow<replaceable>N</replaceable></literal>, так как столбцы с такими именами может генерировать ядро системы.

source: This function is called in the rewriter, not the planner, so the information available is a bit different from that available to the planning routines. <literal>parsetree</literal> is the parse tree for the <command>UPDATE</command> or <command>DELETE</command> command, while <literal>target_rte</literal> and <literal>target_relation</literal> describe the target foreign table.
ru: Эта функция вызывается механизмом перезаписи запросов, а не планировщиком, так что ей доступна информация, несколько отличающаяся от той, что получают подпрограммы на этапе планирования. В <literal>parsetree</literal> передаётся дерево разбора команды <command>UPDATE</command> или <command>DELETE</command>, а параметры <literal>target_rte</literal> и <literal>target_relation</literal> описывают целевую стороннюю таблицу.

source: If the <function>AddForeignUpdateTargets</function> pointer is set to <literal>NULL</literal>, no extra target expressions are added. (This will make it impossible to implement <command>DELETE</command> operations, though <command>UPDATE</command> may still be feasible if the FDW relies on an unchanging primary key to identify rows.)
ru: Если указатель <function>AddForeignUpdateTargets</function> равен <literal>NULL</literal>, дополнительные целевые выражения не добавляются. (Это делает невозможным реализацию операций <command>DELETE</command>, хотя операция <command>UPDATE</command> может быть всё же возможна, если FDW идентифицирует строки, полагаясь на то, что первичный ключ не меняется.)

source: <placeholder-1/> Perform any additional planning actions needed for an insert, update, or delete on a foreign table. This function generates the FDW-private information that will be attached to the <structname>ModifyTable</structname> plan node that performs the update action. This private information must have the form of a <literal>List</literal>, and will be delivered to <function>BeginForeignModify</function> during the execution stage.
ru: <placeholder-1/> Выполняет любые дополнительные действия планирования, необходимые для добавления, изменения или удаления в сторонней таблице. Эта функция формирует частную информацию FDW, которая будет добавлена в узел плана <structname>ModifyTable</structname>, осуществляющий изменение. Эта информация должна возвращаться в списке (<literal>List</literal>); она будет доставлена в функцию <function>BeginForeignModify</function> на стадии выполнения.

source: <literal>root</literal> is the planner's global information about the query. <literal>plan</literal> is the <structname>ModifyTable</structname> plan node, which is complete except for the <structfield>fdwPrivLists</structfield> field. <literal>resultRelation</literal> identifies the target foreign table by its range table index. <literal>subplan_index</literal> identifies which target of the <structname>ModifyTable</structname> plan node this is, counting from zero; use this if you want to index into <literal>plan-&gt;plans</literal> or other substructure of the <literal>plan</literal> node.
ru: В <literal>root</literal> передаётся общая информация планировщика о запросе, а в <literal>plan</literal> — узел плана <structname>ModifyTable</structname>, заполненный, не считая поля <structfield>fdwPrivLists</structfield>. Параметр <literal>resultRelation</literal> указывает на целевую стороннюю таблицу по номеру в списке отношений, а <literal>subplan_index</literal> определяет целевое отношение в данном узле <structname>ModifyTable</structname>, начиная с нуля; воспользуйтесь этим индексом, обращаясь к <literal>plan-&gt;plans</literal> или другой вложенной структуре узла <literal>plan</literal>.

source: If the <function>PlanForeignModify</function> pointer is set to <literal>NULL</literal>, no additional plan-time actions are taken, and the <literal>fdw_private</literal> list delivered to <function>BeginForeignModify</function> will be NIL.
ru: Если указатель <function>PlanForeignModify</function> равен <literal>NULL</literal>, дополнительные действия во время планирования не предпринимаются, и в качестве <literal>fdw_private</literal> в <function>BeginForeignModify</function> поступит NULL.

source: <placeholder-1/> Begin executing a foreign table modification operation. This routine is called during executor startup. It should perform any initialization needed prior to the actual table modifications. Subsequently, <function>ExecForeignInsert</function>, <function>ExecForeignUpdate</function> or <function>ExecForeignDelete</function> will be called for each tuple to be inserted, updated, or deleted.
ru: <placeholder-1/> Начинает выполнение операции изменения данных в сторонней таблице. Эта подпрограмма выполняется при запуске исполнителя. Она должна выполнять любые подготовительные действия, необходимые для того, чтобы собственно произвести изменения в таблице. Впоследствии для каждого кортежа, который будет вставляться, изменяться или удаляться, будет вызываться <function>ExecForeignInsert</function>, <function>ExecForeignUpdate</function> или <function>ExecForeignDelete</function>.

source: <literal>mtstate</literal> is the overall state of the <structname>ModifyTable</structname> plan node being executed; global data about the plan and execution state is available via this structure. <literal>rinfo</literal> is the <structname>ResultRelInfo</structname> struct describing the target foreign table. (The <structfield>ri_FdwState</structfield> field of <structname>ResultRelInfo</structname> is available for the FDW to store any private state it needs for this operation.) <literal>fdw_private</literal> contains the private data generated by <function>PlanForeignModify</function>, if any. <literal>subplan_index</literal> identifies which target of the <structname>ModifyTable</structname> plan node this is. <literal>eflags</literal> contains flag bits describing the executor's operating mode for this plan node.
ru: В параметре <literal>mtstate</literal> передаётся общее состояние выполняемого плана узла <structname>ModifyTable</structname>; через эту структуру доступны глобальные сведения о плане и состояние выполнения. В <literal>rinfo</literal> передаётся структура <structname>ResultRelInfo</structname>, описывающая целевую стороннюю таблицу. (Если FDW нужно сохранить частное состояние, необходимое для этой операции, она может воспользоваться полем <structfield>ri_FdwState</structfield> структуры <structname>ResultRelInfo</structname>.) В <literal>fdw_private</literal> передаются частные данные, если они были сформированы процедурой <function>PlanForeignModify</function>. Параметр <literal>subplan_index</literal> определяет целевое отношение в данном узле <structname>ModifyTable</structname>, а в <literal>eflags</literal> передаются битовые флаги, описывающие режим работы исполнителя для этого узла плана.

source: Note that when <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> is true, this function should not perform any externally-visible actions; it should only do the minimum required to make the node state valid for <function>ExplainForeignModify</function> and <function>EndForeignModify</function>.
ru: Заметьте, что когда <literal>(eflags &amp; EXEC_FLAG_EXPLAIN_ONLY)</literal> не равно нулю, эта функция не должна выполнять какие-либо внешне проявляющиеся действия; она должна сделать только то, что необходимо для получения состояния узла, подходящего для <function>ExplainForeignModify</function> и <function>EndForeignModify</function>.

source: If the <function>BeginForeignModify</function> pointer is set to <literal>NULL</literal>, no action is taken during executor startup.
ru: Если указатель на <function>BeginForeignModify</function> равен <literal>NULL</literal>, никакое действие при запуске исполнителя не выполняется.

source: <placeholder-1/> Insert one tuple into the foreign table. <literal>estate</literal> is global execution state for the query. <literal>rinfo</literal> is the <structname>ResultRelInfo</structname> struct describing the target foreign table. <literal>slot</literal> contains the tuple to be inserted; it will match the row-type definition of the foreign table. <literal>planSlot</literal> contains the tuple that was generated by the <structname>ModifyTable</structname> plan node's subplan; it differs from <literal>slot</literal> in possibly containing additional <quote>junk</quote> columns. (The <literal>planSlot</literal> is typically of little interest for <command>INSERT</command> cases, but is provided for completeness.)
ru: <placeholder-1/> Вставляет один кортеж в стороннюю таблицу. В <literal>estate</literal> передаётся глобальное состояние выполнения запроса, а в <literal>rinfo</literal> — структура <structname>ResultRelInfo</structname>, описывающая целевую стороннюю таблицу. Параметр <literal>slot</literal> содержит кортеж, который должен быть вставлен; он будет соответствовать определению типа строки сторонней таблицы. Параметр <literal>planSlot</literal> содержит кортеж, сформированный вложенным планом узла <structname>ModifyTable</structname>; он отличается от <literal>slot</literal> тем, что может содержать дополнительные <quote>отбросовые</quote> столбцы. (Значение <literal>planSlot</literal> обычно не очень интересно для операций <command>INSERT</command>, но оно представлено для полноты.)

source: The return value is either a slot containing the data that was actually inserted (this might differ from the data supplied, for example as a result of trigger actions), or NULL if no row was actually inserted (again, typically as a result of triggers). The passed-in <literal>slot</literal> can be re-used for this purpose.
ru: Возвращаемым значением будет либо слот, содержащий данные, которые были фактически вставлены (они могут отличаться от переданных данных, например, в результате действий триггеров), либо NULL, если никакая строка фактически не была вставлена (опять же, обычно в результате действий триггеров). Чтобы вернуть результат, также можно использовать передаваемый на вход <literal>slot</literal>.

source: The data in the returned slot is used only if the <command>INSERT</command> query has a <literal>RETURNING</literal> clause or the foreign table has an <literal>AFTER ROW</literal> trigger. Triggers require all columns, but the FDW could choose to optimize away returning some or all columns depending on the contents of the <literal>RETURNING</literal> clause. Regardless, some slot must be returned to indicate success, or the query's reported row count will be wrong.
ru: Данные в возвращаемом слоте используются, только если запрос <command>INSERT</command> содержит предложение <literal>RETURNING</literal> или для сторонней таблицы определён триггер <literal>AFTER ROW</literal>. Триггерам нужны все столбцы, но для предложения <literal>RETURNING</literal> FDW может ради оптимизации не возвращать некоторые или все столбцы, в зависимости от его содержания. Так или иначе, какой-либо слот необходимо вернуть, чтобы отметить, что операция успешна, иначе возвращённое число строк будет неверным.

source: If the <function>ExecForeignInsert</function> pointer is set to <literal>NULL</literal>, attempts to insert into the foreign table will fail with an error message.
ru: Если указатель на <function>ExecForeignInsert</function> равен <literal>NULL</literal>, вставить данные в стороннюю таблицу не удастся, в ответ будет выдаваться сообщение об ошибке.

source: <placeholder-1/> Update one tuple in the foreign table. <literal>estate</literal> is global execution state for the query. <literal>rinfo</literal> is the <structname>ResultRelInfo</structname> struct describing the target foreign table. <literal>slot</literal> contains the new data for the tuple; it will match the row-type definition of the foreign table. <literal>planSlot</literal> contains the tuple that was generated by the <structname>ModifyTable</structname> plan node's subplan; it differs from <literal>slot</literal> in possibly containing additional <quote>junk</quote> columns. In particular, any junk columns that were requested by <function>AddForeignUpdateTargets</function> will be available from this slot.
ru: <placeholder-1/> Изменяет один кортеж в сторонней таблице. В <literal>estate</literal> передаётся глобальное состояние выполнения запроса, а в <literal>rinfo</literal> — структура <structname>ResultRelInfo</structname>, описывающая целевую стороннюю таблицу. Параметр <literal>slot</literal> содержит новые данные для кортежа; он будет соответствовать определению типа строки сторонней таблицы. Параметр <literal>planSlot</literal> содержит кортеж, сформированный вложенным планом узла <structname>ModifyTable</structname>; он отличается от <literal>slot</literal> тем, что может содержать дополнительные <quote>отбросовые</quote> столбцы. В частности, в этом слоте можно получить любые отбросовые столбцы, запрошенные в <function>AddForeignUpdateTargets</function>.

source: The return value is either a slot containing the row as it was actually updated (this might differ from the data supplied, for example as a result of trigger actions), or NULL if no row was actually updated (again, typically as a result of triggers). The passed-in <literal>slot</literal> can be re-used for this purpose.
ru: Возвращаемым значением будет либо слот, содержащий строку в состоянии после изменения (её содержимое может отличаться от переданного, например, в результате действий триггеров), либо NULL, если никакая строка фактически не была изменена (опять же, обычно в результате действий триггеров). Чтобы вернуть результат, также можно использовать передаваемый на вход <literal>slot</literal>.

source: The data in the returned slot is used only if the <command>UPDATE</command> query has a <literal>RETURNING</literal> clause or the foreign table has an <literal>AFTER ROW</literal> trigger. Triggers require all columns, but the FDW could choose to optimize away returning some or all columns depending on the contents of the <literal>RETURNING</literal> clause. Regardless, some slot must be returned to indicate success, or the query's reported row count will be wrong.
ru: Данные в возвращаемом слоте используются, только если запрос <command>UPDATE</command> содержит предложение <literal>RETURNING</literal> или для сторонней таблицы определён триггер <literal>AFTER ROW</literal>. Триггерам нужны все столбцы, но для предложения <literal>RETURNING</literal> FDW может ради оптимизации не возвращать некоторые или все столбцы, в зависимости от его содержания. Так или иначе, какой-либо слот необходимо вернуть, чтобы отметить, что операция успешна, иначе возвращённое число строк будет неверным.

source: If the <function>ExecForeignUpdate</function> pointer is set to <literal>NULL</literal>, attempts to update the foreign table will fail with an error message.
ru: Если указатель на <function>ExecForeignUpdate</function> равен <literal>NULL</literal>, изменить данные в сторонней таблице не удастся, а в ответ будет выдаваться сообщение об ошибке.
