Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/indices.po
Languages: ru

source: <productname>PostgreSQL</productname> automatically creates a unique index when a unique constraint or primary key is defined for a table. The index covers the columns that make up the primary key or unique constraint (a multicolumn index, if appropriate), and is the mechanism that enforces the constraint.
ru: Когда для таблицы определяется ограничение уникальности или первичный ключ, <productname>PostgreSQL</productname> автоматически создаёт уникальный индекс по всем столбцам, составляющим это ограничение или первичный ключ (индекс может быть составным). Такой индекс и является механизмом, который обеспечивает выполнение ограничения.

source: There's no need to manually create indexes on unique columns; doing so would just duplicate the automatically-created index.
ru: Для уникальных столбцов не нужно вручную создавать отдельные индексы — они просто продублируют индексы, созданные автоматически.

source: Indexes on Expressions
ru: Индексы по выражениям

source: <primary>index</primary> <secondary sortas="expressions">on expressions</secondary>
ru: <primary>индекс</primary> <secondary sortas="expressions">по выражению</secondary>

source: An index column need not be just a column of the underlying table, but can be a function or scalar expression computed from one or more columns of the table. This feature is useful to obtain fast access to tables based on the results of computations.
ru: Индекс можно создать не только по столбцу нижележащей таблицы, но и по функции или скалярному выражению с одним или несколькими столбцами таблицы. Это позволяет быстро находить данные в таблице по результатам вычислений.

source: For example, a common way to do case-insensitive comparisons is to use the <function>lower</function> function: <placeholder-1/> This query can use an index if one has been defined on the result of the <literal>lower(col1)</literal> function: <placeholder-2/>
ru: Например, для сравнений без учёта регистра символов часто используется функция <function>lower</function>: <placeholder-1/> Этот запрос сможет использовать индекс, определённый для результата функции <literal>lower(col1)</literal> так: <placeholder-2/>

source: If we were to declare this index <literal>UNIQUE</literal>, it would prevent creation of rows whose <literal>col1</literal> values differ only in case, as well as rows whose <literal>col1</literal> values are actually identical. Thus, indexes on expressions can be used to enforce constraints that are not definable as simple unique constraints.
ru: Если мы объявим этот индекс уникальным (<literal>UNIQUE</literal>), он не даст добавить строки, в которых значения <literal>col1</literal> различаются только регистром, как и те, в которых значения <literal>col1</literal> действительно одинаковые. Таким образом, индексы по выражениям можно использовать ещё и для обеспечения ограничений, которые нельзя записать как простые ограничения уникальности.

source: As another example, if one often does queries like: <placeholder-1/> then it might be worth creating an index like this: <placeholder-2/>
ru: Если же часто выполняются запросы вида: <placeholder-1/> тогда, возможно, стоит создать такой индекс: <placeholder-2/>

source: The syntax of the <command>CREATE INDEX</command> command normally requires writing parentheses around index expressions, as shown in the second example. The parentheses can be omitted when the expression is just a function call, as in the first example.
ru: Синтаксис команды <command>CREATE INDEX</command> обычно требует заключать индексные выражения в скобки, как показано во втором примере. Если же выражение представляет собой просто вызов функции, как в первом примере, дополнительные скобки можно опустить.

source: Index expressions are relatively expensive to maintain, because the derived expression(s) must be computed for each row upon insertion and whenever it is updated. However, the index expressions are <emphasis>not</emphasis> recomputed during an indexed search, since they are already stored in the index. In both examples above, the system sees the query as just <literal>WHERE indexedcolumn = 'constant'</literal> and so the speed of the search is equivalent to any other simple index query. Thus, indexes on expressions are useful when retrieval speed is more important than insertion and update speed.
ru: Поддержка индексируемых выражений обходится довольно дорого, так как эти выражения должны вычисляться при добавлении каждой строки и при каждом последующем изменении. Однако при поиске по индексу индексируемое выражение <emphasis>не</emphasis> вычисляется повторно, так как его результат уже сохранён в индексе. В рассмотренных выше случаях система видит запрос как <literal>WHERE столбец_индекса = 'константа'</literal> и поэтому поиск выполняется так же быстро, как и с простым индексом. Таким образом, индексы по выражениям могут быть полезны, когда скорость извлечения данных гораздо важнее скорости добавления и изменения.

source: Partial Indexes
ru: Частичные индексы

source: <primary>index</primary> <secondary>partial</secondary>
ru: <primary>индекс</primary> <secondary>частичный</secondary>

source: A <firstterm>partial index</firstterm> is an index built over a subset of a table; the subset is defined by a conditional expression (called the <firstterm>predicate</firstterm> of the partial index). The index contains entries only for those table rows that satisfy the predicate. Partial indexes are a specialized feature, but there are several situations in which they are useful.
ru: <firstterm>Частичный индекс</firstterm> &mdash; это индекс, который строится по подмножеству строк таблицы, определяемому условным выражением (оно называется <firstterm>предикатом</firstterm> частичного индекса). Такой индекс содержит записи только для строк, удовлетворяющих предикату. Частичные индексы довольно специфичны, но в ряде ситуаций они могут быть очень полезны.

source: One major reason for using a partial index is to avoid indexing common values. Since a query searching for a common value (one that accounts for more than a few percent of all the table rows) will not use the index anyway, there is no point in keeping those rows in the index at all. This reduces the size of the index, which will speed up those queries that do use the index. It will also speed up many table update operations because the index does not need to be updated in all cases. <xref linkend="indexes-partial-ex1"/> shows a possible application of this idea.
ru: Частичные индексы могут быть полезны, во-первых, тем, что позволяют избежать индексирования распространённых значений. Так как при поиске распространённого значения (такого, которое содержится в значительном проценте всех строк) индекс всё равно не будет использоваться, хранить эти строки в индексе нет смысла. Исключив их из индекса, можно уменьшить его размер, а значит и ускорить запросы, использующие этот индекс. Это также может ускорить операции изменения данных в таблице, так как индекс будет обновляться не всегда. Возможное применение этой идеи проиллюстрировано в <xref remap="6" linkend="indexes-partial-ex1"/>.

source: Setting up a Partial Index to Exclude Common Values
ru: Настройка частичного индекса, исключающего распространённые значения

source: Suppose you are storing web server access logs in a database. Most accesses originate from the IP address range of your organization but some are from elsewhere (say, employees on dial-up connections). If your searches by IP are primarily for outside accesses, you probably do not need to index the IP range that corresponds to your organization's subnet.
ru: Предположим, что вы храните в базе данных журнал обращений к корпоративному сайту. Большая часть обращений будет происходить из диапазона IP-адресов вашей компании, а остальные могут быть откуда угодно (например, к нему могут подключаться внешние сотрудники с динамическими IP). Если при поиске по IP вас обычно интересуют внешние подключения, IP-диапазон внутренней сети компании можно не включать в индекс.

source: Assume a table like this: <placeholder-1/>
ru: Пусть у вас есть такая таблица: <placeholder-1/>

source: To create a partial index that suits our example, use a command such as this: <placeholder-1/>
ru: Создать частичный индекс для нашего примера можно так: <placeholder-1/>

source: A typical query that can use this index would be: <placeholder-1/> A query that cannot use this index is: <placeholder-2/>
ru: Так будет выглядеть типичный запрос, использующий этот индекс: <placeholder-1/> А следующий запрос не будет использовать этот индекс: <placeholder-2/>

source: Observe that this kind of partial index requires that the common values be predetermined, so such partial indexes are best used for data distributions that do not change. The indexes can be recreated occasionally to adjust for new data distributions, but this adds maintenance effort.
ru: Заметьте, что при таком определении частичного индекса необходимо, чтобы распространённые значения были известны заранее, так что такие индексы лучше использовать, когда распределение данных не меняется. Хотя такие индексы можно пересоздавать время от времени, подстраиваясь под новое распределение, это значительно усложняет поддержку.

source: Another possible use for a partial index is to exclude values from the index that the typical query workload is not interested in; this is shown in <xref linkend="indexes-partial-ex2"/>. This results in the same advantages as listed above, but it prevents the <quote>uninteresting</quote> values from being accessed via that index, even if an index scan might be profitable in that case. Obviously, setting up partial indexes for this kind of scenario will require a lot of care and experimentation.
ru: Во-вторых, частичные индексы могут быть полезны тем, что позволяют исключить из индекса значения, которые обычно не представляют интереса; это проиллюстрировано в <xref remap="6" linkend="indexes-partial-ex2"/>. При этом вы получаете те же преимущества, что и в предыдущем случае, но система не сможет извлечь <quote>неинтересные</quote> значения по этому индексу, даже если сканирование индекса может быть эффективным. Очевидно, настройка частичных индексов в таких случаях требует тщательного анализа и тестирования.

source: Setting up a Partial Index to Exclude Uninteresting Values
ru: Настройка частичного индекса, исключающего неинтересные значения

source: If you have a table that contains both billed and unbilled orders, where the unbilled orders take up a small fraction of the total table and yet those are the most-accessed rows, you can improve performance by creating an index on just the unbilled rows. The command to create the index would look like this: <placeholder-1/>
ru: Если у вас есть таблица, в которой хранятся и оплаченные, и неоплаченные счета, и при этом неоплаченные счета составляют только небольшую часть всей таблицы, но представляют наибольший интерес, производительность запросов можно увеличить, создав индекс только по неоплаченным счетам. Сделать это можно следующей командой: <placeholder-1/>

source: A possible query to use this index would be: <placeholder-1/> However, the index can also be used in queries that do not involve <structfield>order_nr</structfield> at all, e.g.: <placeholder-2/> This is not as efficient as a partial index on the <structfield>amount</structfield> column would be, since the system has to scan the entire index. Yet, if there are relatively few unbilled orders, using this partial index just to find the unbilled orders could be a win.
ru: Этот индекс будет применяться, например в таком запросе: <placeholder-1/> Однако он также может применяться в запросах, где <structfield>order_nr</structfield> вообще не используется, например: <placeholder-2/> Конечно, он будет не так эффективен, как мог бы быть частичный индекс по столбцу <structfield>amount</structfield>, так как системе придётся сканировать его целиком. Тем не менее, если неоплаченных счетов сравнительно мало, выиграть при поиске неоплаченного счёта можно и с таким частичным индексом.

source: Note that this query cannot use this index: <placeholder-1/> The order 3501 might be among the billed or unbilled orders.
ru: Заметьте, что в таком запросе этот индекс не будет использоваться: <placeholder-1/> Счёт с номером 3501 может оказаться, как в числе неоплаченных, так и оплаченных.

source: <xref linkend="indexes-partial-ex2"/> also illustrates that the indexed column and the column used in the predicate do not need to match. <productname>PostgreSQL</productname> supports partial indexes with arbitrary predicates, so long as only columns of the table being indexed are involved. However, keep in mind that the predicate must match the conditions used in the queries that are supposed to benefit from the index. To be precise, a partial index can be used in a query only if the system can recognize that the <literal>WHERE</literal> condition of the query mathematically implies the predicate of the index. <productname>PostgreSQL</productname> does not have a sophisticated theorem prover that can recognize mathematically equivalent expressions that are written in different forms. (Not only is such a general theorem prover extremely difficult to create, it would probably be too slow to be of any real use.) The system can recognize simple inequality implications, for example <quote>x &lt; 1</quote> implies <quote>x &lt; 2</quote>; otherwise the predicate condition must exactly match part of the query's <literal>WHERE</literal> condition or the index will not be recognized as usable. Matching takes place at query planning time, not at run time. As a result, parameterized query clauses do not work with a partial index. For example a prepared query with a parameter might specify <quote>x &lt; ?</quote> which will never imply <quote>x &lt; 2</quote> for all possible values of the parameter.
ru: <xref linkend="indexes-partial-ex2"/> также показывает, что индексируемый столбец не обязательно должен совпадать со столбцом, используемым в предикате. <productname>PostgreSQL</productname> поддерживает частичные индексы с произвольными предикатами &mdash; главное, чтобы в них фигурировали только столбцы индексируемой таблицы. Однако не забывайте, что предикат должен соответствовать условиям запросов, для оптимизации которых предназначается данный индекс. Точнее, частичный индекс будет применяться в запросе, только если система сможет понять, что условие <literal>WHERE</literal> данного запроса математически сводится к предикату индекса. Но учтите, что <productname>PostgreSQL</productname> не умеет доказывать математические утверждения об эквивалентности выражений, записанных в разных формах. (Составить программу для таких доказательств крайне сложно, и если даже это удастся, скорость её будет неприемлема для применения на практике.) Система может выявить только самые простые следствия с неравенствами; например, понять, что из <quote>x &lt; 1</quote> следует <quote>x &lt; 2</quote>; во всех остальных случаях условие предиката должно точно совпадать с условием в предложении <literal>WHERE</literal>, иначе индекс будет считаться неподходящим. Сопоставление условий происходит во время планирования запросов, а не во время выполнения. Как следствие, запросы с параметрами не будут работать с частичными индексами. Например, условие с параметром <quote>x &lt; ?</quote> в подготовленном запросе никогда не будет сведено к <quote>x &lt; 2</quote> при всех возможных значениях параметра.

source: A third possible use for partial indexes does not require the index to be used in queries at all. The idea here is to create a unique index over a subset of a table, as in <xref linkend="indexes-partial-ex3"/>. This enforces uniqueness among the rows that satisfy the index predicate, without constraining those that do not.
ru: Третье возможное применение частичных индексов вообще не связано с использованием индекса в запросах. Идея заключается в том, чтобы создать уникальный индекс по подмножеству строк таблицы, как в <xref remap="6" linkend="indexes-partial-ex3"/>. Это обеспечит уникальность среди строк, удовлетворяющих условию предиката, но никак не будет ограничивать остальные.

source: Setting up a Partial Unique Index
ru: Настройка частичного уникального индекса

source: Suppose that we have a table describing test outcomes. We wish to ensure that there is only one <quote>successful</quote> entry for a given subject and target combination, but there might be any number of <quote>unsuccessful</quote> entries. Here is one way to do it: <placeholder-1/> This is a particularly efficient approach when there are few successful tests and many unsuccessful ones.
ru: Предположим, что у нас есть таблица с результатами теста. Мы хотим, чтобы для каждого сочетания предмета и целевой темы была только одна запись об успешном результате, а неудачных попыток могло быть много. Вот как можно этого добиться: <placeholder-1/> Это подход будет особенно эффективным, когда неудачных попыток будет намного больше, чем удачных.

source: Finally, a partial index can also be used to override the system's query plan choices. Also, data sets with peculiar distributions might cause the system to use an index when it really should not. In that case the index can be set up so that it is not available for the offending query. Normally, <productname>PostgreSQL</productname> makes reasonable choices about index usage (e.g., it avoids them when retrieving common values, so the earlier example really only saves index size, it is not required to avoid index usage), and grossly incorrect plan choices are cause for a bug report.
ru: Наконец, с помощью частичных индексов можно также переопределять выбираемый системой план запроса. Возможно, что для данных с неудачным распределением система решит использовать индекс, тогда как на самом деле это неэффективно. В этом случае индекс можно настроить так, чтобы в подобных запросах он не работал. Обычно <productname>PostgreSQL</productname> принимает разумные решения относительно применения индексов (т. е. старается не использовать их для получения распространённых значений, так что частичный индекс в вышеприведённом примере помог только уменьшить размер индекса, для отказа от использования индекса он не требовался), поэтому крайне неэффективный план может быть поводом для сообщения об ошибке.

source: Keep in mind that setting up a partial index indicates that you know at least as much as the query planner knows, in particular you know when an index might be profitable. Forming this knowledge requires experience and understanding of how indexes in <productname>PostgreSQL</productname> work. In most cases, the advantage of a partial index over a regular index will be minimal.
ru: Помните, что настраивая частичный индекс, вы тем самым заявляете, что знаете о данных гораздо больше, чем планировщик запросов. В частности, вы знаете, когда такой индекс может быть полезен. Это знание обязательно должно подкрепляться опытом и пониманием того, как работают индексы в <productname>PostgreSQL</productname>. В большинстве случаев преимущества частичных индексов по сравнению с обычными будут минимальными.

source: More information about partial indexes can be found in <xref linkend="ston89b"/>, <xref linkend="olson93"/>, and <xref linkend="seshadri95"/>.
ru: Узнать о частичных индексах больше можно в следующих источниках: <xref linkend="ston89b"/>, <xref linkend="olson93"/> и <xref linkend="seshadri95"/>.

source: Operator Classes and Operator Families
ru: Семейства и классы операторов

source: <primary>operator class</primary>
ru: <primary>класс операторов</primary>

source: <primary>operator family</primary>
ru: <primary>семейство операторов</primary>

source: An index definition can specify an <firstterm>operator class</firstterm> for each column of an index. <synopsis> CREATE INDEX <replaceable>name</replaceable> ON <replaceable>table</replaceable> (<replaceable>column</replaceable> <replaceable>opclass</replaceable> <optional><replaceable>sort options</replaceable></optional> <optional>, ...</optional>); </synopsis> The operator class identifies the operators to be used by the index for that column. For example, a B-tree index on the type <type>int4</type> would use the <literal>int4_ops</literal> class; this operator class includes comparison functions for values of type <type>int4</type>. In practice the default operator class for the column's data type is usually sufficient. The main reason for having operator classes is that for some data types, there could be more than one meaningful index behavior. For example, we might want to sort a complex-number data type either by absolute value or by real part. We could do this by defining two operator classes for the data type and then selecting the proper class when making an index. The operator class determines the basic sort ordering (which can then be modified by adding sort options <literal>COLLATE</literal>, <literal>ASC</literal>/<literal>DESC</literal> and/or <literal>NULLS FIRST</literal>/<literal>NULLS LAST</literal>).
ru: В определении индекса можно указать <firstterm>класс операторов</firstterm> для каждого столбца индекса. <synopsis> CREATE INDEX <replaceable>имя</replaceable> ON <replaceable>таблица</replaceable> (<replaceable>столбец</replaceable> <replaceable>класс_операторов</replaceable> <optional><replaceable>параметры сортировки</replaceable></optional> <optional>, ...</optional>); </synopsis> Класс операторов определяет, какие операторы будет использовать индекс для этого столбца. Например, индекс-B-дерево по столбцу <type>int4</type> будет использовать класс <literal>int4_ops</literal>; этот класс операторов включает операции со значениями типа <type>int4</type>. На практике часто достаточно принять класс операторов, назначенный для типа столбца классом по умолчанию. Однако для некоторых типов данных могут иметь смысл несколько разных вариантов индексирования и реализовать их как раз позволяют разные классы операторов. Например, комплексные числа можно сортировать как по вещественной части, так и по модулю. Получить два варианта индексов для них можно, определив два класса операторов для данного типа и выбрав соответствующий класс при создании индекса. Выбранный класс операторов задаст основной порядок сортировки данных (его можно уточнить, добавив параметры <literal>COLLATE</literal>, <literal>ASC</literal>/<literal>DESC</literal> и/или <literal>NULLS FIRST</literal>/<literal>NULLS LAST</literal>).
