Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/indices.po
Languages: ru

source: Currently, only the B-tree, GiST, GIN, and BRIN index types support multicolumn indexes. Up to 32 columns can be specified. (This limit can be altered when building <productname>PostgreSQL</productname>; see the file <filename>pg_config_manual.h</filename>.)
ru: В настоящее время составными могут быть только индексы типов B-дерево, GiST, GIN и BRIN. Число столбцов в индексе ограничивается 32. (Этот предел можно изменить при компиляции <productname>PostgreSQL</productname>; см. файл <filename>pg_config_manual.h</filename>.)

source: A multicolumn B-tree index can be used with query conditions that involve any subset of the index's columns, but the index is most efficient when there are constraints on the leading (leftmost) columns. The exact rule is that equality constraints on leading columns, plus any inequality constraints on the first column that does not have an equality constraint, will be used to limit the portion of the index that is scanned. Constraints on columns to the right of these columns are checked in the index, so they save visits to the table proper, but they do not reduce the portion of the index that has to be scanned. For example, given an index on <literal>(a, b, c)</literal> and a query condition <literal>WHERE a = 5 AND b &gt;= 42 AND c &lt; 77</literal>, the index would have to be scanned from the first entry with <literal>a</literal> = 5 and <literal>b</literal> = 42 up through the last entry with <literal>a</literal> = 5. Index entries with <literal>c</literal> &gt;= 77 would be skipped, but they'd still have to be scanned through. This index could in principle be used for queries that have constraints on <literal>b</literal> and/or <literal>c</literal> with no constraint on <literal>a</literal> &mdash; but the entire index would have to be scanned, so in most cases the planner would prefer a sequential table scan over using the index.
ru: Составной индекс-B-дерево может применяться в условиях с любым подмножеством столбцов индекса, но наиболее эффективен он при ограничениях по ведущим (левым) столбцам. Точное правило состоит в том, что сканируемая область индекса определяется условиями равенства с ведущими столбцами и условиями неравенства с первым столбцом, не участвующим в условии равенства. Ограничения столбцов правее них также проверяются по индексу, так что обращение к таблице откладывается, но на размер сканируемой области индекса это уже не влияет. Например, если есть индекс по столбцам <literal>(a, b, c)</literal> и условие <literal>WHERE a = 5 AND b &gt;= 42 AND c &lt; 77</literal>, индекс будет сканироваться от первой записи <literal>a</literal> = 5 и <literal>b</literal> = 42 до последней с <literal>a</literal> = 5. Записи индекса, в которых <literal>c</literal> &gt;= 77, не будут учитываться, но, тем не менее, будут просканированы. Этот индекс в принципе может использоваться в запросах с ограничениями по <literal>b</literal> и/или <literal>c</literal>, без ограничений столбца <literal>a</literal>, но при этом будет просканирован весь индекс, так что в большинстве случаев планировщик предпочтёт использованию индекса полное сканирование таблицы.

source: A multicolumn GiST index can be used with query conditions that involve any subset of the index's columns. Conditions on additional columns restrict the entries returned by the index, but the condition on the first column is the most important one for determining how much of the index needs to be scanned. A GiST index will be relatively ineffective if its first column has only a few distinct values, even if there are many distinct values in additional columns.
ru: Составной индекс GiST может применяться в условиях с любым подмножеством столбцов индекса. Условия с дополнительными столбцами ограничивают записи, возвращаемые индексом, но в первую очередь сканируемая область индекса определяется ограничением первого столбца. GiST-индекс будет относительно малоэффективен, когда первый его столбец содержит только несколько различающихся значений, даже если дополнительные столбцы дают множество различных значений.

source: A multicolumn GIN index can be used with query conditions that involve any subset of the index's columns. Unlike B-tree or GiST, index search effectiveness is the same regardless of which index column(s) the query conditions use.
ru: Составной индекс GIN может применяться в условиях с любым подмножеством столбцов индекса. В отличие от индексов GiST или B-деревьев, эффективность поиска по нему не меняется в зависимости от того, какие из его столбцов используются в условиях запроса.

source: A multicolumn BRIN index can be used with query conditions that involve any subset of the index's columns. Like GIN and unlike B-tree or GiST, index search effectiveness is the same regardless of which index column(s) the query conditions use. The only reason to have multiple BRIN indexes instead of one multicolumn BRIN index on a single table is to have a different <literal>pages_per_range</literal> storage parameter.
ru: Составной индекс BRIN может применяться в условиях запроса с любым подмножеством столбцов индекса. Подобно индексу GIN и в отличие от B-деревьев или GiST, эффективность поиска по нему не меняется в зависимости от того, какие из его столбцов используются в условиях запроса. Единственное, зачем в одной таблице могут потребоваться несколько индексов BRIN вместо одного составного индекса — это затем, чтобы применялись разные параметры хранения <literal>pages_per_range</literal>.

source: Of course, each column must be used with operators appropriate to the index type; clauses that involve other operators will not be considered.
ru: При этом, разумеется, каждый столбец должен использоваться с операторами, соответствующими типу индекса; ограничения с другими операторами рассматриваться не будут.

source: Multicolumn indexes should be used sparingly. In most situations, an index on a single column is sufficient and saves space and time. Indexes with more than three columns are unlikely to be helpful unless the usage of the table is extremely stylized. See also <xref linkend="indexes-bitmap-scans"/> and <xref linkend="indexes-index-only-scans"/> for some discussion of the merits of different index configurations.
ru: Составные индексы следует использовать обдуманно. В большинстве случаев индекс по одному столбцу будет работать достаточно хорошо и сэкономит время и место. Индексы по более чём трём столбцам вряд ли будут полезными, если только таблица не используется крайне однообразно. Описание достоинств различных конфигураций индексов можно найти в <xref remap="6" linkend="indexes-bitmap-scans"/> и <xref remap="6" linkend="indexes-index-only-scans"/>.

source: Indexes and <literal>ORDER BY</literal>
ru: Индексы и предложения <literal>ORDER BY</literal>

source: <primary>index</primary> <secondary>and <literal>ORDER BY</literal></secondary>
ru: <primary>индекс</primary> <secondary>и <literal>ORDER BY</literal></secondary>

source: In addition to simply finding the rows to be returned by a query, an index may be able to deliver them in a specific sorted order. This allows a query's <literal>ORDER BY</literal> specification to be honored without a separate sorting step. Of the index types currently supported by <productname>PostgreSQL</productname>, only B-tree can produce sorted output &mdash; the other index types return matching rows in an unspecified, implementation-dependent order.
ru: Помимо простого поиска строк для выдачи в результате запроса, индексы также могут применяться для сортировки строк в определённом порядке. Это позволяет учесть предложение <literal>ORDER BY</literal> в запросе, не выполняя сортировку дополнительно. Из всех типов индексов, которые поддерживает <productname>PostgreSQL</productname>, сортировать данные могут только B-деревья &mdash; индексы других типов возвращают строки в неопределённом, зависящем от реализации порядке.

source: The planner will consider satisfying an <literal>ORDER BY</literal> specification either by scanning an available index that matches the specification, or by scanning the table in physical order and doing an explicit sort. For a query that requires scanning a large fraction of the table, an explicit sort is likely to be faster than using an index because it requires less disk I/O due to following a sequential access pattern. Indexes are more useful when only a few rows need be fetched. An important special case is <literal>ORDER BY</literal> in combination with <literal>LIMIT</literal> <replaceable>n</replaceable>: an explicit sort will have to process all the data to identify the first <replaceable>n</replaceable> rows, but if there is an index matching the <literal>ORDER BY</literal>, the first <replaceable>n</replaceable> rows can be retrieved directly, without scanning the remainder at all.
ru: Планировщик может выполнить указание <literal>ORDER BY</literal>, либо просканировав существующий индекс, подходящий этому указанию, либо просканировав таблицу в физическом порядке и выполнив сортировку явно. Для запроса, требующего сканирования большой части таблицы, явная сортировка скорее всего будет быстрее, чем применение индекса, так как при последовательном чтении она потребует меньше операций ввода/вывода. Важный особый случай представляет <literal>ORDER BY</literal> в сочетании с <literal>LIMIT</literal> <replaceable>n</replaceable>: при явной сортировке системе потребуется обработать все данные, чтобы выбрать первые <replaceable>n</replaceable> строк, но при наличии индекса, соответствующего столбцам в <literal>ORDER BY</literal>, первые <replaceable>n</replaceable> строк можно получить сразу, не просматривая остальные вовсе.

source: By default, B-tree indexes store their entries in ascending order with nulls last. This means that a forward scan of an index on column <literal>x</literal> produces output satisfying <literal>ORDER BY x</literal> (or more verbosely, <literal>ORDER BY x ASC NULLS LAST</literal>). The index can also be scanned backward, producing output satisfying <literal>ORDER BY x DESC</literal> (or more verbosely, <literal>ORDER BY x DESC NULLS FIRST</literal>, since <literal>NULLS FIRST</literal> is the default for <literal>ORDER BY DESC</literal>).
ru: По умолчанию элементы B-дерева хранятся в порядке возрастания, при этом значения NULL идут в конце. Это означает, что при прямом сканировании индекса по столбцу <literal>x</literal> порядок оказывается соответствующим указанию <literal>ORDER BY x</literal> (или точнее, <literal>ORDER BY x ASC NULLS LAST</literal>). Индекс также может сканироваться в обратную сторону, и тогда порядок соответствует указанию <literal>ORDER BY x DESC</literal> (или точнее, <literal>ORDER BY x DESC NULLS FIRST</literal>, так как для <literal>ORDER BY DESC</literal> подразумевается <literal>NULLS FIRST</literal>).

source: You can adjust the ordering of a B-tree index by including the options <literal>ASC</literal>, <literal>DESC</literal>, <literal>NULLS FIRST</literal>, and/or <literal>NULLS LAST</literal> when creating the index; for example: <placeholder-1/> An index stored in ascending order with nulls first can satisfy either <literal>ORDER BY x ASC NULLS FIRST</literal> or <literal>ORDER BY x DESC NULLS LAST</literal> depending on which direction it is scanned in.
ru: Вы можете изменить порядок сортировки элементов B-дерева, добавив уточнения <literal>ASC</literal>, <literal>DESC</literal>, <literal>NULLS FIRST</literal> и/или <literal>NULLS LAST</literal> при создании индекса; например: <placeholder-1/> Индекс, в котором элементы хранятся в порядке возрастания и значения NULL идут первыми, может удовлетворять указаниям <literal>ORDER BY x ASC NULLS FIRST</literal> или <literal>ORDER BY x DESC NULLS LAST</literal>, в зависимости от направления просмотра.

source: You might wonder why bother providing all four options, when two options together with the possibility of backward scan would cover all the variants of <literal>ORDER BY</literal>. In single-column indexes the options are indeed redundant, but in multicolumn indexes they can be useful. Consider a two-column index on <literal>(x, y)</literal>: this can satisfy <literal>ORDER BY x, y</literal> if we scan forward, or <literal>ORDER BY x DESC, y DESC</literal> if we scan backward. But it might be that the application frequently needs to use <literal>ORDER BY x ASC, y DESC</literal>. There is no way to get that ordering from a plain index, but it is possible if the index is defined as <literal>(x ASC, y DESC)</literal> or <literal>(x DESC, y ASC)</literal>.
ru: У вас может возникнуть вопрос, зачем нужны все четыре варианта при создании индексов, когда и два варианта с учётом обратного просмотра покрывают все виды <literal>ORDER BY</literal>. Для индексов по одному столбцу это и в самом деле излишне, но для индексов по многим столбцам это может быть полезно. Рассмотрим индекс по двум столбцам <literal>(x, y)</literal>: он может удовлетворять указанию <literal>ORDER BY x, y</literal> при прямом сканировании или <literal>ORDER BY x DESC, y DESC</literal> при обратном. Но вполне возможно, что приложение будет часто выполнять <literal>ORDER BY x ASC, y DESC</literal>. В этом случае получить такую сортировку от простого индекса нельзя, но можно получить подходящий индекс, определив его как <literal>(x ASC, y DESC)</literal> или <literal>(x DESC, y ASC)</literal>.

source: Obviously, indexes with non-default sort orderings are a fairly specialized feature, but sometimes they can produce tremendous speedups for certain queries. Whether it's worth maintaining such an index depends on how often you use queries that require a special sort ordering.
ru: Очевидно, что индексы с нестандартными правилами сортировки весьма специфичны, но иногда они могут кардинально ускорить определённые запросы. Стоит ли вводить такие индексы, зависит от того, как часто выполняются запросы с необычным порядком сортировки.

source: Combining Multiple Indexes
ru: Объединение нескольких индексов

source: <primary>index</primary> <secondary>combining multiple indexes</secondary>
ru: <primary>индекс</primary> <secondary>объединение нескольких индексов</secondary>

source: <primary>bitmap scan</primary>
ru: <primary>сканирование по битовой карте</primary>

source: A single index scan can only use query clauses that use the index's columns with operators of its operator class and are joined with <literal>AND</literal>. For example, given an index on <literal>(a, b)</literal> a query condition like <literal>WHERE a = 5 AND b = 6</literal> could use the index, but a query like <literal>WHERE a = 5 OR b = 6</literal> could not directly use the index.
ru: При простом сканировании индекса могут обрабатываться только те предложения в запросе, в которых применяются операторы его класса и объединяет их <literal>AND</literal>. Например, для индекса <literal>(a, b)</literal> условие запроса <literal>WHERE a = 5 AND b = 6</literal> сможет использовать этот индекс, а запрос <literal>WHERE a = 5 OR b = 6</literal> &mdash; нет.

source: Fortunately, <productname>PostgreSQL</productname> has the ability to combine multiple indexes (including multiple uses of the same index) to handle cases that cannot be implemented by single index scans. The system can form <literal>AND</literal> and <literal>OR</literal> conditions across several index scans. For example, a query like <literal>WHERE x = 42 OR x = 47 OR x = 53 OR x = 99</literal> could be broken down into four separate scans of an index on <literal>x</literal>, each scan using one of the query clauses. The results of these scans are then ORed together to produce the result. Another example is that if we have separate indexes on <literal>x</literal> and <literal>y</literal>, one possible implementation of a query like <literal>WHERE x = 5 AND y = 6</literal> is to use each index with the appropriate query clause and then AND together the index results to identify the result rows.
ru: К счастью, <productname>PostgreSQL</productname> способен соединять несколько индексов (и в том числе многократно применять один индекс) и охватывать также случаи, когда сканирования одного индекса недостаточно. Система может сформировать условия <literal>AND</literal> и <literal>OR</literal> за несколько проходов индекса. Например, запрос <literal>WHERE x = 42 OR x = 47 OR x = 53 OR x = 99</literal> можно разбить на четыре сканирования индекса по <literal>x</literal>, по сканированию для каждой части условия. Затем результаты этих сканирований будут логически сложены (OR) вместе и дадут конечный результат. Другой пример &mdash; если у нас есть отдельные индексы по <literal>x</literal> и <literal>y</literal>, запрос <literal>WHERE x = 5 AND y = 6</literal> можно выполнить, применив индексы для соответствующих частей запроса, а затем вычислив логическое произведение (AND) для найденных строк, которое и станет конечным результатом.

source: To combine multiple indexes, the system scans each needed index and prepares a <firstterm>bitmap</firstterm> in memory giving the locations of table rows that are reported as matching that index's conditions. The bitmaps are then ANDed and ORed together as needed by the query. Finally, the actual table rows are visited and returned. The table rows are visited in physical order, because that is how the bitmap is laid out; this means that any ordering of the original indexes is lost, and so a separate sort step will be needed if the query has an <literal>ORDER BY</literal> clause. For this reason, and because each additional index scan adds extra time, the planner will sometimes choose to use a simple index scan even though additional indexes are available that could have been used as well.
ru: Выполняя объединение нескольких индексов, система сканирует все необходимые индексы и создаёт в памяти <firstterm>битовую карту</firstterm> расположения строк таблицы, которые удовлетворяют условиям каждого индекса. Затем битовые карты объединяются операциями AND и OR, как того требуют условия в запросе. Наконец система обращается к соответствующим отмеченным строкам таблицы и возвращает их данные. Строки таблицы просматриваются в физическом порядке, как они представлены в битовой карте; это означает, что порядок сортировки индексов при этом теряется и в запросах с предложением <literal>ORDER BY</literal> сортировка будет выполняться отдельно. По этой причине, а также потому, что каждое сканирование индекса занимает дополнительное время, планировщик иногда выбирает простое сканирование индекса, несмотря на то, что можно было бы подключить и дополнительные индексы.

source: In all but the simplest applications, there are various combinations of indexes that might be useful, and the database developer must make trade-offs to decide which indexes to provide. Sometimes multicolumn indexes are best, but sometimes it's better to create separate indexes and rely on the index-combination feature. For example, if your workload includes a mix of queries that sometimes involve only column <literal>x</literal>, sometimes only column <literal>y</literal>, and sometimes both columns, you might choose to create two separate indexes on <literal>x</literal> and <literal>y</literal>, relying on index combination to process the queries that use both columns. You could also create a multicolumn index on <literal>(x, y)</literal>. This index would typically be more efficient than index combination for queries involving both columns, but as discussed in <xref linkend="indexes-multicolumn"/>, it would be almost useless for queries involving only <literal>y</literal>, so it should not be the only index. A combination of the multicolumn index and a separate index on <literal>y</literal> would serve reasonably well. For queries involving only <literal>x</literal>, the multicolumn index could be used, though it would be larger and hence slower than an index on <literal>x</literal> alone. The last alternative is to create all three indexes, but this is probably only reasonable if the table is searched much more often than it is updated and all three types of query are common. If one of the types of query is much less common than the others, you'd probably settle for creating just the two indexes that best match the common types.
ru: В большинстве приложений (кроме самых простых) полезными могут оказаться различные комбинации индексов, поэтому разработчик баз данных, определяя набор индексов, должен искать компромиссное решение. Иногда оказываются хороши составные индексы, а иногда лучше создать отдельные индексы и положиться на возможности объединения индексов. Например, если типичную нагрузку составляют запросы иногда с условием только по столбцу <literal>x</literal>, иногда только по <literal>y</literal>, а иногда по обоим столбцам, вы можете ограничиться двумя отдельными индексами по <literal>x</literal> и <literal>y</literal>, рассчитывая на то, что при обработке условий с обоими столбцами эти индексы будут объединяться. С другой стороны, вы можете создать один составной индекс по <literal>(x, y)</literal>. Этот индекс скорее всего будет работать эффективнее, чем объединение индексов, в запросах с двумя столбцами, но как говорилось в <xref remap="6" linkend="indexes-multicolumn"/>, он будет практически бесполезен для запросов с ограничениями только по <literal>y</literal>, так что одного этого индекса будет недостаточно. Выигрышным в этом случае может быть сочетание составного индекса с отдельным индексом по <literal>y</literal>. В запросах, где задействуется только <literal>x</literal>, может применяться составной индекс, хотя он будет больше и, следовательно, медленнее индекса по одному <literal>x</literal>. Наконец, можно создать все три индекса, но это будет оправдано, только если данные в таблице изменяются гораздо реже, чем выполняется поиск в таблице, при этом частота запросов этих трёх типов примерно одинакова. Если запросы какого-то одного типа выполняются гораздо реже других, возможно лучше будет оставить только два индекса, соответствующих наиболее частым запросам.

source: Unique Indexes
ru: Уникальные индексы

source: <primary>index</primary> <secondary>unique</secondary>
ru: <primary>индекс</primary> <secondary>уникальный</secondary>

source: Indexes can also be used to enforce uniqueness of a column's value, or the uniqueness of the combined values of more than one column. <synopsis> CREATE UNIQUE INDEX <replaceable>name</replaceable> ON <replaceable>table</replaceable> (<replaceable>column</replaceable> <optional>, ...</optional>); </synopsis> Currently, only B-tree indexes can be declared unique.
ru: Индексы также могут обеспечивать уникальность значения в столбце или уникальность сочетания значений в нескольких столбцах. <synopsis> CREATE UNIQUE INDEX <replaceable>имя</replaceable> ON <replaceable>таблица</replaceable> (<replaceable>столбец</replaceable> <optional>, ...</optional>); </synopsis> В настоящее время уникальными могут быть только индексы-B-деревья.

source: When an index is declared unique, multiple table rows with equal indexed values are not allowed. Null values are not considered equal. A multicolumn unique index will only reject cases where all indexed columns are equal in multiple rows.
ru: Если индекс создаётся как уникальный, в таблицу нельзя будет добавить несколько строк с одинаковыми значениями ключа индекса. При этом значения NULL считаются не равными друг другу. Составной уникальный индекс не принимает только те строки, в которых все индексируемые столбцы содержат одинаковые значения.
