Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/indices.po
Languages: ru

source: The operator classes <literal>text_pattern_ops</literal>, <literal>varchar_pattern_ops</literal>, and <literal>bpchar_pattern_ops</literal> support B-tree indexes on the types <type>text</type>, <type>varchar</type>, and <type>char</type> respectively. The difference from the default operator classes is that the values are compared strictly character by character rather than according to the locale-specific collation rules. This makes these operator classes suitable for use by queries involving pattern matching expressions (<literal>LIKE</literal> or POSIX regular expressions) when the database does not use the standard <quote>C</quote> locale. As an example, you might index a <type>varchar</type> column like this: <placeholder-1/> Note that you should also create an index with the default operator class if you want queries involving ordinary <literal>&lt;</literal>, <literal>&lt;=</literal>, <literal>&gt;</literal>, or <literal>&gt;=</literal> comparisons to use an index. Such queries cannot use the <literal><replaceable>xxx</replaceable>_pattern_ops</literal> operator classes. (Ordinary equality comparisons can use these operator classes, however.) It is possible to create multiple indexes on the same column with different operator classes. If you do use the C locale, you do not need the <literal><replaceable>xxx</replaceable>_pattern_ops</literal> operator classes, because an index with the default operator class is usable for pattern-matching queries in the C locale.
ru: Классы операторов <literal>text_pattern_ops</literal>, <literal>varchar_pattern_ops</literal> и <literal>bpchar_pattern_ops</literal> поддерживают индексы-B-деревья для типов <type>text</type>, <type>varchar</type> и <type>char</type>, соответственно. От стандартных классов операторов они отличаются тем, что сравнивают значения по символам, не применяя правила сортировки, определённые локалью. Благодаря этому они подходят для запросов с поиском по шаблону (с <literal>LIKE</literal> и регулярными выражениями POSIX), когда локаль базы данных не стандартная <quote>C</quote>. Например, вы можете проиндексировать столбец <type>varchar</type> так: <placeholder-1/> Заметьте, что при этом также следует создать индекс с классом операторов по умолчанию, если вы хотите ускорить запросы с обычными сравнениями <literal>&lt;</literal>, <literal>&lt;=</literal>, <literal>&gt;</literal> и <literal>&gt;=</literal> за счёт применения индексов. Классы операторов <literal><replaceable>xxx</replaceable>_pattern_ops</literal> не подходят для таких сравнений. (Однако для проверки равенств эти классы операторов вполне пригодны.) В подобных случаях для одного столбца можно создать несколько индексов с разными классами операторов. Если же вы используете локаль C, классы операторов <literal><replaceable>xxx</replaceable>_pattern_ops</literal> вам не нужны, так как для поиска по шаблону в локали C будет достаточно индексов с классом операторов по умолчанию.

source: There are also some built-in operator classes besides the default ones: <placeholder-1/>
ru: Помимо классов операторов по умолчанию есть ещё несколько встроенных: <placeholder-1/>

source: The following query shows all defined operator classes: <placeholder-1/>
ru: Следующий запрос выводит список всех существующих классов операторов: <placeholder-1/>

source: An operator class is actually just a subset of a larger structure called an <firstterm>operator family</firstterm>. In cases where several data types have similar behaviors, it is frequently useful to define cross-data-type operators and allow these to work with indexes. To do this, the operator classes for each of the types must be grouped into the same operator family. The cross-type operators are members of the family, but are not associated with any single class within the family.
ru: Класс операторов на самом деле является всего лишь подмножеством большой структуры, называемой <firstterm>семейством операторов</firstterm>. В случаях, когда несколько типов данных ведут себя одинаково, часто имеет смысл определить операторы так, чтобы они могли использоваться с индексами сразу нескольких типов. Сделать это можно, сгруппировав классы операторов для этих типов в одном семействе операторов. Такие многоцелевые операторы, являясь членами семейства, не будут связаны с каким-либо одним его классом.

source: This expanded version of the previous query shows the operator family each operator class belongs to: <placeholder-1/>
ru: Расширенная версия предыдущего запроса показывает семью операторов, к которой принадлежит каждый класс операторов: <placeholder-1/>

source: This query shows all defined operator families and all the operators included in each family: <placeholder-1/>
ru: Этот запрос выводит все существующие семейства операторов и все операторы, включённые в эти семейства: <placeholder-1/>

source: Indexes and Collations
ru: Индексы и правила сортировки

source: An index can support only one collation per index column. If multiple collations are of interest, multiple indexes may be needed.
ru: Один индекс может поддерживать только одно правило сортировки для индексируемого столбца. Поэтому при необходимости применять разные правила сортировки могут потребоваться несколько индексов.

source: SELECT * FROM test1c WHERE content &gt; <replaceable>constant</replaceable>;
ru: SELECT * FROM test1c WHERE content &gt; <replaceable>константа</replaceable>;

source: SELECT * FROM test1c WHERE content &gt; <replaceable>constant</replaceable> COLLATE "y";
ru: SELECT * FROM test1c WHERE content &gt; <replaceable>константа</replaceable> COLLATE "y";

source: Consider these statements: <placeholder-1/> The index automatically uses the collation of the underlying column. So a query of the form <placeholder-2/> could use the index, because the comparison will by default use the collation of the column. However, this index cannot accelerate queries that involve some other collation. So if queries of the form, say, <placeholder-3/> are also of interest, an additional index could be created that supports the <literal>"y"</literal> collation, like this: <placeholder-4/>
ru: Рассмотрим следующие операторы: <placeholder-1/> Этот индекс автоматически использует правило сортировки нижележащего столбца. И запрос вида <placeholder-2/> сможет использовать этот индекс, так как при сравнении по умолчанию будет действовать правило сортировки столбца. Однако этот индекс не поможет ускорить запросы с каким-либо другим правилом сортировки. Поэтому, если интерес представляют также и запросы вроде <placeholder-3/> для них можно создать дополнительный индекс, поддерживающий правило сортировки <literal>"y"</literal>, примерно так: <placeholder-4/>

source: Index-Only Scans
ru: Сканирование только индекса

source: <primary>index</primary> <secondary>index-only scans</secondary>
ru: <primary>индекс</primary> <secondary>сканирование только индекса</secondary>

source: <primary>index-only scan</primary>
ru: <primary>сканирование только индекса</primary>

source: All indexes in <productname>PostgreSQL</productname> are <firstterm>secondary</firstterm> indexes, meaning that each index is stored separately from the table's main data area (which is called the table's <firstterm>heap</firstterm> in <productname>PostgreSQL</productname> terminology). This means that in an ordinary index scan, each row retrieval requires fetching data from both the index and the heap. Furthermore, while the index entries that match a given indexable <literal>WHERE</literal> condition are usually close together in the index, the table rows they reference might be anywhere in the heap. The heap-access portion of an index scan thus involves a lot of random access into the heap, which can be slow, particularly on traditional rotating media. (As described in <xref linkend="indexes-bitmap-scans"/>, bitmap scans try to alleviate this cost by doing the heap accesses in sorted order, but that only goes so far.)
ru: Все индексы в <productname>PostgreSQL</productname> являются <firstterm>вторичными</firstterm>, что значит, что каждый индекс хранится вне области основных данных таблицы (которая в терминологии <productname>PostgreSQL</productname> называется <firstterm>кучей</firstterm> таблицы). Это значит, что при обычном сканировании индекса для извлечения каждой строки необходимо прочитать данные и из индекса, и из кучи. Более того, тогда как элементы индекса, соответствующие заданному условию <literal>WHERE</literal>, обычно находятся в индексе рядом, строки таблицы могут располагаться в куче произвольным образом. Таким образом, обращение к куче при поиске по индексу влечёт множество операций произвольного чтения кучи, которые могут обойтись недёшево, особенно на традиционных вращающихся носителях. (Как описано в <xref remap="6" linkend="indexes-bitmap-scans"/>, сканирование по битовой карте пытается снизить стоимость этих операций, упорядочивая доступ к куче, но не более того.)

source: The index type must support index-only scans. B-tree indexes always do. GiST and SP-GiST indexes support index-only scans for some operator classes but not others. Other index types have no support. The underlying requirement is that the index must physically store, or else be able to reconstruct, the original data value for each index entry. As a counterexample, GIN indexes cannot support index-only scans because each index entry typically holds only part of the original data value.
ru: Тип индекса должен поддерживать сканирование только индекса. Индексы-B-деревья поддерживают его всегда. Индексы GiST и SP-GiST могут поддерживать его с одними классами операторов и не поддерживать с другими. Другие индексы такое сканирование не поддерживают. Суть нижележащего требования в том, что индекс должен физически хранить или каким-то образом восстанавливать исходное значение данных для каждого элемента индекса. В качестве контрпримера, индексы GIN неспособны поддерживать сканирование только индекса, так как в элементах индекса обычно хранится только часть исходного значения данных.

source: The query must reference only columns stored in the index. For example, given an index on columns <literal>x</literal> and <literal>y</literal> of a table that also has a column <literal>z</literal>, these queries could use index-only scans: <placeholder-1/> but these queries could not: <placeholder-2/> (Expression indexes and partial indexes complicate this rule, as discussed below.)
ru: Запрос должен обращаться только к столбцам, сохранённым в индексе. Например, если в таблице построен индекс по столбцам <literal>x</literal> и <literal>y</literal>, и в ней есть также столбец <literal>z</literal>, такие запросы будут использовать сканирование только индекса: <placeholder-1/> А эти запросы не будут: <placeholder-2/> (Индексы по выражениям и частичные индексы усложняют это правило, как описано ниже.)

source: To solve this performance problem, <productname>PostgreSQL</productname> supports <firstterm>index-only scans</firstterm>, which can answer queries from an index alone without any heap access. The basic idea is to return values directly out of each index entry instead of consulting the associated heap entry. There are two fundamental restrictions on when this method can be used: <placeholder-1/>
ru: Чтобы решить эту проблему с производительностью, <productname>PostgreSQL</productname> поддерживает <firstterm>сканирование только индекса</firstterm>, при котором результат запроса может быть получен из самого индекса, без обращения к куче. Основная идея такого сканирования в том, чтобы выдавать значения непосредственно из элемента индекса, и не обращаться к соответствующей записи в куче. Для применения этого метода есть два фундаментальных ограничения: <placeholder-1/>

source: If these two fundamental requirements are met, then all the data values required by the query are available from the index, so an index-only scan is physically possible. But there is an additional requirement for any table scan in <productname>PostgreSQL</productname>: it must verify that each retrieved row be <quote>visible</quote> to the query's MVCC snapshot, as discussed in <xref linkend="mvcc"/>. Visibility information is not stored in index entries, only in heap entries; so at first glance it would seem that every row retrieval would require a heap access anyway. And this is indeed the case, if the table row has been modified recently. However, for seldom-changing data there is a way around this problem. <productname>PostgreSQL</productname> tracks, for each page in a table's heap, whether all rows stored in that page are old enough to be visible to all current and future transactions. This information is stored in a bit in the table's <firstterm>visibility map</firstterm>. An index-only scan, after finding a candidate index entry, checks the visibility map bit for the corresponding heap page. If it's set, the row is known visible and so the data can be returned with no further work. If it's not set, the heap entry must be visited to find out whether it's visible, so no performance advantage is gained over a standard index scan. Even in the successful case, this approach trades visibility map accesses for heap accesses; but since the visibility map is four orders of magnitude smaller than the heap it describes, far less physical I/O is needed to access it. In most situations the visibility map remains cached in memory all the time.
ru: Если два этих фундаментальных ограничения выполняются, то все данные, требуемые для выполнения запроса, содержатся в индексе, так что сканирование только по индексу физически возможно. Но в <productname>PostgreSQL</productname> существует и ещё одно требование для сканирования таблицы: необходимо убедиться, что все возвращаемые строки <quote>видны</quote> в снимке MVCC запроса, как описано в <xref remap="6" linkend="mvcc"/>. Информация о видимости хранится не в элементах индекса, а только в куче; поэтому на первый взгляд может показаться, что для получения данных каждой строки всё равно необходимо обращаться к куче. И это в самом деле так, если в таблице недавно произошли изменения. Однако для редко меняющихся данных есть возможность обойти эту проблему. <productname>PostgreSQL</productname> отслеживает для каждой страницы в куче таблицы, являются ли все строки в этой странице достаточно старыми, чтобы их видели все текущие и будущие транзакции. Это отражается в битах в <firstterm>карте видимости</firstterm> таблицы. Процедура сканирования только индекса, найдя потенциально подходящую запись в индексе, проверяет бит в карте видимости для соответствующей страницы в куче. Если он установлен, значит эта строка видна, и данные могут быть возвращены сразу. В противном случае придётся посетить запись строки в куче и проверить, видима ли она, так что никакого выигрыша по сравнению с обычным сканированием индекса не будет. И даже в благоприятном случае обращение к кучи не исключается совсем, а заменяется обращением к карте видимости; но так как карта видимости на четыре порядка меньше соответствующей ей области кучи, для работы с ней требуется много меньше операций физического ввода/вывода. В большинстве ситуаций карта видимости просто всё время находится в памяти.

source: In short, while an index-only scan is possible given the two fundamental requirements, it will be a win only if a significant fraction of the table's heap pages have their all-visible map bits set. But tables in which a large fraction of the rows are unchanging are common enough to make this type of scan very useful in practice.
ru: Таким образом, тогда как сканирование только по индексу возможно лишь при выполнении двух фундаментальных требований, оно даст выигрыш, только если для значительной части страниц в куче таблицы установлены биты полной видимости. Но таблицы, в которых меняется лишь небольшая часть строк, встречаются достаточно часто, чтобы этот тип сканирования был весьма полезен на практике.

source: To make effective use of the index-only scan feature, you might choose to create indexes in which only the leading columns are meant to match <literal>WHERE</literal> clauses, while the trailing columns hold <quote>payload</quote> data to be returned by a query. For example, if you commonly run queries like <placeholder-1/> the traditional approach to speeding up such queries would be to create an index on <literal>x</literal> only. However, an index on <literal>(x, y)</literal> would offer the possibility of implementing this query as an index-only scan. As previously discussed, such an index would be larger and hence more expensive than an index on <literal>x</literal> alone, so this is attractive only if the table is known to be mostly static. Note it's important that the index be declared on <literal>(x, y)</literal> not <literal>(y, x)</literal>, as for most index types (particularly B-trees) searches that do not constrain the leading index columns are not very efficient.
ru: Чтобы эффективно применять возможность сканирования только индекса, можно создать индексы, в которых только первые столбцы будут соответствовать предложениям <literal>WHERE</literal>, а остальные столбцы будут содержать полезные данные, возвращаемые запросом. Например, если вы часто выполняете запросы вида: <placeholder-1/> при традиционном подходе к ускорению таких запросов можно было бы создать индекс только по <literal>x</literal>. Однако индекс по <literal>(x, y)</literal> дал бы возможность выполнения этого запроса со сканированием только индекса. Как говорилось ранее, такой индекс был бы объёмнее и дороже в обслуживании, чем индекс только по <literal>x</literal>, так что этот вариант предпочтителен, только для таблиц в основном статических. Заметьте, что в объявлении индекса важно указать столбцы <literal>(x, y)</literal>, а не <literal>(y, x)</literal>, так как для большинства типов индексов (а именно, B-деревьев) поиск, при котором не ограничиваются значения ведущих столбцов индекса, не будет эффективным.

source: In principle, index-only scans can be used with expression indexes. For example, given an index on <literal>f(x)</literal> where <literal>x</literal> is a table column, it should be possible to execute <placeholder-1/> as an index-only scan; and this is very attractive if <literal>f()</literal> is an expensive-to-compute function. However, <productname>PostgreSQL</productname>'s planner is currently not very smart about such cases. It considers a query to be potentially executable by index-only scan only when all <emphasis>columns</emphasis> needed by the query are available from the index. In this example, <literal>x</literal> is not needed except in the context <literal>f(x)</literal>, but the planner does not notice that and concludes that an index-only scan is not possible. If an index-only scan seems sufficiently worthwhile, this can be worked around by declaring the index to be on <literal>(f(x), x)</literal>, where the second column is not expected to be used in practice but is just there to convince the planner that an index-only scan is possible. An additional caveat, if the goal is to avoid recalculating <literal>f(x)</literal>, is that the planner won't necessarily match uses of <literal>f(x)</literal> that aren't in indexable <literal>WHERE</literal> clauses to the index column. It will usually get this right in simple queries such as shown above, but not in queries that involve joins. These deficiencies may be remedied in future versions of <productname>PostgreSQL</productname>.
ru: В принципе сканирование только индекса может применяться и с индексами по выражениям. Например, при наличии индекса по <literal>f(x)</literal>, где <literal>x</literal> — столбец таблицы, должно быть возможно выполнить <placeholder-1/> как сканирование только индекса; и это очень заманчиво, если <literal>f()</literal> — сложная для вычисления функция. Однако планировщик <productname>PostgreSQL</productname> в настоящее время может вести себя не очень разумно. Он считает, что запрос может выполняться со сканированием только по индексу, только когда из индекса могут быть получены все <emphasis>столбцы</emphasis>, требующиеся для запроса. В этом примере <literal>x</literal> фигурирует только в контексте <literal>f(x)</literal>, но планировщик не замечает этого и решает, что сканирование только по индексу невозможно. Если сканирование только по индексу заслуживает того, эту проблему можно обойти, объявив индекс по <literal>(f(x), x)</literal>, где второй столбец может не использоваться на практике, но нужен для того, чтобы убедить планировщик, что сканирование только по индексу возможно. Если это делается ради того, чтобы избежать вычислений <literal>f(x)</literal>, надо также заметить, что планировщик не обязательно свяжет с использованием индекса упоминания <literal>f(x)</literal>, фигурирующие не в индексируемых предложениях <literal>WHERE</literal> со столбцом индекса. Обычно он это делает правильно в простых запросах, вроде показанного выше, но не в запросах с соединениями. Эти недостатки могут быть устранены в будущих версиях <productname>PostgreSQL</productname>.

source: Partial indexes also have interesting interactions with index-only scans. Consider the partial index shown in <xref linkend="indexes-partial-ex3"/>: <placeholder-1/> In principle, we could do an index-only scan on this index to satisfy a query like <placeholder-2/> But there's a problem: the <literal>WHERE</literal> clause refers to <literal>success</literal> which is not available as a result column of the index. Nonetheless, an index-only scan is possible because the plan does not need to recheck that part of the <literal>WHERE</literal> clause at run time: all entries found in the index necessarily have <literal>success = true</literal> so this need not be explicitly checked in the plan. <productname>PostgreSQL</productname> versions 9.6 and later will recognize such cases and allow index-only scans to be generated, but older versions will not.
ru: С использованием частичных индексов при сканировании только по индексу тоже связаны интересные особенности. Предположим, что у нас есть частичный индекс, показанный в <xref remap="6" linkend="indexes-partial-ex3"/>: <placeholder-1/> В принципе с ним мы можем произвести сканирование только по индексу при выполнении запроса <placeholder-2/> Но есть одна проблема: предложение <literal>WHERE</literal> обращается к столбцу <literal>success</literal>, который отсутствует в результирующих столбцах индекса. Тем не менее, сканирование только индекса возможно, так как плану не нужно перепроверять эту часть предложения <literal>WHERE</literal> во время выполнения: у всех записей, найденных в индексе, значение <literal>success = true</literal>, так что в плане его не нужно проверять явно. <productname>PostgreSQL</productname> версий 9.6 и новее распознает такую ситуацию и сможет произвести сканирование только по индексу, но старые версии неспособны на это.

source: Examining Index Usage
ru: Контроль использования индексов

source: <primary>index</primary> <secondary>examining usage</secondary>
ru: <primary>индексы</primary> <secondary>контроль использования</secondary>
