Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/indices.po
Languages: ru

source: Indexes
ru: Индексы

source: <primary>index</primary>
ru: <primary>индекс</primary>

source: Indexes are a common way to enhance database performance. An index allows the database server to find and retrieve specific rows much faster than it could do without an index. But indexes also add overhead to the database system as a whole, so they should be used sensibly.
ru: Индексы &mdash; это традиционное средство увеличения производительности БД. Используя индекс, сервер баз данных может находить и извлекать нужные строки гораздо быстрее, чем без него. Однако с индексами связана дополнительная нагрузка на СУБД в целом, поэтому применять их следует обдуманно.

source: Introduction
ru: Введение

source: SELECT content FROM test1 WHERE id = <replaceable>constant</replaceable>;
ru: SELECT content FROM test1 WHERE id = <replaceable>константа</replaceable>;

source: Suppose we have a table similar to this: <placeholder-1/> and the application issues many queries of the form: <placeholder-2/> With no advance preparation, the system would have to scan the entire <structname>test1</structname> table, row by row, to find all matching entries. If there are many rows in <structname>test1</structname> and only a few rows (perhaps zero or one) that would be returned by such a query, this is clearly an inefficient method. But if the system has been instructed to maintain an index on the <structfield>id</structfield> column, it can use a more efficient method for locating matching rows. For instance, it might only have to walk a few levels deep into a search tree.
ru: Предположим, что у нас есть такая таблица: <placeholder-1/> и приложение выполняет много подобных запросов: <placeholder-2/> Если система не будет заранее подготовлена, ей придётся сканировать всю таблицу <structname>test1</structname>, строку за строкой, чтобы найти все подходящие записи. Когда таблица <structname>test1</structname> содержит большое количество записей, а этот запрос должен вернуть всего несколько (возможно, одну или ноль), такое сканирование, очевидно, неэффективно. Но если создать в системе индекс по полю <structfield>id</structfield>, она сможет находить строки гораздо быстрее. Возможно, для этого ей понадобится опуститься всего на несколько уровней в дереве поиска.

source: A similar approach is used in most non-fiction books: terms and concepts that are frequently looked up by readers are collected in an alphabetic index at the end of the book. The interested reader can scan the index relatively quickly and flip to the appropriate page(s), rather than having to read the entire book to find the material of interest. Just as it is the task of the author to anticipate the items that readers are likely to look up, it is the task of the database programmer to foresee which indexes will be useful.
ru: Подобный подход часто используется в технической литературе: термины и понятия, которые могут представлять интерес, собираются в алфавитном указателе в конце книги. Читатель может просмотреть этот указатель довольно быстро и затем перейти сразу к соответствующей странице, вместо того, чтобы пролистывать всю книгу в поисках нужного материала. Так же, как задача автора предугадать, что именно будут искать в книге читатели, задача программиста баз данных &mdash; заранее определить, какие индексы будут полезны.

source: The following command can be used to create an index on the <structfield>id</structfield> column, as discussed: <placeholder-1/> The name <structname>test1_id_index</structname> can be chosen freely, but you should pick something that enables you to remember later what the index was for.
ru: Создать индекс для столбца <structfield>id</structfield> рассмотренной ранее таблицы можно с помощью следующей команды: <placeholder-1/> Имя индекса <structname>test1_id_index</structname> может быть произвольным, главное, чтобы оно позволяло понять, для чего этот индекс.

source: To remove an index, use the <command>DROP INDEX</command> command. Indexes can be added to and removed from tables at any time.
ru: Для удаления индекса используется команда <command>DROP INDEX</command>. Добавлять и удалять индексы можно в любое время.

source: Once an index is created, no further intervention is required: the system will update the index when the table is modified, and it will use the index in queries when it thinks doing so would be more efficient than a sequential table scan. But you might have to run the <command>ANALYZE</command> command regularly to update statistics to allow the query planner to make educated decisions. See <xref linkend="performance-tips"/> for information about how to find out whether an index is used and when and why the planner might choose <emphasis>not</emphasis> to use an index.
ru: Когда индекс создан, никакие дополнительные действия не требуются: система сама будет обновлять его при изменении данных в таблице и сама будет использовать его в запросах, где, по её мнению, это будет эффективнее, чем сканирование всей таблицы. Вам, возможно, придётся только периодически запускать команду <command>ANALYZE</command> для обновления статистических данных, на основе которых планировщик запросов принимает решения. В <xref remap="6" linkend="performance-tips"/> вы можете узнать, как определить, используется ли определённый индекс и при каких условиях планировщик может решить <emphasis>не</emphasis> использовать его.

source: Indexes can also benefit <command>UPDATE</command> and <command>DELETE</command> commands with search conditions. Indexes can moreover be used in join searches. Thus, an index defined on a column that is part of a join condition can also significantly speed up queries with joins.
ru: Индексы могут быть полезны также при выполнении команд <command>UPDATE</command> и <command>DELETE</command> с условиями поиска. Кроме того, они могут применяться в поиске с соединением. То есть, индекс, определённый для столбца, участвующего в условии соединения, может значительно ускорить запросы с JOIN.

source: Creating an index on a large table can take a long time. By default, <productname>PostgreSQL</productname> allows reads (<command>SELECT</command> statements) to occur on the table in parallel with index creation, but writes (<command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>) are blocked until the index build is finished. In production environments this is often unacceptable. It is possible to allow writes to occur in parallel with index creation, but there are several caveats to be aware of &mdash; for more information see <xref linkend="sql-createindex-concurrently" endterm="sql-createindex-concurrently-title"/>.
ru: Создание индекса для большой таблицы может занимать много времени. По умолчанию <productname>PostgreSQL</productname> позволяет параллельно с созданием индекса выполнять чтение (операторы <command>SELECT</command>) таблицы, но операции записи (<command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>) блокируются до окончания построения индекса. Для производственной среды это ограничение часто бывает неприемлемым. Хотя есть возможность разрешить запись параллельно с созданием индексов, при этом нужно учитывать ряд оговорок &mdash; они описаны в подразделе <xref linkend="sql-createindex-concurrently" endterm="sql-createindex-concurrently-title"/>.

source: After an index is created, the system has to keep it synchronized with the table. This adds overhead to data manipulation operations. Therefore indexes that are seldom or never used in queries should be removed.
ru: После создания индекса система должна поддерживать его в состоянии, соответствующем данным таблицы. С этим связаны неизбежные накладные расходы при изменении данных. Таким образом, индексы, которые используются в запросах редко или вообще никогда, должны быть удалены.

source: Index Types
ru: Типы индексов

source: <productname>PostgreSQL</productname> provides several index types: B-tree, Hash, GiST, SP-GiST, GIN and BRIN. Each index type uses a different algorithm that is best suited to different types of queries. By default, the <command>CREATE INDEX</command> command creates B-tree indexes, which fit the most common situations.
ru: <productname>PostgreSQL</productname> поддерживает несколько типов индексов: B-дерево, хеш, GiST, SP-GiST, GIN и BRIN. Для разных типов индексов применяются разные алгоритмы, ориентированные на определённые типы запросов. По умолчанию команда <command>CREATE INDEX</command> создаёт индексы типа B-дерево, эффективные в большинстве случаев.

source: <primary>index</primary> <secondary>B-tree</secondary>
ru: <primary>индекс</primary> <secondary>B-дерево</secondary>

source: <primary>B-tree</primary> <see>index</see>
ru: <primary>B-дерево</primary> <see>индекс</see>

source: <placeholder-1/> <placeholder-2/> B-trees can handle equality and range queries on data that can be sorted into some ordering. In particular, the <productname>PostgreSQL</productname> query planner will consider using a B-tree index whenever an indexed column is involved in a comparison using one of these operators: <placeholder-3/> Constructs equivalent to combinations of these operators, such as <literal>BETWEEN</literal> and <literal>IN</literal>, can also be implemented with a B-tree index search. Also, an <literal>IS NULL</literal> or <literal>IS NOT NULL</literal> condition on an index column can be used with a B-tree index.
ru: <placeholder-1/> <placeholder-2/> B-деревья могут работать в условиях на равенство и в проверках диапазонов с данными, которые можно отсортировать в некотором порядке. Точнее, планировщик запросов <productname>PostgreSQL</productname> может задействовать индекс-B-дерево, когда индексируемый столбец участвует в сравнении с одним из следующих операторов: <placeholder-3/> При обработке конструкций, представимых как сочетание этих операторов, например <literal>BETWEEN</literal> и <literal>IN</literal>, так же может выполняться поиск по индексу-B-дереву. Кроме того, такие индексы могут использоваться и в условиях <literal>IS NULL</literal> и <literal>IS NOT NULL</literal> по индексированным столбцам.

source: The optimizer can also use a B-tree index for queries involving the pattern matching operators <literal>LIKE</literal> and <literal>~</literal> <emphasis>if</emphasis> the pattern is a constant and is anchored to the beginning of the string &mdash; for example, <literal>col LIKE 'foo%'</literal> or <literal>col ~ '^foo'</literal>, but not <literal>col LIKE '%bar'</literal>. However, if your database does not use the C locale you will need to create the index with a special operator class to support indexing of pattern-matching queries; see <xref linkend="indexes-opclass"/> below. It is also possible to use B-tree indexes for <literal>ILIKE</literal> and <literal>~*</literal>, but only if the pattern starts with non-alphabetic characters, i.e., characters that are not affected by upper/lower case conversion.
ru: Также оптимизатор может использовать эти индексы в запросах с операторами сравнения по шаблону <literal>LIKE</literal> и <literal>~</literal>, <emphasis>если</emphasis> этот шаблон определяется константой и он привязан к началу строки &mdash; например, <literal>col LIKE 'foo%'</literal> или <literal>col ~ '^foo'</literal>, но не <literal>col LIKE '%bar'</literal>. Но если ваша база данных использует не локаль C, для поддержки индексирования запросов с шаблонами вам потребуется создать индекс со специальным классом операторов; см. <xref remap="4" linkend="indexes-opclass"/>. Индексы-B-деревья можно использовать и для <literal>ILIKE</literal> и <literal>~*</literal>, но только если шаблон начинается не с алфавитных символов, то есть символов, не подверженных преобразованию регистра.

source: B-tree indexes can also be used to retrieve data in sorted order. This is not always faster than a simple scan and sort, but it is often helpful.
ru: B-деревья могут также применяться для получения данных, отсортированных по порядку. Это не всегда быстрее простого сканирования и сортировки, но иногда бывает полезно.

source: <primary>index</primary> <secondary>hash</secondary>
ru: <primary>индекс</primary> <secondary>по хешу</secondary>

source: <primary>hash</primary> <see>index</see>
ru: <primary>хеш</primary> <see>индекс</see>

source: <placeholder-1/> <placeholder-2/> Hash indexes can only handle simple equality comparisons. The query planner will consider using a hash index whenever an indexed column is involved in a comparison using the <literal>=</literal> operator. The following command is used to create a hash index: <synopsis> CREATE INDEX <replaceable>name</replaceable> ON <replaceable>table</replaceable> USING HASH (<replaceable>column</replaceable>); </synopsis>
ru: <placeholder-1/> <placeholder-2/> Хеш-индексы работают только с простыми условиями равенства. Планировщик запросов может применить хеш-индекс, только если индексируемый столбец участвует в сравнении с оператором <literal>=</literal>. Создать такой индекс можно следующей командой: <synopsis> CREATE INDEX <replaceable>имя</replaceable> ON <replaceable>таблица</replaceable> USING HASH (<replaceable>столбец</replaceable>); </synopsis>

source: <primary>index</primary> <secondary>GiST</secondary>
ru: <primary>индекс</primary> <secondary>GiST</secondary>

source: <primary>GiST</primary> <see>index</see>
ru: <primary>GiST</primary> <see>индекс</see>

source: <placeholder-1/> <placeholder-2/> GiST indexes are not a single kind of index, but rather an infrastructure within which many different indexing strategies can be implemented. Accordingly, the particular operators with which a GiST index can be used vary depending on the indexing strategy (the <firstterm>operator class</firstterm>). As an example, the standard distribution of <productname>PostgreSQL</productname> includes GiST operator classes for several two-dimensional geometric data types, which support indexed queries using these operators: <placeholder-3/> (See <xref linkend="functions-geometry"/> for the meaning of these operators.) The GiST operator classes included in the standard distribution are documented in <xref linkend="gist-builtin-opclasses-table"/>. Many other GiST operator classes are available in the <literal>contrib</literal> collection or as separate projects. For more information see <xref linkend="gist"/>.
ru: <placeholder-1/> <placeholder-2/> GiST-индексы представляют собой не просто разновидность индексов, а инфраструктуру, позволяющую реализовать много разных стратегий индексирования. Как следствие, GiST-индексы могут применяться с разными операторами, в зависимости от стратегии индексирования (<firstterm>класса операторов</firstterm>). Например, стандартный дистрибутив <productname>PostgreSQL</productname> включает классы операторов GiST для нескольких двумерных типов геометрических данных, что позволяет применять индексы в запросах с операторами: <placeholder-3/> (Эти операторы описаны в <xref remap="6" linkend="functions-geometry"/>.) Классы операторов GiST, включённые в стандартный дистрибутив, описаны в <xref remap="6" linkend="gist-builtin-opclasses-table"/>. В коллекции <literal>contrib</literal> можно найти и другие классы операторов GiST, реализованные как отдельные проекты. За дополнительными сведениями обратитесь к <xref remap="3" linkend="gist"/>.

source: GiST indexes are also capable of optimizing <quote>nearest-neighbor</quote> searches, such as <placeholder-1/> which finds the ten places closest to a given target point. The ability to do this is again dependent on the particular operator class being used. In <xref linkend="gist-builtin-opclasses-table"/>, operators that can be used in this way are listed in the column <quote>Ordering Operators</quote>.
ru: GiST-индексы также могут оптимизировать поиск <quote>ближайшего соседа</quote>, например такой: <placeholder-1/> который возвращает десять расположений, ближайших к заданной точке. Возможность такого применения индекса опять же зависит от класса используемого оператора. Операторы, которые можно использовать таким образом, перечислены в <xref remap="6" linkend="gist-builtin-opclasses-table"/>, в столбце <quote>Операторы сортировки</quote>.

source: <primary>index</primary> <secondary>SP-GiST</secondary>
ru: <primary>индекс</primary> <secondary>SP-GiST</secondary>

source: <primary>SP-GiST</primary> <see>index</see>
ru: <primary>SP-GiST</primary> <see>индекс</see>

source: <placeholder-1/> <placeholder-2/> SP-GiST indexes, like GiST indexes, offer an infrastructure that supports various kinds of searches. SP-GiST permits implementation of a wide range of different non-balanced disk-based data structures, such as quadtrees, k-d trees, and radix trees (tries). As an example, the standard distribution of <productname>PostgreSQL</productname> includes SP-GiST operator classes for two-dimensional points, which support indexed queries using these operators: <placeholder-3/> (See <xref linkend="functions-geometry"/> for the meaning of these operators.) The SP-GiST operator classes included in the standard distribution are documented in <xref linkend="spgist-builtin-opclasses-table"/>. For more information see <xref linkend="spgist"/>.
ru: <placeholder-1/> <placeholder-2/> Индексы SP-GiST, как и GiST, предоставляют инфраструктуру, поддерживающие различные типы поиска. SP-GiST позволяет организовывать на диске самые разные несбалансированные структуры данных, такие как деревья квадрантов, k-мерные и префиксные деревья. Например, стандартный дистрибутив <productname>PostgreSQL</productname> включает классы операторов SP-GiST для точек в двумерном пространстве, что позволяет применять индексы в запросах с операторами: <placeholder-3/> (Эти операторы описаны в <xref remap="6" linkend="functions-geometry"/>.) Классы операторов SP-GiST, включённые в стандартный дистрибутив, описаны в <xref remap="6" linkend="spgist-builtin-opclasses-table"/>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="spgist"/>.

source: <primary>index</primary> <secondary>GIN</secondary>
ru: <primary>индекс</primary> <secondary>GIN</secondary>

source: <primary>GIN</primary> <see>index</see>
ru: <primary>GIN</primary> <see>индекс</see>

source: <placeholder-1/> <placeholder-2/> GIN indexes are <quote>inverted indexes</quote> which are appropriate for data values that contain multiple component values, such as arrays. An inverted index contains a separate entry for each component value, and can efficiently handle queries that test for the presence of specific component values.
ru: <placeholder-1/> <placeholder-2/> GIN-индексы представляют собой <quote>инвертированные индексы</quote>, в которых могут содержаться значения с несколькими ключами, например массивы. Инвертированный индекс содержит отдельный элемент для значения каждого компонента, и может эффективно работать в запросах, проверяющих присутствие определённых значений компонентов.

source: Like GiST and SP-GiST, GIN can support many different user-defined indexing strategies, and the particular operators with which a GIN index can be used vary depending on the indexing strategy. As an example, the standard distribution of <productname>PostgreSQL</productname> includes a GIN operator class for arrays, which supports indexed queries using these operators: <placeholder-1/> (See <xref linkend="functions-array"/> for the meaning of these operators.) The GIN operator classes included in the standard distribution are documented in <xref linkend="gin-builtin-opclasses-table"/>. Many other GIN operator classes are available in the <literal>contrib</literal> collection or as separate projects. For more information see <xref linkend="gin"/>.
ru: Подобно GiST и SP-GiST, индексы GIN могут поддерживать различные определённые пользователем стратегии и в зависимости от них могут применяться с разными операторами. Например, стандартный дистрибутив <productname>PostgreSQL</productname> включает класс операторов GIN для массивов, что позволяет применять индексы в запросах с операторами: <placeholder-1/> (Эти операторы описаны в <xref remap="6" linkend="functions-array"/>.) Классы операторов GIN, включённые в стандартный дистрибутив, описаны в <xref remap="6" linkend="gin-builtin-opclasses-table"/>. В коллекции <literal>contrib</literal> и в отдельных проектах можно найти и много других классов операторов GIN. За дополнительными сведениями обратитесь к <xref remap="3" linkend="gin"/>.

source: <primary>index</primary> <secondary>BRIN</secondary>
ru: <primary>индекс</primary> <secondary>BRIN</secondary>

source: <primary>BRIN</primary> <see>index</see>
ru: <primary>BRIN</primary> <see>индекс</see>

source: <placeholder-1/> <placeholder-2/> BRIN indexes (a shorthand for Block Range INdexes) store summaries about the values stored in consecutive physical block ranges of a table. Like GiST, SP-GiST and GIN, BRIN can support many different indexing strategies, and the particular operators with which a BRIN index can be used vary depending on the indexing strategy. For data types that have a linear sort order, the indexed data corresponds to the minimum and maximum values of the values in the column for each block range. This supports indexed queries using these operators: <placeholder-3/> The BRIN operator classes included in the standard distribution are documented in <xref linkend="brin-builtin-opclasses-table"/>. For more information see <xref linkend="brin"/>.
ru: <placeholder-1/> <placeholder-2/> BRIN-индексы (сокращение от Block Range INdexes, Индексы зон блоков) хранят обобщённые сведения о значениях, находящихся в физически последовательно расположенных блоках таблицы. Подобно GiST, SP-GiST и GIN, индексы BRIN могут поддерживать определённые пользователем стратегии, и в зависимости от них применяться с разными операторами. Для типов данных, имеющих линейный порядок сортировки, записям в индексе соответствуют минимальные и максимальные значения данных в столбце для каждой зоны блоков. Это позволяет поддерживать запросы со следующими операторами: <placeholder-3/> Классы операторов BRIN, включённые в стандартный дистрибутив, описаны в <xref remap="6" linkend="brin-builtin-opclasses-table"/>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="brin"/>.

source: Multicolumn Indexes
ru: Составные индексы

source: <primary>index</primary> <secondary>multicolumn</secondary>
ru: <primary>индекс</primary> <secondary>составной</secondary>

source: SELECT name FROM test2 WHERE major = <replaceable>constant</replaceable> AND minor = <replaceable>constant</replaceable>;
ru: SELECT name FROM test2 WHERE major = <replaceable>константа</replaceable> AND minor = <replaceable>константа</replaceable>;

source: An index can be defined on more than one column of a table. For example, if you have a table of this form: <placeholder-1/> (say, you keep your <filename class="directory">/dev</filename> directory in a database...) and you frequently issue queries like: <placeholder-2/> then it might be appropriate to define an index on the columns <structfield>major</structfield> and <structfield>minor</structfield> together, e.g.: <placeholder-3/>
ru: Индексы можно создавать и по нескольким столбцам таблицы. Например, если у вас есть таблица: <placeholder-1/> (предположим, что вы поместили в неё содержимое каталога <filename class="directory">/dev</filename>) и вы часто выполняете запросы вида: <placeholder-2/> тогда имеет смысл определить индекс, покрывающий оба столбца <structfield>major</structfield> и <structfield>minor</structfield>. Например: <placeholder-3/>
