Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/maintenance.po
Languages: ru

source: As with vacuuming for space recovery, frequent updates of statistics are more useful for heavily-updated tables than for seldom-updated ones. But even for a heavily-updated table, there might be no need for statistics updates if the statistical distribution of the data is not changing much. A simple rule of thumb is to think about how much the minimum and maximum values of the columns in the table change. For example, a <type>timestamp</type> column that contains the time of row update will have a constantly-increasing maximum value as rows are added and updated; such a column will probably need more frequent statistics updates than, say, a column containing URLs for pages accessed on a website. The URL column might receive changes just as often, but the statistical distribution of its values probably changes relatively slowly.
ru: Как и процедура очистки для высвобождения пространства, частое обновление статистики полезнее для интенсивно изменяемых таблиц, нежели для тех таблиц, которые изменяются редко. Однако даже в случае часто изменяемой таблицы обновление статистики может не требоваться, если статистическое распределение данных меняется слабо. Как правило, достаточно оценить, насколько меняются максимальное и минимальное значения в столбцах таблицы. Например, максимальное значение в столбце <type>timestamp</type>, хранящем время изменения строки, будет постоянно увеличиваться по мере добавления и изменения строк; для такого столбца может потребоваться более частое обновление статистики, чем, к примеру, для столбца, содержащего адреса страниц (URL), которые запрашивались с сайта. Столбец с URL-адресами может меняться столь же часто, однако статистическое распределение его значений, вероятно, будет изменяться относительно медленно.

source: It is possible to run <command>ANALYZE</command> on specific tables and even just specific columns of a table, so the flexibility exists to update some statistics more frequently than others if your application requires it. In practice, however, it is usually best to just analyze the entire database, because it is a fast operation. <command>ANALYZE</command> uses a statistically random sampling of the rows of a table rather than reading every single row.
ru: Команду <command>ANALYZE</command> можно выполнять для отдельных таблиц и даже просто для отдельных столбцов таблицы, поэтому, если того требует приложение, одни статистические данные можно обновлять чаще, чем другие. Однако на практике обычно лучше просто анализировать всю базу данных, поскольку это быстрая операция, так как <command>ANALYZE</command> читает не каждую отдельную строку, а статистически случайную выборку строк таблицы.

source: Although per-column tweaking of <command>ANALYZE</command> frequency might not be very productive, you might find it worthwhile to do per-column adjustment of the level of detail of the statistics collected by <command>ANALYZE</command>. Columns that are heavily used in <literal>WHERE</literal> clauses and have highly irregular data distributions might require a finer-grain data histogram than other columns. See <command>ALTER TABLE SET STATISTICS</command>, or change the database-wide default using the <xref linkend="guc-default-statistics-target"/> configuration parameter.
ru: Хотя индивидуальная настройка частоты <command>ANALYZE</command> для отдельных столбцов может быть не очень полезной, смысл может иметь настройка детализации статистики, собираемой командой <command>ANALYZE</command>. Для столбцов, которые часто используются в предложениях <literal>WHERE</literal>, и имеют очень неравномерное распределение данных, может потребоваться более детальная, по сравнению с другими столбцами, гистограмма данных. В таких случаях можно воспользоваться командой <command>ALTER TABLE SET STATISTICS</command> или изменить значение по умолчанию параметра уровня БД <xref linkend="guc-default-statistics-target"/>.

source: Also, by default there is limited information available about the selectivity of functions. However, if you create an expression index that uses a function call, useful statistics will be gathered about the function, which can greatly improve query plans that use the expression index.
ru: Кроме того, по умолчанию информация об избирательности функций ограничена. Однако если вы создаёте индекс по выражению с вызовом функции, об этой функции будет собрана полезная статистическая информация, которая может значительно улучшить планы запросов, в которых используется данный индекс.

source: The autovacuum daemon does not issue <command>ANALYZE</command> commands for foreign tables, since it has no means of determining how often that might be useful. If your queries require statistics on foreign tables for proper planning, it's a good idea to run manually-managed <command>ANALYZE</command> commands on those tables on a suitable schedule.
ru: Демон автоочистки не выполняет команды <command>ANALYZE</command> для сторонних таблиц, поскольку он не знает, как часто это следует делать. Если для получения качественных планов вашим запросам необходима статистика по сторонним таблицам, будет хорошей идеей дополнительно запускать <command>ANALYZE</command> для них по подходящему расписанию.

source: Updating The Visibility Map
ru: Обновление карты видимости

source: Vacuum maintains a <link linkend="storage-vm">visibility map</link> for each table to keep track of which pages contain only tuples that are known to be visible to all active transactions (and all future transactions, until the page is again modified). This has two purposes. First, vacuum itself can skip such pages on the next run, since there is nothing to clean up.
ru: Процедура очистки поддерживает <link linkend="storage-vm">карты видимости</link> для каждой таблицы, позволяющие определить, в каких страницах есть только записи, заведомо видимые для всех активных транзакций (и всех будущих транзакций, пока страница не будет изменена). Это имеет два применения. Во-первых, сам процесс очистки может пропускать такие страницы при следующем запуске, поскольку на этих страницах вычищать нечего.

source: Second, it allows <productname>PostgreSQL</productname> to answer some queries using only the index, without reference to the underlying table. Since <productname>PostgreSQL</productname> indexes don't contain tuple visibility information, a normal index scan fetches the heap tuple for each matching index entry, to check whether it should be seen by the current transaction. An <link linkend="indexes-index-only-scans"><firstterm>index-only scan</firstterm></link>, on the other hand, checks the visibility map first. If it's known that all tuples on the page are visible, the heap fetch can be skipped. This is most useful on large data sets where the visibility map can prevent disk accesses. The visibility map is vastly smaller than the heap, so it can easily be cached even when the heap is very large.
ru: Во-вторых, с такими картами <productname>PostgreSQL</productname> может выдавать результаты некоторых запросов, используя только индекс, не обращаясь к данным таблицы. Так как индексы <productname>PostgreSQL</productname> не содержат информацию о видимости записей, при обычном сканировании по индексу необходимо извлечь соответствующую запись из таблицы и проверить её видимость для текущей транзакции. Поэтому при <link linkend="indexes-index-only-scans"><firstterm>сканировании только индекса</firstterm></link>, наоборот, сначала проверяется карта видимости. Если известно, что все записи на странице видимы, то выборку из таблицы можно пропустить. Это наиболее полезно с большими наборах данных, когда благодаря карте видимости можно оптимизировать чтение с диска. Карта видимости значительно меньше таблицы, поэтому она легко помещается в кеш, даже когда объём самих страниц очень велик.

source: Preventing Transaction ID Wraparound Failures
ru: Предотвращение ошибок из-за зацикливания счётчика транзакций

source: <primary>transaction ID</primary> <secondary>wraparound</secondary>
ru: <primary>идентификатор транзакции</primary> <secondary>зацикливание</secondary>

source: <primary>wraparound</primary> <secondary>of transaction IDs</secondary>
ru: <primary>зацикливание</primary> <secondary>идентификаторов транзакций</secondary>

source: <productname>PostgreSQL</productname>'s <link linkend="mvcc-intro">MVCC</link> transaction semantics depend on being able to compare transaction ID (<acronym>XID</acronym>) numbers: a row version with an insertion XID greater than the current transaction's XID is <quote>in the future</quote> and should not be visible to the current transaction. But since transaction IDs have limited size (32 bits) a cluster that runs for a long time (more than 4 billion transactions) would suffer <firstterm>transaction ID wraparound</firstterm>: the XID counter wraps around to zero, and all of a sudden transactions that were in the past appear to be in the future &mdash; which means their output become invisible. In short, catastrophic data loss. (Actually the data is still there, but that's cold comfort if you cannot get at it.) To avoid this, it is necessary to vacuum every table in every database at least once every two billion transactions.
ru: В <productname>PostgreSQL</productname> семантика транзакций <link linkend="mvcc-intro">MVCC</link> зависит от возможности сравнения номеров идентификаторов транзакций (<acronym>XID</acronym>): версия строки, у которой XID добавившей её транзакции больше, чем XID текущей транзакции, относится <quote>к будущему</quote> и не должна быть видна в текущей транзакции. Однако поскольку идентификаторы транзакций имеют ограниченный размер (32 бита), кластер, работающий долгое время (более 4 миллиардов транзакций) столкнётся с <firstterm>зацикливанием идентификаторов транзакций</firstterm>: счётчик XID прокрутится до нуля, и внезапно транзакции, которые относились к прошлому, окажутся в будущем &mdash; это означает, что их результаты станут невидимыми. Одним словом, это катастрофическая потеря данных. (На самом деле данные никуда не пропадают, однако если вы не можете их получить, то это слабое утешение.) Для того чтобы этого избежать, необходимо выполнять очистку для каждой таблицы в каждой базе данных как минимум единожды на два миллиардов транзакций.

source: The reason that periodic vacuuming solves the problem is that <command>VACUUM</command> will mark rows as <emphasis>frozen</emphasis>, indicating that they were inserted by a transaction that committed sufficiently far in the past that the effects of the inserting transaction are certain to be visible to all current and future transactions. Normal XIDs are compared using modulo-2<superscript>32</superscript> arithmetic. This means that for every normal XID, there are two billion XIDs that are <quote>older</quote> and two billion that are <quote>newer</quote>; another way to say it is that the normal XID space is circular with no endpoint. Therefore, once a row version has been created with a particular normal XID, the row version will appear to be <quote>in the past</quote> for the next two billion transactions, no matter which normal XID we are talking about. If the row version still exists after more than two billion transactions, it will suddenly appear to be in the future. To prevent this, <productname>PostgreSQL</productname> reserves a special XID, <literal>FrozenTransactionId</literal>, which does not follow the normal XID comparison rules and is always considered older than every normal XID. Frozen row versions are treated as if the inserting XID were <literal>FrozenTransactionId</literal>, so that they will appear to be <quote>in the past</quote> to all normal transactions regardless of wraparound issues, and so such row versions will be valid until deleted, no matter how long that is.
ru: Периодическое выполнение очистки решает эту проблему, потому что процедура <command>VACUUM</command> помечает строки как <emphasis>замороженные</emphasis>, указывая, что они были вставлены транзакцией, зафиксированной достаточно давно, так что эффект добавляющей транзакции с точки зрения MVCC определённо будет виден во всех текущих и будущих транзакциях. Обычные значения XID сравниваются по модулю 2<superscript>32</superscript>. Это означает, что для каждого обычного XID существуют два миллиарда значений XID, которые <quote>старше</quote> него, и два миллиарда значений, которые <quote>младше</quote> него; другими словами, пространство значений XID циклично и не имеет конечной точки. Следовательно, как только создаётся версия строки с обычным XID, для следующих двух миллиардов транзакций эта версия строки оказывается <quote>в прошлом</quote>, неважно о каком значении обычного XID идет речь. Если после двух миллиардов транзакций эта версия строки всё ещё существует, она внезапно окажется в будущем. Для того чтобы это предотвратить, в какой-то момент значение XID для старых версий строк должно быть заменено на <literal>FrozenTransactionId</literal> (заморожено) до того, как будет достигнута граница в два миллиарда транзакций. После получения этого особенного XID для всех обычных транзакций эти версии строк будут относиться <quote>к прошлому</quote>, независимо от зацикливания, и, таким образом, эти версии строк будут действительны до момента их удаления, когда бы это ни произошло.

source: In <productname>PostgreSQL</productname> versions before 9.4, freezing was implemented by actually replacing a row's insertion XID with <literal>FrozenTransactionId</literal>, which was visible in the row's <structname>xmin</structname> system column. Newer versions just set a flag bit, preserving the row's original <structname>xmin</structname> for possible forensic use. However, rows with <structname>xmin</structname> equal to <literal>FrozenTransactionId</literal> (2) may still be found in databases <application>pg_upgrade</application>'d from pre-9.4 versions.
ru: В версиях <productname>PostgreSQL</productname> до 9.4 замораживание было реализовано как замена XID добавления строки специальным идентификатором <literal>FrozenTransactionId</literal>, который можно было увидеть в системной колонке <structname>xmin</structname> данной строки. В новых версиях просто устанавливается битовый флаг, а исходный <structname>xmin</structname> строки сохраняется для возможного расследования в будущем. Однако строки с <structname>xmin</structname>, равным <literal>FrozenTransactionId</literal> (2), можно по-прежнему встретить в базах данных, обновлённых (с применением <application>pg_upgrade</application>) с версий до 9.4.

source: Also, system catalogs may contain rows with <structname>xmin</structname> equal to <literal>BootstrapTransactionId</literal> (1), indicating that they were inserted during the first phase of <application>initdb</application>. Like <literal>FrozenTransactionId</literal>, this special XID is treated as older than every normal XID.
ru: Также системные каталоги могут содержать строки со значением <structname>xmin</structname>, равным <literal>BootstrapTransactionId</literal> (1), показывающим, что они были вставлены на первом этапе <application>initdb</application>. Как и <literal>FrozenTransactionId</literal>, этот специальный XID считается более старым, чем любой обычный XID.

source: <xref linkend="guc-vacuum-freeze-min-age"/> controls how old an XID value has to be before rows bearing that XID will be frozen. Increasing this setting may avoid unnecessary work if the rows that would otherwise be frozen will soon be modified again, but decreasing this setting increases the number of transactions that can elapse before the table must be vacuumed again.
ru: Параметр <xref linkend="guc-vacuum-freeze-min-age"/> определяет, насколько старым должен стать XID, чтобы строки с таким XID были заморожены. Увеличение его значения помогает избежать ненужной работы, если строки, которые могли бы быть заморожены в ближайшее время, будут изменены ещё раз, а уменьшение приводит к увеличению количества транзакций, которые могут выполниться, прежде чем потребуется очередная очистка таблицы.

source: <command>VACUUM</command> uses the <link linkend="storage-vm">visibility map</link> to determine which pages of a table must be scanned. Normally, it will skip pages that don't have any dead row versions even if those pages might still have row versions with old XID values. Therefore, normal <command>VACUUM</command>s won't always freeze every old row version in the table. Periodically, <command>VACUUM</command> will perform an <firstterm>aggressive vacuum</firstterm>, skipping only those pages which contain neither dead rows nor any unfrozen XID or MXID values. <xref linkend="guc-vacuum-freeze-table-age"/> controls when <command>VACUUM</command> does that: all-visible but not all-frozen pages are scanned if the number of transactions that have passed since the last such scan is greater than <varname>vacuum_freeze_table_age</varname> minus <varname>vacuum_freeze_min_age</varname>. Setting <varname>vacuum_freeze_table_age</varname> to 0 forces <command>VACUUM</command> to use this more aggressive strategy for all scans.
ru: <command>VACUUM</command> определяет, какие страницы таблицы нужно сканировать, анализируя <link linkend="storage-vm">карту видимости</link>. Обычно при этой операции пропускаются страницы, в которых нет мёртвых версий строк, даже если в них могут быть версии строк со старыми XID. Таким образом, обычная команда <command>VACUUM</command> не будет всегда замораживать все версии строк, имеющиеся в таблице. Периодически <command>VACUUM</command> будет также производить <firstterm>агрессивную очистку</firstterm>, пропуская только те страницы, которые не содержат ни мёртвых строк, ни незамороженных значений XID или MXID. Когда <command>VACUUM</command> будет делать это, зависит от параметра <xref linkend="guc-vacuum-freeze-table-age"/>: полностью видимые, но не полностью замороженные страницы будут сканироваться, если число транзакций, прошедших со времени последнего такого сканирования, оказывается больше чем <varname>vacuum_freeze_table_age</varname> минус <varname>vacuum_freeze_min_age</varname>. Если <varname>vacuum_freeze_table_age</varname> равно 0, <command>VACUUM</command> будет применять эту более агрессивную стратегию при каждом сканировании.

source: The maximum time that a table can go unvacuumed is two billion transactions minus the <varname>vacuum_freeze_min_age</varname> value at the time of the last aggressive vacuum. If it were to go unvacuumed for longer than that, data loss could result. To ensure that this does not happen, autovacuum is invoked on any table that might contain unfrozen rows with XIDs older than the age specified by the configuration parameter <xref linkend="guc-autovacuum-freeze-max-age"/>. (This will happen even if autovacuum is disabled.)
ru: Максимальное время, в течение которого таблица может обходиться без очистки, составляет два миллиарда транзакций минус значение <varname>vacuum_freeze_min_age</varname> с момента последней агрессивной очистки. Если бы таблица не подвергалась очистке дольше, была бы возможна потеря данных. Чтобы гарантировать, что это не произойдёт, для любой таблицы, которая может содержать значения XID старше, чем возраст, указанный в конфигурационном параметре <xref linkend="guc-autovacuum-freeze-max-age"/>, вызывается автоочистка. (Это случится, даже если автоочистка отключена.)

source: This implies that if a table is not otherwise vacuumed, autovacuum will be invoked on it approximately once every <varname>autovacuum_freeze_max_age</varname> minus <varname>vacuum_freeze_min_age</varname> transactions. For tables that are regularly vacuumed for space reclamation purposes, this is of little importance. However, for static tables (including tables that receive inserts, but no updates or deletes), there is no need to vacuum for space reclamation, so it can be useful to try to maximize the interval between forced autovacuums on very large static tables. Obviously one can do this either by increasing <varname>autovacuum_freeze_max_age</varname> or decreasing <varname>vacuum_freeze_min_age</varname>.
ru: Это означает, что если очистка таблицы не вызывается другим способом, то автоочистка для неё будет вызываться приблизительно через каждые <varname>autovacuum_freeze_max_age</varname> минус <varname>vacuum_freeze_min_age</varname> транзакций. Для таблиц, очищаемых регулярно для высвобождения пространства, это неактуально. В то же время статичные таблицы (включая таблицы, в которых данные вставляются, но не изменяются и не удаляются) не нуждаются в очистке для высвобождения пространства, поэтому для очень больших статичных таблиц имеет смысл увеличить интервал между вынужденными запусками автоочистки. Очевидно, это можно сделать, либо увеличив <varname>autovacuum_freeze_max_age</varname>, либо уменьшив <varname>vacuum_freeze_min_age</varname>.

source: The effective maximum for <varname>vacuum_freeze_table_age</varname> is 0.95 * <varname>autovacuum_freeze_max_age</varname>; a setting higher than that will be capped to the maximum. A value higher than <varname>autovacuum_freeze_max_age</varname> wouldn't make sense because an anti-wraparound autovacuum would be triggered at that point anyway, and the 0.95 multiplier leaves some breathing room to run a manual <command>VACUUM</command> before that happens. As a rule of thumb, <command>vacuum_freeze_table_age</command> should be set to a value somewhat below <varname>autovacuum_freeze_max_age</varname>, leaving enough gap so that a regularly scheduled <command>VACUUM</command> or an autovacuum triggered by normal delete and update activity is run in that window. Setting it too close could lead to anti-wraparound autovacuums, even though the table was recently vacuumed to reclaim space, whereas lower values lead to more frequent aggressive vacuuming.
ru: Фактический максимум для <varname>vacuum_freeze_table_age</varname> составляет 0.95 * <varname>autovacuum_freeze_max_age</varname>; большее значение будет ограничено этим пределом. Значение, превышающее <varname>autovacuum_freeze_max_age</varname>, не имело бы смысла, поскольку по достижении этого значения в любом случае вызывалась бы автоочистка для предотвращения зацикливания, а коэффициент 0.95 оставляет немного времени для того, чтобы запустить команду <command>VACUUM</command> вручную до того, как это произойдёт. Как правило, установленное значение <command>vacuum_freeze_table_age</command> должно быть несколько меньше <varname>autovacuum_freeze_max_age</varname>, чтобы оставленный промежуток был достаточен для выполнения в этом окне <command>VACUUM</command> по расписанию или автоочистки, управляемой обычной активностью операций удаления и изменения. Если это значение будет слишком близким к максимуму, автоочистка для предотвращения зацикливания будет выполняться, даже если таблица только что была очищена для высвобождения пространства, в то же время при небольшом значении будет чаще производиться агрессивная очистка.
