Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/maintenance.po
Languages: ru

source: If several large tables all become eligible for vacuuming in a short amount of time, all autovacuum workers might become occupied with vacuuming those tables for a long period. This would result in other tables and databases not being vacuumed until a worker becomes available. There is no limit on how many workers might be in a single database, but workers do try to avoid repeating work that has already been done by other workers. Note that the number of running workers does not count towards <xref linkend="guc-max-connections"/> or <xref linkend="guc-superuser-reserved-connections"/> limits.
ru: Если в течение короткого промежутка времени потребность в очистке возникает для нескольких больших таблиц, все рабочие процессы автоочистки могут продолжительное время заниматься очисткой только этих таблиц. В результате другие таблицы и базы данных будут ожидать очистки, пока не появится свободный рабочий процесс. Число рабочих процессов для одной базы не ограничивается, при этом каждый процесс старается не повторять работу, только что выполненную другими. Заметьте, что в ограничениях <xref linkend="guc-max-connections"/> или <xref linkend="guc-superuser-reserved-connections"/> число выполняющихся рабочих процессов не учитывается.

source: vacuum threshold = vacuum base threshold + vacuum scale factor * number of tuples
ru: порог очистки = базовый порог очистки + коэффициент доли для очистки * количество кортежей

source: Tables whose <structfield>relfrozenxid</structfield> value is more than <xref linkend="guc-autovacuum-freeze-max-age"/> transactions old are always vacuumed (this also applies to those tables whose freeze max age has been modified via storage parameters; see below). Otherwise, if the number of tuples obsoleted since the last <command>VACUUM</command> exceeds the <quote>vacuum threshold</quote>, the table is vacuumed. The vacuum threshold is defined as: <placeholder-1/> where the vacuum base threshold is <xref linkend="guc-autovacuum-vacuum-threshold"/>, the vacuum scale factor is <xref linkend="guc-autovacuum-vacuum-scale-factor"/>, and the number of tuples is <structname>pg_class</structname>.<structfield>reltuples</structfield>. The number of obsolete tuples is obtained from the statistics collector; it is a semi-accurate count updated by each <command>UPDATE</command> and <command>DELETE</command> operation. (It is only semi-accurate because some information might be lost under heavy load.) If the <structfield>relfrozenxid</structfield> value of the table is more than <varname>vacuum_freeze_table_age</varname> transactions old, an aggressive vacuum is performed to freeze old tuples and advance <structfield>relfrozenxid</structfield>; otherwise, only pages that have been modified since the last vacuum are scanned.
ru: Для таблиц с <structfield>relfrozenxid</structfield>, устаревшим более чем на <xref linkend="guc-autovacuum-freeze-max-age"/> транзакций, очистка выполняется всегда (это также применимо к таблицам, для которых максимальный порог заморозки был изменён через параметры хранения; см. ниже). В противном случае, очистка таблицы производится, если количество кортежей, устаревших с момента последнего выполнения <command>VACUUM</command>, превышает <quote>пороговое значение очистки</quote>. Пороговое значение очистки определяется как: <placeholder-1/> где базовый порог очистки — значение <xref linkend="guc-autovacuum-vacuum-threshold"/>, коэффициент доли — <xref linkend="guc-autovacuum-vacuum-scale-factor"/>, а количество кортежей — <structname>pg_class</structname>.<structfield>reltuples</structfield>. Количество устаревших кортежей получается от сборщика статистики; оно представляет собой приблизительное число, обновляемое после каждой операции <command>UPDATE</command> и <command>DELETE</command>. (Точность не гарантируется, потому что при большой нагрузке часть информации может быть утеряна.) Если значение <structfield>relfrozenxid</structfield> для таблицы старее <varname>vacuum_freeze_table_age</varname> транзакций, производится агрессивная очистка с целью заморозить старые версии строк и увеличить значение <structfield>relfrozenxid</structfield>; в противном случае сканируются только страницы, изменённые после последней очистки.

source: analyze threshold = analyze base threshold + analyze scale factor * number of tuples
ru: порог анализа = базовый порог анализа + коэффициент доли для анализа * количество кортежей

source: For analyze, a similar condition is used: the threshold, defined as: <placeholder-1/> is compared to the total number of tuples inserted, updated, or deleted since the last <command>ANALYZE</command>.
ru: Для выполнения сбора статистики используется аналогичное условие: пороговое значение, определяемое как: <placeholder-1/> сравнивается с общим количеством кортежей добавленных, изменённых или удалённых после последнего выполнения <command>ANALYZE</command>.

source: Temporary tables cannot be accessed by autovacuum. Therefore, appropriate vacuum and analyze operations should be performed via session SQL commands.
ru: Автоочистка не обрабатывает временные таблицы. Поэтому очистку и сбор статистики в них нужно производить с помощью SQL-команд в обычном сеансе.

source: The default thresholds and scale factors are taken from <filename>postgresql.conf</filename>, but it is possible to override them (and many other autovacuum control parameters) on a per-table basis; see <xref linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/> for more information. If a setting has been changed via a table's storage parameters, that value is used when processing that table; otherwise the global settings are used. See <xref linkend="runtime-config-autovacuum"/> for more details on the global settings.
ru: Используемые по умолчанию пороговые значения и коэффициенты берутся из <filename>postgresql.conf</filename>, однако их (и многие другие параметры, управляющие автоочисткой) можно переопределить для каждой таблицы; за подробностями обратитесь к <xref remap="3" linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/>. Если какие-либо значения определены через параметры хранения таблицы, при обработке этой таблицы действуют они, а в противном случае — глобальные параметры. За более подробной информацией о глобальных параметрах обратитесь к <xref remap="3" linkend="runtime-config-autovacuum"/>.

source: When multiple workers are running, the autovacuum cost delay parameters (see <xref linkend="runtime-config-resource-vacuum-cost"/>) are <quote>balanced</quote> among all the running workers, so that the total I/O impact on the system is the same regardless of the number of workers actually running. However, any workers processing tables whose per-table <literal>autovacuum_vacuum_cost_delay</literal> or <literal>autovacuum_vacuum_cost_limit</literal> storage parameters have been set are not considered in the balancing algorithm.
ru: Когда выполняются несколько рабочих процессов, параметры задержки автоочистки по стоимости (см. <xref remap="4" linkend="runtime-config-resource-vacuum-cost"/>) <quote>распределяются</quote> между всеми этими процессами, так что общее воздействие на систему остаётся неизменным, независимо от их числа. Однако этот алгоритм распределения нагрузки не учитывает процессы, обрабатывающие таблицы с индивидуальными значениями параметров хранения <literal>autovacuum_vacuum_cost_delay</literal> и <literal>autovacuum_vacuum_cost_limit</literal>.

source: Routine Reindexing
ru: Регулярная переиндексация

source: <primary>reindex</primary>
ru: <primary>переиндексация</primary>

source: In some situations it is worthwhile to rebuild indexes periodically with the <xref linkend="sql-reindex"/> command or a series of individual rebuilding steps.
ru: В некоторых ситуациях стоит периодически перестраивать индексы, выполняя команду <xref linkend="sql-reindex"/> или последовательность отдельных шагов по восстановлению индексов.

source: B-tree index pages that have become completely empty are reclaimed for re-use. However, there is still a possibility of inefficient use of space: if all but a few index keys on a page have been deleted, the page remains allocated. Therefore, a usage pattern in which most, but not all, keys in each range are eventually deleted will see poor use of space. For such usage patterns, periodic reindexing is recommended.
ru: Страницы индексов на основе B-деревьев, которые стали абсолютно пустыми, могут быть использованы повторно. Однако возможность неэффективного использования пространства всё же остаётся: если со страницы были удалены почти все, но не все ключи индекса, страница всё равно остаётся занятой. Следовательно, шаблон использования, при котором со временем удаляются многие, но не все ключи в каждом диапазоне, приведёт к неэффективному расходованию пространства. В таких случаях рекомендуется периодически проводить переиндексацию.

source: The potential for bloat in non-B-tree indexes has not been well researched. It is a good idea to periodically monitor the index's physical size when using any non-B-tree index type.
ru: Возможность потери пространства в индексах на основе не B-деревьев глубоко не исследовалась. Поэтому имеет смысл периодически отслеживать физический размер индекса, когда применяется индекс такого типа.

source: Also, for B-tree indexes, a freshly-constructed index is slightly faster to access than one that has been updated many times because logically adjacent pages are usually also physically adjacent in a newly built index. (This consideration does not apply to non-B-tree indexes.) It might be worthwhile to reindex periodically just to improve access speed.
ru: Кроме того, с B-деревьями доступ по недавно построенному индексу осуществляется немного быстрее, нежели доступ по индексу, который неоднократно изменялся, поскольку в недавно построенном индексе страницы, близкие логически, обычно расположены так же близко и физически. (Это соображение неприменимо к индексам, которые основаны не на B-деревьях.) Поэтому периодически проводить переиндексацию стоит хотя бы для того, чтобы увеличить скорость доступа.

source: <xref linkend="sql-reindex"/> can be used safely and easily in all cases. But since the command requires an exclusive table lock, it is often preferable to execute an index rebuild with a sequence of creation and replacement steps. Index types that support <xref linkend="sql-createindex"/> with the <literal>CONCURRENTLY</literal> option can instead be recreated that way. If that is successful and the resulting index is valid, the original index can then be replaced by the newly built one using a combination of <xref linkend="sql-alterindex"/> and <xref linkend="sql-dropindex"/>. When an index is used to enforce uniqueness or other constraints, <xref linkend="sql-altertable"/> might be necessary to swap the existing constraint with one enforced by the new index. Review this alternate multistep rebuild approach carefully before using it as there are limitations on which indexes can be reindexed this way, and errors must be handled.
ru: Команду <xref linkend="sql-reindex"/> можно безопасно и просто применять во всех случаях. Но так как она требует исключительной блокировки таблицы, часто предпочтительнее перестраивать индекс в несколько этапов, включающих создание и замену индекса. Типы индексов, которые поддерживает <xref linkend="sql-createindex"/> с указанием <literal>CONCURRENTLY</literal>, можно построить именно так. Если это удаётся и получен рабочий индекс, изначальный индекс можно заменить им, выполнив <xref linkend="sql-alterindex"/> и <xref linkend="sql-dropindex"/>. Когда индекс используется для обеспечения уникальности или других ограничений, может потребоваться команда <xref linkend="sql-altertable"/>, чтобы поменять существующее ограничение на то, что обеспечивает новый индекс. Обстоятельно продумайте эту многоходовую процедуру, прежде чем выполнять её, так как не все индексы можно перестроить таким образом, и предусмотрите обработку ошибок.

source: Log File Maintenance
ru: Обслуживание журнала

source: <primary>server log</primary> <secondary>log file maintenance</secondary>
ru: <primary>журнал сервера</primary> <secondary>обслуживание файла журнала</secondary>

source: It is a good idea to save the database server's log output somewhere, rather than just discarding it via <filename>/dev/null</filename>. The log output is invaluable when diagnosing problems. However, the log output tends to be voluminous (especially at higher debug levels) so you won't want to save it indefinitely. You need to <emphasis>rotate</emphasis> the log files so that new log files are started and old ones removed after a reasonable period of time.
ru: Журнал сервера базы данных желательно сохранять где-либо, а не просто сбрасывать его в <filename>/dev/null</filename>. Этот журнал бесценен при диагностике проблем. Однако он может быть очень объёмным (особенно при высоких уровнях отладки), так что хранить его неограниченно долго вы вряд ли захотите. Поэтому необходимо организовать <emphasis>ротацию</emphasis> журнальных файлов так, чтобы новые файлы создавались, а старые удалялись через разумный промежуток времени.

source: If you simply direct the <systemitem>stderr</systemitem> of <command>postgres</command> into a file, you will have log output, but the only way to truncate the log file is to stop and restart the server. This might be acceptable if you are using <productname>PostgreSQL</productname> in a development environment, but few production servers would find this behavior acceptable.
ru: Если просто направить <systemitem>stderr</systemitem> команды <command>postgres</command> в файл, вы получите в нём журнал сообщений, но очистить этот файл можно будет, только если остановить и перезапустить сервер. Это может быть допустимо при использовании <productname>PostgreSQL</productname> в среде разработки, но вряд ли такой вариант будет приемлемым в производственной среде.

source: A better approach is to send the server's <systemitem>stderr</systemitem> output to some type of log rotation program. There is a built-in log rotation facility, which you can use by setting the configuration parameter <varname>logging_collector</varname> to <literal>true</literal> in <filename>postgresql.conf</filename>. The control parameters for this program are described in <xref linkend="runtime-config-logging-where"/>. You can also use this approach to capture the log data in machine readable <acronym>CSV</acronym> (comma-separated values) format.
ru: Лучшим подходом будет перенаправление вывода сервера <systemitem>stderr</systemitem> в какую-либо программу ротации журнальных файлов. Существует и встроенное средство ротации журнальных файлов, которое можно использовать, установив для параметра <varname>logging_collector</varname> значение <literal>true</literal> в <filename>postgresql.conf</filename>. Параметры, управляющие этой программой, описаны в <xref remap="6" linkend="runtime-config-logging-where"/>. Этот подход также можно использовать для получения содержимого журнала в формате <acronym>CSV</acronym> (значения, разделённые запятыми).

source: Alternatively, you might prefer to use an external log rotation program if you have one that you are already using with other server software. For example, the <application>rotatelogs</application> tool included in the <productname>Apache</productname> distribution can be used with <productname>PostgreSQL</productname>. To do this, just pipe the server's <systemitem>stderr</systemitem> output to the desired program. If you start the server with <command>pg_ctl</command>, then <systemitem>stderr</systemitem> is already redirected to <systemitem>stdout</systemitem>, so you just need a pipe command, for example: <placeholder-1/>
ru: Вы также можете использовать внешнюю программу для ротации журнальных файлов, если уже применяете такое приложение для других серверных приложений. Например, утилиту <application>rotatelogs</application>, включённую в дистрибутив <productname>Apache</productname>, можно использовать и с <productname>PostgreSQL</productname>. Для этого просто направьте вывод <systemitem>stderr</systemitem> сервера в желаемую программу. Если вы запускаете сервер, используя <command>pg_ctl</command>, то <systemitem>stderr</systemitem> уже будет перенаправлен в <systemitem>stdout</systemitem>, так что будет достаточно просто применить конвейер, например: <placeholder-1/>

source: Another production-grade approach to managing log output is to send it to <application>syslog</application> and let <application>syslog</application> deal with file rotation. To do this, set the configuration parameter <varname>log_destination</varname> to <literal>syslog</literal> (to log to <application>syslog</application> only) in <filename>postgresql.conf</filename>. Then you can send a <literal>SIGHUP</literal> signal to the <application>syslog</application> daemon whenever you want to force it to start writing a new log file. If you want to automate log rotation, the <application>logrotate</application> program can be configured to work with log files from <application>syslog</application>.
ru: Ещё одно решение промышленного уровня заключается в передаче журнала в <application>syslog</application>, чтобы ротацией файлов занималась уже служба <application>syslog</application>. Для этого присвойте параметру конфигурации <varname>log_destination</varname> значение <literal>syslog</literal> (для вывода журнала только в <application>syslog</application>) в <filename>postgresql.conf</filename>. Затем вы сможете посылать сигнал <literal>SIGHUP</literal> службе <application>syslog</application>, когда захотите принудительно начать запись нового журнального файла. Если вы хотите автоматизировать ротацию журнальных файлов, программу <application>logrotate</application> можно настроить и для работы с журнальными файлами, которые формирует <application>syslog</application>.

source: On many systems, however, <application>syslog</application> is not very reliable, particularly with large log messages; it might truncate or drop messages just when you need them the most. Also, on <productname>Linux</productname>, <application>syslog</application> will flush each message to disk, yielding poor performance. (You can use a <quote><literal>-</literal></quote> at the start of the file name in the <application>syslog</application> configuration file to disable syncing.)
ru: Однако во многих системах, а особенно c большими сообщениями, <application>syslog</application> работает не очень надёжно; он может обрезать или терять сообщения как раз тогда, когда они вам нужны. Кроме того, в <productname>Linux</productname>, <application>syslog</application>> сбрасывает каждое сообщение на диск, от чего страдает производительность. (Для отключения этой синхронной записи можно добавить <quote><literal>-</literal></quote> перед именем файла в файле конфигурации <application>syslog</application>.)

source: Note that all the solutions described above take care of starting new log files at configurable intervals, but they do not handle deletion of old, no-longer-useful log files. You will probably want to set up a batch job to periodically delete old log files. Another possibility is to configure the rotation program so that old log files are overwritten cyclically.
ru: Обратите внимание, что все описанные выше решения обеспечивают создание новых журнальных файлов через задаваемые промежутки времени, но не удаление старых, ставших бесполезными файлов журналов. Возможно, вы захотите создать задание для периодического удаления старых файлов. Кроме того, вы можете настроить программу ротации файлов так, чтобы старые файлы журналов циклически перезаписывались.

source: <ulink url="http://dalibo.github.io/pgbadger/"><productname>pgBadger</productname></ulink> is an external project that does sophisticated log file analysis. <ulink url="http://bucardo.org/wiki/Check_postgres"><productname>check_postgres</productname></ulink> provides Nagios alerts when important messages appear in the log files, as well as detection of many other extraordinary conditions.
ru: Также вам может быть полезен <ulink url="http://dalibo.github.io/pgbadger/"><productname>pgBadger</productname></ulink> — инструмент для сложного анализа файлов журнала. Кроме того, <ulink url="http://bucardo.org/wiki/Check_postgres"><productname>check_postgres</productname></ulink> может посылать уведомления в Nagios, когда в журнале появляются важные сообщения, а также при обнаружении других нестандартных ситуаций.

source: <command>VACUUM</command> normally only scans pages that have been modified since the last vacuum, but <structfield>relfrozenxid</structfield> can only be advanced when every page of the table that might contain unfrozen XIDs is scanned. This happens when <structfield>relfrozenxid</structfield> is more than <varname>vacuum_freeze_table_age</varname> transactions old, when <command>VACUUM</command>'s <literal>FREEZE</literal> option is used, or when all pages that are not already all-frozen happen to require vacuuming to remove dead row versions. When <command>VACUUM</command> scans every page in the table that is not already all-frozen, it should set <literal>age(relfrozenxid)</literal> to a value just a little more than the <varname>vacuum_freeze_min_age</varname> setting that was used (more by the number of transcations started since the <command>VACUUM</command> started). If no <structfield>relfrozenxid</structfield>-advancing <command>VACUUM</command> is issued on the table until <varname>autovacuum_freeze_max_age</varname> is reached, an autovacuum will soon be forced for the table.
ru: Обычно <command>VACUUM</command> сканирует только те страницы, которые изменялись после последней очистки, однако <structfield>relfrozenxid</structfield> может увеличиться только при сканировании всех страниц таблицы, включая те, что могут содержать незамороженные XID. Это происходит когда возраст <structfield>relfrozenxid</structfield> достигает <varname>vacuum_freeze_table_age</varname> транзакций, когда <command>VACUUM</command> вызывается с указанием <literal>FREEZE</literal>, или когда оказывается, что очистку для удаления мёртвых версий строк нужно провести во всех ещё не замороженных страницах. Когда <command>VACUUM</command> сканирует в таблице каждую ещё не полностью замороженную страницу, значение <literal>age(relfrozenxid)</literal> в результате должно стать немного больше, чем установленное значение <varname>vacuum_freeze_min_age</varname> (больше на число транзакций, начатых с момента запуска <command>VACUUM</command>). Если по достижении <varname>autovacuum_freeze_max_age</varname> для таблицы ни разу не будет выполнена операция <structfield>relfrozenxid</structfield>, в скором времени для неё будет принудительно запущена автоочистка.
