Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/maintenance.po
Languages: ru

source: The sole disadvantage of increasing <varname>autovacuum_freeze_max_age</varname> (and <varname>vacuum_freeze_table_age</varname> along with it) is that the <filename>pg_xact</filename> and <filename>pg_commit_ts</filename> subdirectories of the database cluster will take more space, because it must store the commit status and (if <varname>track_commit_timestamp</varname> is enabled) timestamp of all transactions back to the <varname>autovacuum_freeze_max_age</varname> horizon. The commit status uses two bits per transaction, so if <varname>autovacuum_freeze_max_age</varname> is set to its maximum allowed value of two billion, <filename>pg_xact</filename> can be expected to grow to about half a gigabyte and <filename>pg_commit_ts</filename> to about 20GB. If this is trivial compared to your total database size, setting <varname>autovacuum_freeze_max_age</varname> to its maximum allowed value is recommended. Otherwise, set it depending on what you are willing to allow for <filename>pg_xact</filename> and <filename>pg_commit_ts</filename> storage. (The default, 200 million transactions, translates to about 50MB of <filename>pg_xact</filename> storage and about 2GB of <filename>pg_commit_ts</filename> storage.)
ru: Единственный минус увеличения <varname>autovacuum_freeze_max_age</varname> (и <varname>vacuum_freeze_table_age</varname> с ним) заключается в том, что подкаталоги <filename>pg_xact</filename> и <filename>pg_commit_ts</filename> в кластере баз данных будут занимать больше места, поскольку в них нужно будет хранить статус и (при включённом <varname>track_commit_timestamp</varname>) время фиксации всех транзакций вплоть до горизонта <varname>autovacuum_freeze_max_age</varname>. Для статуса фиксации используется по два бита на транзакцию, поэтому если в <varname>autovacuum_freeze_max_age</varname> установлено максимально допустимое значение в два миллиарда, то размер <filename>pg_xact</filename> может составить примерно половину гигабайта, а <filename>pg_commit_ts</filename> примерно 20 ГБ. Если по сравнению с объёмом вашей базы данных этот объём незначителен, тогда рекомендуется установить для <varname>autovacuum_freeze_max_age</varname> максимально допустимое значение. В противном случае установите значение этого параметра в зависимости от объёма, который вы готовы выделить для <filename>pg_xact</filename> и <filename>pg_commit_ts</filename>. (Значению по умолчанию, 200 миллионам транзакций, соответствует приблизительно 50 МБ в <filename>pg_xact</filename> и около 2 ГБ в <filename>pg_commit_ts</filename>.)

source: The sole disadvantage of increasing <varname>autovacuum_freeze_max_age</varname> (and <varname>vacuum_freeze_table_age</varname> along with it) is that the <filename>pg_clog</filename> subdirectory of the database cluster will take more space, because it must store the commit status of all transactions back to the <varname>autovacuum_freeze_max_age</varname> horizon. The commit status uses two bits per transaction, so if <varname>autovacuum_freeze_max_age</varname> is set to its maximum allowed value of two billion, <filename>pg_clog</filename> can be expected to grow to about half a gigabyte. If this is trivial compared to your total database size, setting <varname>autovacuum_freeze_max_age</varname> to its maximum allowed value is recommended. Otherwise, set it depending on what you are willing to allow for <filename>pg_clog</filename> storage. (The default, 200 million transactions, translates to about 50MB of <filename>pg_clog</filename> storage.)
ru: Единственный минус увеличения <varname>autovacuum_freeze_max_age</varname> (и <varname>vacuum_freeze_table_age</varname> с ним) заключается в том, что подкаталог <filename>pg_clog</filename> в кластере базы данных будет занимать больше места, поскольку в нём нужно будет хранить статус фиксации всех транзакций вплоть до горизонта <varname>autovacuum_freeze_max_age</varname>. Для статуса фиксации используется по два бита на транзакцию, поэтому если в <varname>autovacuum_freeze_max_age</varname> установлено максимально допустимое значение в два миллиарда, то размер <filename>pg_clog</filename> может составить примерно половину гигабайта. Если по сравнению с объёмом вашей базы данных этот объём незначителен, тогда рекомендуется установить для <varname>autovacuum_freeze_max_age</varname> максимально допустимое значение. В противном случае, установите значение этого параметра в зависимости от объёма, который вы готовы выделить для <filename>pg_clog</filename>. (Значению по умолчанию, 200 миллионам транзакций, соответствует приблизительно 50 Мб в <filename>pg_clog</filename>.)

source: One disadvantage of decreasing <varname>vacuum_freeze_min_age</varname> is that it might cause <command>VACUUM</command> to do useless work: freezing a row version is a waste of time if the row is modified soon thereafter (causing it to acquire a new XID). So the setting should be large enough that rows are not frozen until they are unlikely to change any more.
ru: Уменьшение значения <varname>vacuum_freeze_min_age</varname>, с другой стороны, чревато тем, что команда <command>VACUUM</command> может выполнять бесполезную работу: замораживание версии строки — пустая трата времени, если эта строка будет вскоре изменена (и в результате получит новый XID). Поэтому значение этого параметра должно быть достаточно большим для того, чтобы строки не замораживались, пока их последующее изменение не станет маловероятным.

source: To track the age of the oldest unfrozen XIDs in a database, <command>VACUUM</command> stores XID statistics in the system tables <structname>pg_class</structname> and <structname>pg_database</structname>. In particular, the <structfield>relfrozenxid</structfield> column of a table's <structname>pg_class</structname> row contains the freeze cutoff XID that was used by the last aggressive <command>VACUUM</command> for that table. All rows inserted by transactions with XIDs older than this cutoff XID are guaranteed to have been frozen. Similarly, the <structfield>datfrozenxid</structfield> column of a database's <structname>pg_database</structname> row is a lower bound on the unfrozen XIDs appearing in that database &mdash; it is just the minimum of the per-table <structfield>relfrozenxid</structfield> values within the database. A convenient way to examine this information is to execute queries such as: <placeholder-1/> The <literal>age</literal> column measures the number of transactions from the cutoff XID to the current transaction's XID.
ru: Для отслеживания возраста самых старых значений XID в базе данных команда <command>VACUUM</command> сохраняет статистику по XID в системных таблицах <structname>pg_class</structname> и <structname>pg_database</structname>. В частности, столбец <structfield>relfrozenxid</structfield> в записи для определённой таблицы в <structname>pg_class</structname> содержит граничное значение XID, с которым в последний раз выполнялась агрессивная очистка (<command>VACUUM</command>) этой таблицы. Все строки, добавленные транзакциями с более ранними XID, гарантированно будут заморожены. Аналогично столбец <structfield>datfrozenxid</structfield> в записи для базы данных в <structname>pg_database</structname> представляет нижнюю границу обычных значений XID, встречающихся в этой базе &mdash; он просто хранит минимальное из всех значений <structfield>relfrozenxid</structfield> для таблиц этой базы. Эту информацию удобно получать с помощью таких запросов: <placeholder-1/> Столбец <literal>age</literal> показывает количество транзакций от граничного значения XID до XID текущей транзакции.

source: <command>VACUUM</command> normally only scans pages that have been modified since the last vacuum, but <structfield>relfrozenxid</structfield> can only be advanced when every page of the table that might contain unfrozen XIDs is scanned. This happens when <structfield>relfrozenxid</structfield> is more than <varname>vacuum_freeze_table_age</varname> transactions old, when <command>VACUUM</command>'s <literal>FREEZE</literal> option is used, or when all pages that are not already all-frozen happen to require vacuuming to remove dead row versions. When <command>VACUUM</command> scans every page in the table that is not already all-frozen, it should set <literal>age(relfrozenxid)</literal> to a value just a little more than the <varname>vacuum_freeze_min_age</varname> setting that was used (more by the number of transactions started since the <command>VACUUM</command> started). If no <structfield>relfrozenxid</structfield>-advancing <command>VACUUM</command> is issued on the table until <varname>autovacuum_freeze_max_age</varname> is reached, an autovacuum will soon be forced for the table.
ru: Обычно <command>VACUUM</command> сканирует только те страницы, которые изменялись после последней очистки, однако <structfield>relfrozenxid</structfield> может увеличиться только при сканировании всех страниц таблицы, включая те, что могут содержать незамороженные XID. Это происходит когда возраст <structfield>relfrozenxid</structfield> достигает <varname>vacuum_freeze_table_age</varname> транзакций, когда <command>VACUUM</command> вызывается с указанием <literal>FREEZE</literal>, или когда оказывается, что очистку для удаления мёртвых версий строк нужно провести во всех ещё не замороженных страницах. Когда <command>VACUUM</command> сканирует в таблице каждую ещё не полностью замороженную страницу, значение <literal>age(relfrozenxid)</literal> в результате должно стать немного больше, чем установленное значение <varname>vacuum_freeze_min_age</varname> (больше на число транзакций, начатых с момента запуска <command>VACUUM</command>). Если по достижении <varname>autovacuum_freeze_max_age</varname> для таблицы ни разу не будет выполнена операция <structfield>relfrozenxid</structfield>, в скором времени для неё будет принудительно запущена автоочистка.

source: WARNING: database "mydb" must be vacuumed within 177009986 transactions HINT: To avoid a database shutdown, execute a database-wide VACUUM in "mydb".
ru: ПРЕДУПРЕЖДЕНИЕ: база данных "mydb" должна быть очищена (предельное число транзакций: 177009986) ПОДСКАЗКА: Во избежание отключения базы данных выполните очистку (VACUUM) всей базы "mydb".

source: ERROR: database is not accepting commands to avoid wraparound data loss in database "mydb" HINT: Stop the postmaster and vacuum that database in single-user mode.
ru: ОШИБКА: база данных не принимает команды во избежание потери данных из-за зацикливания в БД "mydb" ПОДСКАЗКА: Остановите управляющий процесс (postmaster) и выполните очистку (VACUUM) базы данных в однопользовательском режиме.

source: If for some reason autovacuum fails to clear old XIDs from a table, the system will begin to emit warning messages like this when the database's oldest XIDs reach ten million transactions from the wraparound point: <placeholder-1/> (A manual <command>VACUUM</command> should fix the problem, as suggested by the hint; but note that the <command>VACUUM</command> must be performed by a superuser, else it will fail to process system catalogs and thus not be able to advance the database's <structfield>datfrozenxid</structfield>.) If these warnings are ignored, the system will shut down and refuse to start any new transactions once there are fewer than 1 million transactions left until wraparound: <placeholder-2/> The 1-million-transaction safety margin exists to let the administrator recover without data loss, by manually executing the required <command>VACUUM</command> commands. However, since the system will not execute commands once it has gone into the safety shutdown mode, the only way to do this is to stop the server and start the server in single-user mode to execute <command>VACUUM</command>. The shutdown mode is not enforced in single-user mode. See the <xref linkend="app-postgres"/> reference page for details about using single-user mode.
ru: Если по какой-либо причине автоочистка не может вычистить старые значения XID из таблицы, система начинает выдавать предупреждающие сообщения, подобные приведённому ниже, когда самое старое значение XID в базе данных оказывается в десяти миллионах транзакций от точки зацикливания: <placeholder-1/> (Проблему можно решить, как предлагает подсказка, запустив <command>VACUUM</command> вручную; однако учтите, что выполнять <command>VACUUM</command> должен суперпользователь, в противном случае эта процедура не сможет обработать системные каталоги и, следовательно, не сможет увеличить значение <structfield>datfrozenxid</structfield> для базы данных.) Если эти предупреждения игнорировать, система отключится и не будет начинать никаких транзакций, как только до точки зацикливания останется менее 1 миллиона транзакций: <placeholder-2/> Резерв в 1 миллион транзакций позволяет администратору провести восстановление без потери данных, выполнив необходимые команды <command>VACUUM</command> вручную. Однако, поскольку после безопасной остановки система не будет исполнять команды, администратору останется только перезапустить сервер в однопользовательском режиме, чтобы запустить <command>VACUUM</command>. За подробной информацией об использовании однопользовательского режима обратитесь к странице справки по <xref linkend="app-postgres"/>.

source: Multixacts and Wraparound
ru: Мультитранзакции и зацикливание

source: <primary>wraparound</primary> <secondary>of multixact IDs</secondary>
ru: <primary>зацикливание</primary> <secondary>идентификаторов мультитранзакций</secondary>

source: <firstterm>Multixact IDs</firstterm> are used to support row locking by multiple transactions. Since there is only limited space in a tuple header to store lock information, that information is encoded as a <quote>multiple transaction ID</quote>, or multixact ID for short, whenever there is more than one transaction concurrently locking a row. Information about which transaction IDs are included in any particular multixact ID is stored separately in the <filename>pg_multixact</filename> subdirectory, and only the multixact ID appears in the <structfield>xmax</structfield> field in the tuple header. Like transaction IDs, multixact IDs are implemented as a 32-bit counter and corresponding storage, all of which requires careful aging management, storage cleanup, and wraparound handling. There is a separate storage area which holds the list of members in each multixact, which also uses a 32-bit counter and which must also be managed.
ru: <firstterm>Идентификаторы мультитранзакций</firstterm> используются для поддержки блокировки строк несколькими транзакциями одновременно. Поскольку в заголовке строки есть только ограниченное пространство для хранения информации о блокировках, в нём указывается <quote>идентификатор множественной транзакции</quote>, или идентификатор мультитранзакции для краткости, когда строку блокируют одновременно несколько транзакций. Информация о том, какие именно идентификаторы транзакций относятся к определённой мультитранзакции, хранится отдельно в подкаталоге <filename>pg_multixact</filename>, а в поле <structfield>xmax</structfield> в заголовке строки сохраняется только идентификатор мультитранзакции. Как и идентификаторы транзакций, идентификаторы мультитранзакций исполнены в виде 32-разрядного счётчика и хранятся аналогично, что требует аккуратного управления их возрастом, очисткой хранилища и предотвращением зацикливаний. Существует отдельная область, в которой содержится список членов каждой мультитранзакции, где счётчики также 32-битные и требуют должного контроля.

source: Whenever <command>VACUUM</command> scans any part of a table, it will replace any multixact ID it encounters which is older than <xref linkend="guc-vacuum-multixact-freeze-min-age"/> by a different value, which can be the zero value, a single transaction ID, or a newer multixact ID. For each table, <structname>pg_class</structname>.<structfield>relminmxid</structfield> stores the oldest possible multixact ID still appearing in any tuple of that table. If this value is older than <xref linkend="guc-vacuum-multixact-freeze-table-age"/>, an aggressive vacuum is forced. As discussed in the previous section, an aggressive vacuum means that only those pages which are known to be all-frozen will be skipped. <function>mxid_age()</function> can be used on <structname>pg_class</structname>.<structfield>relminmxid</structfield> to find its age.
ru: Когда <command>VACUUM</command> сканирует какую-либо часть таблицы, каждый идентификатор мультитранзакции старее чем <xref linkend="guc-vacuum-multixact-freeze-min-age"/> заменяется другим значением, которое может быть нулевым, идентификатором одиночной транзакции или новым идентификатором мультитранзакции. Для каждой таблицы в <structname>pg_class</structname>.<structfield>relminmxid</structfield> хранится самый старый возможный идентификатор мультитранзакции, всё ещё задействованный в какой-либо строке этой таблицы. Если это значение оказывается старее <xref linkend="guc-vacuum-multixact-freeze-table-age"/>, выполняется агрессивная очистка. Как рассказывалось в предыдущем разделе, при агрессивной очистке будут пропускаться только те страницы, которые считаются полностью замороженными. Узнать возраст <structname>pg_class</structname>.<structfield>relminmxid</structfield> можно с помощью функции <function>mxid_age()</function>.

source: Aggressive <command>VACUUM</command> scans, regardless of what causes them, enable advancing the value for that table. Eventually, as all tables in all databases are scanned and their oldest multixact values are advanced, on-disk storage for older multixacts can be removed.
ru: Благодаря агрессивным операциям <command>VACUUM</command>, вне зависимости от их причины, это значение для таблицы будет увеличиваться. В конце концов, по мере сканирования всех таблиц во всех базах данных и увеличения их старейших значений мультитранзакций, информация о старых мультитранзакциях может быть удалена с диска.

source: As a safety device, an aggressive vacuum scan will occur for any table whose multixact-age is greater than <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>. Aggressive vacuum scans will also occur progressively for all tables, starting with those that have the oldest multixact-age, if the amount of used member storage space exceeds the amount 50% of the addressable storage space. Both of these kinds of aggressive scans will occur even if autovacuum is nominally disabled.
ru: В качестве меры защиты, агрессивное сканирование с целью очистки будет происходить для любой таблицы, возраст мультитранзакций которой больше, чем <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>. Агрессивное сканирование также будет выполняться постепенно со всеми таблицами, начиная с имеющих старейшие мультитранзакции, если объём занятой области членов мультитранзакций превышает 50% от объёма адресуемого пространства. Эти два варианта агрессивного сканирования осуществляются, даже если процесс автоочистки отключён.

source: The Autovacuum Daemon
ru: Демон автоочистки

source: <primary>autovacuum</primary> <secondary>general information</secondary>
ru: <primary>автоочистка</primary> <secondary>общая информация</secondary>

source: <productname>PostgreSQL</productname> has an optional but highly recommended feature called <firstterm>autovacuum</firstterm>, whose purpose is to automate the execution of <command>VACUUM</command> and <command>ANALYZE </command> commands. When enabled, autovacuum checks for tables that have had a large number of inserted, updated or deleted tuples. These checks use the statistics collection facility; therefore, autovacuum cannot be used unless <xref linkend="guc-track-counts"/> is set to <literal>true</literal>. In the default configuration, autovacuuming is enabled and the related configuration parameters are appropriately set.
ru: В <productname>PostgreSQL</productname> имеется не обязательная, но настоятельно рекомендуемая к использованию функция, называемая <firstterm>автоочисткой</firstterm>, предназначение которой — автоматизировать выполнение команд <command>VACUUM</command> и <command>ANALYZE </command>. Когда автоочистка включена, она проверяет, в каких таблицах было вставлено, изменено или удалено много строк. При этих проверках используются средства сбора статистики; поэтому автоочистка будет работать, только если параметр <xref linkend="guc-track-counts"/> имеет значение <literal>true</literal>. В конфигурации по умолчанию автоочистка включена и соответствующие параметры имеют подходящие значения.

source: The <quote>autovacuum daemon</quote> actually consists of multiple processes. There is a persistent daemon process, called the <firstterm>autovacuum launcher</firstterm>, which is in charge of starting <firstterm>autovacuum worker</firstterm> processes for all databases. The launcher will distribute the work across time, attempting to start one worker within each database every <xref linkend="guc-autovacuum-naptime"/> seconds. (Therefore, if the installation has <replaceable>N</replaceable> databases, a new worker will be launched every <varname>autovacuum_naptime</varname>/<replaceable>N</replaceable> seconds.) A maximum of <xref linkend="guc-autovacuum-max-workers"/> worker processes are allowed to run at the same time. If there are more than <varname>autovacuum_max_workers</varname> databases to be processed, the next database will be processed as soon as the first worker finishes. Each worker process will check each table within its database and execute <command>VACUUM</command> and/or <command>ANALYZE</command> as needed. <xref linkend="guc-log-autovacuum-min-duration"/> can be set to monitor autovacuum workers' activity.
ru: <quote>Демон автоочистки</quote> на самом деле состоит из нескольких процессов. Существует постоянный фоновый процесс, называемый <firstterm>процессом запуска автоочистки</firstterm>, который отвечает за запуск <firstterm>рабочих процессов автоочистки</firstterm> для всех баз данных. Этот контролирующий процесс распределяет работу по времени, стараясь запускать рабочий процесс для каждой базы данных каждые <xref linkend="guc-autovacuum-naptime"/> секунд. (Следовательно, если всего имеется <replaceable>N</replaceable> баз данных, новый рабочий процесс будет запускаться каждые <varname>autovacuum_naptime</varname>/<replaceable>N</replaceable> секунд.) Одновременно могут выполняться до <xref linkend="guc-autovacuum-max-workers"/> рабочих процессов. Если число баз данных, требующих обработки, превышает <varname>autovacuum_max_workers</varname>, обработка следующей базы начинается сразу по завершении первого рабочего процесса. Каждый рабочий процесс проверяет все таблицы в своей базе данных и в случае необходимости выполняет <command>VACUUM</command> и/или <command>ANALYZE</command>. Для отслеживания действий рабочих процессов можно установить параметр <xref linkend="guc-log-autovacuum-min-duration"/>.
