Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/maintenance.po
Languages: ru

source: Routine Database Maintenance Tasks
ru: Регламентные задачи обслуживания базы данных

source: <primary>maintenance</primary>
ru: <primary>обслуживание</primary>

source: <primary>routine maintenance</primary>
ru: <primary>регламентное обслуживание</primary>

source: <productname>PostgreSQL</productname>, like any database software, requires that certain tasks be performed regularly to achieve optimum performance. The tasks discussed here are <emphasis>required</emphasis>, but they are repetitive in nature and can easily be automated using standard tools such as <application>cron</application> scripts or Windows' <application>Task Scheduler</application>. It is the database administrator's responsibility to set up appropriate scripts, and to check that they execute successfully.
ru: Как и в любой СУБД, в <productname>PostgreSQL</productname> для достижения оптимальной производительности нужно регулярно выполнять определённые процедуры. Задачи, которые рассматриваются в этой главе, являются <emphasis>обязательными</emphasis>, но они по природе своей повторяющиеся и легко поддаются автоматизации с использованием стандартных средств, таких как задания <application>cron</application> или <application>Планировщика задач</application> в Windows. Создание соответствующих заданий и контроль над их успешным выполнением входят в обязанности администратора базы данных.

source: One obvious maintenance task is the creation of backup copies of the data on a regular schedule. Without a recent backup, you have no chance of recovery after a catastrophe (disk failure, fire, mistakenly dropping a critical table, etc.). The backup and recovery mechanisms available in <productname>PostgreSQL</productname> are discussed at length in <xref linkend="backup"/>.
ru: Одной из очевидных задач обслуживания СУБД является регулярное создание резервных копий данных. При отсутствии свежей резервной копии у вас не будет шанса восстановить систему после катастрофы (сбой диска, пожар, удаление важной таблицы по ошибке и т. д.). Механизмы резервного копирования и восстановления в <productname>PostgreSQL</productname> детально рассматриваются в <xref remap="6" linkend="backup"/>.

source: The other main category of maintenance task is periodic <quote>vacuuming</quote> of the database. This activity is discussed in <xref linkend="routine-vacuuming"/>. Closely related to this is updating the statistics that will be used by the query planner, as discussed in <xref linkend="vacuum-for-statistics"/>.
ru: Другое важное направление обслуживания СУБД — периодическая <quote>очистка</quote> базы данных. Эта операция рассматривается в <xref remap="6" linkend="routine-vacuuming"/>. С ней тесно связано обновление статистики, которая будет использоваться планировщиком запросов; оно рассматривается в <xref remap="6" linkend="vacuum-for-statistics"/>.

source: Another task that might need periodic attention is log file management. This is discussed in <xref linkend="logfile-maintenance"/>.
ru: Ещё одной задачей, требующей периодического выполнения, является управление файлами журнала. Она рассматривается в <xref remap="6" linkend="logfile-maintenance"/>.

source: <ulink url="http://bucardo.org/wiki/Check_postgres"><application>check_postgres</application></ulink> is available for monitoring database health and reporting unusual conditions. <application>check_postgres</application> integrates with Nagios and MRTG, but can be run standalone too.
ru: Для контроля состояния базы данных и для отслеживания нестандартных ситуаций можно использовать <ulink url="http://bucardo.org/wiki/Check_postgres"><application>check_postgres</application></ulink>. Скрипт <application>check_postgres</application> можно интегрировать с Nagios и MRTG, однако он может работать и самостоятельно.

source: <productname>PostgreSQL</productname> is low-maintenance compared to some other database management systems. Nonetheless, appropriate attention to these tasks will go far towards ensuring a pleasant and productive experience with the system.
ru: По сравнению с некоторыми другими СУБД <productname>PostgreSQL</productname> неприхотлив в обслуживании. Тем не менее, должное внимание к вышеперечисленным задачам будет значительно способствовать комфортной и производительной работе с СУБД.

source: Routine Vacuuming
ru: Регламентная очистка

source: <primary>vacuum</primary>
ru: <primary>очистка</primary>

source: <productname>PostgreSQL</productname> databases require periodic maintenance known as <firstterm>vacuuming</firstterm>. For many installations, it is sufficient to let vacuuming be performed by the <firstterm>autovacuum daemon</firstterm>, which is described in <xref linkend="autovacuum"/>. You might need to adjust the autovacuuming parameters described there to obtain best results for your situation. Some database administrators will want to supplement or replace the daemon's activities with manually-managed <command>VACUUM</command> commands, which typically are executed according to a schedule by <application>cron</application> or <application>Task Scheduler</application> scripts. To set up manually-managed vacuuming properly, it is essential to understand the issues discussed in the next few subsections. Administrators who rely on autovacuuming may still wish to skim this material to help them understand and adjust autovacuuming.
ru: Базы данных <productname>PostgreSQL</productname> требуют периодического проведения процедуры обслуживания, которая называется <firstterm>очисткой</firstterm>. Во многих случаях очистку достаточно выполнять с помощью <firstterm>демона автоочистки</firstterm>, который описан в <xref remap="6" linkend="autovacuum"/>. Возможно, в вашей ситуации для получения оптимальных результатов потребуется настроить описанные там же параметры автоочистки. Некоторые администраторы СУБД могут дополнить или заменить действие этого демона командами <command>VACUUM</command> (обычно они выполняются по расписанию в заданиях <application>cron</application> или <application>Планировщика задач</application>). Чтобы правильно организовать очистку вручную, необходимо понимать темы, которые будут рассмотрены в следующих подразделах. Администраторы, которые полагаются на автоочистку, возможно, всё же захотят просмотреть этот материал, чтобы лучше понимать и настраивать эту процедуру.

source: Vacuuming Basics
ru: Основные принципы очистки

source: To recover or reuse disk space occupied by updated or deleted rows.
ru: Для высвобождения или повторного использования дискового пространства, занятого изменёнными или удалёнными строками.

source: To update data statistics used by the <productname>PostgreSQL</productname> query planner.
ru: Для обновления статистики по данным, используемой планировщиком запросов <productname>PostgreSQL</productname>.

source: To update the visibility map, which speeds up <link linkend="indexes-index-only-scans">index-only scans</link>.
ru: Для обновления карты видимости, которая ускоряет <link linkend="indexes-index-only-scans">сканирование только индекса</link>.

source: To protect against loss of very old data due to <firstterm>transaction ID wraparound</firstterm> or <firstterm>multixact ID wraparound</firstterm>.
ru: Для предотвращения потери очень старых данных из-за зацикливания идентификаторов <firstterm>транзакций</firstterm> или <firstterm>мультитранзакций</firstterm>.

source: <productname>PostgreSQL</productname>'s <xref linkend="sql-vacuum"/> command has to process each table on a regular basis for several reasons: <placeholder-1/> Each of these reasons dictates performing <command>VACUUM</command> operations of varying frequency and scope, as explained in the following subsections.
ru: Команды <xref linkend="sql-vacuum"/> в <productname>PostgreSQL</productname> должны обрабатывать каждую таблицу по следующим причинам: <placeholder-1/> Разные причины диктуют выполнение действий <command>VACUUM</command> с разной частотой и в разном объёме, как рассматривается в следующих подразделах.

source: There are two variants of <command>VACUUM</command>: standard <command>VACUUM</command> and <command>VACUUM FULL</command>. <command>VACUUM FULL</command> can reclaim more disk space but runs much more slowly. Also, the standard form of <command>VACUUM</command> can run in parallel with production database operations. (Commands such as <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> will continue to function normally, though you will not be able to modify the definition of a table with commands such as <command>ALTER TABLE</command> while it is being vacuumed.) <command>VACUUM FULL</command> requires exclusive lock on the table it is working on, and therefore cannot be done in parallel with other use of the table. Generally, therefore, administrators should strive to use standard <command>VACUUM</command> and avoid <command>VACUUM FULL</command>.
ru: Существует два варианта <command>VACUUM</command>: обычный <command>VACUUM</command> и <command>VACUUM FULL</command>. Команда <command>VACUUM FULL</command> может высвободить больше дискового пространства, однако работает медленнее. Кроме того, обычная команда <command>VACUUM</command> может выполняться параллельно с использованием производственной базы данных. (При этом такие команды как <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> будут выполняться нормально, хотя нельзя будет изменить определение таблицы командами типа <command>ALTER TABLE</command>.) Команда <command>VACUUM FULL</command> требует исключительной блокировки обрабатываемой таблицы и поэтому не может выполняться параллельно с другими операциями с этой таблицей. По этой причине администраторы, как правило, должны стараться использовать обычную команду <command>VACUUM</command> и избегать <command>VACUUM FULL</command>.

source: <command>VACUUM</command> creates a substantial amount of I/O traffic, which can cause poor performance for other active sessions. There are configuration parameters that can be adjusted to reduce the performance impact of background vacuuming &mdash; see <xref linkend="runtime-config-resource-vacuum-cost"/>.
ru: Команда <command>VACUUM</command> порождает существенный объём трафика ввода/вывода, который может стать причиной низкой производительности в других активных сеансах. Это влияние фоновой очистки можно регулировать, настраивая параметры конфигурации (см. <xref remap="4" linkend="runtime-config-resource-vacuum-cost"/>).

source: Recovering Disk Space
ru: Высвобождение дискового пространства

source: <primary>disk space</primary>
ru: <primary>дисковое пространство</primary>

source: In <productname>PostgreSQL</productname>, an <command>UPDATE</command> or <command>DELETE</command> of a row does not immediately remove the old version of the row. This approach is necessary to gain the benefits of multiversion concurrency control (<acronym>MVCC</acronym>, see <xref linkend="mvcc"/>): the row version must not be deleted while it is still potentially visible to other transactions. But eventually, an outdated or deleted row version is no longer of interest to any transaction. The space it occupies must then be reclaimed for reuse by new rows, to avoid unbounded growth of disk space requirements. This is done by running <command>VACUUM</command>.
ru: В <productname>PostgreSQL</productname> команды <command>UPDATE</command> или <command>DELETE</command> не вызывают немедленного удаления старой версии изменяемых строк. Этот подход необходим для реализации эффективного многоверсионного управления конкурентным доступом (<acronym>MVCC</acronym>, см. <xref remap="4" linkend="mvcc"/>): версия строки не должна удаляться до тех пор, пока она остаётся потенциально видимой для других транзакций. Однако в конце концов устаревшая или удалённая версия строки оказывается не нужна ни одной из транзакций. После этого занимаемое ей место должно быть освобождено и может быть отдано новым строкам, во избежание неограниченного роста потребности в дисковом пространстве. Это происходит при выполнении команды <command>VACUUM</command>.

source: The standard form of <command>VACUUM</command> removes dead row versions in tables and indexes and marks the space available for future reuse. However, it will not return the space to the operating system, except in the special case where one or more pages at the end of a table become entirely free and an exclusive table lock can be easily obtained. In contrast, <command>VACUUM FULL</command> actively compacts tables by writing a complete new version of the table file with no dead space. This minimizes the size of the table, but can take a long time. It also requires extra disk space for the new copy of the table, until the operation completes.
ru: Обычная форма <command>VACUUM</command> удаляет неиспользуемые версии строк в таблицах и индексах и помечает пространство свободным для дальнейшего использования. Однако это дисковое пространство не возвращается операционной системе, кроме особого случая, когда полностью освобождаются одна или несколько страниц в конце таблицы и можно легко получить исключительную блокировку таблицы. Команда <command>VACUUM FULL</command>, напротив, кардинально сжимает таблицы, записывая абсолютно новую версию файла таблицы без неиспользуемого пространства. Это минимизирует размер таблицы, однако может занять много времени. Кроме того, для этого требуется больше места на диске для записи новой копии таблицы до завершения операции.

source: The usual goal of routine vacuuming is to do standard <command>VACUUM</command>s often enough to avoid needing <command>VACUUM FULL</command>. The autovacuum daemon attempts to work this way, and in fact will never issue <command>VACUUM FULL</command>. In this approach, the idea is not to keep tables at their minimum size, but to maintain steady-state usage of disk space: each table occupies space equivalent to its minimum size plus however much space gets used up between vacuumings. Although <command>VACUUM FULL</command> can be used to shrink a table back to its minimum size and return the disk space to the operating system, there is not much point in this if the table will just grow again in the future. Thus, moderately-frequent standard <command>VACUUM</command> runs are a better approach than infrequent <command>VACUUM FULL</command> runs for maintaining heavily-updated tables.
ru: Обычно цель регулярной очистки — выполнять простую очистку (<command>VACUUM</command>) достаточно часто, чтобы не возникала необходимость в <command>VACUUM FULL</command>. Демон автоочистки пытается работать в этом режиме, и на самом деле он сам никогда не выполняет <command>VACUUM FULL</command>. Основная идея такого подхода не в том, чтобы минимизировать размер таблиц, а в том, чтобы поддерживать использование дискового пространства на стабильном уровне: каждая таблица занимает объём, равный её минимальному размеру, плюс объём, который был занят между процедурами очистки. Хотя с помощью <command>VACUUM FULL</command> можно сжать таблицу до минимума и возвратить дисковое пространство операционной системе, большого смысла в этом нет, если в будущем таблица так же вырастет снова. Следовательно, для активно изменяемых таблиц лучше с умеренной частотой выполнять <command>VACUUM</command>, чем очень редко выполнять <command>VACUUM FULL</command>.

source: Some administrators prefer to schedule vacuuming themselves, for example doing all the work at night when load is low. The difficulty with doing vacuuming according to a fixed schedule is that if a table has an unexpected spike in update activity, it may get bloated to the point that <command>VACUUM FULL</command> is really necessary to reclaim space. Using the autovacuum daemon alleviates this problem, since the daemon schedules vacuuming dynamically in response to update activity. It is unwise to disable the daemon completely unless you have an extremely predictable workload. One possible compromise is to set the daemon's parameters so that it will only react to unusually heavy update activity, thus keeping things from getting out of hand, while scheduled <command>VACUUM</command>s are expected to do the bulk of the work when the load is typical.
ru: Некоторые администраторы предпочитают планировать очистку БД самостоятельно, например, проводя все работы ночью в период низкой загрузки. Однако очистка только по фиксированному расписанию плоха тем, что при резком скачке интенсивности изменений таблица может разрастить настолько, что для высвобождения пространства действительно понадобится выполнить <command>VACUUM FULL</command>. Использование демона автоочистки снимает эту проблему, поскольку он планирует очистку динамически, отслеживая интенсивность изменений. Полностью отключать этот демон может иметь смысл, только если вы имеете дело с предельно предсказуемой загрузкой. Возможен и компромиссный вариант — настроить параметры демона автоочистки так, чтобы он реагировал только на необычайно высокую интенсивность изменений и мог удержать ситуацию под контролем, в то время как команды <command>VACUUM</command>, запускаемые по расписанию, будут выполнять основную работу в периоды нормальной загрузки.

source: For those not using autovacuum, a typical approach is to schedule a database-wide <command>VACUUM</command> once a day during a low-usage period, supplemented by more frequent vacuuming of heavily-updated tables as necessary. (Some installations with extremely high update rates vacuum their busiest tables as often as once every few minutes.) If you have multiple databases in a cluster, don't forget to <command>VACUUM</command> each one; the program <xref linkend="app-vacuumdb"/> might be helpful.
ru: Если же автоочистка не применяется, обычно планируется выполнение <command>VACUUM</command> для всей базы данных раз в сутки в период низкой активности, и в случае необходимости оно дополняется более частой очисткой интенсивно изменяемых таблиц. (В некоторых ситуациях, когда изменения производятся крайне интенсивно, самые востребованные таблицы могут очищаться раз в несколько минут.) Если в вашем кластере несколько баз данных, не забывайте выполнять <command>VACUUM</command> для каждой из них; при этом может быть полезна программа <xref linkend="app-vacuumdb"/>.

source: Plain <command>VACUUM</command> may not be satisfactory when a table contains large numbers of dead row versions as a result of massive update or delete activity. If you have such a table and you need to reclaim the excess disk space it occupies, you will need to use <command>VACUUM FULL</command>, or alternatively <xref linkend="sql-cluster"/> or one of the table-rewriting variants of <xref linkend="sql-altertable"/>. These commands rewrite an entire new copy of the table and build new indexes for it. All these options require exclusive lock. Note that they also temporarily use extra disk space approximately equal to the size of the table, since the old copies of the table and indexes can't be released until the new ones are complete.
ru: Результат обычного <command>VACUUM</command> может быть неудовлетворительным, когда вследствие массового изменения или удаления строк в таблице оказывается много мёртвых версий строк. Если у вас есть такая таблица и вам нужно освободить лишнее пространство, которое она занимает, используйте команду <command>VACUUM FULL</command> или, в качестве альтернативы, <xref linkend="sql-cluster"/> или один из вариантов <xref linkend="sql-altertable"/>, выполняющий перезапись таблицы. Эти команды записывают абсолютно новую копию таблицы и строят для неё индексы. Все эти варианты требуют исключительной блокировки. Заметьте, что они также на время требуют дополнительного пространства на диске в объёме, приблизительно равном размеру таблицы, поскольку старые копии таблицы и индексов нельзя удалить до завершения создания новых копий.

source: If you have a table whose entire contents are deleted on a periodic basis, consider doing it with <xref linkend="sql-truncate"/> rather than using <command>DELETE</command> followed by <command>VACUUM</command>. <command>TRUNCATE</command> removes the entire content of the table immediately, without requiring a subsequent <command>VACUUM</command> or <command>VACUUM FULL</command> to reclaim the now-unused disk space. The disadvantage is that strict MVCC semantics are violated.
ru: Если у вас есть таблица, всё содержимое которой периодически удаляется, рассмотрите возможность использования <xref linkend="sql-truncate"/> вместо <command>DELETE</command> с последующей командой <command>VACUUM</command>. <command>TRUNCATE</command> немедленно удаляет всё содержимое таблицы, не требуя последующей очистки (<command>VACUUM</command> или <command>VACUUM FULL</command>) для высвобождения неиспользуемого дискового пространства. Недостатком такого подхода является нарушение строгой семантики MVCC.

source: Updating Planner Statistics
ru: Обновление статистики планировщика

source: <primary>statistics</primary> <secondary>of the planner</secondary>
ru: <primary>статистика</primary> <secondary>планировщика</secondary>

source: The <productname>PostgreSQL</productname> query planner relies on statistical information about the contents of tables in order to generate good plans for queries. These statistics are gathered by the <xref linkend="sql-analyze"/> command, which can be invoked by itself or as an optional step in <command>VACUUM</command>. It is important to have reasonably accurate statistics, otherwise poor choices of plans might degrade database performance.
ru: Планировщик запросов в <productname>PostgreSQL</productname>, выбирая эффективные планы запросов, полагается на статистическую информацию о содержимом таблиц. Эта статистика собирается командой <xref linkend="sql-analyze"/>, которая может вызываться сама по себе или как дополнительное действие команды <command>VACUUM</command>. Статистика должна быть достаточно точной, так как в противном случае неудачно выбранные планы запросов могут снизить производительность базы данных.

source: The autovacuum daemon, if enabled, will automatically issue <command>ANALYZE</command> commands whenever the content of a table has changed sufficiently. However, administrators might prefer to rely on manually-scheduled <command>ANALYZE</command> operations, particularly if it is known that update activity on a table will not affect the statistics of <quote>interesting</quote> columns. The daemon schedules <command>ANALYZE</command> strictly as a function of the number of rows inserted or updated; it has no knowledge of whether that will lead to meaningful statistical changes.
ru: Демон автоочистки, если он включён, будет автоматически выполнять <command>ANALYZE</command> после существенных изменений содержимого таблицы. Однако администраторы могут предпочесть выполнение <command>ANALYZE</command> вручную, в частности, если известно, что производимые в таблице изменения не повлияют на статистику по <quote>интересным</quote> столбцам. Демон же планирует выполнение <command>ANALYZE</command> в зависимости только от количества вставленных или изменённых строк; он не знает, приведут ли они к значимым изменениям статистики.
