Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/perform.po
Languages: ru

source: Performance Tips
ru: Оптимизация производительности

source: <primary>performance</primary>
ru: <primary>производительность</primary>

source: Query performance can be affected by many things. Some of these can be controlled by the user, while others are fundamental to the underlying design of the system. This chapter provides some hints about understanding and tuning <productname>PostgreSQL</productname> performance.
ru: Быстродействие запросов зависит от многих факторов. На некоторые из них могут воздействовать пользователи, а другие являются фундаментальными особенностями системы. В этой главе приводятся полезные советы, которые помогут понять их и оптимизировать производительность <productname>PostgreSQL</productname>.

source: Using <command>EXPLAIN</command>
ru: Использование <command>EXPLAIN</command>

source: <primary>query plan</primary>
ru: <primary>план запроса</primary>

source: <productname>PostgreSQL</productname> devises a <firstterm>query plan</firstterm> for each query it receives. Choosing the right plan to match the query structure and the properties of the data is absolutely critical for good performance, so the system includes a complex <firstterm>planner</firstterm> that tries to choose good plans. You can use the <xref linkend="sql-explain"/> command to see what query plan the planner creates for any query. Plan-reading is an art that requires some experience to master, but this section attempts to cover the basics.
ru: Выполняя любой полученный запрос, <productname>PostgreSQL</productname> разрабатывает для него <firstterm>план запроса</firstterm>. Выбор правильного плана, соответствующего структуре запроса и характеристикам данным, крайне важен для хорошей производительности, поэтому в системе работает сложный <firstterm>планировщик</firstterm>, задача которого &mdash; подобрать хороший план. Узнать, какой план был выбран для какого-либо запроса, можно с помощью команды <xref linkend="sql-explain"/>. Понимание плана &mdash; это искусство, и чтобы овладеть им, нужен определённый опыт, но этот раздел расскажет о самых простых вещах.

source: Examples in this section are drawn from the regression test database after doing a <command>VACUUM ANALYZE</command>, using 9.3 development sources. You should be able to get similar results if you try the examples yourself, but your estimated costs and row counts might vary slightly because <command>ANALYZE</command>'s statistics are random samples rather than exact, and because costs are inherently somewhat platform-dependent.
ru: Приведённые ниже примеры показаны на тестовой базе данных, которая создаётся для выявления регрессий в исходных кодах <productname>PostgreSQL</productname> текущей версии. Для неё предварительно выполняется <command>VACUUM ANALYZE</command>. Вы должны получить похожие результаты, если возьмёте ту же базу данных и проделаете следующие действия, но примерная стоимость и ожидаемое число строк у вас может немного отличаться из-за того, что статистика команды <command>ANALYZE</command> рассчитывается по случайной выборке, а оценки стоимости зависят от конкретной платформы.

source: The examples use <command>EXPLAIN</command>'s default <quote>text</quote> output format, which is compact and convenient for humans to read. If you want to feed <command>EXPLAIN</command>'s output to a program for further analysis, you should use one of its machine-readable output formats (XML, JSON, or YAML) instead.
ru: В этих примерах используется текстовый формат вывода <command>EXPLAIN</command>, принятый по умолчанию, как более компактный и удобный для восприятия человеком. Если вывод <command>EXPLAIN</command> нужно передать какой-либо программе для дальнейшего анализа, лучше использовать один из машинно-ориентированных форматов (XML, JSON или YAML).

source: <command>EXPLAIN</command> Basics
ru: Азы <command>EXPLAIN</command>

source: The structure of a query plan is a tree of <firstterm>plan nodes</firstterm>. Nodes at the bottom level of the tree are scan nodes: they return raw rows from a table. There are different types of scan nodes for different table access methods: sequential scans, index scans, and bitmap index scans. There are also non-table row sources, such as <literal>VALUES</literal> clauses and set-returning functions in <literal>FROM</literal>, which have their own scan node types. If the query requires joining, aggregation, sorting, or other operations on the raw rows, then there will be additional nodes above the scan nodes to perform these operations. Again, there is usually more than one possible way to do these operations, so different node types can appear here too. The output of <command>EXPLAIN</command> has one line for each node in the plan tree, showing the basic node type plus the cost estimates that the planner made for the execution of that plan node. Additional lines might appear, indented from the node's summary line, to show additional properties of the node. The very first line (the summary line for the topmost node) has the estimated total execution cost for the plan; it is this number that the planner seeks to minimize.
ru: Структура плана запроса представляет собой дерево <firstterm>узлов плана</firstterm>. Узлы на нижнем уровне дерева &mdash; это узлы сканирования, которые возвращают необработанные данные таблицы. Разным типам доступа к таблице соответствуют разные узлы: последовательное сканирование, сканирование индекса и сканирование битовой карты. Источниками строк могут быть не только таблицы, но и например, предложения <literal>VALUES</literal> и функции, возвращающие множества во <literal>FROM</literal>, и они представляются отдельными типами узлов сканирования. Если запрос требует объединения, агрегатных вычислений, сортировки или других операций с исходными строками, над узлами сканирования появляются узлы, обозначающие эти операции. И так как обычно операции могут выполняться разными способами, на этом уровне тоже могут быть узлы разных типов. В выводе команды <command>EXPLAIN</command> для каждого узла в дереве плана отводится одна строка, где показывается базовый тип узла плюс оценка стоимости выполнения данного узла, которую сделал для него планировщик. Если для узла выводятся дополнительные свойства, в вывод могут добавляться дополнительные строки, с отступом от основной информации узла. В самой первой строке (основной строке самого верхнего узла) выводится общая стоимость выполнения для всего плана; именно это значение планировщик старается минимизировать.

source: Here is a trivial example, just to show what the output looks like: <screen> EXPLAIN SELECT * FROM tenk1; QUERY PLAN ------------------------------------------------------------- Seq Scan on tenk1 (cost=0.00..458.00 rows=10000 width=244) </screen>
ru: Взгляните на следующий простейший пример, просто иллюстрирующий формат вывода: <screen> EXPLAIN SELECT * FROM tenk1; QUERY PLAN ------------------------------------------------------------- Seq Scan on tenk1 (cost=0.00..458.00 rows=10000 width=244) </screen>

source: Estimated start-up cost. This is the time expended before the output phase can begin, e.g., time to do the sorting in a sort node.
ru: Приблизительная стоимость запуска. Это время, которое проходит, прежде чем начнётся этап вывода данных, например для сортирующего узла это время сортировки.

source: Estimated total cost. This is stated on the assumption that the plan node is run to completion, i.e., all available rows are retrieved. In practice a node's parent node might stop short of reading all available rows (see the <literal>LIMIT</literal> example below).
ru: Приблизительная общая стоимость. Она вычисляется в предположении, что узел плана выполняется до конца, то есть возвращает все доступные строки. На практике родительский узел может досрочно прекратить чтение строк дочернего (см. приведённый ниже пример с <literal>LIMIT</literal>).

source: Estimated number of rows output by this plan node. Again, the node is assumed to be run to completion.
ru: Ожидаемое число строк, которое должен вывести этот узел плана. При этом так же предполагается, что узел выполняется до конца.

source: Estimated average width of rows output by this plan node (in bytes).
ru: Ожидаемый средний размер строк, выводимых этим узлом плана (в байтах).

source: Since this query has no <literal>WHERE</literal> clause, it must scan all the rows of the table, so the planner has chosen to use a simple sequential scan plan. The numbers that are quoted in parentheses are (left to right): <placeholder-1/>
ru: Этот запрос не содержит предложения <literal>WHERE</literal>, поэтому он должен просканировать все строки таблицы, так что планировщик выбрал план простого последовательного сканирования. Числа, перечисленные в скобках (слева направо), имеют следующий смысл: <placeholder-1/>

source: The costs are measured in arbitrary units determined by the planner's cost parameters (see <xref linkend="runtime-config-query-constants"/>). Traditional practice is to measure the costs in units of disk page fetches; that is, <xref linkend="guc-seq-page-cost"/> is conventionally set to <literal>1.0</literal> and the other cost parameters are set relative to that. The examples in this section are run with the default cost parameters.
ru: Стоимость может измеряться в произвольных единицах, определяемых параметрами планировщика (см. <xref remap="4" linkend="runtime-config-query-constants"/>). Традиционно единицей стоимости считается операция чтения страницы с диска; то есть <xref remap="4" linkend="guc-seq-page-cost"/> обычно равен <literal>1.0</literal>, а другие параметры задаётся относительно него. Примеры в этом разделе выполняются со стандартными параметрами стоимости.

source: It's important to understand that the cost of an upper-level node includes the cost of all its child nodes. It's also important to realize that the cost only reflects things that the planner cares about. In particular, the cost does not consider the time spent transmitting result rows to the client, which could be an important factor in the real elapsed time; but the planner ignores it because it cannot change it by altering the plan. (Every correct plan will output the same row set, we trust.)
ru: Важно понимать, что стоимость узла верхнего уровня включает стоимость всех его потомков. Также важно осознавать, что эта стоимость отражает только те факторы, которые учитывает планировщик. В частности, она не зависит от времени, необходимого для передачи результирующих строк клиенту, хотя оно может составлять значительную часть общего времени выполнения запроса. Тем не менее планировщик игнорирует эту величину, так как он всё равно не сможет изменить её, выбрав другой план. (Мы верим в то, что любой правильный план запроса выдаёт один и тот же набор строк.)

source: The <literal>rows</literal> value is a little tricky because it is not the number of rows processed or scanned by the plan node, but rather the number emitted by the node. This is often less than the number scanned, as a result of filtering by any <literal>WHERE</literal>-clause conditions that are being applied at the node. Ideally the top-level rows estimate will approximate the number of rows actually returned, updated, or deleted by the query.
ru: Значение <literal>rows</literal> здесь имеет особенность &mdash; оно выражает не число строк, обработанных или просканированных узлом плана, а число строк, выданных этим узлом. Часто оно окажется меньше числа просканированных строк в результате применённой к узлу фильтрации по условиям <literal>WHERE</literal>. В идеале, на верхнем уровне это значение будет приблизительно равно числу строк, которое фактически возвращает, изменяет или удаляет запрос.

source: Returning to our example: <screen> EXPLAIN SELECT * FROM tenk1; QUERY PLAN ------------------------------------------------------------- Seq Scan on tenk1 (cost=0.00..458.00 rows=10000 width=244) </screen>
ru: Возвращаясь к нашему примеру: <screen> EXPLAIN SELECT * FROM tenk1; QUERY PLAN ------------------------------------------------------------- Seq Scan on tenk1 (cost=0.00..458.00 rows=10000 width=244) </screen>

source: These numbers are derived very straightforwardly. If you do: <placeholder-1/> you will find that <classname>tenk1</classname> has 358 disk pages and 10000 rows. The estimated cost is computed as (disk pages read * <xref linkend="guc-seq-page-cost"/>) + (rows scanned * <xref linkend="guc-cpu-tuple-cost"/>). By default, <varname>seq_page_cost</varname> is 1.0 and <varname>cpu_tuple_cost</varname> is 0.01, so the estimated cost is (358 * 1.0) + (10000 * 0.01) = 458.
ru: Эти числа получаются очень просто. Выполните: <placeholder-1/> и вы увидите, что <classname>tenk1</classname> содержит 358 страниц диска и 10000 строк. Общая стоимость вычисляется как (число_чтений_диска * <xref linkend="guc-seq-page-cost"/>) + (число_просканированных_строк * <xref linkend="guc-cpu-tuple-cost"/>). По умолчанию, <varname>seq_page_cost</varname> равно 1.0, а <varname>cpu_tuple_cost</varname> &mdash; 0.01, так что приблизительная стоимость запроса равна (358 * 1.0) + (10000 * 0.01) = 458.

source: Now let's modify the query to add a <literal>WHERE</literal> condition: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 7000; QUERY PLAN ------------------------------------------------------------ Seq Scan on tenk1 (cost=0.00..483.00 rows=7001 width=244) Filter: (unique1 &lt; 7000) </screen> Notice that the <command>EXPLAIN</command> output shows the <literal>WHERE</literal> clause being applied as a <quote>filter</quote> condition attached to the Seq Scan plan node. This means that the plan node checks the condition for each row it scans, and outputs only the ones that pass the condition. The estimate of output rows has been reduced because of the <literal>WHERE</literal> clause. However, the scan will still have to visit all 10000 rows, so the cost hasn't decreased; in fact it has gone up a bit (by 10000 * <xref linkend="guc-cpu-operator-cost"/>, to be exact) to reflect the extra CPU time spent checking the <literal>WHERE</literal> condition.
ru: Теперь давайте изменим запрос, добавив в него предложение <literal>WHERE</literal>: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 7000; QUERY PLAN ------------------------------------------------------------ Seq Scan on tenk1 (cost=0.00..483.00 rows=7001 width=244) Filter: (unique1 &lt; 7000) </screen> Заметьте, что в выводе <command>EXPLAIN</command> показано, что условие <literal>WHERE</literal> применено как <quote>фильтр</quote> к узлу плана Seq Scan (Последовательное сканирование). Это означает, что узел плана проверяет это условие для каждого просканированного им узла и выводит только те строки, которые удовлетворяют ему. Предложение <literal>WHERE</literal> повлияло на оценку числа выходных строк. Однако при сканировании потребуется прочитать все 10000 строк, поэтому общая стоимость не уменьшилась. На деле она даже немного увеличилась (на 10000 * <xref linkend="guc-cpu-operator-cost"/>, если быть точными), отражая дополнительное время, которое потребуется процессору на проверку условия <literal>WHERE</literal>.

source: The actual number of rows this query would select is 7000, but the <literal>rows</literal> estimate is only approximate. If you try to duplicate this experiment, you will probably get a slightly different estimate; moreover, it can change after each <command>ANALYZE</command> command, because the statistics produced by <command>ANALYZE</command> are taken from a randomized sample of the table.
ru: Фактическое число строк результата этого запроса будет равно 7000, но значение <literal>rows</literal> даёт только приблизительное значение. Если вы попытаетесь повторить этот эксперимент, вы можете получить немного другую оценку; более того, она может меняться после каждой команды <command>ANALYZE</command>, так как <command>ANALYZE</command> получает статистику по случайной выборке таблицы.

source: Now, let's make the condition more restrictive: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 100; QUERY PLAN ------------------------------------------------------------------------------ Bitmap Heap Scan on tenk1 (cost=5.07..229.20 rows=101 width=244) Recheck Cond: (unique1 &lt; 100) -&gt; Bitmap Index Scan on tenk1_unique1 (cost=0.00..5.04 rows=101 width=0) Index Cond: (unique1 &lt; 100) </screen> Here the planner has decided to use a two-step plan: the child plan node visits an index to find the locations of rows matching the index condition, and then the upper plan node actually fetches those rows from the table itself. Fetching rows separately is much more expensive than reading them sequentially, but because not all the pages of the table have to be visited, this is still cheaper than a sequential scan. (The reason for using two plan levels is that the upper plan node sorts the row locations identified by the index into physical order before reading them, to minimize the cost of separate fetches. The <quote>bitmap</quote> mentioned in the node names is the mechanism that does the sorting.)
ru: Теперь давайте сделаем ограничение более избирательным: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 100; QUERY PLAN -------------------------------------------------------------------------- Bitmap Heap Scan on tenk1 (cost=5.07..229.20 rows=101 width=244) Recheck Cond: (unique1 &lt; 100) -&gt; Bitmap Index Scan on tenk1_unique1 (cost=0.00..5.01 rows=101 width=0) Index Cond: (unique1 &lt; 100) </screen> В данном случае планировщик решил использовать план из двух этапов: сначала дочерний узел плана просматривает индекс и находит в нём адреса строк, соответствующих условию индекса, а затем верхний узел собственно выбирает эти строки из таблицы. Выбирать строки по отдельности гораздо дороже, чем просто читать их последовательно, но так как читать придётся не все страницы таблицы, это всё равно будет дешевле, чем сканировать всю таблицу. (Использование двух уровней плана объясняется тем, что верхний узел сортирует адреса строк, выбранных из индекса, в физическом порядке, прежде чем читать, чтобы снизить стоимость отдельных чтений. Слово <quote>bitmap</quote> (битовая карта) в имени узла обозначает механизм, выполняющий сортировку.)

source: Now let's add another condition to the <literal>WHERE</literal> clause: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 100 AND stringu1 = 'xxx'; QUERY PLAN ------------------------------------------------------------------------------ Bitmap Heap Scan on tenk1 (cost=5.04..229.43 rows=1 width=244) Recheck Cond: (unique1 &lt; 100) Filter: (stringu1 = 'xxx'::name) -&gt; Bitmap Index Scan on tenk1_unique1 (cost=0.00..5.04 rows=101 width=0) Index Cond: (unique1 &lt; 100) </screen> The added condition <literal>stringu1 = 'xxx'</literal> reduces the output row count estimate, but not the cost because we still have to visit the same set of rows. Notice that the <literal>stringu1</literal> clause cannot be applied as an index condition, since this index is only on the <literal>unique1</literal> column. Instead it is applied as a filter on the rows retrieved by the index. Thus the cost has actually gone up slightly to reflect this extra checking.
ru: Теперь давайте добавим ещё одно условие в предложение <literal>WHERE</literal>: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 100 AND stringu1 = 'xxx'; QUERY PLAN -------------------------------------------------------------------------- Bitmap Heap Scan on tenk1 (cost=5.01..229.40 rows=1 width=244) Recheck Cond: (unique1 &lt; 100) Filter: (stringu1 = 'xxx'::name) -&gt; Bitmap Index Scan on tenk1_unique1 (cost=0.00..5.04 rows=101 width=0) Index Cond: (unique1 &lt; 100) </screen> Добавленное условие <literal>stringu1 = 'xxx'</literal> уменьшает оценку числа результирующих строк, но не стоимость запроса, так как просматриваться будет тот же набор строк, что и раньше. Заметьте, что условие на <literal>stringu1</literal> не добавляется в качестве условия индекса, так как индекс построен только по столбцу <literal>unique1</literal>. Вместо этого оно применяется как фильтр к строкам, полученным по индексу. В результате стоимость даже немного увеличилась, отражая добавление этой проверки.

source: In some cases the planner will prefer a <quote>simple</quote> index scan plan: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 = 42; QUERY PLAN ----------------------------------------------------------------------------- Index Scan using tenk1_unique1 on tenk1 (cost=0.29..8.30 rows=1 width=244) Index Cond: (unique1 = 42) </screen> In this type of plan the table rows are fetched in index order, which makes them even more expensive to read, but there are so few that the extra cost of sorting the row locations is not worth it. You'll most often see this plan type for queries that fetch just a single row. It's also often used for queries that have an <literal>ORDER BY</literal> condition that matches the index order, because then no extra sorting step is needed to satisfy the <literal>ORDER BY</literal>.
ru: В некоторых случаях планировщик предпочтёт <quote>простой</quote> план сканирования индекса: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 = 42; QUERY PLAN --------------------------------------------------------------------------- Index Scan using tenk1_unique1 on tenk1 (cost=0.29..8.30 rows=1 width=244) Index Cond: (unique1 = 42) </screen> В плане такого типа строки таблицы выбираются в порядке индекса, в результате чего чтение их обходится дороже, но так как их немного, дополнительно сортировать положения строк не стоит. Вы часто будете встречать этот тип плана в запросах, которые выбирают всего одну строку. Также он часто задействуется там, где условие <literal>ORDER BY</literal> соответствует порядку индекса, так как в этих случаях для выполнения <literal>ORDER BY</literal> не требуется дополнительный шаг сортировки.

source: If there are separate indexes on several of the columns referenced in <literal>WHERE</literal>, the planner might choose to use an AND or OR combination of the indexes: <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 100 AND unique2 &gt; 9000; QUERY PLAN ------------------------------------------------------------------------------------- Bitmap Heap Scan on tenk1 (cost=25.08..60.21 rows=10 width=244) Recheck Cond: ((unique1 &lt; 100) AND (unique2 &gt; 9000)) -&gt; BitmapAnd (cost=25.08..25.08 rows=10 width=0) -&gt; Bitmap Index Scan on tenk1_unique1 (cost=0.00..5.04 rows=101 width=0) Index Cond: (unique1 &lt; 100) -&gt; Bitmap Index Scan on tenk1_unique2 (cost=0.00..19.78 rows=999 width=0) Index Cond: (unique2 &gt; 9000) </screen> But this requires visiting both indexes, so it's not necessarily a win compared to using just one index and treating the other condition as a filter. If you vary the ranges involved you'll see the plan change accordingly.
ru: Если в таблице есть отдельные индексы по разным столбцам, фигурирующим в <literal>WHERE</literal>, планировщик может выбрать сочетание этих индексов (с AND и OR): <screen> EXPLAIN SELECT * FROM tenk1 WHERE unique1 &lt; 100 AND unique2 &gt; 9000; QUERY PLAN ------------------------------------------------------------------------------------- Bitmap Heap Scan on tenk1 (cost=25.08..60.21 rows=10 width=244) Recheck Cond: ((unique1 &lt; 100) AND (unique2 &gt; 9000)) -&gt; BitmapAnd (cost=25.08..25.08 rows=10 width=0) -&gt; Bitmap Index Scan on tenk1_unique1 (cost=0.00..5.04 rows=101 width=0) Index Cond: (unique1 &lt; 100) -&gt; Bitmap Index Scan on tenk1_unique2 (cost=0.00..19.78 rows=999 width=0) Index Cond: (unique2 &gt; 9000) </screen> Но для этого потребуется обойти оба индекса, так что это не обязательно будет выгоднее, чем просто просмотреть один индекс, а второе условие обработать как фильтр. Измените диапазон и вы увидите, как это повлияет на план.
