Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/perform.po
Languages: ru

source: There are cases in which the actual and estimated values won't match up well, but nothing is really wrong. One such case occurs when plan node execution is stopped short by a <literal>LIMIT</literal> or similar effect. For example, in the <literal>LIMIT</literal> query we used before, <screen> EXPLAIN ANALYZE SELECT * FROM tenk1 WHERE unique1 &lt; 100 AND unique2 &gt; 9000 LIMIT 2; QUERY PLAN ------------------------------------------------------------------------------------------------------------------------------- Limit (cost=0.29..14.71 rows=2 width=244) (actual time=0.177..0.249 rows=2 loops=1) -&gt; Index Scan using tenk1_unique2 on tenk1 (cost=0.29..72.42 rows=10 width=244) (actual time=0.174..0.244 rows=2 loops=1) Index Cond: (unique2 &gt; 9000) Filter: (unique1 &lt; 100) Rows Removed by Filter: 287 Planning time: 0.096 ms Execution time: 0.336 ms </screen> the estimated cost and row count for the Index Scan node are shown as though it were run to completion. But in reality the Limit node stopped requesting rows after it got two, so the actual row count is only 2 and the run time is less than the cost estimate would suggest. This is not an estimation error, only a discrepancy in the way the estimates and true values are displayed.
ru: Бывает, что фактическое и приближённо оценённое значения не совпадают, но в этом нет ничего плохого. Например, это возможно, когда выполнение плана узла прекращается преждевременно из-за указания <literal>LIMIT</literal> или подобного эффекта. Например, для запроса с <literal>LIMIT</literal>, который мы пробовали раньше: <screen> EXPLAIN ANALYZE SELECT * FROM tenk1 WHERE unique1 &lt; 100 AND unique2 &gt; 9000 LIMIT 2; QUERY PLAN ------------------------------------------------------------------------------------------------------------------------------- Limit (cost=0.29..14.71 rows=2 width=244) (actual time=0.177..0.249 rows=2 loops=1) -&gt; Index Scan using tenk1_unique2 on tenk1 (cost=0.29..72.42 rows=10 width=244) (actual time=0.174..0.244 rows=2 loops=1) Index Cond: (unique2 &gt; 9000) Filter: (unique1 &lt; 100) Rows Removed by Filter: 287 Planning time: 0.096 ms Execution time: 0.336 ms </screen> Оценки стоимости и числа строк для узла Index Scan показываются в предположении, что этот узел будет выполняться до конца. Но в действительности узел Limit прекратил запрашивать строки, как только получил первые две, так что фактическое число строк равно 2 и время выполнения запроса будет меньше, чем рассчитал планировщик. Но это не ошибка, а просто следствие того, что оценённые и фактические значения выводятся по-разному.

source: Merge joins also have measurement artifacts that can confuse the unwary. A merge join will stop reading one input if it's exhausted the other input and the next key value in the one input is greater than the last key value of the other input; in such a case there can be no more matches and so no need to scan the rest of the first input. This results in not reading all of one child, with results like those mentioned for <literal>LIMIT</literal>. Also, if the outer (first) child contains rows with duplicate key values, the inner (second) child is backed up and rescanned for the portion of its rows matching that key value. <command>EXPLAIN ANALYZE</command> counts these repeated emissions of the same inner rows as if they were real additional rows. When there are many outer duplicates, the reported actual row count for the inner child plan node can be significantly larger than the number of rows that are actually in the inner relation.
ru: Соединения слиянием также имеют свои особенности, которые могут ввести в заблуждение. Соединение слиянием прекратит читать один источник данных, если второй будет прочитан до конца, а следующее значение ключа в первом больше последнего значения во втором. В этом случае пар строк больше не будет, так что сканировать первый источник дальше нет смысла. В результате будут прочитаны не все строки одного потомка и вы получите тот же эффект, что и с <literal>LIMIT</literal>. Кроме того, если внешний (первый) потомок содержит строки с повторяющимися значениями ключа, внутренний (второй) потомок сдвинется назад и повторно выдаст строки для этого значения ключа. <command>EXPLAIN ANALYZE</command> считает эти повторяющиеся строки, как если бы это действительно были дополнительные строки внутреннего источника. Когда во внешнем узле много таких повторений ключей, фактическое число строк, подсчитанное для внутреннего узла, может значительно превышать число строк в соответствующей таблице.

source: BitmapAnd and BitmapOr nodes always report their actual row counts as zero, due to implementation limitations.
ru: Для узлов BitmapAnd (Логическое произведение битовых карт) и BitmapOr (Логическое сложение битовых карт) фактическое число строк всегда равно 0 из-за ограничений реализации.

source: Statistics Used by the Planner
ru: Статистика, используемая планировщиком

source: <primary>statistics</primary> <secondary>of the planner</secondary>
ru: <primary>статистика</primary> <secondary>планировщика</secondary>

source: Single-Column Statistics
ru: Статистика по одному столбцу

source: As we saw in the previous section, the query planner needs to estimate the number of rows retrieved by a query in order to make good choices of query plans. This section provides a quick look at the statistics that the system uses for these estimates.
ru: Как было показано в предыдущем разделе, планировщик запросов должен оценить число строк, возвращаемых запросов, чтобы сделать правильный выбор в отношении плана запроса. В этом разделе кратко описывается статистика, которую использует система для этих оценок.

source: One component of the statistics is the total number of entries in each table and index, as well as the number of disk blocks occupied by each table and index. This information is kept in the table <link linkend="catalog-pg-class"><structname>pg_class</structname></link>, in the columns <structfield>reltuples</structfield> and <structfield>relpages</structfield>. We can look at it with queries similar to this one: <screen> SELECT relname, relkind, reltuples, relpages FROM pg_class WHERE relname LIKE 'tenk1%'; relname | relkind | reltuples | relpages ----------------------+---------+-----------+---------- tenk1 | r | 10000 | 358 tenk1_hundred | i | 10000 | 30 tenk1_thous_tenthous | i | 10000 | 30 tenk1_unique1 | i | 10000 | 30 tenk1_unique2 | i | 10000 | 30 (5 rows) </screen> Here we can see that <structname>tenk1</structname> contains 10000 rows, as do its indexes, but the indexes are (unsurprisingly) much smaller than the table.
ru: В частности, статистика включает общее число записей в каждой таблице и индексе, а также число дисковых блоков, которые они занимают. Эта информация содержится в таблице <link linkend="catalog-pg-class"><structname>pg_class</structname></link>, в столбцах <structfield>reltuples</structfield> и <structfield>relpages</structfield>. Получить её можно, например так: <screen> SELECT relname, relkind, reltuples, relpages FROM pg_class WHERE relname LIKE 'tenk1%'; relname | relkind | reltuples | relpages ----------------------+---------+-----------+---------- tenk1 | r | 10000 | 358 tenk1_hundred | i | 10000 | 30 tenk1_thous_tenthous | i | 10000 | 30 tenk1_unique1 | i | 10000 | 30 tenk1_unique2 | i | 10000 | 30 (5 rows) </screen> Здесь мы видим, что <structname>tenk1</structname> содержит 10000 строк данных и столько же строк в индексах (что неудивительно), но объём индексов гораздо меньше таблицы.

source: For efficiency reasons, <structfield>reltuples</structfield> and <structfield>relpages</structfield> are not updated on-the-fly, and so they usually contain somewhat out-of-date values. They are updated by <command>VACUUM</command>, <command>ANALYZE</command>, and a few DDL commands such as <command>CREATE INDEX</command>. A <command>VACUUM</command> or <command>ANALYZE</command> operation that does not scan the entire table (which is commonly the case) will incrementally update the <structfield>reltuples</structfield> count on the basis of the part of the table it did scan, resulting in an approximate value. In any case, the planner will scale the values it finds in <structname>pg_class</structname> to match the current physical table size, thus obtaining a closer approximation.
ru: Для большей эффективности <structfield>reltuples</structfield> и <structfield>relpages</structfield> не пересчитываются &laquo;на лету&raquo;, так что они обычно содержат несколько устаревшие значения. Их обновляют команды <command>VACUUM</command>, <command>ANALYZE</command> и несколько команд DDL, такие как <command>CREATE INDEX</command>. <command>VACUUM</command> и <command>ANALYZE</command> могут не сканировать всю таблицу (и обычно так и делают), а только вычислить приращение <structfield>reltuples</structfield> по части таблицы, так что результат остаётся приблизительным. В любом случае планировщик пересчитывает значения, полученные из <structname>pg_class</structname>, в пропорции к текущему физическому размеру таблицы и таким образом уточняет приближение.

source: Most queries retrieve only a fraction of the rows in a table, due to <literal>WHERE</literal> clauses that restrict the rows to be examined. The planner thus needs to make an estimate of the <firstterm>selectivity</firstterm> of <literal>WHERE</literal> clauses, that is, the fraction of rows that match each condition in the <literal>WHERE</literal> clause. The information used for this task is stored in the <link linkend="catalog-pg-statistic"><structname>pg_statistic</structname></link> system catalog. Entries in <structname>pg_statistic</structname> are updated by the <command>ANALYZE</command> and <command>VACUUM ANALYZE</command> commands, and are always approximate even when freshly updated.
ru: Большинство запросов возвращают не все строки таблицы, а только немногие из них, ограниченные условиями <literal>WHERE</literal>. Поэтому планировщику нужно оценить <firstterm>избирательность</firstterm> условий <literal>WHERE</literal>, то есть определить, какой процент строк будет соответствовать каждому условию в предложении <literal>WHERE</literal>. Нужная для этого информация хранится в системном каталоге <link linkend="catalog-pg-statistic"><structname>pg_statistic</structname></link>. Значения в <structname>pg_statistic</structname> обновляются командами <command>ANALYZE</command> и <command>VACUUM ANALYZE</command> и никогда не бывают точными, даже сразу после обновления.

source: Rather than look at <structname>pg_statistic</structname> directly, it's better to look at its view <link linkend="view-pg-stats"><structname>pg_stats</structname></link> when examining the statistics manually. <structname>pg_stats</structname> is designed to be more easily readable. Furthermore, <structname>pg_stats</structname> is readable by all, whereas <structname>pg_statistic</structname> is only readable by a superuser. (This prevents unprivileged users from learning something about the contents of other people's tables from the statistics. The <structname>pg_stats</structname> view is restricted to show only rows about tables that the current user can read.) For example, we might do: <screen> SELECT attname, inherited, n_distinct, array_to_string(most_common_vals, E'\n') as most_common_vals FROM pg_stats WHERE tablename = 'road'; attname | inherited | n_distinct | most_common_vals ---------+-----------+------------+------------------------------------ name | f | -0.363388 | I- 580 Ramp+ | | | I- 880 Ramp+ | | | Sp Railroad + | | | I- 580 + | | | I- 680 Ramp name | t | -0.284859 | I- 880 Ramp+ | | | I- 580 Ramp+ | | | I- 680 Ramp+ | | | I- 580 + | | | State Hwy 13 Ramp (2 rows) </screen> Note that two rows are displayed for the same column, one corresponding to the complete inheritance hierarchy starting at the <literal>road</literal> table (<literal>inherited</literal>=<literal>t</literal>), and another one including only the <literal>road</literal> table itself (<literal>inherited</literal>=<literal>f</literal>).
ru: Для исследования статистики лучше обращаться не непосредственно к таблице <structname>pg_statistic</structname>, а к представлению <link linkend="view-pg-stats"><structname>pg_stats</structname></link>, предназначенному для облегчения восприятия этой информации. Кроме того, представление <structname>pg_stats</structname> доступно для чтения всем, тогда как <structname>pg_statistic</structname> &mdash; только суперпользователям. (Это сделано для того, чтобы непривилегированные пользователи не могли ничего узнать о содержимом таблиц других людей из статистики. Представление <structname>pg_stats</structname> устроено так, что оно показывает строки только для тех таблиц, которые может читать данный пользователь.) Например, мы можем выполнить: <screen> SELECT attname, inherited, n_distinct, array_to_string(most_common_vals, E'\n') as most_common_vals FROM pg_stats WHERE tablename = 'road'; attname | inherited | n_distinct | most_common_vals ---------+-----------+------------+------------------------------------ name | f | -0.363388 | I- 580 Ramp+ | | | I- 880 Ramp+ | | | Sp Railroad + | | | I- 580 + | | | I- 680 Ramp name | t | -0.284859 | I- 880 Ramp+ | | | I- 580 Ramp+ | | | I- 680 Ramp+ | | | I- 580 + | | | State Hwy 13 Ramp (2 rows) </screen> Заметьте, что для одного столбца показываются две строки: одна соответствует полной иерархии наследования, построенной для таблицы <literal>road</literal> (<literal>inherited</literal>=<literal>t</literal>), и другая относится непосредственно к таблице <literal>road</literal> (<literal>inherited</literal>=<literal>f</literal>).

source: The amount of information stored in <structname>pg_statistic</structname> by <command>ANALYZE</command>, in particular the maximum number of entries in the <structfield>most_common_vals</structfield> and <structfield>histogram_bounds</structfield> arrays for each column, can be set on a column-by-column basis using the <command>ALTER TABLE SET STATISTICS</command> command, or globally by setting the <xref linkend="guc-default-statistics-target"/> configuration variable. The default limit is presently 100 entries. Raising the limit might allow more accurate planner estimates to be made, particularly for columns with irregular data distributions, at the price of consuming more space in <structname>pg_statistic</structname> and slightly more time to compute the estimates. Conversely, a lower limit might be sufficient for columns with simple data distributions.
ru: Объём информации, сохраняемой в <structname>pg_statistic</structname> командой <command>ANALYZE</command>, в частности максимальное число записей в массивах <structfield>most_common_vals</structfield> (самые популярные значения) и <structfield>histogram_bounds</structfield> (границы гистограмм) для каждого столбца, можно ограничить на уровне столбцов с помощью команды <command>ALTER TABLE SET STATISTICS</command> или глобально, установив параметр конфигурации <xref linkend="guc-default-statistics-target"/>. В настоящее время ограничение по умолчанию равно 100 записям. Увеличивая этот предел, можно увеличить точность оценок планировщика, особенно для столбцов с нерегулярным распределением данных, ценой большего объёма <structname>pg_statistic</structname> и, возможно, увеличения времени расчёта этой статистики. И напротив, для столбцов с простым распределением данных может быть достаточно меньшего предела.

source: Further details about the planner's use of statistics can be found in <xref linkend="planner-stats-details"/>.
ru: Подробнее использование статистики планировщиком описывается в <xref remap="6" linkend="planner-stats-details"/>.

source: Extended Statistics
ru: Расширенная статистика

source: <primary>correlation</primary> <secondary>in the query planner</secondary>
ru: <primary>корреляция</primary> <secondary>в планировщике запросов</secondary>

source: It is common to see slow queries running bad execution plans because multiple columns used in the query clauses are correlated. The planner normally assumes that multiple conditions are independent of each other, an assumption that does not hold when column values are correlated. Regular statistics, because of their per-individual-column nature, cannot capture any knowledge about cross-column correlation. However, <productname>PostgreSQL</productname> has the ability to compute <firstterm>multivariate statistics</firstterm>, which can capture such information.
ru: Часто наблюдается картина, когда медленное выполнение запросов объясняется плохим выбором плана из-за того, что несколько столбцов, фигурирующих в условиях запроса, оказываются связанными. Обычно планировщик полагает, что несколько условий не зависят друг от друга, а это предположение оказывается неверным, когда значения этих столбцов коррелируют. Обычная статистика, которая по природе своей строится по отдельным столбцам, не может выявить корреляции между столбцами. Однако <productname>PostgreSQL</productname> имеет возможность вычислять <firstterm>многовариантную статистику</firstterm>, которая может собирать необходимую для этого информацию.

source: Because the number of possible column combinations is very large, it's impractical to compute multivariate statistics automatically. Instead, <firstterm>extended statistics objects</firstterm>, more often called just <firstterm>statistics objects</firstterm>, can be created to instruct the server to obtain statistics across interesting sets of columns.
ru: Так как число возможных комбинаций столбцов очень велико, автоматически вычислять многовариантную статистику непрактично. Вместо этого можно создать <firstterm>объекты расширенной статистики</firstterm>, чаще называемые просто <firstterm>объектами статистики</firstterm>, чтобы сервер собирал статистику по некоторым наборам столбцов, представляющим интерес.

source: Statistics objects are created using <xref linkend="sql-createstatistics"/>, which see for more details. Creation of such an object merely creates a catalog entry expressing interest in the statistics. Actual data collection is performed by <command>ANALYZE</command> (either a manual command, or background auto-analyze). The collected values can be examined in the <link linkend="catalog-pg-statistic-ext"><structname>pg_statistic_ext</structname></link> catalog.
ru: Объекты статистики создаются командой <xref linkend="sql-createstatistics"/> (за подробностями обратитесь к её описанию). При создании такого объекта просто создаётся запись в каталоге, выражающая востребованность этой статистики. Собственно сбор данных выполняется командой <command>ANALYZE</command> (при запуске вручную или фоновом автоанализе). Изучить собранные значения можно в каталоге <link linkend="catalog-pg-statistic-ext"><structname>pg_statistic_ext</structname></link>.

source: <command>ANALYZE</command> computes extended statistics based on the same sample of table rows that it takes for computing regular single-column statistics. Since the sample size is increased by increasing the statistics target for the table or any of its columns (as described in the previous section), a larger statistics target will normally result in more accurate extended statistics, as well as more time spent calculating them.
ru: Команда <command>ANALYZE</command> вычисляет расширенную статистику по той же выборке строк таблицы, которая используется и для вычисления обычной статистики по отдельным столбцам. Так как размер выборки увеличивается с увеличением целевого ограничения статистики для таблицы или любых её столбцов (как описано в предыдущем разделе), при большем целевом ограничении обычно получается более точная расширенная статистика, но и времени на её вычисление требуется больше.

source: The following subsections describe the kinds of extended statistics that are currently supported.
ru: В следующих подразделах описываются виды расширенной статистики, поддерживаемые в настоящее время.

source: Functional Dependencies
ru: Функциональные зависимости

source: The simplest kind of extended statistics tracks <firstterm>functional dependencies</firstterm>, a concept used in definitions of database normal forms. We say that column <structfield>b</structfield> is functionally dependent on column <structfield>a</structfield> if knowledge of the value of <structfield>a</structfield> is sufficient to determine the value of <structfield>b</structfield>, that is there are no two rows having the same value of <structfield>a</structfield> but different values of <structfield>b</structfield>. In a fully normalized database, functional dependencies should exist only on primary keys and superkeys. However, in practice many data sets are not fully normalized for various reasons; intentional denormalization for performance reasons is a common example. Even in a fully normalized database, there may be partial correlation between some columns, which can be expressed as partial functional dependency.
ru: Простейший вид расширенной статистики отслеживает <firstterm>функциональные зависимости</firstterm> (это понятие используется в определении нормальных форм баз данных). Мы называем столбец <structfield>b</structfield> функционально зависимым от столбца <structfield>a</structfield>, если знания значения <structfield>a</structfield> достаточно для определения значения <structfield>b</structfield>, то есть не существует двух строк с одинаковыми значениями <structfield>a</structfield>, но разными значениями <structfield>b</structfield>. В полностью нормализованной базе данных функциональные зависимости должны существовать только в первичных ключах и суперключах. Однако на практике многие наборы данных не нормализуются полностью по разным причинам; например, денормализация часто производится намеренно по соображениям производительности.

source: The existence of functional dependencies directly affects the accuracy of estimates in certain queries. If a query contains conditions on both the independent and the dependent column(s), the conditions on the dependent columns do not further reduce the result size; but without knowledge of the functional dependency, the query planner will assume that the conditions are independent, resulting in underestimating the result size.
ru: Существование функциональных зависимостей напрямую влияет на точность оценок в определённых запросах. Если запрос содержит условия как по независимым, так и по зависимым столбцам, условия по зависимым столбцам дополнительно не сокращают размер результата. Однако без знания о функциональной зависимости планировщик запросов будет полагать, что все условия независимы, и недооценит размер результата.
