Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/perform.po
Languages: ru

source: Turn off <xref linkend="guc-synchronous-commit"/>; there might be no need to force <acronym>WAL</acronym> writes to disk on every commit. This setting does risk transaction loss (though not data corruption) in case of a crash of the <emphasis>database</emphasis>.
ru: Выключите <xref linkend="guc-synchronous-commit"/>; нет необходимости принудительно записывать <acronym>WAL</acronym> на диск при фиксации каждой транзакции. Но учтите, это может привести к потере транзакций (хотя данные останутся согласованными) в случае сбоя <emphasis>базы данных</emphasis>.

source: Turn off <xref linkend="guc-full-page-writes"/>; there is no need to guard against partial page writes.
ru: Выключите <xref linkend="guc-full-page-writes"/>; защита от частичной записи страниц не нужна.

source: Increase <xref linkend="guc-max-wal-size"/> and <xref linkend="guc-checkpoint-timeout"/>; this reduces the frequency of checkpoints, but increases the storage requirements of <filename>/pg_wal</filename>.
ru: Увеличьте <xref linkend="guc-max-wal-size"/> и <xref linkend="guc-checkpoint-timeout"/>; это уменьшит частоту контрольных точек, хотя объём <filename>/pg_wal</filename> при этом вырастет.

source: Create <link linkend="sql-createtable-unlogged">unlogged tables</link> to avoid <acronym>WAL</acronym> writes, though it makes the tables non-crash-safe.
ru: Создавайте <link linkend="sql-createtable-unlogged">нежурналируемые таблицы</link> для оптимизации записи в <acronym>WAL</acronym> (но учтите, что такие таблицы не защищены от сбоя).

source: Durability is a database feature that guarantees the recording of committed transactions even if the server crashes or loses power. However, durability adds significant database overhead, so if your site does not require such a guarantee, <productname>PostgreSQL</productname> can be configured to run much faster. The following are configuration changes you can make to improve performance in such cases. Except as noted below, durability is still guaranteed in case of a crash of the database software; only abrupt operating system stoppage creates a risk of data loss or corruption when these settings are used. <placeholder-1/>
ru: Стабильность &mdash; это свойство базы данных, гарантирующее, что результат зафиксированных транзакций будет сохранён даже в случае сбоя сервера или отключения питания. Однако обеспечивается стабильность за счёт значительной дополнительной нагрузки. Поэтому, если вы можете отказаться от такой гарантии, <productname>PostgreSQL</productname> можно ускорить ещё больше, применив следующие методы оптимизации. Кроме явно описанных исключений, даже с такими изменениями конфигурации при сбое программного ядра СУБД гарантия стабильности сохраняется; риск потери или разрушения данных возможен только в случае внезапной остановки операционной системы. <placeholder-1/>

source: Increase <xref linkend="guc-max-wal-size"/> and <xref linkend="guc-checkpoint-timeout"/> ; this reduces the frequency of checkpoints, but increases the storage requirements of <filename>/pg_xlog</filename>.
ru: Увеличьте <xref linkend="guc-max-wal-size"/> и <xref linkend="guc-checkpoint-timeout"/>; это уменьшит частоту контрольных точек, хотя объём <filename>/pg_xlog</filename> при этом вырастет.
