Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/perform.po
Languages: ru

source: When using multiple <command>INSERT</command>s, turn off autocommit and just do one commit at the end. (In plain SQL, this means issuing <command>BEGIN</command> at the start and <command>COMMIT</command> at the end. Some client libraries might do this behind your back, in which case you need to make sure the library does it when you want it done.) If you allow each insertion to be committed separately, <productname>PostgreSQL</productname> is doing a lot of work for each row that is added. An additional benefit of doing all insertions in one transaction is that if the insertion of one row were to fail then the insertion of all rows inserted up to that point would be rolled back, so you won't be stuck with partially loaded data.
ru: Выполняя серию команд <command>INSERT</command>, выключите автофиксацию транзакций и зафиксируйте транзакцию только один раз в самом конце. (В обычном SQL это означает, что нужно выполнить <command>BEGIN</command> до, и <command>COMMIT</command> после этой серии. Некоторые клиентские библиотеки могут делать это автоматически, в таких случаях нужно убедиться, что это так.) Если вы будете фиксировать каждое добавление по отдельности, <productname>PostgreSQL</productname> придётся проделать много действий для каждой добавляемой строки. Выполнять все операции в одной транзакции хорошо ещё и потому, что в случае ошибки добавления одной из строк произойдёт откат к исходному состоянию и вы не окажетесь в сложной ситуации с частично загруженными данными.

source: Use <command>COPY</command>
ru: Используйте <command>COPY</command>

source: Use <xref linkend="sql-copy"/> to load all the rows in one command, instead of using a series of <command>INSERT</command> commands. The <command>COPY</command> command is optimized for loading large numbers of rows; it is less flexible than <command>INSERT</command>, but incurs significantly less overhead for large data loads. Since <command>COPY</command> is a single command, there is no need to disable autocommit if you use this method to populate a table.
ru: Используйте <xref linkend="sql-copy"/>, чтобы загрузить все строки одной командой вместо серии <command>INSERT</command>. Команда <command>COPY</command> оптимизирована для загрузки большого количества строк; хотя она не так гибка, как <command>INSERT</command>, но при загрузке больших объёмов данных она влечёт гораздо меньше накладных расходов. Так как <command>COPY</command> &mdash; это одна команда, применяя её, нет необходимости отключать автофиксацию транзакций.

source: If you cannot use <command>COPY</command>, it might help to use <xref linkend="sql-prepare"/> to create a prepared <command>INSERT</command> statement, and then use <command>EXECUTE</command> as many times as required. This avoids some of the overhead of repeatedly parsing and planning <command>INSERT</command>. Different interfaces provide this facility in different ways; look for <quote>prepared statements</quote> in the interface documentation.
ru: В случаях, когда <command>COPY</command> не подходит, может быть полезно создать подготовленный оператор <command>INSERT</command> с помощью <xref linkend="sql-prepare"/>, а затем выполнять <command>EXECUTE</command> столько раз, сколько потребуется. Это позволит избежать накладных расходов, связанных с разбором и анализом каждой команды <command>INSERT</command>. В разных интерфейсах это может выглядеть по-разному; за подробностями обратитесь к описанию <quote>подготовленных операторов</quote> в документации конкретного интерфейса.

source: Note that loading a large number of rows using <command>COPY</command> is almost always faster than using <command>INSERT</command>, even if <command>PREPARE</command> is used and multiple insertions are batched into a single transaction.
ru: Заметьте, что с помощью <command>COPY</command> большое количество строк практически всегда загружается быстрее, чем с помощью <command>INSERT</command>, даже если используется <command>PREPARE</command> и серия операций добавления заключена в одну транзакцию.

source: <command>COPY</command> is fastest when used within the same transaction as an earlier <command>CREATE TABLE</command> or <command>TRUNCATE</command> command. In such cases no WAL needs to be written, because in case of an error, the files containing the newly loaded data will be removed anyway. However, this consideration only applies when <xref linkend="guc-wal-level"/> is <literal>minimal</literal> as all commands must write WAL otherwise.
ru: <command>COPY</command> работает быстрее всего, если она выполняется в одной транзакции с командами <command>CREATE TABLE</command> или <command>TRUNCATE</command>. В таких случаях записывать WAL не нужно, так как в случае ошибки файлы, содержащие загружаемые данные, будут всё равно удалены. Однако это замечание справедливо, только когда параметр <xref linkend="guc-wal-level"/> равен <literal>minimal</literal>, так как в противном случае все команды должны записывать свои изменения в WAL.

source: Remove Indexes
ru: Удалите индексы

source: If you are loading a freshly created table, the fastest method is to create the table, bulk load the table's data using <command>COPY</command>, then create any indexes needed for the table. Creating an index on pre-existing data is quicker than updating it incrementally as each row is loaded.
ru: Если вы загружаете данные в только что созданную таблицу, быстрее всего будет загрузить данные с помощью <command>COPY</command>, а затем создать все необходимые для неё индексы. На создание индекса для уже существующих данных уйдёт меньше времени, чем на последовательное его обновление при добавлении каждой строки.

source: If you are adding large amounts of data to an existing table, it might be a win to drop the indexes, load the table, and then recreate the indexes. Of course, the database performance for other users might suffer during the time the indexes are missing. One should also think twice before dropping a unique index, since the error checking afforded by the unique constraint will be lost while the index is missing.
ru: Если вы добавляете данные в существующую таблицу, может иметь смысл удалить индексы, загрузить таблицу, а затем пересоздать индексы. Конечно, при этом надо учитывать, что временное отсутствие индексов может отрицательно повлиять на скорость работы других пользователей. Кроме того, следует дважды подумать, прежде чем удалять уникальные индексы, так как без них соответствующие проверки ключей не будут выполняться.

source: Remove Foreign Key Constraints
ru: Удалите ограничения внешних ключей

source: Just as with indexes, a foreign key constraint can be checked <quote>in bulk</quote> more efficiently than row-by-row. So it might be useful to drop foreign key constraints, load data, and re-create the constraints. Again, there is a trade-off between data load speed and loss of error checking while the constraint is missing.
ru: Как и с индексами, проверки, связанные с ограничениями внешних ключей, выгоднее выполнять <quote>массово</quote>, а не для каждой строки в отдельности. Поэтому может быть полезно удалить ограничения внешних ключей, загрузить данные, а затем восстановить прежние ограничения. И в этом случае тоже приходится выбирать между скоростью загрузки данных и риском допустить ошибки в отсутствие ограничений.

source: What's more, when you load data into a table with existing foreign key constraints, each new row requires an entry in the server's list of pending trigger events (since it is the firing of a trigger that checks the row's foreign key constraint). Loading many millions of rows can cause the trigger event queue to overflow available memory, leading to intolerable swapping or even outright failure of the command. Therefore it may be <emphasis>necessary</emphasis>, not just desirable, to drop and re-apply foreign keys when loading large amounts of data. If temporarily removing the constraint isn't acceptable, the only other recourse may be to split up the load operation into smaller transactions.
ru: Более того, когда вы загружаете данные в таблицу с существующими ограничениями внешнего ключа, для каждой новой строки добавляется запись в очередь событий триггера (так как именно срабатывающий триггер проверяет такие ограничения для строки). При загрузке многих миллионов строк очередь событий триггера может занять всю доступную память, что приведёт к недопустимой нагрузке на файл подкачки или даже к сбою команды. Таким образом, загружая большие объёмы данных, может быть не просто желательно, а <emphasis>необходимо</emphasis> удалять, а затем восстанавливать внешние ключи. Если же временное отключение этого ограничения неприемлемо, единственно возможным решением может быть разделение всей операции загрузки на меньшие транзакции.

source: Increase <varname>maintenance_work_mem</varname>
ru: Увеличьте <varname>maintenance_work_mem</varname>

source: Temporarily increasing the <xref linkend="guc-maintenance-work-mem"/> configuration variable when loading large amounts of data can lead to improved performance. This will help to speed up <command>CREATE INDEX</command> commands and <command>ALTER TABLE ADD FOREIGN KEY</command> commands. It won't do much for <command>COPY</command> itself, so this advice is only useful when you are using one or both of the above techniques.
ru: Ускорить загрузку больших объёмов данных можно, увеличив параметр конфигурации <xref linkend="guc-maintenance-work-mem"/> на время загрузки. Это приведёт к увеличению быстродействия <command>CREATE INDEX</command> и <command>ALTER TABLE ADD FOREIGN KEY</command>. На скорость самой команды <command>COPY</command> это не повлияет, так что этот совет будет полезен, только если вы применяете какой-либо из двух вышеописанных приёмов.

source: Increase <varname>max_wal_size</varname>
ru: Увеличьте <varname>max_wal_size</varname>

source: Temporarily increasing the <xref linkend="guc-max-wal-size"/> configuration variable can also make large data loads faster. This is because loading a large amount of data into <productname>PostgreSQL</productname> will cause checkpoints to occur more often than the normal checkpoint frequency (specified by the <varname>checkpoint_timeout</varname> configuration variable). Whenever a checkpoint occurs, all dirty pages must be flushed to disk. By increasing <varname>max_wal_size</varname> temporarily during bulk data loads, the number of checkpoints that are required can be reduced.
ru: Также массовую загрузку данных можно ускорить, изменив на время загрузки параметр конфигурации <xref linkend="guc-max-wal-size"/>. Загружая большие объёмы данных, <productname>PostgreSQL</productname> вынужден увеличивать частоту контрольных точек по сравнению с обычной (которая задаётся параметром <varname>checkpoint_timeout</varname>), а значит и чаще сбрасывать &laquo;грязные&raquo; страницы на диск. Временно увеличив <varname>max_wal_size</varname>, можно уменьшить частоту контрольных точек и связанных с ними операций ввода-вывода.

source: Disable WAL Archival and Streaming Replication
ru: Отключите архивацию WAL и потоковую репликацию

source: When loading large amounts of data into an installation that uses WAL archiving or streaming replication, it might be faster to take a new base backup after the load has completed than to process a large amount of incremental WAL data. To prevent incremental WAL logging while loading, disable archiving and streaming replication, by setting <xref linkend="guc-wal-level"/> to <literal>minimal</literal>, <xref linkend="guc-archive-mode"/> to <literal>off</literal>, and <xref linkend="guc-max-wal-senders"/> to zero. But note that changing these settings requires a server restart.
ru: Для загрузки больших объёмов данных в среде, где используется архивация WAL или потоковая репликация, быстрее будет сделать копию базы данных после загрузки данных, чем обрабатывать множество операций изменений в WAL. Чтобы отключить передачу изменений через WAL в процессе загрузки, отключите архивацию и потоковую репликацию, назначьте параметру <xref linkend="guc-wal-level"/> значение <literal>minimal</literal>, <xref linkend="guc-archive-mode"/> &mdash; <literal>off</literal>, а <xref linkend="guc-max-wal-senders"/> &mdash; 0. Но имейте в виду, что изменённые параметры вступят в силу только после перезапуска сервера.

source: <command>CREATE INDEX</command> (and variants such as <command>ALTER TABLE ADD PRIMARY KEY</command>)
ru: <command>CREATE INDEX</command> (и подобные команды, как например <command>ALTER TABLE ADD PRIMARY KEY</command>)

source: <command>COPY FROM</command>, when the target table has been created or truncated earlier in the same transaction
ru: <command>COPY FROM</command>, когда целевая таблица была создана или опустошена ранее в той же транзакции

source: Aside from avoiding the time for the archiver or WAL sender to process the WAL data, doing this will actually make certain commands faster, because they are designed not to write WAL at all if <varname>wal_level</varname> is <literal>minimal</literal>. (They can guarantee crash safety more cheaply by doing an <function>fsync</function> at the end than by writing WAL.) This applies to the following commands: <placeholder-1/>
ru: Это не только поможет сэкономить время архивации и передачи WAL, но и непосредственно ускорит некоторые команды, которые могут вовсе не использовать WAL, если <varname>wal_level</varname> равен <literal>minimal</literal>. (Они могут гарантировать безопасность при сбое, не записывая все изменения в WAL, а выполнив только <function>fsync</function> в конце операции, что будет гораздо дешевле.) Это относится к следующим командам: <placeholder-1/>

source: Run <command>ANALYZE</command> Afterwards
ru: Выполните в конце <command>ANALYZE</command>

source: Whenever you have significantly altered the distribution of data within a table, running <xref linkend="sql-analyze"/> is strongly recommended. This includes bulk loading large amounts of data into the table. Running <command>ANALYZE</command> (or <command>VACUUM ANALYZE</command>) ensures that the planner has up-to-date statistics about the table. With no statistics or obsolete statistics, the planner might make poor decisions during query planning, leading to poor performance on any tables with inaccurate or nonexistent statistics. Note that if the autovacuum daemon is enabled, it might run <command>ANALYZE</command> automatically; see <xref linkend="vacuum-for-statistics"/> and <xref linkend="autovacuum"/> for more information.
ru: Всякий раз, когда распределение данных в таблице значительно меняется, настоятельно рекомендуется выполнять <xref linkend="sql-analyze"/>. Эта рекомендация касается и загрузки в таблицу большого объёма данных. Выполнив <command>ANALYZE</command> (или <command>VACUUM ANALYZE</command>), вы тем самым обновите статистику по данной таблице для планировщика. Когда планировщик не имеет статистики или она не соответствует действительности, он не сможет правильно планировать запросы, что приведёт к снижению быстродействия при работе с соответствующими таблицами. Заметьте, что если включён демон автоочистки, он может запускать <command>ANALYZE</command> автоматически; подробнее об этом можно узнать в <xref remap="6" linkend="vacuum-for-statistics"/> и <xref remap="6" linkend="autovacuum"/>.

source: Some Notes About <application>pg_dump</application>
ru: Несколько замечаний относительно <application>pg_dump</application>

source: Dump scripts generated by <application>pg_dump</application> automatically apply several, but not all, of the above guidelines. To reload a <application>pg_dump</application> dump as quickly as possible, you need to do a few extra things manually. (Note that these points apply while <emphasis>restoring</emphasis> a dump, not while <emphasis>creating</emphasis> it. The same points apply whether loading a text dump with <application>psql</application> or using <application>pg_restore</application> to load from a <application>pg_dump</application> archive file.)
ru: В скриптах загрузки данных, которые генерирует <application>pg_dump</application>, автоматически учитываются некоторые, но не все из этих рекомендаций. Чтобы загрузить данные, которые выгрузил <application>pg_dump</application>, максимально быстро, вам нужно будет выполнить некоторые дополнительные действия вручную. (Заметьте, что эти замечания относятся только к <emphasis>восстановлению</emphasis> данных, но не к <emphasis>выгрузке</emphasis> их. Следующие рекомендации применимы вне зависимости от того, загружается ли архивный файл <application>pg_dump</application> в <application>psql</application> или в <application>pg_restore</application>.)

source: Set appropriate (i.e., larger than normal) values for <varname>maintenance_work_mem</varname> and <varname>max_wal_size</varname>.
ru: Установите подходящие (то есть превышающие обычные) значения для <varname>maintenance_work_mem</varname> и <varname>max_wal_size</varname>.

source: If using WAL archiving or streaming replication, consider disabling them during the restore. To do that, set <varname>archive_mode</varname> to <literal>off</literal>, <varname>wal_level</varname> to <literal>minimal</literal>, and <varname>max_wal_senders</varname> to zero before loading the dump. Afterwards, set them back to the right values and take a fresh base backup.
ru: Если вы используете архивацию WAL или потоковую репликацию, по возможности отключите их на время восстановления. Для этого перед загрузкой данных, присвойте параметру <varname>archive_mode</varname> значение <literal>off</literal>, <varname>wal_level</varname> &mdash; <literal>minimal</literal>, а <varname>max_wal_senders</varname> &mdash; 0. Закончив восстановление, верните их обычные значения и сделайте свежую базовую резервную копию.

source: Experiment with the parallel dump and restore modes of both <application>pg_dump</application> and <application>pg_restore</application> and find the optimal number of concurrent jobs to use. Dumping and restoring in parallel by means of the <option>-j</option> option should give you a significantly higher performance over the serial mode.
ru: Поэкспериментируйте с режимами параллельного копирования и восстановления команд <application>pg_dump</application> и <application>pg_restore</application>, и подберите оптимальное число параллельных заданий. Параллельное копирование и восстановление данных, управляемое параметром <option>-j</option>, должно дать значительный выигрыш в скорости по сравнению с последовательным режимом.

source: Consider whether the whole dump should be restored as a single transaction. To do that, pass the <option>-1</option> or <option>--single-transaction</option> command-line option to <application>psql</application> or <application>pg_restore</application>. When using this mode, even the smallest of errors will rollback the entire restore, possibly discarding many hours of processing. Depending on how interrelated the data is, that might seem preferable to manual cleanup, or not. <command>COPY</command> commands will run fastest if you use a single transaction and have WAL archiving turned off.
ru: Если это возможно в вашей ситуации, восстановите все данные в рамках одной транзакции. Для этого передайте параметр <option>-1</option> или <option>--single-transaction</option> команде <application>psql</application> или <application>pg_restore</application>. Но учтите, что в этом режиме даже незначительная ошибка приведёт к откату всех изменений и часы восстановления будут потрачены зря. В зависимости от того, насколько взаимосвязаны данные, предпочтительнее может быть вычистить их вручную. Команды <command>COPY</command> будут работать максимально быстро, когда они выполняются в одной транзакции и архивация WAL выключена.

source: If multiple CPUs are available in the database server, consider using <application>pg_restore</application>'s <option>--jobs</option> option. This allows concurrent data loading and index creation.
ru: Если на сервере баз данных установлено несколько процессоров, полезным может оказаться параметр <option>--jobs</option> команды <application>pg_restore</application>. С его помощью можно выполнить загрузку данных и создание индексов параллельно.

source: Run <command>ANALYZE</command> afterwards.
ru: После загрузки данных запустите <command>ANALYZE</command>.

source: By default, <application>pg_dump</application> uses <command>COPY</command>, and when it is generating a complete schema-and-data dump, it is careful to load data before creating indexes and foreign keys. So in this case several guidelines are handled automatically. What is left for you to do is to: <placeholder-1/>
ru: По умолчанию <application>pg_dump</application> использует команду <command>COPY</command> и когда она выгружает полностью схему и данные, в сгенерированном скрипте она сначала предусмотрительно загружает данные, а потом создаёт индексы и внешние ключи. Так что в этом случае часть рекомендаций выполняется автоматически. Вам остаётся учесть только следующие: <placeholder-1/>

source: You can get the effect of disabling foreign keys by using the <option>--disable-triggers</option> option &mdash; but realize that that eliminates, rather than just postpones, foreign key validation, and so it is possible to insert bad data if you use it.
ru: Вы можете отключить внешние ключи, используя параметр <option>--disable-triggers</option> &mdash; но при этом нужно понимать, что тем самым вы не просто отложите, а полностью выключите соответствующие проверки, что позволит вставить недопустимые данные.

source: A data-only dump will still use <command>COPY</command>, but it does not drop or recreate indexes, and it does not normally touch foreign keys. <placeholder-1/> So when loading a data-only dump, it is up to you to drop and recreate indexes and foreign keys if you wish to use those techniques. It's still useful to increase <varname>max_wal_size</varname> while loading the data, but don't bother increasing <varname>maintenance_work_mem</varname>; rather, you'd do that while manually recreating indexes and foreign keys afterwards. And don't forget to <command>ANALYZE</command> when you're done; see <xref linkend="vacuum-for-statistics"/> and <xref linkend="autovacuum"/> for more information.
ru: При выгрузке данных без схемы тоже используется команда <command>COPY</command>, но индексы, как обычно и внешние ключи, при этом не удаляются и не пересоздаются. <placeholder-1/> Поэтому, загружая только данные, вы сами должны решить, нужно ли для ускорения загрузки удалять и пересоздавать индексы и внешние ключи. При этом будет так же полезно увеличить параметр <varname>max_wal_size</varname>, но не <varname>maintenance_work_mem</varname>; его стоит менять, только если вы впоследствии пересоздаёте индексы и внешние ключи вручную. И не забудьте выполнить <command>ANALYZE</command> после; подробнее об этом можно узнать в <xref remap="6" linkend="vacuum-for-statistics"/> и <xref remap="6" linkend="autovacuum"/>.

source: Non-Durable Settings
ru: Оптимизация, угрожающая стабильности

source: <primary>non-durable</primary>
ru: <primary>угроза стабильности</primary>

source: Place the database cluster's data directory in a memory-backed file system (i.e. <acronym>RAM</acronym> disk). This eliminates all database disk I/O, but limits data storage to the amount of available memory (and perhaps swap).
ru: Поместите каталог данных кластера БД в файловую систему, размещённую в памяти (т. е. в <acronym>RAM</acronym>-диск). Так вы исключите всю активность ввода/вывода, связанную с базой данных, если только размер базы данных не превышает объём свободной памяти (возможно, с учётом файла подкачки).

source: Turn off <xref linkend="guc-fsync"/>; there is no need to flush data to disk.
ru: Выключите <xref linkend="guc-fsync"/>; сбрасывать данные на диск не нужно.
