Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/perform.po
Languages: ru

source: To inform the planner about functional dependencies, <command>ANALYZE</command> can collect measurements of cross-column dependency. Assessing the degree of dependency between all sets of columns would be prohibitively expensive, so data collection is limited to those groups of columns appearing together in a statistics object defined with the <literal>dependencies</literal> option. It is advisable to create <literal>dependencies</literal> statistics only for column groups that are strongly correlated, to avoid unnecessary overhead in both <command>ANALYZE</command> and later query planning.
ru: Для информирования планировщика о функциональных зависимостях команда <command>ANALYZE</command> может собирать показатели зависимостей между столбцами. Оценить степень зависимости между всеми наборами столбцов обошлось бы непозволительно дорого, поэтому сбор данных ограничивается только теми группами столбцов, которые фигурируют вместе в объекте статистики, определённом со свойством <literal>dependencies</literal>. Во избежание ненужных издержек при выполнении <command>ANALYZE</command> и последующем планировании запросов статистику с <literal>dependencies</literal> рекомендуется создавать только для групп сильно коррелирующих столбцов.

source: Here is an example of collecting functional-dependency statistics: <placeholder-1/> Here it can be seen that column 1 (zip code) fully determines column 5 (city) so the coefficient is 1.0, while city only determines zip code about 42% of the time, meaning that there are many cities (58%) that are represented by more than a single ZIP code.
ru: Взгляните на пример сбора статистики функциональной зависимости: <placeholder-1/> В показанном случае столбец 1 (код zip) полностью определяет столбец 5 (city), так что коэффициент равен 1.0, тогда как город (столбец city) определяет код ZIP только в 42% всех случаев, что означает, что многие города (58%) представлены несколькими кодами ZIP.

source: When computing the selectivity for a query involving functionally dependent columns, the planner adjusts the per-condition selectivity estimates using the dependency coefficients so as not to produce an underestimate.
ru: При вычислении избирательности запроса, в котором задействованы функционально зависимые столбцы, планировщик корректирует оценки избирательности по условиям, используя коэффициенты зависимостей, чтобы не допустить недооценки размера результата.

source: Limitations of Functional Dependencies
ru: Ограничения функциональных зависимостей

source: Functional dependencies are currently only applied when considering simple equality conditions that compare columns to constant values. They are not used to improve estimates for equality conditions comparing two columns or comparing a column to an expression, nor for range clauses, <literal>LIKE</literal> or any other type of condition.
ru: Функциональные зависимости в настоящее время применяются только при рассмотрении простых условий с равенствами, сравнивающих значения столбцов с константами. Они не используются для улучшения оценок при проверке равенства двух столбцов или сравнении столбца с выражением, а также в условиях с диапазоном, условиях <literal>LIKE</literal> или любых других видах условий.

source: When estimating with functional dependencies, the planner assumes that conditions on the involved columns are compatible and hence redundant. If they are incompatible, the correct estimate would be zero rows, but that possibility is not considered. For example, given a query like <placeholder-1/> the planner will disregard the <structfield>city</structfield> clause as not changing the selectivity, which is correct. However, it will make the same assumption about <placeholder-2/> even though there will really be zero rows satisfying this query. Functional dependency statistics do not provide enough information to conclude that, however.
ru: Рассматривая функциональные зависимости, планировщик предполагает, что условия по задействованным столбцам совместимы и таким образом избыточны. Если условия несовместимы, правильной оценкой должен быть ноль строк, но эта возможность не рассматривается. Например, с таким запросом <placeholder-1/> планировщик отбросит условие с <structfield>city</structfield>, так как оно не влияет на избирательность, что верно. Однако он сделает то же предположение и в таком случае: <placeholder-2/> хотя на самом деле этому запросу будет удовлетворять ноль строк. Но статистика функциональной зависимости не даёт достаточно информации, чтобы прийти к такому заключению.

source: In many practical situations, this assumption is usually satisfied; for example, there might be a GUI in the application that only allows selecting compatible city and ZIP code values to use in a query. But if that's not the case, functional dependencies may not be a viable option.
ru: Во многих практических ситуациях это предположение обычно удовлетворяется; например, графический интерфейс приложения для последующего формирования запроса может не допускать выбор несовместимого сочетания города и кода ZIP. Но когда это не так, статистика функциональной зависимости может не подойти.

source: Multivariate N-Distinct Counts
ru: Многовариантное число различных значений

source: Single-column statistics store the number of distinct values in each column. Estimates of the number of distinct values when combining more than one column (for example, for <literal>GROUP BY a, b</literal>) are frequently wrong when the planner only has single-column statistical data, causing it to select bad plans.
ru: Статистика по одному столбцу содержит число различных значений в каждом отдельном столбце. Оценки числа различных значений в сочетании нескольких столбцов (например, в <literal>GROUP BY a, b</literal>) часто оказываются ошибочными, когда планировщик имеет статистические данные только по отдельным столбцам, что приводит к выбору плохих планов.

source: To improve such estimates, <command>ANALYZE</command> can collect n-distinct statistics for groups of columns. As before, it's impractical to do this for every possible column grouping, so data is collected only for those groups of columns appearing together in a statistics object defined with the <literal>ndistinct</literal> option. Data will be collected for each possible combination of two or more columns from the set of listed columns.
ru: Для улучшения таких оценок операция <command>ANALYZE</command> может собирать статистику по различным значениям для группы столбцов. Как и ранее, это непрактично делать для каждой возможной группы столбцов, так что данные собираются только по тем группам столбцов, которые указаны в определении объекта статистики, создаваемого со свойством <literal>ndistinct</literal>. Данные будут собираться по всем возможным сочетаниям из двух или нескольких столбцов из перечисленных в определении.

source: Continuing the previous example, the n-distinct counts in a table of ZIP codes might look like the following: <placeholder-1/> This indicates that there are three combinations of columns that have 33178 distinct values: ZIP code and state; ZIP code and city; and ZIP code, city and state (the fact that they are all equal is expected given that ZIP code alone is unique in this table). On the other hand, the combination of city and state has only 27435 distinct values.
ru: В продолжение предыдущего примера, количества различных значений в таблице ZIP-кодов могут выглядеть так: <placeholder-1/> Как видно, есть три комбинации столбцов, имеющих 33178 различных значений: код ZIP и штат; код ZIP и город; код ZIP, город и штат (то, что все эти числа равны, ожидаемый факт, так как сам по себе код ZIP в этой таблице уникален). С другой стороны, сочетание города и штата даёт только 27435 различных значений.

source: It's advisable to create <literal>ndistinct</literal> statistics objects only on combinations of columns that are actually used for grouping, and for which misestimation of the number of groups is resulting in bad plans. Otherwise, the <command>ANALYZE</command> cycles are just wasted.
ru: Объект статистики <literal>ndistinct</literal> рекомендуется создавать только для тех сочетаний столбцов, которые действительно используются при группировке, и только когда неправильная оценка числа групп может привести к выбору плохих планов. В противном случае усилия, потраченные на выполнение <command>ANALYZE</command>, будут напрасными.

source: Controlling the Planner with Explicit <literal>JOIN</literal> Clauses
ru: Управление планировщиком с помощью явных предложений <literal>JOIN</literal>

source: <primary>join</primary> <secondary>controlling the order</secondary>
ru: <primary>соединение</primary> <secondary>управление порядком</secondary>

source: It is possible to control the query planner to some extent by using the explicit <literal>JOIN</literal> syntax. To see why this matters, we first need some background.
ru: Поведением планировщика в некоторой степени можно управлять, используя явный синтаксис <literal>JOIN</literal>. Понять, когда и почему это бывает нужно, поможет небольшое введение.

source: In a simple join query, such as: <placeholder-1/> the planner is free to join the given tables in any order. For example, it could generate a query plan that joins A to B, using the <literal>WHERE</literal> condition <literal>a.id = b.id</literal>, and then joins C to this joined table, using the other <literal>WHERE</literal> condition. Or it could join B to C and then join A to that result. Or it could join A to C and then join them with B &mdash; but that would be inefficient, since the full Cartesian product of A and C would have to be formed, there being no applicable condition in the <literal>WHERE</literal> clause to allow optimization of the join. (All joins in the <productname>PostgreSQL</productname> executor happen between two input tables, so it's necessary to build up the result in one or another of these fashions.) The important point is that these different join possibilities give semantically equivalent results but might have hugely different execution costs. Therefore, the planner will explore all of them to try to find the most efficient query plan.
ru: В простом запросе с соединением, например таком: <placeholder-1/> планировщик может соединять данные таблицы в любом порядке. Например, он может разработать план, в котором сначала A соединяется с B по условию <literal>WHERE</literal> <literal>a.id = b.id</literal>, а затем C соединяется с получившейся таблицей по другому условию <literal>WHERE</literal>. Либо он может соединить B с C, а затем с A результатом соединения. Он также может соединить сначала A с C, а затем результат с B &mdash; но это будет не эффективно, так как ему придётся сформировать полное декартово произведение A и C из-за отсутствия в предложении <literal>WHERE</literal> условия, подходящего для оптимизации соединения. (В <productname>PostgreSQL</productname> исполнитель запросов может соединять только по две таблицы, поэтому для получения результата нужно выбрать один из этих способов.) При этом важно понимать, что все эти разные способы соединения дают одинаковые по смыслу результаты, но стоимость их может различаться многократно. Поэтому планировщик должен изучить их все и найти самый эффективный способ выполнения запроса.

source: When a query only involves two or three tables, there aren't many join orders to worry about. But the number of possible join orders grows exponentially as the number of tables expands. Beyond ten or so input tables it's no longer practical to do an exhaustive search of all the possibilities, and even for six or seven tables planning might take an annoyingly long time. When there are too many input tables, the <productname>PostgreSQL</productname> planner will switch from exhaustive search to a <firstterm>genetic</firstterm> probabilistic search through a limited number of possibilities. (The switch-over threshold is set by the <xref linkend="guc-geqo-threshold"/> run-time parameter.) The genetic search takes less time, but it won't necessarily find the best possible plan.
ru: Когда запрос включает только две или три таблицы, возможны всего несколько вариантов их соединения. Но их число растёт экспоненциально с увеличением числа задействованных таблиц. Если число таблиц больше десяти, уже практически невозможно выполнить полный перебор всех вариантов, и даже для шести или семи таблиц планирование может занять недопустимо много времени. Когда таблиц слишком много, планировщик <productname>PostgreSQL</productname> переключается с полного поиска на алгоритм <firstterm>генетического</firstterm> вероятностного поиска в ограниченном числе вариантов. (Порог для этого переключения задаётся параметром выполнения <xref linkend="guc-geqo-threshold"/>.) Генетический поиск выполняется быстрее, но не гарантирует, что найденный план будет наилучшим.

source: When the query involves outer joins, the planner has less freedom than it does for plain (inner) joins. For example, consider: <placeholder-1/> Although this query's restrictions are superficially similar to the previous example, the semantics are different because a row must be emitted for each row of A that has no matching row in the join of B and C. Therefore the planner has no choice of join order here: it must join B to C and then join A to that result. Accordingly, this query takes less time to plan than the previous query. In other cases, the planner might be able to determine that more than one join order is safe. For example, given: <placeholder-2/> it is valid to join A to either B or C first. Currently, only <literal>FULL JOIN</literal> completely constrains the join order. Most practical cases involving <literal>LEFT JOIN</literal> or <literal>RIGHT JOIN</literal> can be rearranged to some extent.
ru: Когда запрос включает внешние соединения, планировщик имеет меньше степеней свободы, чем с обычными (внутренними) соединениями. Например, рассмотрим запрос: <placeholder-1/> Хотя ограничения в этом запросе очень похожи на показанные в предыдущем примере, смысл его отличается, так как результирующая строка должна выдаваться для каждой строки A, даже если для неё не находится соответствия в соединении B и C. Таким образом, здесь планировщик не может выбирать порядок соединения: он должен соединить B с C, а затем соединить A с результатом. Соответственно, и план этого запроса построится быстрее, чем предыдущего. В других случаях планировщик сможет определить, что можно безопасно выбрать один из нескольких способов соединения. Например, для запроса: <placeholder-2/> можно соединить A либо с B, либо с C. В настоящее время только <literal>FULL JOIN</literal> полностью ограничивает порядок соединения. На практике в большинстве запросов с <literal>LEFT JOIN</literal> и <literal>RIGHT JOIN</literal> порядком можно управлять в некоторой степени.

source: Explicit inner join syntax (<literal>INNER JOIN</literal>, <literal>CROSS JOIN</literal>, or unadorned <literal>JOIN</literal>) is semantically the same as listing the input relations in <literal>FROM</literal>, so it does not constrain the join order.
ru: Синтаксис явного внутреннего соединения (<literal>INNER JOIN</literal>, <literal>CROSS JOIN</literal> или лаконичный <literal>JOIN</literal>) по смыслу равнозначен перечислению отношений в предложении <literal>FROM</literal>, так что он никак не ограничивает порядок соединений.

source: Even though most kinds of <literal>JOIN</literal> don't completely constrain the join order, it is possible to instruct the <productname>PostgreSQL</productname> query planner to treat all <literal>JOIN</literal> clauses as constraining the join order anyway. For example, these three queries are logically equivalent: <placeholder-1/> But if we tell the planner to honor the <literal>JOIN</literal> order, the second and third take less time to plan than the first. This effect is not worth worrying about for only three tables, but it can be a lifesaver with many tables.
ru: Хотя большинство видов <literal>JOIN</literal> не полностью ограничивают порядок соединения, в <productname>PostgreSQL</productname> можно принудить планировщик обрабатывать все предложения <literal>JOIN</literal> как ограничивающие этот порядок. Например, следующие три запроса логически равнозначны: <placeholder-1/> Но если мы укажем планировщику соблюдать порядок <literal>JOIN</literal>, на планирование второго и третьего уйдёт меньше времени. Когда речь идёт только о трёх таблицах, выигрыш будет незначительным, но для множества таблиц это может быть очень эффективно.

source: To force the planner to follow the join order laid out by explicit <literal>JOIN</literal>s, set the <xref linkend="guc-join-collapse-limit"/> run-time parameter to 1. (Other possible values are discussed below.)
ru: Чтобы планировщик соблюдал порядок внутреннего соединения, выраженный явно предложениями <literal>JOIN</literal>, нужно присвоить параметру выполнения <xref linkend="guc-join-collapse-limit"/> значение 1. (Другие допустимые значения обсуждаются ниже.)

source: You do not need to constrain the join order completely in order to cut search time, because it's OK to use <literal>JOIN</literal> operators within items of a plain <literal>FROM</literal> list. For example, consider: <placeholder-1/> With <varname>join_collapse_limit</varname> = 1, this forces the planner to join A to B before joining them to other tables, but doesn't constrain its choices otherwise. In this example, the number of possible join orders is reduced by a factor of 5.
ru: Чтобы сократить время поиска, необязательно полностью ограничивать порядок соединений, в <literal>JOIN</literal> можно соединять элементы как в обычном списке <literal>FROM</literal>. Например, рассмотрите следующий запрос: <placeholder-1/> Если <varname>join_collapse_limit</varname> = 1, планировщик будет вынужден соединить A с B раньше, чем результат с другими таблицами, но в дальнейшем выборе вариантов он не ограничен. В данном примере число возможных вариантов соединения уменьшается в 5 раз.

source: Constraining the planner's search in this way is a useful technique both for reducing planning time and for directing the planner to a good query plan. If the planner chooses a bad join order by default, you can force it to choose a better order via <literal>JOIN</literal> syntax &mdash; assuming that you know of a better order, that is. Experimentation is recommended.
ru: Упрощать для планировщика задачу перебора вариантов таким способом &mdash; это полезный приём, помогающий не только выбрать сократить время планирования, но и подтолкнуть планировщик к хорошему плану. Если планировщик по умолчанию выбирает неудачный порядок соединения, вы можете заставить его выбрать лучший, применив синтаксис <literal>JOIN</literal>, конечно если вы сами его знаете. Эффект подобной оптимизации рекомендуется подтверждать экспериментально.

source: A closely related issue that affects planning time is collapsing of subqueries into their parent query. For example, consider: <placeholder-1/> This situation might arise from use of a view that contains a join; the view's <literal>SELECT</literal> rule will be inserted in place of the view reference, yielding a query much like the above. Normally, the planner will try to collapse the subquery into the parent, yielding: <placeholder-2/> This usually results in a better plan than planning the subquery separately. (For example, the outer <literal>WHERE</literal> conditions might be such that joining X to A first eliminates many rows of A, thus avoiding the need to form the full logical output of the subquery.) But at the same time, we have increased the planning time; here, we have a five-way join problem replacing two separate three-way join problems. Because of the exponential growth of the number of possibilities, this makes a big difference. The planner tries to avoid getting stuck in huge join search problems by not collapsing a subquery if more than <varname>from_collapse_limit</varname> <literal>FROM</literal> items would result in the parent query. You can trade off planning time against quality of plan by adjusting this run-time parameter up or down.
ru: На время планирования влияет и другой, тесно связанный фактор &mdash; решение о включении подзапросов в родительский запрос. Пример такого запроса: <placeholder-1/> Такая же ситуация может возникнуть с представлением, содержащим соединение; вместо ссылки на это представление будет вставлено его выражение <literal>SELECT</literal> и в результате получится запрос, похожий на показанный выше. Обычно планировщик старается включить подзапрос в родительский запрос и получить таким образом: <placeholder-2/> Часто это позволяет построить лучший план, чем при планировании подзапросов по отдельности. (Например, внешние условия <literal>WHERE</literal> могут быть таковы, что при соединении сначала X с A будет исключено множество строк A, а значит формировать логический результат подзапроса полностью не потребуется.) Но в то же время тем самым мы увеличиваем время планирования; две задачи соединения трёх элементов мы заменяем одной с пятью элементами. Так как число вариантов увеличивается экспоненциально, сложность задачи увеличивается многократно. Планировщик пытается избежать проблем поиска с огромным числом вариантов, рассматривая подзапросы отдельно, если в предложении <literal>FROM</literal> родительского запроса оказывается больше чем <varname>from_collapse_limit</varname> элементов. Изменяя этот параметр выполнения, можно подобрать оптимальное соотношение времени планирования и качества плана.

source: <xref linkend="guc-from-collapse-limit"/> and <xref linkend="guc-join-collapse-limit"/> are similarly named because they do almost the same thing: one controls when the planner will <quote>flatten out</quote> subqueries, and the other controls when it will flatten out explicit joins. Typically you would either set <varname>join_collapse_limit</varname> equal to <varname>from_collapse_limit</varname> (so that explicit joins and subqueries act similarly) or set <varname>join_collapse_limit</varname> to 1 (if you want to control join order with explicit joins). But you might set them differently if you are trying to fine-tune the trade-off between planning time and run time.
ru: Параметры <xref linkend="guc-from-collapse-limit"/> и <xref linkend="guc-join-collapse-limit"/> называются похоже, потому что они делают практически одно и то же: первый параметр определяет, когда планировщик будет <quote>сносить</quote> в предложение <literal>FROM</literal> подзапросы, а второй &mdash; явные соединения. Обычно <varname>join_collapse_limit</varname> устанавливается равным <varname>from_collapse_limit</varname> (чтобы явные соединения и подзапросы обрабатывались одинаково) или 1 (если требуется управлять порядком соединений). Но вы можете задать другие значения, чтобы добиться оптимального соотношения времени планирования и времени выполнения запросов.

source: Populating a Database
ru: Наполнение базы данных

source: One might need to insert a large amount of data when first populating a database. This section contains some suggestions on how to make this process as efficient as possible.
ru: Довольно часто в начале или в процессе использования базы данных возникает необходимость загрузить в неё большой объём данных. В этом разделе приведены рекомендации, которые помогут сделать это максимально эффективно.

source: Disable Autocommit
ru: Отключите автофиксацию транзакций

source: <primary>autocommit</primary> <secondary>bulk-loading data</secondary>
ru: <primary>автофиксация</primary> <secondary>массовая загрузка данных</secondary>
