Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/pgcrypto.po
Languages: ru

source: Options for PGP Functions
ru: Параметры функций PGP

source: Options are named to be similar to GnuPG. An option's value should be given after an equal sign; separate options from each other with commas. For example: <placeholder-1/>
ru: Имена параметров подобны принятым в GnuPG. Значение параметра должно задаваться после знака равно; друг от друга параметры отделяются запятыми. Например: <placeholder-1/>

source: All of the options except <literal>convert-crlf</literal> apply only to encrypt functions. Decrypt functions get the parameters from the PGP data.
ru: Все эти параметры, кроме <literal>convert-crlf</literal>, применяются только к функциям шифрования. Функции расшифровывания получают параметры из данных PGP.

source: The most interesting options are probably <literal>compress-algo</literal> and <literal>unicode-mode</literal>. The rest should have reasonable defaults.
ru: Вероятно, самые интересные параметры — это <literal>compress-algo</literal> и <literal>unicode-mode</literal>. Остальные должны иметь достаточно адекватные значения по умолчанию.

source: Which cipher algorithm to use.
ru: Выбирает алгоритм шифрования.

source: Values: bf, aes128, aes192, aes256 (OpenSSL-only: <placeholder-1/>, <placeholder-2/>) Default: aes128 Applies to: pgp_sym_encrypt, pgp_pub_encrypt
ru: Значения: bf, aes128, aes192, aes256 (только OpenSSL: <placeholder-1/>, <placeholder-2/>) По умолчанию: aes128 Применим к: pgp_sym_encrypt, pgp_pub_encrypt

source: Which compression algorithm to use. Only available if <productname>PostgreSQL</productname> was built with zlib.
ru: Выбирает алгоритм сжатия. Принимается, только если <productname>PostgreSQL</productname> собран с zlib.

source: Values: 0 - no compression 1 - ZIP compression 2 - ZLIB compression (= ZIP plus meta-data and block CRCs) Default: 0 Applies to: pgp_sym_encrypt, pgp_pub_encrypt
ru: Значения: 0 — без сжатия 1 — сжатие ZIP 2 — сжатие ZLIB (= ZIP плюс метаданные и CRC блоков) По умолчанию: 0 Применим к: pgp_sym_encrypt, pgp_pub_encrypt

source: How much to compress. Higher levels compress smaller but are slower. 0 disables compression.
ru: Определяет уровень сжатия. Чем больше уровень, тем меньшего объёма результат, но длительнее процесс. Значение 0 отключает сжатие.

source: Values: 0, 1-9 Default: 6 Applies to: pgp_sym_encrypt, pgp_pub_encrypt
ru: Значения: 0, 1-9 По умолчанию: 6 Применим к: pgp_sym_encrypt, pgp_pub_encrypt

source: Whether to convert <literal>\n</literal> into <literal>\r\n</literal> when encrypting and <literal>\r\n</literal> to <literal>\n</literal> when decrypting. RFC 4880 specifies that text data should be stored using <literal>\r\n</literal> line-feeds. Use this to get fully RFC-compliant behavior.
ru: Определяет, преобразовывать ли <literal>\n</literal> в <literal>\r\n</literal> при шифровании и <literal>\r\n</literal> в <literal>\n</literal> при дешифровании. В RFC 4880 требуется, чтобы текстовые данные хранились с переводами строк в виде <literal>\r\n</literal>. Воспользуйтесь этим параметром, чтобы поведение полностью соответствовало RFC.

source: Values: 0, 1 Default: 0 Applies to: pgp_sym_encrypt, pgp_pub_encrypt, pgp_sym_decrypt, pgp_pub_decrypt
ru: Значения: 0, 1 По умолчанию: 0 Применим к: pgp_sym_encrypt, pgp_pub_encrypt, pgp_sym_decrypt, pgp_pub_decrypt

source: Do not protect data with SHA-1. The only good reason to use this option is to achieve compatibility with ancient PGP products, predating the addition of SHA-1 protected packets to RFC 4880. Recent gnupg.org and pgp.com software supports it fine.
ru: Не защищать данные хешем SHA-1. Единственная разумная причина использовать этот параметр — добиться совместимости с древними программами PGP, вышедшими до того, как в RFC 4880 была предусмотрена защита пакетов с SHA-1. Все последние реализации с gnupg.org и pgp.com прекрасно поддерживают это.

source: Values: 0, 1 Default: 0 Applies to: pgp_sym_encrypt, pgp_pub_encrypt
ru: Значения: 0, 1 По умолчанию: 0 Применим к: pgp_sym_encrypt, pgp_pub_encrypt

source: Use separate session key. Public-key encryption always uses a separate session key; this option is for symmetric-key encryption, which by default uses the S2K key directly.
ru: Использовать отдельный сеансовый ключ. Для шифрования с открытым ключом всегда используется отдельный сеансовый ключ; этот параметр предназначен для шифрования с симметричным ключом, которое по умолчанию использует непосредственно ключ S2K.

source: Values: 0, 1 Default: 0 Applies to: pgp_sym_encrypt
ru: Значения: 0, 1 По умолчанию: 0 Применим к: pgp_sym_encrypt

source: Which S2K algorithm to use.
ru: Режим алгоритма S2K.

source: Values: 0 - Without salt. Dangerous! 1 - With salt but with fixed iteration count. 3 - Variable iteration count. Default: 3 Applies to: pgp_sym_encrypt
ru: Значения: 0 — Без соли. Опасно! 1 — С солью, но с фиксированным числом итераций. 3 — С переменным числом итераций. По умолчанию: 3 Применим к: pgp_sym_encrypt

source: The number of iterations of the S2K algorithm to use. It must be a value between 1024 and 65011712, inclusive.
ru: Число итераций для алгоритма S2K. Оно должно быть не меньше 1024 и не больше 65011712.

source: Default: A random value between 65536 and 253952 Applies to: pgp_sym_encrypt, only with s2k-mode=3
ru: По умолчанию: случайное значение между 65536 и 253952 Применим к: pgp_sym_encrypt, только с s2k-mode=3

source: Which digest algorithm to use in S2K calculation.
ru: Выбирает алгоритм хеширования, который будет использоваться для вычисления S2K.

source: Values: md5, sha1 Default: sha1 Applies to: pgp_sym_encrypt
ru: Значения: md5, sha1 По умолчанию: sha1 Применим к: pgp_sym_encrypt

source: Which cipher to use for encrypting separate session key.
ru: Выбирает шифр, который будет использоваться для шифрования отдельного сеансового ключа.

source: Values: bf, aes, aes128, aes192, aes256 Default: use cipher-algo Applies to: pgp_sym_encrypt
ru: Значения: bf, aes, aes128, aes192, aes256 По умолчанию: используется cipher-algo Применим к: pgp_sym_encrypt

source: Whether to convert textual data from database internal encoding to UTF-8 and back. If your database already is UTF-8, no conversion will be done, but the message will be tagged as UTF-8. Without this option it will not be.
ru: Определяет, преобразовывать ли текстовые данные из внутренней кодировки базы данных в UTF-8 и обратно. Если кодировка базы уже UTF-8, перекодировка не производится, но сообщение помечается как UTF-8. Без данного параметра этого не происходит.

source: Generating PGP Keys with GnuPG
ru: Формирование ключей PGP с применением GnuPG

source: To generate a new key: <placeholder-1/>
ru: Формирование нового ключа: <placeholder-1/>

source: The preferred key type is <quote>DSA and Elgamal</quote>.
ru: Предпочитаемый тип ключей: <quote>DSA and Elgamal</quote>.

source: For RSA encryption you must create either DSA or RSA sign-only key as master and then add an RSA encryption subkey with <literal>gpg --edit-key</literal>.
ru: Для шифрования RSA вы должны создать главный ключ либо DSA, либо RSA только для подписания, а затем добавить подключ для шифрования, выполнив команду <literal>gpg --edit-key</literal>.

source: To list keys: <placeholder-1/>
ru: Просмотр списка ключей: <placeholder-1/>

source: To export a public key in ASCII-armor format: <placeholder-1/>
ru: Экспорт открытого ключа в формате &laquo;ASCII Armor&raquo;: <placeholder-1/>

source: To export a secret key in ASCII-armor format: <placeholder-1/>
ru: Экспорт закрытого ключа в формате &laquo;ASCII Armor&raquo;: <placeholder-1/>

source: You need to use <function>dearmor()</function> on these keys before giving them to the PGP functions. Or if you can handle binary data, you can drop <literal>-a</literal> from the command.
ru: Прежде чем передавать эти ключи функциям PGP, вы должны применить функцию <function>dearmor()</function> к этим ключам. Либо, если вы можете обработать двоичные данные, уберите <literal>-a</literal> из команды.

source: For more details see <literal>man gpg</literal>, <ulink url="http://www.gnupg.org/gph/en/manual.html">The GNU Privacy Handbook</ulink> and other documentation on <ulink url="http://www.gnupg.org"/>.
ru: Дополнительную информацию вы можете получить в руководстве <literal>man gpg</literal>, <ulink url="http://www.gnupg.org/gph/en/manual.html">The GNU Privacy Handbook</ulink> (Руководство GNU по обеспечению конфиденциальности) и другой документации на сайте <ulink url="http://www.gnupg.org"/>.

source: Limitations of PGP Code
ru: Ограничения кода PGP

source: No support for signing. That also means that it is not checked whether the encryption subkey belongs to the master key.
ru: Не поддерживается подписывание. Это также означает, что принадлежность подключа шифрования главному ключу не проверяется.

source: No support for encryption key as master key. As such practice is generally discouraged, this should not be a problem.
ru: Не поддерживается использование ключа шифрования в качестве главного ключа. Так как подобная практика обычно не приветствуется, это не должно быть проблемой.

source: No support for several subkeys. This may seem like a problem, as this is common practice. On the other hand, you should not use your regular GPG/PGP keys with <filename>pgcrypto</filename>, but create new ones, as the usage scenario is rather different.
ru: Нет поддержки нескольких подключей. Это может представляться проблемой, так как такие ключи не редкость. С другой стороны, вы всё равно не должны использовать обычные ключи GPG/PGP с <filename>pgcrypto</filename>, а должны создать новые, учитывая, что это другой сценарий использования.

source: Raw Encryption Functions
ru: Низкоуровневые функции шифрования

source: These functions only run a cipher over data; they don't have any advanced features of PGP encryption. Therefore they have some major problems:
ru: Эти функции выполняют только шифрование данных; они не предоставляют расширенные возможности шифрования PGP. Таким образом, с ними связаны следующие проблемы:

source: They use user key directly as cipher key.
ru: Они используют ключ пользователя непосредственно в качестве ключа шифрования.

source: They don't provide any integrity checking, to see if the encrypted data was modified.
ru: Они не обеспечивают проверку целостности, которая должна выявлять модификацию зашифрованных данных.

source: They expect that users manage all encryption parameters themselves, even IV.
ru: Они рассчитаны на то, что пользователи будут управлять всеми параметрами шифрования самостоятельно, даже вектором инициализации.

source: They don't handle text.
ru: Они не рассчитаны на текст.

source: So, with the introduction of PGP encryption, usage of raw encryption functions is discouraged.
ru: Поэтому с появлением поддержки шифрования PGP использовать низкоуровневые функции шифрования не рекомендуется.

source: <literal>cbc</literal> &mdash; next block depends on previous (default)
ru: <literal>cbc</literal> &mdash; следующий блок зависит от предыдущего (по умолчанию)

source: <literal>ecb</literal> &mdash; each block is encrypted separately (for testing only)
ru: <literal>ecb</literal> &mdash; каждый блок шифруется отдельно (только для тестирования)

source: <literal>pkcs</literal> &mdash; data may be any length (default)
ru: <literal>pkcs</literal> &mdash; данные могут быть любой длины (по умолчанию)

source: <literal>none</literal> &mdash; data must be multiple of cipher block size
ru: <literal>none</literal> &mdash; размер данных должен быть кратен размеру блока шифра

source: Encrypt/decrypt data using the cipher method specified by <parameter>type</parameter>. The syntax of the <parameter>type</parameter> string is: <synopsis> <replaceable>algorithm</replaceable> <optional> <literal>-</literal> <replaceable>mode</replaceable> </optional> <optional> <literal>/pad:</literal> <replaceable>padding</replaceable> </optional> </synopsis> where <replaceable>algorithm</replaceable> is one of: <placeholder-1/> and <replaceable>mode</replaceable> is one of: <placeholder-2/> and <replaceable>padding</replaceable> is one of: <placeholder-3/>
ru: Эти функции зашифровывают/расшифровывают данные, применяя метод шифрования, заданный параметром <parameter>type</parameter>. Строка <parameter>type</parameter> имеет следующий формат: <synopsis> <replaceable>алгоритм</replaceable> <optional> <literal>-</literal> <replaceable>режим</replaceable> </optional> <optional> <literal>/pad:</literal> <replaceable>дозаполнение</replaceable> </optional> </synopsis> где допустимый <replaceable>алгоритм</replaceable>: <placeholder-1/> допустимый <replaceable>режим</replaceable>: <placeholder-2/> и допустимое <replaceable>дозаполнение</replaceable>: <placeholder-3/>

source: So, for example, these are equivalent: <placeholder-1/>
ru: Так что, например, эти вызовы равнозначны: <placeholder-1/>

source: In <function>encrypt_iv</function> and <function>decrypt_iv</function>, the <parameter>iv</parameter> parameter is the initial value for the CBC mode; it is ignored for ECB. It is clipped or padded with zeroes if not exactly block size. It defaults to all zeroes in the functions without this parameter.
ru: Для функций <function>encrypt_iv</function> и <function>decrypt_iv</function> параметр <parameter>iv</parameter> задаёт начальное значение для режима CBC; для ECB он игнорируется. Оно обрезается или дополняется нулями, если его размер не равен ровно размеру блока. В функциях без этого параметра оно по умолчанию заполняется нулями.

source: Random-Data Functions
ru: Функции получения случайных данных

source: Returns <parameter>count</parameter> cryptographically strong random bytes. At most 1024 bytes can be extracted at a time. This is to avoid draining the randomness generator pool.
ru: Возвращает криптографически стойкие случайные байты в количестве <parameter>count</parameter>. За один вызов можно получить максимум 1024 байт. Это ограничение предотвращает исчерпание пула энтропии.

source: Returns a version 4 (random) UUID.
ru: Возвращает UUID версии 4 (случайный).

source: Notes
ru: Замечания

source: Configuration
ru: Конфигурирование

source: <filename>pgcrypto</filename> configures itself according to the findings of the main PostgreSQL <literal>configure</literal> script. The options that affect it are <literal>--with-zlib</literal> and <literal>--with-openssl</literal>.
ru: Модуль <filename>pgcrypto</filename> настраивается согласно установкам, полученным в главном скрипте <literal>configure</literal> PostgreSQL. На его конфигурацию влияют аргументы <literal>--with-zlib</literal> и <literal>--with-openssl</literal>.

source: When compiled with zlib, PGP encryption functions are able to compress data before encrypting.
ru: При компиляции с zlib шифрующие функции PGP могут сжимать данные перед шифрованием.

source: When compiled with OpenSSL, there will be more algorithms available. Also public-key encryption functions will be faster as OpenSSL has more optimized BIGNUM functions.
ru: При компиляции с OpenSSL будут доступны дополнительные алгоритмы. Кроме того, функции шифрования с открытым ключом будут быстрее, так как OpenSSL содержит оптимизированные функции для работы с большими числами (BIGNUM).

source: Summary of Functionality with and without OpenSSL
ru: Обзор функциональности с и без OpenSSL

source: Functionality
ru: Функциональность

source: Built-in
ru: Встроенная

source: With OpenSSL
ru: С OpenSSL

source: Other digest algorithms
ru: Другие алгоритмы кеширования

source: yes (Note 1)
ru: да (Примечание 1)

source: yes (Note 2)
ru: да (Примечание 2)

source: Raw encryption
ru: Низкоуровневое шифрование

source: PGP Symmetric encryption
ru: Симметричное шифрование PGP

source: PGP Public-Key encryption
ru: Шифрование PGP с открытым ключом

source: Any digest algorithm OpenSSL supports is automatically picked up. This is not possible with ciphers, which need to be supported explicitly.
ru: Автоматически выбирается любой алгоритм кеширования, который поддерживает OpenSSL. Это невозможно с шифрами, они должны поддерживаться явно.

source: SHA2 algorithms were added to OpenSSL in version 0.9.8. For older versions, <filename>pgcrypto</filename> will use built-in code.
ru: Алгоритмы SHA2 были добавлены в OpenSSL в версии 0.9.8. С более старыми версиями <filename>pgcrypto</filename> использует встроенный код.

source: NULL Handling
ru: Обработка NULL

source: As is standard in SQL, all functions return NULL, if any of the arguments are NULL. This may create security risks on careless usage.
ru: Как и положено по стандарту SQL, все эти функции возвращают NULL, если один из аргументов — NULL. Это может угрожать безопасности при неаккуратном использовании.

source: Security Limitations
ru: Ограничения безопасности

source: All <filename>pgcrypto</filename> functions run inside the database server. That means that all the data and passwords move between <filename>pgcrypto</filename> and client applications in clear text. Thus you must:
ru: Все функции <filename>pgcrypto</filename> выполняются внутри сервера баз данных. Это означает, что все данные и пароли передаются между функциями <filename>pgcrypto</filename> и клиентскими приложениями открытым текстом. Поэтому вы должны:

source: Connect locally or use SSL connections.
ru: Подключаться локально или использовать подключения SSL.

source: Trust both system and database administrator.
ru: Доверять и системе, и администратору баз данных.

source: If you cannot, then better do crypto inside client application.
ru: Если это невозможно, лучше произвести шифрование в клиентском приложении.

source: The implementation does not resist <ulink url="http://en.wikipedia.org/wiki/Side-channel_attack">side-channel attacks</ulink>. For example, the time required for a <filename>pgcrypto</filename> decryption function to complete varies among ciphertexts of a given size.
ru: Эта реализация не противостоит <ulink url="http://en.wikipedia.org/wiki/Side-channel_attack">атакам по сторонним каналам</ulink>. Например, время, требующееся для выполнения функции дешифрования <filename>pgcrypto</filename>, будет разным для разного шифротекста заданного размера.

source: Useful Reading
ru: Полезное чтение

source: The GNU Privacy Handbook.
ru: The GNU Privacy Handbook (Руководство GNU по обеспечению конфиденциальности)

source: Describes the crypt-blowfish algorithm.
ru: Описывает алгоритм crypt-blowfish.

source: How to choose a good password.
ru: Как выбрать хороший пароль.

source: Interesting idea for picking passwords.
ru: Интересный способ выбора пароля.

source: Describes good and bad cryptography.
ru: Описывает хорошую и плохую криптографию.

source: Technical References
ru: Техническая информация

source: OpenPGP message format.
ru: Формат сообщений OpenPGP.

source: The MD5 Message-Digest Algorithm.
ru: Алгоритм вычисления дайджеста сообщения MD5.

source: HMAC: Keyed-Hashing for Message Authentication.
ru: HMAC: Хеширование по ключу для аутентификации сообщений.

source: Comparison of crypt-des, crypt-md5 and bcrypt algorithms.
ru: Сравнение алгоритмов crypt-des, crypt-md5 и bcrypt.

source: Description of Fortuna CSPRNG.
ru: Описание Fortuna CSPRNG.

source: Jean-Luc Cooke Fortuna-based <filename>/dev/random</filename> driver for Linux.
ru: Драйвер <filename>/dev/random</filename> для Linux на базе Fortuna, написанный Жан-Люком Куком.

source: Collection of cryptology pointers.
ru: Коллекция ссылок по криптологии.

# title
source: Author
ru: Автор

source: Marko Kreen <email>markokr@gmail.com</email>
ru: Марко Крин <email>markokr@gmail.com</email>

source: <filename>pgcrypto</filename> uses code from the following sources:
ru: Модуль <filename>pgcrypto</filename> заимствует код из следующих источников:

# entry
source: Author
ru: Автор

source: Source origin
ru: Источник исходного кода

source: DES crypt
ru: Шифрование DES

source: David Burren and others
ru: Дэвид Буррен и другие

source: MD5 crypt
ru: Хеширование MD5

source: Poul-Henning Kamp
ru: Пол-Хеннинг Камп

source: Blowfish crypt
ru: Шифрование Blowfish

source: Blowfish cipher
ru: Шифр Blowfish

source: Simon Tatham
ru: Саймон Тэтем

source: Rijndael cipher
ru: Шифр Rijndael

source: Brian Gladman
ru: Брайан Глэдмен

source: MD5 hash and SHA1
ru: Хеш MD5 и SHA1

source: WIDE Project
ru: Проект WIDE

source: Aaron D. Gifford
ru: Аарон Д. Гиффорд

source: BIGNUM math
ru: Математика BIGNUM

source: Michael J. Fromberger
ru: Майкл Дж. Фромбергер

source: yes (Note 3)
ru: да (Примечание 3)

source: AES is included in OpenSSL since version 0.9.7. For older versions, <filename>pgcrypto</filename> will use built-in code.
ru: AES включён в OpenSSL, начиная с версии 0.9.7. С более старыми версиями <filename>pgcrypto</filename> использует встроенный код.
