Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/pgcrypto.po
Languages: ru

source: <primary>encryption</primary> <secondary>for specific columns</secondary>
ru: <primary>шифрование</primary> <secondary>избранных столбцов</secondary>

source: The <filename>pgcrypto</filename> module provides cryptographic functions for <productname>PostgreSQL</productname>.
ru: Модуль <filename>pgcrypto</filename> предоставляет криптографические функции для <productname>PostgreSQL</productname>.

source: General Hashing Functions
ru: Стандартные функции хеширования

source: Computes a binary hash of the given <parameter>data</parameter>. <parameter>type</parameter> is the algorithm to use. Standard algorithms are <literal>md5</literal>, <literal>sha1</literal>, <literal>sha224</literal>, <literal>sha256</literal>, <literal>sha384</literal> and <literal>sha512</literal>. If <filename>pgcrypto</filename> was built with OpenSSL, more algorithms are available, as detailed in <xref linkend="pgcrypto-with-without-openssl"/>.
ru: Вычисляет двоичный хеш данных (<parameter>data</parameter>). Параметр <parameter>type</parameter> выбирает используемый алгоритм. Поддерживаются стандартные алгоритмы: <literal>md5</literal>, <literal>sha1</literal>, <literal>sha224</literal>, <literal>sha256</literal>, <literal>sha384</literal> и <literal>sha512</literal>. Если модуль <filename>pgcrypto</filename> собирался с OpenSSL, становятся доступны и другие алгоритмы, как описано в <xref remap="6" linkend="pgcrypto-with-without-openssl"/>.

source: If you want the digest as a hexadecimal string, use <function>encode()</function> on the result. For example: <placeholder-1/>
ru: Если вы хотите получить дайджест в виде шестнадцатеричной строки, примените <function>encode()</function> к результату. Например: <placeholder-1/>

source: Calculates hashed MAC for <parameter>data</parameter> with key <parameter>key</parameter>. <parameter>type</parameter> is the same as in <function>digest()</function>.
ru: Вычисляет имитовставку на основе хеша для данных <parameter>data</parameter> с ключом <parameter>key</parameter>. Параметр <parameter>type</parameter> имеет то же значение, что и для <function>digest()</function>.

source: This is similar to <function>digest()</function> but the hash can only be recalculated knowing the key. This prevents the scenario of someone altering data and also changing the hash to match.
ru: Эта функция похожа на <function>digest()</function>, но вычислить хеш с ней можно, только зная ключ. Это защищает от сценария подмены данных и хеша вместе с ними.

source: If the key is larger than the hash block size it will first be hashed and the result will be used as key.
ru: Если размер ключа больше размера блока хеша, он сначала хешируется, а затем используется в качестве ключа хеширования данных.

source: Password Hashing Functions
ru: Функции хеширования пароля

source: The functions <function>crypt()</function> and <function>gen_salt()</function> are specifically designed for hashing passwords. <function>crypt()</function> does the hashing and <function>gen_salt()</function> prepares algorithm parameters for it.
ru: Функции <function>crypt()</function> и <function>gen_salt()</function> разработаны специально для хеширования паролей. Функция <function>crypt()</function> выполняет хеширование, а <function>gen_salt()</function> подготавливает параметры алгоритма для неё.

source: The algorithms in <function>crypt()</function> differ from the usual MD5 or SHA1 hashing algorithms in the following respects:
ru: Алгоритмы в <function>crypt()</function> отличаются от обычных алгоритмов хеширования MD5 и SHA1 в следующих аспектах:

source: They are slow. As the amount of data is so small, this is the only way to make brute-forcing passwords hard.
ru: Они медленные. Так как объём данных невелик, это единственный способ усложнить перебор паролей.

source: They use a random value, called the <firstterm>salt</firstterm>, so that users having the same password will have different encrypted passwords. This is also an additional defense against reversing the algorithm.
ru: Они используют случайное значение, называемое <firstterm>солью</firstterm>, чтобы у пользователей с одинаковыми паролями зашифрованные пароли оказывались разными. Это также обеспечивает дополнительную защиту от получения обратного алгоритма.

source: They include the algorithm type in the result, so passwords hashed with different algorithms can co-exist.
ru: Они включают в результат тип алгоритма, что допускает сосуществование паролей, хешированных разными алгоритмами.

source: Some of them are adaptive &mdash; that means when computers get faster, you can tune the algorithm to be slower, without introducing incompatibility with existing passwords.
ru: Некоторые из них являются адаптируемыми &mdash; то есть с ростом производительности компьютеров эти алгоритмы можно настроить так, чтобы они стали медленнее, при этом сохраняя совместимость с существующими паролями.

source: <xref linkend="pgcrypto-crypt-algorithms"/> lists the algorithms supported by the <function>crypt()</function> function.
ru: В <xref remap="6" linkend="pgcrypto-crypt-algorithms"/> перечислены алгоритмы, поддерживаемые функцией <function>crypt()</function>.

source: Supported Algorithms for <function>crypt()</function>
ru: Алгоритмы, которые поддерживает <function>crypt()</function>

source: Algorithm
ru: Алгоритм

source: Max Password Length
ru: Макс. длина пароля

source: Adaptive?
ru: Адаптивный?

source: Salt Bits
ru: Размер соли (бит)

source: Output Length
ru: Размер результата

source: Description
ru: Описание

source: yes
ru: да

source: Blowfish-based, variant 2a
ru: На базе Blowfish, вариация 2a

source: unlimited
ru: без ограничений

source: no
ru: нет

source: MD5-based crypt
ru: crypt на базе MD5

source: Extended DES
ru: Расширенный DES

source: Original UNIX crypt
ru: Изначальный crypt из UNIX

source: Calculates a crypt(3)-style hash of <parameter>password</parameter>. When storing a new password, you need to use <function>gen_salt()</function> to generate a new <parameter>salt</parameter> value. To check a password, pass the stored hash value as <parameter>salt</parameter>, and test whether the result matches the stored value.
ru: Вычисляет хеш пароля (<parameter>password</parameter>) в стиле crypt(3). Для сохранения нового пароля необходимо вызвать <function>gen_salt()</function>, чтобы сгенерировать новое значение соли (<parameter>salt</parameter>). Для проверки пароля нужно передать сохранённое значение хеша в параметре <parameter>salt</parameter> и проверить, соответствует ли результат сохранённому значению.

source: Example of setting a new password: <placeholder-1/>
ru: Пример установки нового пароля: <placeholder-1/>

source: Example of authentication: <placeholder-1/> This returns <literal>true</literal> if the entered password is correct.
ru: Пример проверки пароля: <placeholder-1/> Этот запрос возвращает <literal>true</literal>, если введённый пароль правильный.

source: Generates a new random salt string for use in <function>crypt()</function>. The salt string also tells <function>crypt()</function> which algorithm to use.
ru: Вычисляет новое случайное значение соли для функции <function>crypt()</function>. Строка соли также говорит <function>crypt()</function>, какой алгоритм использовать.

source: The <parameter>type</parameter> parameter specifies the hashing algorithm. The accepted types are: <literal>des</literal>, <literal>xdes</literal>, <literal>md5</literal> and <literal>bf</literal>.
ru: Параметр <parameter>type</parameter> задаёт алгоритм хеширования. Принимаются следующие варианты: <literal>des</literal>, <literal>xdes</literal>, <literal>md5</literal> и <literal>bf</literal>.

source: The <parameter>iter_count</parameter> parameter lets the user specify the iteration count, for algorithms that have one. The higher the count, the more time it takes to hash the password and therefore the more time to break it. Although with too high a count the time to calculate a hash may be several years &mdash; which is somewhat impractical. If the <parameter>iter_count</parameter> parameter is omitted, the default iteration count is used. Allowed values for <parameter>iter_count</parameter> depend on the algorithm and are shown in <xref linkend="pgcrypto-icfc-table"/>.
ru: Параметр <parameter>iter_count</parameter> позволяет пользователю указать счётчик итераций для алгоритма, который его принимает. Чем больше это число, тем больше времени уйдёт на вычисление хеша пароля, а значит, тем больше времени понадобится, чтобы взломать его. Хотя со слишком большим значением время вычисления хеша может вырасти до нескольких лет &mdash; это вряд ли практично. Когда параметр <parameter>iter_count</parameter> опускается, применяется количество итераций по умолчанию. Множество допустимых значений для <parameter>iter_count</parameter> зависит от алгоритма, как показано в <xref remap="6" linkend="pgcrypto-icfc-table"/>.

source: Iteration Counts for <function>crypt()</function>
ru: Счётчики итераций для <function>crypt()</function>

source: Default
ru: По умолчанию

source: Min
ru: Мин.

source: Max
ru: Макс.

source: For <literal>xdes</literal> there is an additional limitation that the iteration count must be an odd number.
ru: Для <literal>xdes</literal> есть дополнительное ограничение: счётчик итераций должен быть нечётным.

source: To pick an appropriate iteration count, consider that the original DES crypt was designed to have the speed of 4 hashes per second on the hardware of that time. Slower than 4 hashes per second would probably dampen usability. Faster than 100 hashes per second is probably too fast.
ru: При выборе подходящего числа итераций учтите, что оригинальный алгоритм DES crypt был рассчитан так, чтобы выдавать 4 хеша в секунду на компьютерах того времени. Если за секунду будет вычисляться меньше 4 хешей, скорее всего, возникнут определённые неудобства при пользовании. С другой стороны, скорость больше, чем 100 хешей в секунду, вероятно, будет слишком высокой.

source: <xref linkend="pgcrypto-hash-speed-table"/> gives an overview of the relative slowness of different hashing algorithms. The table shows how much time it would take to try all combinations of characters in an 8-character password, assuming that the password contains either only lower case letters, or upper- and lower-case letters and numbers. In the <literal>crypt-bf</literal> entries, the number after a slash is the <parameter>iter_count</parameter> parameter of <function>gen_salt</function>.
ru: В <xref remap="6" linkend="pgcrypto-hash-speed-table"/> дана сводка относительной скорости различных алгоритмов хеширования. В таблице показано, сколько времени уйдёт на перебор всех комбинацией символов в восьмисимвольном пароле, в предположении, что пароль содержит только буквы в нижнем регистре, либо буквы в верхнем и нижнем регистре, а также цифры. В строках <literal>crypt-bf</literal> числа после косой черты показывают значение параметра <parameter>iter_count</parameter> функции <function>gen_salt</function>.

source: Hash Algorithm Speeds
ru: Скорости алгоритмов хеширования

source: Hashes/sec
ru: Хешей/сек.

source: For <literal>[a-z]</literal>
ru: Для <literal>[a-z]</literal>

source: For <literal>[A-Za-z0-9]</literal>
ru: Для <literal>[A-Za-z0-9]</literal>

source: Duration relative to <literal>md5 hash</literal>
ru: Длительность относительно <literal>md5</literal>

source: 4 years
ru: 4 года

source: 3927 years
ru: 3927 лет

source: 2 years
ru: 2 года

source: 1929 years
ru: 1929 лет

source: 1 year
ru: 1 год

source: 982 years
ru: 982 лет

source: 188 days
ru: 188 дней

source: 521 years
ru: 521 лет

source: 15 days
ru: 15 дней

source: 41 years
ru: 41 год

source: 157.5 minutes
ru: 157.5 минут

source: 108 days
ru: 108 дней

source: 90 minutes
ru: 90 минут

source: 68 days
ru: 68 дней

source: <literal>md5</literal> (hash)
ru: <literal>md5</literal> (хеш)

source: 22.5 minutes
ru: 22.5 минут

source: 17 days
ru: 17 дней

source: Notes:
ru: Замечания:

source: The machine used is an Intel Mobile Core i3.
ru: Для расчётов использовался процессор Intel Mobile Core i3.

source: <literal>crypt-des</literal> and <literal>crypt-md5</literal> algorithm numbers are taken from John the Ripper v1.6.38 <literal>-test</literal> output.
ru: Показатели алгоритмов <literal>crypt-des</literal> и <literal>crypt-md5</literal> взяты из вывода теста программы John the Ripper v1.6.38.

source: <literal>md5 hash</literal> numbers are from mdcrack 1.2.
ru: Показатели <literal>md5</literal> получены программой mdcrack 1.2.

source: <literal>sha1</literal> numbers are from lcrack-20031130-beta.
ru: Показатели <literal>sha1</literal> получены программой lcrack-20031130-beta.

source: <literal>crypt-bf</literal> numbers are taken using a simple program that loops over 1000 8-character passwords. That way I can show the speed with different numbers of iterations. For reference: <literal>john -test</literal> shows 13506 loops/sec for <literal>crypt-bf/5</literal>. (The very small difference in results is in accordance with the fact that the <literal>crypt-bf</literal> implementation in <filename>pgcrypto</filename> is the same one used in John the Ripper.)
ru: Показатели <literal>crypt-bf</literal> получены простой программой, обрабатывающей в цикле 1000 паролей из 8-символов. Таким способом можно показать скорость с разным числом итераций. Для справки: <literal>john -test</literal> показывает 13506 циклов/с для <literal>crypt-bf/5</literal>. (Это очень небольшое различие в результатах согласуется с тем фактом, что реализация <literal>crypt-bf</literal> в <filename>pgcrypto</filename> не отличается от применяемой в программе John the Ripper.)

source: Note that <quote>try all combinations</quote> is not a realistic exercise. Usually password cracking is done with the help of dictionaries, which contain both regular words and various mutations of them. So, even somewhat word-like passwords could be cracked much faster than the above numbers suggest, while a 6-character non-word-like password may escape cracking. Or not.
ru: Заметьте, что вариант <quote>перепробовать все комбинации</quote> не вполне реалистичен. Обычно перебор паролей производится с применением словарей, которые содержат и обычные слова, и их различные видоизменения. Поэтому даже похожие на слова пароли обычно можно подобрать быстрее, чем за указанное время, тогда как 6-символьный несловесный пароль может избежать взлома. А может и не избежать.

source: PGP Encryption Functions
ru: Функции шифрования на базе PGP

source: The functions here implement the encryption part of the OpenPGP (RFC 4880) standard. Supported are both symmetric-key and public-key encryption.
ru: Функции, описанные здесь, реализуют часть стандарта OpenPGP (RFC 4880), относящуюся к шифрованию. Они поддерживают шифрование как с симметричным, так и с закрытым ключом.

source: An encrypted PGP message consists of 2 parts, or <firstterm>packets</firstterm>:
ru: Зашифрованное PGP сообщение состоит из 2 частей или <firstterm>пакетов</firstterm>:

source: Packet containing a session key &mdash; either symmetric-key or public-key encrypted.
ru: Пакет, содержащий сеансовый ключ &mdash; либо симметричный, либо открытый (в зашифрованном виде).

source: Packet containing data encrypted with the session key.
ru: Пакет, содержащий данные, зашифрованные сеансовым ключом.

source: When encrypting with a symmetric key (i.e., a password):
ru: При шифровании с симметричным ключом (то есть, паролем):

source: The given password is hashed using a String2Key (S2K) algorithm. This is rather similar to <function>crypt()</function> algorithms &mdash; purposefully slow and with random salt &mdash; but it produces a full-length binary key.
ru: Заданный пароль хешируется по алгоритму String2Key (S2K). Этот алгоритм подобен алгоритмам <function>crypt()</function> &mdash; специально замедлен и добавляет случайную соль &mdash; но на выход выдаёт двоичный ключ полной длины.

source: If a separate session key is requested, a new random key will be generated. Otherwise the S2K key will be used directly as the session key.
ru: Если требуется отдельный сеансовый ключ, генерируется новый случайный ключ. В противном случае в качестве сеансового будет использоваться непосредственно ключ S2K.

source: If the S2K key is to be used directly, then only S2K settings will be put into the session key packet. Otherwise the session key will be encrypted with the S2K key and put into the session key packet.
ru: Когда используется непосредственно ключ S2K, в пакет сеансового ключа помещаются только параметры S2K. В противном случае сеансовый ключ шифруется ключом S2K и результат помещается в пакет сеансового ключа.

source: When encrypting with a public key:
ru: При шифровании с открытым ключом:

source: A new random session key is generated.
ru: Генерируется новый случайный сеансовый ключ.

source: It is encrypted using the public key and put into the session key packet.
ru: Он зашифровывается открытым ключом и помещается в пакет сеансового ключа.

source: In either case the data to be encrypted is processed as follows:
ru: В любом случае данные, которые должны быть зашифрованы, обрабатываются так:

source: Optional data-manipulation: compression, conversion to UTF-8, and/or conversion of line-endings.
ru: Необязательная подготовка данных: сжатие, перекодировка в UTF-8 и/или преобразование концов строк.

source: The data is prefixed with a block of random bytes. This is equivalent to using a random IV.
ru: Перед данными добавляется блок случайных байт. Это равносильно использованию случайного вектора инициализации.

source: An SHA1 hash of the random prefix and data is appended.
ru: В конце добавляется хеш SHA1 случайного префикса и данных.

source: All this is encrypted with the session key and placed in the data packet.
ru: Всё это шифруется сеансовым ключом и помещается в пакет данных.

source: Encrypt <parameter>data</parameter> with a symmetric PGP key <parameter>psw</parameter>. The <parameter>options</parameter> parameter can contain option settings, as described below.
ru: Шифрует данные (<parameter>data</parameter>) симметричным ключом PGP <parameter>psw</parameter>. В <parameter>options</parameter> могут передаваться криптографические параметры, описанные ниже.

source: Decrypt a symmetric-key-encrypted PGP message.
ru: Расшифровывает сообщение, зашифрованное симметричным ключом PGP.

source: Decrypting <type>bytea</type> data with <function>pgp_sym_decrypt</function> is disallowed. This is to avoid outputting invalid character data. Decrypting originally textual data with <function>pgp_sym_decrypt_bytea</function> is fine.
ru: Расшифровывать данные <type>bytea</type> функцией <function>pgp_sym_decrypt</function> запрещено. Это ограничение введено, чтобы не допустить вывода некорректных символьных данных. Расшифровывать изначально текстовые данные с помощью <function>pgp_sym_decrypt_bytea</function> можно без ограничений.

source: The <parameter>options</parameter> parameter can contain option settings, as described below.
ru: Аргумент <parameter>options</parameter> может содержать криптографические параметры, описанные ниже.

source: Encrypt <parameter>data</parameter> with a public PGP key <parameter>key</parameter>. Giving this function a secret key will produce an error.
ru: Зашифровывает данные (<parameter>data</parameter>) открытым ключом PGP (<parameter>key</parameter>). Если передать этой функции закрытый ключ, она выдаст ошибку.

source: Decrypt a public-key-encrypted message. <parameter>key</parameter> must be the secret key corresponding to the public key that was used to encrypt. If the secret key is password-protected, you must give the password in <parameter>psw</parameter>. If there is no password, but you want to specify options, you need to give an empty password.
ru: Расшифровывает сообщение, зашифрованное открытым ключом. В <parameter>key</parameter> должен передаваться закрытый ключ, соответствующий открытому ключу, применяющемуся при шифровании. Если секретный ключ защищён паролем, этот пароль нужно передать в параметре <parameter>psw</parameter>. Если пароля нет, но необходимо передать криптографические параметры, вы должны передать пустой пароль.

source: Decrypting <type>bytea</type> data with <function>pgp_pub_decrypt</function> is disallowed. This is to avoid outputting invalid character data. Decrypting originally textual data with <function>pgp_pub_decrypt_bytea</function> is fine.
ru: Расшифровывать данные <type>bytea</type> функцией <function>pgp_pub_decrypt</function> запрещено. Это ограничение введено, чтобы не допустить вывода недопустимых символьных данных. Расшифровывать изначально текстовые данные с помощью <function>pgp_pub_decrypt_bytea</function> можно без ограничений.

source: <function>pgp_key_id</function> extracts the key ID of a PGP public or secret key. Or it gives the key ID that was used for encrypting the data, if given an encrypted message.
ru: <function>pgp_key_id</function> извлекает идентификатор ключа из открытого или закрытого ключа PGP. Она также может выдать идентификатор ключа, которым были зашифрованы данные, если ей передаётся зашифрованное сообщение.

source: It can return 2 special key IDs:
ru: Она может выдать два специальных идентификатора ключа:

source: The message is encrypted with a symmetric key.
ru: Сообщение зашифровано симметричным ключом.

source: The message is public-key encrypted, but the key ID has been removed. That means you will need to try all your secret keys on it to see which one decrypts it. <filename>pgcrypto</filename> itself does not produce such messages.
ru: Сообщение зашифровано открытом ключом, но идентификатор ключа был удалён. Это означает, что вам надо будет перепробовать ключи, чтобы подобрать подходящий. Сама библиотека <filename>pgcrypto</filename> не генерирует такие сообщения.

source: Note that different keys may have the same ID. This is rare but a normal event. The client application should then try to decrypt with each one, to see which fits &mdash; like handling <literal>ANYKEY</literal>.
ru: Заметьте, что разные ключи могут иметь одинаковый идентификатор. Это редкое, но не невероятное явление. В таком случае клиентское приложение должно пытаться расшифровать данные с каждым ключом, пока не найдёт подходящий &mdash; примерно так же, как и с <literal>ANYKEY</literal>.

source: These functions wrap/unwrap binary data into PGP ASCII-armor format, which is basically Base64 with CRC and additional formatting.
ru: Эти функции переводят двоичные данные в/из формата PGP &laquo;ASCII Armor&raquo;, по сути представляющий собой кодировку Base64 с контрольными суммами и дополнительным форматированием.

source: If the <parameter>keys</parameter> and <parameter>values</parameter> arrays are specified, an <firstterm>armor header</firstterm> is added to the armored format for each key/value pair. Both arrays must be single-dimensional, and they must be of the same length. The keys and values cannot contain any non-ASCII characters.
ru: Если задаются массивы <parameter>keys</parameter> и <parameter>values</parameter>, для каждой пары ключ/значения в формат Armor добавляется <firstterm>заголовок Armor</firstterm>. Оба массива должны быть одномерными и иметь одинаковую длину. Задаваемые ключи и значения могут содержать только символы ASCII.

source: <function>pgp_armor_headers()</function> extracts the armor headers from <parameter>data</parameter>. The return value is a set of rows with two columns, key and value. If the keys or values contain any non-ASCII characters, they are treated as UTF-8.
ru: Функция <function>pgp_armor_headers()</function> извлекает заголовки Armor из параметра <parameter>data</parameter>. Она возвращает набор строк с двумя столбцами, key и value. Если в ключах или значениях оказываются символы не ASCII, они воспринимаются как UTF-8.
