Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/pgtrgm.po
Languages: ru

source: The <filename>pg_trgm</filename> module provides functions and operators for determining the similarity of alphanumeric text based on trigram matching, as well as index operator classes that support fast searching for similar strings.
ru: Модуль <filename>pg_trgm</filename> предоставляет функции и операторы для определения схожести алфавитно-цифровых строк на основе триграмм, а также классы операторов индексов, поддерживающие быстрый поиск схожих строк.

source: Trigram (or Trigraph) Concepts
ru: Понятия, связанные с триграммами (или триграфами)

source: A trigram is a group of three consecutive characters taken from a string. We can measure the similarity of two strings by counting the number of trigrams they share. This simple idea turns out to be very effective for measuring the similarity of words in many natural languages.
ru: Триграмма — это группа трёх последовательных символов, взятых из строки. Мы можем измерить схожесть двух строк, подсчитав число триграмм, которые есть в обеих. Эта простая идея оказывается очень эффективной для измерения схожести слов на многих естественных языках.

source: <filename>pg_trgm</filename> ignores non-word characters (non-alphanumerics) when extracting trigrams from a string. Each word is considered to have two spaces prefixed and one space suffixed when determining the set of trigrams contained in the string. For example, the set of trigrams in the string <quote><literal>cat</literal></quote> is <quote><literal> c</literal></quote>, <quote><literal> ca</literal></quote>, <quote><literal>cat</literal></quote>, and <quote><literal>at </literal></quote>. The set of trigrams in the string <quote><literal>foo|bar</literal></quote> is <quote><literal> f</literal></quote>, <quote><literal> fo</literal></quote>, <quote><literal>foo</literal></quote>, <quote><literal>oo </literal></quote>, <quote><literal> b</literal></quote>, <quote><literal> ba</literal></quote>, <quote><literal>bar</literal></quote>, and <quote><literal>ar </literal></quote>.
ru: <filename>pg_trgm</filename>, извлекая триграммы из строк, игнорирует символы, не относящиеся к словам (не алфавитно-цифровые). При выделении триграмм, содержащихся в строке, считается, что перед каждым словом находятся два пробела, а после — один пробел. Например, из строки <quote><literal>cat</literal></quote> выделяется набор триграмм: <quote><literal> c</literal></quote>, <quote><literal> ca</literal></quote>, <quote><literal>cat</literal></quote> и <quote><literal>at </literal></quote>. Из строки <quote><literal>foo|bar</literal></quote> выделяются триграммы: <quote><literal> f</literal></quote>, <quote><literal> fo</literal></quote>, <quote><literal>foo</literal></quote>, <quote><literal>oo </literal></quote>, <quote><literal> b</literal></quote>, <quote><literal> ba</literal></quote>, <quote><literal>bar</literal></quote> и <quote><literal>ar </literal></quote>.

source: Functions and Operators
ru: Функции и операторы

source: The functions provided by the <filename>pg_trgm</filename> module are shown in <xref linkend="pgtrgm-func-table"/>, the operators in <xref linkend="pgtrgm-op-table"/>.
ru: Реализованные в модуле <filename>pg_trgm</filename> функции перечислены в <xref remap="6" linkend="pgtrgm-func-table"/>, а операторы — в <xref remap="6" linkend="pgtrgm-op-table"/>.

source: <filename>pg_trgm</filename> Functions
ru: Функции <filename>pg_trgm</filename>

source: Function
ru: Функция

source: Returns
ru: Возвращает

source: Description
ru: Описание

source: Returns a number that indicates how similar the two arguments are. The range of the result is zero (indicating that the two strings are completely dissimilar) to one (indicating that the two strings are identical).
ru: Возвращает число, показывающее, насколько близки два аргумента. Диапазон результатов — от нуля (это значение указывает, что две строки полностью различны) до одного (это значение указывает, что две строки идентичны).

source: Returns an array of all the trigrams in the given string. (In practice this is seldom useful except for debugging.)
ru: Возвращает массив всех триграмм в заданной строке. (На практике это редко бывает полезно, кроме как для отладки.)

source: Returns a number that indicates how similar the first string to the most similar word of the second string. The function searches in the second string a most similar word not a most similar substring. The range of the result is zero (indicating that the two strings are completely dissimilar) to one (indicating that the first string is identical to one of the words of the second string).
ru: Возвращает число, показывающее, насколько слово в первой строке схоже с наиболее похожим на него словом во второй строке. Эта функция ищет во второй строке наиболее похожее слово, а не подстроку. Результат выдаётся в интервале от нуля (строки полностью различны) до одного (первая строка в точности совпадает с одним из слов во второй строке).

source: Returns the current similarity threshold used by the <literal>%</literal> operator. This sets the minimum similarity between two words for them to be considered similar enough to be misspellings of each other, for example (<emphasis>deprecated</emphasis>).
ru: Возвращает текущий порог схожести, который использует оператор <literal>%</literal>. Это значение задаёт минимальную схожесть между двумя словами, при которой они считаются настолько близкими, что одно может быть, например, ошибочным написанием другого (<emphasis>устаревшая</emphasis>).

source: Sets the current similarity threshold that is used by the <literal>%</literal> operator. The threshold must be between 0 and 1 (default is 0.3). Returns the same value passed in (<emphasis>deprecated</emphasis>).
ru: Задаёт текущий порог схожести, который использует оператор <literal>%</literal>. Это значение должно быть в диапазоне от 0 до 1 (по умолчанию 0.3). Возвращает то же значение, что было передано на вход (<emphasis>устаревшая</emphasis>).

source: <filename>pg_trgm</filename> Operators
ru: Операторы <filename>pg_trgm</filename>

source: Operator
ru: Оператор

source: Returns <literal>true</literal> if its arguments have a similarity that is greater than the current similarity threshold set by <varname>pg_trgm.similarity_threshold</varname>.
ru: Возвращает <literal>true</literal>, если схожесть аргументов выше текущего порога, заданного параметром <varname>pg_trgm.similarity_threshold</varname>.

source: Returns <literal>true</literal> if its first argument has the similar word in the second argument and they have a similarity that is greater than the current word similarity threshold set by <varname>pg_trgm.word_similarity_threshold</varname> parameter.
ru: Возвращает <literal>true</literal>, если первый аргумент функции содержит слово, похожее на слово во втором аргументе, и их степень схожести выше текущего порога, заданного параметром <varname>pg_trgm.word_similarity_threshold</varname>.

source: Commutator of the <literal>&lt;%</literal> operator.
ru: Оператор, коммутирующий для <literal>&lt;%</literal>.

source: Returns the <quote>distance</quote> between the arguments, that is one minus the <function>similarity()</function> value.
ru: Возвращает <quote>расстояние</quote> между аргументами, то есть один минус значение <function>similarity()</function>.

source: Returns the <quote>distance</quote> between the arguments, that is one minus the <function>word_similarity()</function> value.
ru: Возвращает <quote>расстояние</quote> между аргументами, то есть один минус значение <function>word_similarity()</function>.

source: Commutator of the <literal>&lt;&lt;-&gt;</literal> operator.
ru: Оператор, коммутирующий для <literal>&lt;&lt;-&gt;</literal>.

source: GUC Parameters
ru: Параметры GUC

source: <primary><varname>pg_trgm.similarity_threshold</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>pg_trgm.similarity_threshold</varname></primary>

source: Sets the current similarity threshold that is used by the <literal>%</literal> operator. The threshold must be between 0 and 1 (default is 0.3).
ru: Задаёт текущий порог схожести, который использует оператор <literal>%</literal>. Это значение должно быть в диапазоне от 0 до 1 (по умолчанию 0.3).

source: <primary><varname>pg_trgm.word_similarity_threshold</varname> configuration parameter </primary>
ru: <primary>параметр конфигурации <varname>pg_trgm.word_similarity_threshold</varname></primary>

source: Sets the current word similarity threshold that is used by <literal>&lt;%</literal> and <literal>%&gt;</literal> operators. The threshold must be between 0 and 1 (default is 0.6).
ru: Задаёт текущий порог схожести, который используют операторы <literal>&lt;%</literal> и <literal>%&gt;</literal>. Это значение должно быть в диапазоне от 0 до 1 (по умолчанию 0.6).

source: Index Support
ru: Поддержка индексов

source: The <filename>pg_trgm</filename> module provides GiST and GIN index operator classes that allow you to create an index over a text column for the purpose of very fast similarity searches. These index types support the above-described similarity operators, and additionally support trigram-based index searches for <literal>LIKE</literal>, <literal>ILIKE</literal>, <literal>~</literal> and <literal>~*</literal> queries. (These indexes do not support equality nor simple comparison operators, so you may need a regular B-tree index too.)
ru: Модуль <filename>pg_trgm</filename> предоставляет классы операторов индексов GiST и GIN, позволяющие создавать индекс по текстовым столбцам для очень быстрого поиска по критерию схожести. Эти типы индексов поддерживают вышеописанные операторы схожести и дополнительно поддерживают поиск на основе триграмм для запросов с <literal>LIKE</literal>, <literal>ILIKE</literal>, <literal>~</literal> и <literal>~*</literal>. (Эти индексы не поддерживают простые операторы сравнения и равенства, так что вам может понадобиться и обычный индекс-B-дерево.)

source: Example: <placeholder-1/> or <placeholder-2/>
ru: Пример: <placeholder-1/> или <placeholder-2/>

source: SELECT t, similarity(t, '<replaceable>word</replaceable>') AS sml FROM test_trgm WHERE t % '<replaceable>word</replaceable>' ORDER BY sml DESC, t;
ru: SELECT t, similarity(t, '<replaceable>слово</replaceable>') AS sml FROM test_trgm WHERE t % '<replaceable>слово</replaceable>' ORDER BY sml DESC, t;

source: At this point, you will have an index on the <structfield>t</structfield> column that you can use for similarity searching. A typical query is <placeholder-1/> This will return all values in the text column that are sufficiently similar to <replaceable>word</replaceable>, sorted from best match to worst. The index will be used to make this a fast operation even over very large data sets.
ru: На этот момент у вас будет индекс по столбцу <structfield>t</structfield>, используя который можно осуществлять поиск по схожести. Пример типичного запроса: <placeholder-1/> Он выдаст все значения в текстовом столбце, которые достаточно схожи со словом <replaceable>word</replaceable>, в порядке сортировки от наиболее к наименее схожим. Благодаря использованию индекса, эта операция будет быстрой даже с очень большими наборами данных.

source: SELECT t, t &lt;-&gt; '<replaceable>word</replaceable>' AS dist FROM test_trgm ORDER BY dist LIMIT 10;
ru: SELECT t, t &lt;-&gt; '<replaceable>слово</replaceable>' AS dist FROM test_trgm ORDER BY dist LIMIT 10;

source: A variant of the above query is <placeholder-1/> This can be implemented quite efficiently by GiST indexes, but not by GIN indexes. It will usually beat the first formulation when only a small number of the closest matches is wanted.
ru: Другой вариант предыдущего запроса: <placeholder-1/> Он может быть довольно эффективно выполнен с применением индексов GiST, а не GIN. Обычно он выигрышнее первого варианта только когда требуется получить небольшое количество близких совпадений.

source: SELECT t, word_similarity('<replaceable>word</replaceable>', t) AS sml FROM test_trgm WHERE '<replaceable>word</replaceable>' &lt;% t ORDER BY sml DESC, t;
ru: SELECT t, word_similarity('<replaceable>слово</replaceable>', t) AS sml FROM test_trgm WHERE '<replaceable>слово</replaceable>' &lt;% t ORDER BY sml DESC, t;

source: Also you can use an index on the <structfield>t</structfield> column for word similarity. For example: <placeholder-1/> This will return all values in the text column that have a word which sufficiently similar to <replaceable>word</replaceable>, sorted from best match to worst. The index will be used to make this a fast operation even over very large data sets.
ru: Вы также можете использовать индекс по столбцу <structfield>t</structfield> для поиска по схожести. Например: <placeholder-1/> Этот запрос выдаст все значения в текстовом столбце, содержащие слова, достаточно схожие со строкой <replaceable>слово</replaceable>, в порядке сортировки от наиболее к наименее схожим. Благодаря использованию индекса, эта операция будет быстрой даже с очень большими наборами данных.

source: SELECT t, '<replaceable>word</replaceable>' &lt;&lt;-&gt; t AS dist FROM test_trgm ORDER BY dist LIMIT 10;
ru: SELECT t, '<replaceable>слово</replaceable>' &lt;&lt;-&gt; t AS dist FROM test_trgm ORDER BY dist LIMIT 10;

source: A variant of the above query is <placeholder-1/> This can be implemented quite efficiently by GiST indexes, but not by GIN indexes.
ru: Другой вариант предыдущего запроса: <placeholder-1/> Он может быть довольно эффективно выполнен с применением индексов GiST, а не GIN.

source: Beginning in <productname>PostgreSQL</productname> 9.1, these index types also support index searches for <literal>LIKE</literal> and <literal>ILIKE</literal>, for example <placeholder-1/> The index search works by extracting trigrams from the search string and then looking these up in the index. The more trigrams in the search string, the more effective the index search is. Unlike B-tree based searches, the search string need not be left-anchored.
ru: Начиная с <productname>PostgreSQL</productname> 9.1, эти типы индексов также поддерживают поиск с операторами <literal>LIKE</literal> и <literal>ILIKE</literal>, например: <placeholder-1/> При таком поиске по индексу сначала из искомой строки извлекаются триграммы, а затем они ищутся в индексе. Чем больше триграмм оказывается в искомой строке, тем более эффективным будет поиск по индексу. В отличие от поиска по B-дереву, искомая строка не должна привязываться к левому краю.

source: Beginning in <productname>PostgreSQL</productname> 9.3, these index types also support index searches for regular-expression matches (<literal>~</literal> and <literal>~*</literal> operators), for example <placeholder-1/> The index search works by extracting trigrams from the regular expression and then looking these up in the index. The more trigrams that can be extracted from the regular expression, the more effective the index search is. Unlike B-tree based searches, the search string need not be left-anchored.
ru: Начиная с <productname>PostgreSQL</productname> 9.3, индексы этих типов также поддерживают поиск по регулярным выражениям (операторы <literal>~</literal> и <literal>~*</literal>), например: <placeholder-1/> При таком поиске из регулярного выражения извлекаются триграммы, а затем они ищутся в индексе. Чем больше триграмм удаётся извлечь из регулярного выражения, тем более эффективным будет поиск по индексу. В отличие от поиска по B-дереву, искомая строка не должна привязываться к левому краю.

source: For both <literal>LIKE</literal> and regular-expression searches, keep in mind that a pattern with no extractable trigrams will degenerate to a full-index scan.
ru: Относительно поиска по регулярному выражению или с <literal>LIKE</literal>, имейте в виду, что при отсутствии триграмм в искомом шаблоне поиск сводится к полному сканирования индекса.

source: The choice between GiST and GIN indexing depends on the relative performance characteristics of GiST and GIN, which are discussed elsewhere.
ru: Выбор между индексами GiST и GIN зависит от относительных характеристик производительности GiST и GIN, которые здесь не рассматриваются.

source: Text Search Integration
ru: Интеграция с текстовым поиском

source: Trigram matching is a very useful tool when used in conjunction with a full text index. In particular it can help to recognize misspelled input words that will not be matched directly by the full text search mechanism.
ru: Сопоставление триграмм — очень полезный приём в сочетании с применением полнотекстового индекса. В частности это может помочь найти слова, написанные неправильно, которые не будут находиться непосредственно механизмом полнотекстового поиска.

source: The first step is to generate an auxiliary table containing all the unique words in the documents: <placeholder-1/> where <structname>documents</structname> is a table that has a text field <structfield>bodytext</structfield> that we wish to search. The reason for using the <literal>simple</literal> configuration with the <function>to_tsvector</function> function, instead of using a language-specific configuration, is that we want a list of the original (unstemmed) words.
ru: В первую очередь нужно построить дополнительную таблицу, содержащую все уникальные слова в документе: <placeholder-1/> Здесь <structname>documents</structname> — это таблица с текстовым полем <structfield>bodytext</structfield>, по которому мы будем выполнять поиск. Конфигурация <literal>simple</literal> используется с функцией <function>to_tsvector</function> вместо конфигурации для определённого языка по той причине, что нам нужен список исходных (необработанных стеммером) слов.

source: Next, create a trigram index on the word column: <placeholder-1/> Now, a <command>SELECT</command> query similar to the previous example can be used to suggest spellings for misspelled words in user search terms. A useful extra test is to require that the selected words are also of similar length to the misspelled word.
ru: Затем нужно создать индекс триграмм по столбцу со словами: <placeholder-1/> Теперь мы можем использовать запрос <command>SELECT</command>, подобный показанному в предыдущем примере, и предлагать варианты исправлений слов, введённых пользователем с ошибками. Кроме того, может быть полезно дополнительно проверить, что выбранные слова также имеют длину, примерно равную длине ошибочных слов.

source: Since the <structname>words</structname> table has been generated as a separate, static table, it will need to be periodically regenerated so that it remains reasonably up-to-date with the document collection. Keeping it exactly current is usually unnecessary.
ru: Так как таблица <structname>words</structname> была сформирована как отдельная статическая таблица, её нужно периодически обновлять, чтобы она достаточно хорошо соответствовала набору документов. Постоянно поддерживать её в полностью актуальном состоянии обычно не требуется.

source: References
ru: Ссылки

source: GiST Development Site <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/>
ru: Сайт разработки GiST <ulink url="http://www.sai.msu.su/~megera/postgres/gist/"/>

source: Tsearch2 Development Site <ulink url="http://www.sai.msu.su/~megera/postgres/gist/tsearch/V2/"/>
ru: Сайт разработки Tsearch2 <ulink url="http://www.sai.msu.su/~megera/postgres/gist/tsearch/V2/"/>

source: Authors
ru: Авторы

source: Oleg Bartunov <email>oleg@sai.msu.su</email>, Moscow, Moscow University, Russia
ru: Олег Бартунов <email>oleg@sai.msu.su</email>, Москва, Московский Государственный Университет, Россия

source: Teodor Sigaev <email>teodor@sigaev.ru</email>, Moscow, Delta-Soft Ltd.,Russia
ru: Фёдор Сигаев <email>teodor@sigaev.ru</email>, Москва, ООО &laquo;Дельта-Софт&raquo;, Россия

source: Alexander Korotkov <email>a.korotkov@postgrespro.ru</email>, Moscow, Postgres Professional, Russia
ru: Александр Коротков <email>a.korotkov@postgrespro.ru</email>, Москва, Postgres Professional, Россия

source: Documentation: Christopher Kings-Lynne
ru: Документация: Кристофер Кингс-Линн

source: This module is sponsored by Delta-Soft Ltd., Moscow, Russia.
ru: Разработку этого модуля спонсировало ООО &laquo;Дельта-Софт&raquo;, г. Москва, Россия.
