Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/alter_tsdictionary.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a text search dictionary
ru: изменить определение словаря текстового поиска

source: name
ru: имя

source: option
ru: параметр

source: value
ru: значение

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER TEXT SEARCH DICTIONARY</command> changes the definition of a text search dictionary. You can change the dictionary's template-specific options, or change the dictionary's name or owner.
ru: <command>ALTER TEXT SEARCH DICTIONARY</command> изменяет определение словаря текстового поиска. Эта команда позволяет изменить параметры словаря, связанные с шаблонами, или сменить владельца или имя словаря.

source: You must be the owner of the dictionary to use <command>ALTER TEXT SEARCH DICTIONARY</command>.
ru: Выполнить <command>ALTER TEXT SEARCH DICTIONARY</command> может только владелец словаря.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing text search dictionary.
ru: Имя (возможно, дополненное схемой) существующего словаря текстового поиска.

source: The name of a template-specific option to be set for this dictionary.
ru: Имя параметра шаблона, устанавливаемого для данного словаря.

source: The new value to use for a template-specific option. If the equal sign and value are omitted, then any previous setting for the option is removed from the dictionary, allowing the default to be used.
ru: Новое значение для параметра настройки шаблонов. Если знак равно и значение опущено, предыдущее значение параметра удаляется из словаря, что позволяет вернутся к значению по умолчанию.

source: The new name of the text search dictionary.
ru: Новое имя словаря текстового поиска.

source: The new owner of the text search dictionary.
ru: Новый владелец словаря текстового поиска.

source: The new schema for the text search dictionary.
ru: Новая схема словаря текстового поиска.

source: Template-specific options can appear in any order.
ru: Параметры настройки шаблонов могут перечисляться в любом порядке.

source: Examples
ru: Примеры

source: The following example command changes the stopword list for a Snowball-based dictionary. Other parameters remain unchanged.
ru: Команда в следующем примере меняет список стоп-слов словаря на базе Snowball. Другие параметры остаются неизменными.

source: The following example command changes the language option to <literal>dutch</literal>, and removes the stopword option entirely.
ru: Команда в следующем примере меняет параметр, определяющий язык, на <literal>dutch</literal>, и удаляет параметр, задающий список стоп-слов.

source: The following example command <quote>updates</quote> the dictionary's definition without actually changing anything. <placeholder-1/> (The reason this works is that the option removal code doesn't complain if there is no such option.) This trick is useful when changing configuration files for the dictionary: the <command>ALTER</command> will force existing database sessions to re-read the configuration files, which otherwise they would never do if they had read them earlier.
ru: Следующая команда <quote>изменяет</quote> определение словаря, на самом деле не меняя ничего. <placeholder-1/> (Это работает потому, что код удаления параметра не считает ошибкой отсутствие такого параметра.) Этот трюк может быть полезен при изменении файлов конфигурации словаря; <command>ALTER</command> принудит все существующие сеансы перечитать файлы конфигурации, что в противном случае они не сделают никогда, если прочитали конфигурацию ранее.

source: Compatibility
ru: Совместимость

source: There is no <command>ALTER TEXT SEARCH DICTIONARY</command> statement in the SQL standard.
ru: Оператор <command>ALTER TEXT SEARCH DICTIONARY</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
