Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/cluster.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: cluster a table according to an index
ru: кластеризовать таблицу согласно индексу

source: table_name
ru: имя_таблицы

source: index_name
ru: имя_индекса

source: Description
ru: Описание

source: <command>CLUSTER</command> instructs <productname>PostgreSQL</productname> to cluster the table specified by <replaceable class="parameter">table_name</replaceable> based on the index specified by <replaceable class="parameter">index_name</replaceable>. The index must already have been defined on <replaceable class="parameter">table_name</replaceable>.
ru: Оператор <command>CLUSTER</command> указывает <productname>PostgreSQL</productname> кластеризовать таблицу, заданную параметром <replaceable class="parameter">имя_таблицы</replaceable>, согласно индексу, заданному параметром <replaceable class="parameter">имя_индекса</replaceable>. Указанный индекс уже должен быть определён в таблице <replaceable class="parameter">имя_таблицы</replaceable>.

source: When a table is clustered, it is physically reordered based on the index information. Clustering is a one-time operation: when the table is subsequently updated, the changes are not clustered. That is, no attempt is made to store new or updated rows according to their index order. (If one wishes, one can periodically recluster by issuing the command again. Also, setting the table's <literal>fillfactor</literal> storage parameter to less than 100% can aid in preserving cluster ordering during updates, since updated rows are kept on the same page if enough space is available there.)
ru: В результате кластеризации таблицы её содержимое физически переупорядочивается в зависимости от индекса. Кластеризация является одноразовой операцией: последующие изменения в таблице нарушают порядок кластеризации. Другими словами, система не пытается автоматически сохранять порядок новых или изменённых строк в соответствии с индексом. (Если такое желание возникает, можно периодически повторять кластеризацию, выполняя команду снова. Кроме того, если для заданной таблицы установить параметр <literal>FILLFACTOR</literal> меньше 100%, это может помочь сохранить порядок кластеризации при изменениях, так как изменяемые строки будут помещаться в ту же страницу, если в ней достаточно места.)

source: When a table is clustered, <productname>PostgreSQL</productname> remembers which index it was clustered by. The form <command>CLUSTER <replaceable class="parameter">table_name</replaceable></command> reclusters the table using the same index as before. You can also use the <literal>CLUSTER</literal> or <literal>SET WITHOUT CLUSTER</literal> forms of <xref linkend="sql-altertable"/> to set the index to be used for future cluster operations, or to clear any previous setting.
ru: Когда таблица кластеризована, <productname>PostgreSQL</productname> запоминает, по какому именно индексу. Форма <command>CLUSTER <replaceable class="parameter">имя_таблицы</replaceable></command> повторно кластеризует таблицу по тому же индексу. Для установки индекса, который будет использоваться для будущих операций кластеризации, или очистки предыдущего значения можно также применить команду <literal>CLUSTER</literal> или формы <literal>SET WITHOUT CLUSTER</literal> команды <xref linkend="sql-altertable"/>.

source: <command>CLUSTER</command> without any parameter reclusters all the previously-clustered tables in the current database that the calling user owns, or all such tables if called by a superuser. This form of <command>CLUSTER</command> cannot be executed inside a transaction block.
ru: <command>CLUSTER</command> без параметров повторно кластеризует все ранее кластеризованные таблицы в текущей базе данных, принадлежащие пользователю, вызывающему команду, или все такие таблицы, если её вызывает суперпользователь. Эту форму <command>CLUSTER</command> нельзя выполнять внутри блока транзакции.

source: When a table is being clustered, an <literal>ACCESS EXCLUSIVE</literal> lock is acquired on it. This prevents any other database operations (both reads and writes) from operating on the table until the <command>CLUSTER</command> is finished.
ru: В процессе кластеризации таблицы для неё запрашивается блокировка <literal>ACCESS EXCLUSIVE</literal>. Это препятствует выполнению всех других операций (чтению и записи) с таблицей до завершения <command>CLUSTER</command>.

source: Parameters
ru: Параметры

source: The name (possibly schema-qualified) of a table.
ru: Имя (возможно, дополненное схемой) таблицы.

source: The name of an index.
ru: Имя индекса.

source: Prints a progress report as each table is clustered.
ru: Выводит отчёт о процессе кластеризации по мере обработки таблиц.

source: Notes
ru: Замечания

source: In cases where you are accessing single rows randomly within a table, the actual order of the data in the table is unimportant. However, if you tend to access some data more than others, and there is an index that groups them together, you will benefit from using <command>CLUSTER</command>. If you are requesting a range of indexed values from a table, or a single indexed value that has multiple rows that match, <command>CLUSTER</command> will help because once the index identifies the table page for the first row that matches, all other rows that match are probably already on the same table page, and so you save disk accesses and speed up the query.
ru: В случаях, когда происходит обращение к случайным единичным строкам таблицы, фактический порядок данных в этой таблице не важен. Но если обращения к одним данным происходят чаще, чем к другим, и есть индекс, которые собирает их вместе, применение команды <command>CLUSTER</command> может быть полезным. Например, когда из таблицы запрашивается диапазон индексированных значений, либо одно индексированное значение, которому соответствуют несколько строк, <command>CLUSTER</command> может помочь, так как страница таблицы, найденная по индексу для первой искомой строки, скорее всего, будет содержать и все остальные искомые строки. Таким образом, кластеризация помогает соптимизировать обращения к диску и ускорить запросы.

source: <command>CLUSTER</command> can re-sort the table using either an index scan on the specified index, or (if the index is a b-tree) a sequential scan followed by sorting. It will attempt to choose the method that will be faster, based on planner cost parameters and available statistical information.
ru: <command>CLUSTER</command> может переупорядочить таблицу, выполнив либо сканирование указанного индекса, либо (для индексов-B-деревьев) последовательное сканирование, а затем сортировку. Наилучший по скорости вариант будет выбран, исходя из имеющейся статистической информации и параметров планировщика.

source: When an index scan is used, a temporary copy of the table is created that contains the table data in the index order. Temporary copies of each index on the table are created as well. Therefore, you need free space on disk at least equal to the sum of the table size and the index sizes.
ru: Когда выбирается сканирование индекса, создаётся временная таблица, содержащая данные целевой таблицы по порядку индекса. Также создаются копии всех индексов таблицы. Таким образом, для этой операции требуется объём дискового пространства не меньше, чем размер таблицы и индексов в сумме.

source: When a sequential scan and sort is used, a temporary sort file is also created, so that the peak temporary space requirement is as much as double the table size, plus the index sizes. This method is often faster than the index scan method, but if the disk space requirement is intolerable, you can disable this choice by temporarily setting <xref linkend="guc-enable-sort"/> to <literal>off</literal>.
ru: В случае выбора последовательного сканирования и сортировки создаётся ещё и временный файл для сортировки, так что пиковым требованием будет удвоенный размер таблицы плюс размер индексов. Этот метод часто быстрее, чем сканирование по индексу, но если требование к дисковому пространству неприемлемо, можно отключить его выбор, временно установив <xref linkend="guc-enable-sort"/> в <literal>off</literal>.

source: It is advisable to set <xref linkend="guc-maintenance-work-mem"/> to a reasonably large value (but not more than the amount of RAM you can dedicate to the <command>CLUSTER</command> operation) before clustering.
ru: Перед кластеризацией рекомендуется установить в <xref linkend="guc-maintenance-work-mem"/> достаточно большое значение (но не больше, чем объём ОЗУ, который вы хотите выделить для операции <command>CLUSTER</command>).

source: Because the planner records statistics about the ordering of tables, it is advisable to run <xref linkend="sql-analyze"/> on the newly clustered table. Otherwise, the planner might make poor choices of query plans.
ru: Так как планировщик записывает статистику, связанную с порядком таблиц, для вновь кластеризуемых таблиц рекомендуется запускать <xref linkend="sql-analyze"/>. В противном случае планировщик может ошибиться с выбором плана запроса.

source: Because <command>CLUSTER</command> remembers which indexes are clustered, one can cluster the tables one wants clustered manually the first time, then set up a periodic maintenance script that executes <command>CLUSTER</command> without any parameters, so that the desired tables are periodically reclustered.
ru: Так как <command>CLUSTER</command> запоминает, по каким индексам кластеризованы таблицы, достаточно лишь один раз вручную кластеризовать нужные таблицы, а затем настроить периодический скрипт обслуживания, который будет выполнять <command>CLUSTER</command> без параметров, с тем чтобы эти таблицы регулярно кластеризовались.

source: Examples
ru: Примеры

source: Cluster the table <literal>employees</literal> on the basis of its index <literal>employees_ind</literal>: <placeholder-1/>
ru: Кластеризация таблицы <literal>employees</literal> согласно её индексу <literal>employees_ind</literal>: <placeholder-1/>

source: Cluster the <literal>employees</literal> table using the same index that was used before: <placeholder-1/>
ru: Кластеризация таблицы <literal>employees</literal> согласно тому же индексу, что был использован ранее: <placeholder-1/>

source: Cluster all tables in the database that have previously been clustered: <placeholder-1/>
ru: Кластеризация всех таблиц в базе данных, что были кластеризованы ранее: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>CLUSTER</command> statement in the SQL standard.
ru: Оператор <command>CLUSTER</command> отсутствует в стандарте SQL.

source: The syntax <synopsis> CLUSTER <replaceable class="parameter">index_name</replaceable> ON <replaceable class="parameter">table_name</replaceable> </synopsis> is also supported for compatibility with pre-8.3 <productname>PostgreSQL</productname> versions.
ru: Синтаксис <synopsis> CLUSTER <replaceable class="parameter">имя_индекса</replaceable> ON <replaceable class="parameter">имя_таблицы</replaceable> </synopsis> так же является допустимым для совместимости с <productname>PostgreSQL</productname> до версии 8.3.

source: See Also
ru: См. также
