Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/create_tablespace.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new tablespace
ru: создать табличное пространство

source: tablespace_name
ru: табл_пространство

source: new_owner
ru: новый_владелец

source: directory
ru: каталог

source: tablespace_option
ru: параметр_табличного_пространства

source: value
ru: значение

source: Description
ru: Описание

source: <command>CREATE TABLESPACE</command> registers a new cluster-wide tablespace. The tablespace name must be distinct from the name of any existing tablespace in the database cluster.
ru: <command>CREATE TABLESPACE</command> регистрирует новое табличное пространство на уровне кластера баз данных. Имя табличного пространства должно отличаться от имён уже существующих табличных пространств в кластере.

source: A tablespace allows superusers to define an alternative location on the file system where the data files containing database objects (such as tables and indexes) can reside.
ru: Табличные пространства позволяют суперпользователям определять альтернативные расположения в файловой системе, где могут находиться файлы, содержащие объекты базы данных (например, таблицы или индексы).

source: A user with appropriate privileges can pass <replaceable class="parameter">tablespace_name</replaceable> to <command>CREATE DATABASE</command>, <command>CREATE TABLE</command>, <command>CREATE INDEX</command> or <command>ADD CONSTRAINT</command> to have the data files for these objects stored within the specified tablespace.
ru: Пользователь, имеющий соответствующие права, может передать параметр <replaceable class="parameter">табл_пространство</replaceable> команде <command>CREATE DATABASE</command>, <command>CREATE TABLE</command>, <command>CREATE INDEX</command> или <command>ADD CONSTRAINT</command>, чтобы файлы данных для этих объектов хранились в указанном табличном пространстве.

source: A tablespace cannot be used independently of the cluster in which it is defined; see <xref linkend="manage-ag-tablespaces"/>.
ru: Табличное пространство нельзя использовать отдельно от кластера, в котором оно было определено; см. <xref remap="4" linkend="manage-ag-tablespaces"/>.

source: Parameters
ru: Параметры

source: The name of a tablespace to be created. The name cannot begin with <literal>pg_</literal>, as such names are reserved for system tablespaces.
ru: Имя создаваемого табличного пространства. Это имя не может начинаться с <literal>pg_</literal>, так как такие имена зарезервированы для системных табличных пространств.

source: user_name
ru: имя_пользователя

source: The name of the user who will own the tablespace. If omitted, defaults to the user executing the command. Only superusers can create tablespaces, but they can assign ownership of tablespaces to non-superusers.
ru: Имя пользователя, который будет владельцем табличного пространства. Если опущено, владельцем по умолчанию станет пользователь, выполняющий команду. Создавать пространства имён могут только суперпользователи, но их владельцами могут быть назначены и обычные пользователи.

source: The directory that will be used for the tablespace. The directory should be empty and must be owned by the <productname>PostgreSQL</productname> system user. The directory must be specified by an absolute path name.
ru: Каталог, который будет использован для этого табличного пространства. Этот каталог должен быть пустым и должен принадлежать системному пользователю <productname>PostgreSQL</productname>. Задаваться его расположение должно абсолютным путём.

source: A tablespace parameter to be set or reset. Currently, the only available parameters are <varname>seq_page_cost</varname>, <varname>random_page_cost</varname> and <varname>effective_io_concurrency</varname>. Setting either value for a particular tablespace will override the planner's usual estimate of the cost of reading pages from tables in that tablespace, as established by the configuration parameters of the same name (see <xref linkend="guc-seq-page-cost"/>, <xref linkend="guc-random-page-cost"/>, <xref linkend="guc-effective-io-concurrency"/>). This may be useful if one tablespace is located on a disk which is faster or slower than the remainder of the I/O subsystem.
ru: Устанавливаемый или сбрасываемый параметр табличного пространства. В настоящее время поддерживаются только параметры <varname>seq_page_cost</varname>, <varname>random_page_cost</varname> и <varname>effective_io_concurrency</varname>. При установке этих значений для заданного табличного пространства будет переопределена обычная оценка стоимости чтения страниц из таблиц в этом пространстве, настраиваемая одноимённым параметром конфигурации (см. <xref remap="4" linkend="guc-seq-page-cost"/>, <xref linkend="guc-random-page-cost"/>, <xref remap="4" linkend="guc-effective-io-concurrency"/>). Это может быть полезно, если одно из табличных пространств размещено на диске, который быстрее или медленнее остальной дисковой системы.

source: Notes
ru: Замечания

source: Tablespaces are only supported on systems that support symbolic links.
ru: Табличные пространства поддерживаются только на платформах, поддерживающих символические ссылки.

source: <command>CREATE TABLESPACE</command> cannot be executed inside a transaction block.
ru: <command>CREATE TABLESPACE</command> не может быть выполнена внутри блока транзакции.

source: Examples
ru: Примеры

source: Create a tablespace <literal>dbspace</literal> at <literal>/data/dbs</literal>: <placeholder-1/>
ru: Создание табличного пространства <literal>dbspace</literal> в <literal>/data/dbs</literal>: <placeholder-1/>

source: Create a tablespace <literal>indexspace</literal> at <literal>/data/indexes</literal> owned by user <literal>genevieve</literal>: <placeholder-1/>
ru: Создание табличного пространства <literal>indexspace</literal> в <literal>/data/indexes</literal> и назначение его владельцем <literal>genevieve</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE TABLESPACE</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>CREATE TABLESPACE</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
