Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/create_transform.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new transform
ru: создать трансформацию

source: type_name
ru: имя_типа

source: lang_name
ru: имя_языка

source: from_sql_function_name
ru: имя_функции_из_sql

source: argument_type
ru: тип_аргумента

source: to_sql_function_name
ru: имя_функции_в_sql

source: Description
ru: Описание

source: <command>CREATE TRANSFORM</command> defines a new transform. <command>CREATE OR REPLACE TRANSFORM</command> will either create a new transform, or replace an existing definition.
ru: <command>CREATE TRANSFORM</command> определяет новую трансформацию. <command>CREATE OR REPLACE TRANSFORM</command> либо создаёт трансформацию, либо заменяет существующую.

source: A transform specifies how to adapt a data type to a procedural language. For example, when writing a function in PL/Python using the <type>hstore</type> type, PL/Python has no prior knowledge how to present <type>hstore</type> values in the Python environment. Language implementations usually default to using the text representation, but that is inconvenient when, for example, an associative array or a list would be more appropriate.
ru: Трансформация определяет, как преобразовать тип данных для процедурного языка. Например, если написать на языке PL/Python функцию, использующую тип <type>hstore</type>, PL/Python заведомо не знает, как должны представляться значения <type>hstore</type> в среде Python. Обычно реализации языка нисходят к текстовому представлению, но это может быть неудобно, когда более уместен был бы, например, ассоциативный массив или список.

source: A <quote>from SQL</quote> function that converts the type from the SQL environment to the language. This function will be invoked on the arguments of a function written in the language.
ru: Функция <quote>из SQL</quote> преобразует тип из среды SQL в среду языка. Эта функция будет вызываться для аргументов функции, написанной на этом языке.

source: A <quote>to SQL</quote> function that converts the type from the language to the SQL environment. This function will be invoked on the return value of a function written in the language.
ru: Функция <quote>в SQL</quote> преобразует тип из среды языка в среду SQL. Эта функция будет вызываться для значения, возвращаемого из функции на этом языке.

source: A transform specifies two functions: <placeholder-1/> It is not necessary to provide both of these functions. If one is not specified, the language-specific default behavior will be used if necessary. (To prevent a transformation in a certain direction from happening at all, you could also write a transform function that always errors out.)
ru: Трансформация определяет две функции: <placeholder-1/> Предоставлять обе эти функции не требуется, можно ограничиться одной. Если одна из них не указана, при необходимости выбирается поведение, принятое для языка по умолчанию. (Чтобы полностью перекрыть путь трансформации в одну сторону, можно написать функцию, которая будет всегда выдавать ошибку.)

source: To be able to create a transform, you must own and have <literal>USAGE</literal> privilege on the type, have <literal>USAGE</literal> privilege on the language, and own and have <literal>EXECUTE</literal> privilege on the from-SQL and to-SQL functions, if specified.
ru: Чтобы создать трансформацию, необходимо быть владельцем и иметь право <literal>USAGE</literal> для типа, иметь право <literal>USAGE</literal> для языка, а также быть владельцем и иметь право <literal>EXECUTE</literal> для функций из-SQL и в-SQL, если они задаются.

source: Parameters
ru: Параметры

source: The name of the data type of the transform.
ru: Имя типа данных, для которого предназначена трансформация.

source: The name of the language of the transform.
ru: Имя языка, для которого предназначена трансформация.

source: The name of the function for converting the type from the SQL environment to the language. It must take one argument of type <type>internal</type> and return type <type>internal</type>. The actual argument will be of the type for the transform, and the function should be coded as if it were. (But it is not allowed to declare an SQL-level function returning <type>internal</type> without at least one argument of type <type>internal</type>.) The actual return value will be something specific to the language implementation. If no argument list is specified, the function name must be unique in its schema.
ru: Имя функции для преобразования типа из среды SQL в среду языка. Она должна принимать один аргумент типа <type>internal</type> и возвращать тип <type>internal</type>. Фактический аргумент будет иметь тип, заданный для трансформации, и сама функция должна рассчитывать на это. (Но на уровне SQL нельзя объявить функцию, возвращающую тип <type>internal</type>, если она не принимает минимум один аргумент типа <type>internal</type>.) Фактически возвращаемое значение будет определяться реализацией языка. Если список аргументов отсутствует, имя функции должно быть уникальным в её схеме.

source: The name of the function for converting the type from the SQL environment to the language. It must take one argument of type <type>internal</type> and return type <type>internal</type>. The actual argument will be of the type for the transform, and the function should be coded as if it were. (But it is not allowed to declare an SQL-level function returning <type>internal</type> without at least one argument of type <type>internal</type>.) The actual return value will be something specific to the language implementation.
ru: Имя функции для преобразования типа из среды SQL в среду языка. Она должна принимать один аргумент типа <type>internal</type> и возвращать тип <type>internal</type>. Фактический аргумент будет иметь тип, заданный для трансформации, и сама функция должна рассчитывать на это. (Но на уровне SQL нельзя объявить функцию, возвращающую тип <type>internal</type>, если она не принимает минимум один аргумент типа <type>internal</type>.) Фактически возвращаемое значение будет определяться реализацией языка.

source: The name of the function for converting the type from the language to the SQL environment. It must take one argument of type <type>internal</type> and return the type that is the type for the transform. The actual argument value will be something specific to the language implementation. If no argument list is specified, the function name must be unique in its schema.
ru: Имя функции для преобразования типа из среды языка в среду SQL. Она должна принимать один аргумент типа <type>internal</type> и возвращать тип, для которого создаётся трансформация. Фактическое значение аргумента будет определяться реализацией языка. Если список аргументов отсутствует, имя функции должно быть уникальным в её схеме.

source: Notes
ru: Замечания

source: Use <xref linkend="sql-droptransform"/> to remove transforms.
ru: Для удаления трансформаций применяется <xref linkend="sql-droptransform"/>.

source: Examples
ru: Примеры

source: To create a transform for type <type>hstore</type> and language <literal>plpythonu</literal>, first set up the type and the language: <placeholder-1/> Then create the necessary functions: <placeholder-2/> And finally create the transform to connect them all together: <placeholder-3/> In practice, these commands would be wrapped up in extensions.
ru: Чтобы создать трансформацию для типа <type>hstore</type> и языка <literal>plpythonu</literal>, сначала нужно создать тип и язык: <placeholder-1/> Затем создайте необходимые функции: <placeholder-2/> И наконец, создайте трансформацию, соединяющую всё это вместе: <placeholder-3/> На практике эти команды помещаются в расширение.

source: The <filename>contrib</filename> section contains a number of extensions that provide transforms, which can serve as real-world examples.
ru: В разделе <filename>contrib</filename> представлено несколько расширений, в которых определены трансформации, что может послужить практическим примером реализации.

source: Compatibility
ru: Совместимость

source: This form of <command>CREATE TRANSFORM</command> is a <productname>PostgreSQL</productname> extension. There is a <command>CREATE TRANSFORM</command> command in the <acronym>SQL</acronym> standard, but it is for adapting data types to client languages. That usage is not supported by <productname>PostgreSQL</productname>.
ru: Первая форма <command>CREATE TRANSFORM</command> является расширением <productname>PostgreSQL</productname>. В стандарте <acronym>SQL</acronym> есть команда <command>CREATE TRANSFORM</command>, но её предназначение — преобразовывать типы для языков на стороне клиента. Этот вариант использования не поддерживается <productname>PostgreSQL</productname>.

source: See Also
ru: См. также

source: The name of the function for converting the type from the language to the SQL environment. It must take one argument of type <type>internal</type> and return the type that is the type for the transform. The actual argument value will be something specific to the language implementation.
ru: Имя функции для преобразования типа из среды языка в среду SQL. Она должна принимать один аргумент типа <type>internal</type> и возвращать тип, для которого создаётся трансформация. Фактическое значение аргумента будет определяться реализацией языка.
