Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/create_tsparser.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new text search parser
ru: создать анализатор текстового поиска

source: name
ru: имя

source: start_function
ru: функция_начала

source: gettoken_function
ru: функция_выдачи_фрагмента

source: end_function
ru: функция_окончания

source: lextypes_function
ru: функция_лекс_типов

source: headline_function
ru: функция_выдержек

source: Description
ru: Описание

source: <command>CREATE TEXT SEARCH PARSER</command> creates a new text search parser. A text search parser defines a method for splitting a text string into tokens and assigning types (categories) to the tokens. A parser is not particularly useful by itself, but must be bound into a text search configuration along with some text search dictionaries to be used for searching.
ru: <command>CREATE TEXT SEARCH PARSER</command> создаёт анализатор текстового поиска. Анализатор текстового поиска определяет способ разделения текстовой строки на фрагменты и назначения типов (категорий) этим фрагментам. Анализатор не очень полезен сам по себе, для осуществления поиска он должен быть подключён к конфигурации текстового поиска вместе с определёнными словарями.

source: If a schema name is given then the text search parser is created in the specified schema. Otherwise it is created in the current schema.
ru: Если указывается имя схемы, словарь текстового поиска создаётся в указанной схеме. В противном случае он создаётся в текущей схеме.

source: You must be a superuser to use <command>CREATE TEXT SEARCH PARSER</command>. (This restriction is made because an erroneous text search parser definition could confuse or even crash the server.)
ru: Выполнить <command>CREATE TEXT SEARCH PARSER</command> может только суперпользователь. (Это ограничение введено потому, что ошибочное определение анализатора текстового поиска может вызвать нарушения или даже сбой в работе сервера.)

source: Refer to <xref linkend="textsearch"/> for further information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="textsearch"/>.

source: Parameters
ru: Параметры

source: The name of the text search parser to be created. The name can be schema-qualified.
ru: Имя создаваемого анализатора текстового поиска, возможно, дополненное схемой.

source: The name of the start function for the parser.
ru: Имя функции, вызываемой в начале обработки.

source: The name of the get-next-token function for the parser.
ru: Имя функции, выдающей следующий фрагмент.

source: The name of the end function for the parser.
ru: Имя функции, вызываемой по окончании обработки.

source: The name of the lextypes function for the parser (a function that returns information about the set of token types it produces).
ru: Имя функции перечисления лексических типов (эта функция выдаёт информацию о множестве типов фрагментов, выделяемых анализатором).

source: The name of the headline function for the parser (a function that summarizes a set of tokens).
ru: Имя функции извлечения выдержек (эта функция выделяет краткое содержание для набора фрагментов).

source: The function names can be schema-qualified if necessary. Argument types are not given, since the argument list for each type of function is predetermined. All except the headline function are required.
ru: Имена функций могут быть дополнены именем схемы, если требуется. Типы аргументов не указываются, так как список аргументов для всех типов функций предопределён. Обязательными являются все функции, кроме функции выдержек.

source: The arguments can appear in any order, not only the one shown above.
ru: Аргументы могут перечисляться в любом порядке, не только в том, что показан выше.

source: Compatibility
ru: Совместимость

source: There is no <command>CREATE TEXT SEARCH PARSER</command> statement in the SQL standard.
ru: Оператор <command>CREATE TEXT SEARCH PARSER</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
