Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/create_cast.po
Languages: ru

source: Actually the preceding paragraph is an oversimplification: there are two cases in which a function-call construct will be treated as a cast request without having matched it to an actual function. If a function call <replaceable>name</replaceable>(<replaceable>x</replaceable>) does not exactly match any existing function, but <replaceable>name</replaceable> is the name of a data type and <structname>pg_cast</structname> provides a binary-coercible cast to this type from the type of <replaceable>x</replaceable>, then the call will be construed as a binary-coercible cast. This exception is made so that binary-coercible casts can be invoked using functional syntax, even though they lack any function. Likewise, if there is no <structname>pg_cast</structname> entry but the cast would be to or from a string type, the call will be construed as an I/O conversion cast. This exception allows I/O conversion casts to be invoked using functional syntax.
ru: Вообще говоря, в предыдущем абзаце допущено некоторое упрощение: есть два случая, когда конструкция с вызовом функции исполняется как приведение, без сопоставления с фактической функцией. Если вызову функции <replaceable>имя</replaceable>(<replaceable>x</replaceable>) в точности не соответствует существующая функция, но имеется тип данных <replaceable>имя</replaceable> и в <structname>pg_cast</structname> есть двоично-сводимое приведение типа <replaceable>x</replaceable> к этому типу, такой вызов будет воспринят как приведение. Это исключение введено, чтобы двоично-сводимое приведение можно было вызывать, используя синтаксис функций, несмотря на то, что никакой функции преобразования у него нет. Аналогично, если запись приведения в <structname>pg_cast</structname> отсутствует, но в случае приведения это было бы преобразование в/из строкового типа, такой вызов будет выполнен как преобразование ввода/вывода. Это исключение позволяет вызывать преобразование ввода/вывода, используя синтаксис вызова функции.

source: There is also an exception to the exception: I/O conversion casts from composite types to string types cannot be invoked using functional syntax, but must be written in explicit cast syntax (either <literal>CAST</literal> or <literal>::</literal> notation). This exception was added because after the introduction of automatically-provided I/O conversion casts, it was found too easy to accidentally invoke such a cast when a function or column reference was intended.
ru: Но есть исключение и из этого исключения: преобразование ввода/вывода из составных типов в строковые нельзя вызвать в виде функции, его необходимо записать как явное приведение (используя <literal>CAST</literal> или запись <literal>::</literal>). Это исключение было добавлено, потому что после введения автоматически предоставляемых преобразований ввода/вывода, оказалось слишком легко случайно вызвать такое приведение, тогда как имелась в виду ссылка на столбец или функцию.

source: Examples
ru: Примеры

source: To create an assignment cast from type <type>bigint</type> to type <type>int4</type> using the function <literal>int4(bigint)</literal>: <placeholder-1/> (This cast is already predefined in the system.)
ru: Создание приведения присваивания типа <type>bigint</type> к типу <type>int4</type> с помощью функции <literal>int4(bigint)</literal>: <placeholder-1/> (Это приведение уже предопределено в системе.)

source: Compatibility
ru: Совместимость

source: The <command>CREATE CAST</command> command conforms to the <acronym>SQL</acronym> standard, except that SQL does not make provisions for binary-coercible types or extra arguments to implementation functions. <literal>AS IMPLICIT</literal> is a <productname>PostgreSQL</productname> extension, too.
ru: Команда <command>CREATE CAST</command> соответствует стандарту <acronym>SQL</acronym>, за исключением того, что в стандарте ничего не говорится о двоично-сводимых типах и дополнительных аргументах реализующих функций. Указание <literal>AS IMPLICIT</literal> тоже является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также

source: <replaceable>function_name</replaceable>(<replaceable>argument_type</replaceable> [, ...])
ru: <replaceable>имя_функции</replaceable>(<replaceable>тип_аргумента</replaceable> [, ...])
