Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/drop_rule.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a rewrite rule
ru: удалить правило перезаписи

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: Description
ru: Описание

source: <command>DROP RULE</command> drops a rewrite rule.
ru: <command>DROP RULE</command> удаляет правило перезаписи.

source: Parameters
ru: Параметры

source: Do not throw an error if the rule does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если правило не существует. В этом случае будет выдано замечание.

source: The name of the rule to drop.
ru: Имя правила, подлежащего удалению.

source: The name (optionally schema-qualified) of the table or view that the rule applies to.
ru: Имя (возможно, дополненное схемой) существующей таблицы (или представления), к которой применяется это правило.

source: Automatically drop objects that depend on the rule, and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного правила, и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the rule if any objects depend on it. This is the default.
ru: Отказать в удалении правила, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To drop the rewrite rule <literal>newrule</literal>: <placeholder-1/>
ru: Удаление правила перезаписи <literal>newrule</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP RULE</command> is a <productname>PostgreSQL</productname> language extension, as is the entire query rewrite system.
ru: <command>DROP RULE</command> является языковым расширением <productname>PostgreSQL</productname>, как и вся система перезаписи запросов.

source: See Also
ru: См. также
