Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/drop_type.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a data type
ru: удалить тип данных

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP TYPE</command> removes a user-defined data type. Only the owner of a type can remove it.
ru: <command>DROP TYPE</command> удаляет определённый пользователем тип данных. Удалить тип может только его владелец.

source: Parameters
ru: Параметры

source: Do not throw an error if the type does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если тип не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of the data type to remove.
ru: Имя (возможно, дополненное схемой) типа данных, подлежащего удалению.

source: Automatically drop objects that depend on the type (such as table columns, functions, and operators), and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного типа (например, столбцы таблиц, функции и операторы), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the type if any objects depend on it. This is the default.
ru: Отказать в удалении типа, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To remove the data type <type>box</type>: <placeholder-1/>
ru: Удаление типа данных <type>box</type>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: This command is similar to the corresponding command in the SQL standard, apart from the <literal>IF EXISTS</literal> option, which is a <productname>PostgreSQL</productname> extension. But note that much of the <command>CREATE TYPE</command> command and the data type extension mechanisms in <productname>PostgreSQL</productname> differ from the SQL standard.
ru: Эта команда подобна соответствующей команде в стандарте SQL, но указание <literal>IF EXISTS</literal> является расширением <productname>PostgreSQL</productname>. Однако учтите, что команда <command>CREATE TYPE</command> и механизм расширения типов в <productname>PostgreSQL</productname> значительно отличаются от стандарта SQL.

source: See Also
ru: См. также
