Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/drop_domain.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a domain
ru: удалить домен

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP DOMAIN</command> removes a domain. Only the owner of a domain can remove it.
ru: <command>DROP DOMAIN</command> удаляет домен. Удалить домен может только его владелец.

source: Parameters
ru: Параметры

source: Do not throw an error if the domain does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если домен не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing domain.
ru: Имя (возможно, дополненное схемой) существующего домена.

source: Automatically drop objects that depend on the domain (such as table columns), and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного домена (например, столбцы таблиц), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the domain if any objects depend on it. This is the default.
ru: Отказать в удалении домена, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To remove the domain <type>box</type>: <placeholder-1/>
ru: Удаление домена <type>box</type>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: This command conforms to the SQL standard, except for the <literal>IF EXISTS</literal> option, which is a <productname>PostgreSQL</productname> extension.
ru: Эта команда соответствует стандарту SQL, за исключением параметра <literal>IF EXISTS</literal>, являющегося расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
