Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/drop_collation.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a collation
ru: удалить правило сортировки

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP COLLATION</command> removes a previously defined collation. To be able to drop a collation, you must own the collation.
ru: <command>DROP COLLATION</command> удаляет ранее определённое правило сортировки. Чтобы удалить правило сортировки, необходимо быть его владельцем.

source: Parameters
ru: Параметры

source: Do not throw an error if the collation does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если правило сортировки не существует. В этом случае будет выдано замечание.

source: The name of the collation. The collation name can be schema-qualified.
ru: Имя правила сортировки, возможно, дополненное схемой.

source: Automatically drop objects that depend on the collation, and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного правила сортировки, и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the collation if any objects depend on it. This is the default.
ru: Отказать в удалении правила сортировки, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To drop the collation named <literal>german</literal>: <placeholder-1/>
ru: Удаление правила сортировки с именем <literal>german</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <command>DROP COLLATION</command> command conforms to the <acronym>SQL</acronym> standard, apart from the <literal>IF EXISTS</literal> option, which is a <productname>PostgreSQL</productname> extension.
ru: Команда <command>DROP COLLATION</command> соответствует стандарту <acronym>SQL</acronym>, за исключением параметра <literal>IF EXISTS</literal>, являющегося расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
