Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/drop_table.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a table
ru: удалить таблицу

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP TABLE</command> removes tables from the database. Only the table owner, the schema owner, and superuser can drop a table. To empty a table of rows without destroying the table, use <xref linkend="sql-delete"/> or <xref linkend="sql-truncate"/>.
ru: <command>DROP TABLE</command> удаляет таблицы из базы данных. Удалить таблицу может только её владелец, владелец схемы или суперпользователь. Чтобы опустошить таблицу, не удаляя её саму, вместо этой команды следует использовать <xref linkend="sql-delete"/> или <xref linkend="sql-truncate"/>.

source: <command>DROP TABLE</command> always removes any indexes, rules, triggers, and constraints that exist for the target table. However, to drop a table that is referenced by a view or a foreign-key constraint of another table, <literal>CASCADE</literal> must be specified. (<literal>CASCADE</literal> will remove a dependent view entirely, but in the foreign-key case it will only remove the foreign-key constraint, not the other table entirely.)
ru: <command>DROP TABLE</command> всегда удаляет все индексы, правила, триггеры и ограничения, существующие в целевой таблице. Однако, чтобы удалить таблицу, на которую ссылается представление или ограничение внешнего ключа в другой таблице, необходимо дополнительно указать <literal>CASCADE</literal>. (С указанием <literal>CASCADE</literal> зависимое представление будет удалено полностью, но в случае с первичным ключом удалено будет только само ограничение, а не таблица, к которой оно относится.)

source: Parameters
ru: Параметры

source: Do not throw an error if the table does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если таблица не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of the table to drop.
ru: Имя (возможно, дополненное схемой) таблицы, подлежащей удалению.

source: Automatically drop objects that depend on the table (such as views), and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данной таблицы (например, представления), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the table if any objects depend on it. This is the default.
ru: Отказать в удалении таблицы, если от неё зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To destroy two tables, <literal>films</literal> and <literal>distributors</literal>: <placeholder-1/>
ru: Удаление таблиц <literal>films</literal> и <literal>distributors</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: This command conforms to the SQL standard, except that the standard only allows one table to be dropped per command, and apart from the <literal>IF EXISTS</literal> option, which is a <productname>PostgreSQL</productname> extension.
ru: Эта команда соответствует стандарту SQL, но возможность удалять в одной команде несколько таблиц и указание <literal>IF EXISTS</literal> являются расширениями <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
