Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/fetch.po
Languages: ru

source: <primary>cursor</primary> <secondary>FETCH</secondary>
ru: <primary>курсор</primary> <secondary>FETCH</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: retrieve rows from a query using a cursor
ru: получить результат запроса через курсор

source: cursor_name
ru: имя_курсора

source: where <placeholder-1/> can be empty or one of:
ru: Здесь <placeholder-1/> может быть пустым или принимать следующее значение:

source: count
ru: число

source: Description
ru: Описание

source: <command>FETCH</command> retrieves rows using a previously-created cursor.
ru: <command>FETCH</command> получает строки через ранее созданный курсор.

source: A cursor has an associated position, which is used by <command>FETCH</command>. The cursor position can be before the first row of the query result, on any particular row of the result, or after the last row of the result. When created, a cursor is positioned before the first row. After fetching some rows, the cursor is positioned on the row most recently retrieved. If <command>FETCH</command> runs off the end of the available rows then the cursor is left positioned after the last row, or before the first row if fetching backward. <command>FETCH ALL</command> or <command>FETCH BACKWARD ALL</command> will always leave the cursor positioned after the last row or before the first row.
ru: Курсор связан с определённым положением, что и использует команда <command>FETCH</command>. Курсор может располагаться перед первой строкой результата запроса, на любой строке этого результата, либо после последней строки. При создании курсор оказывается перед первой строкой. Когда <command>FETCH</command> доходит до конца набора строк, курсор остаётся в положении после последней строки, либо перед первой, при движении назад. После команд <command>FETCH ALL</command> и <command>FETCH BACKWARD ALL</command> курсор всегда оказывается после последней строки или перед первой, соответственно.

source: The forms <literal>NEXT</literal>, <literal>PRIOR</literal>, <literal>FIRST</literal>, <literal>LAST</literal>, <literal>ABSOLUTE</literal>, <literal>RELATIVE</literal> fetch a single row after moving the cursor appropriately. If there is no such row, an empty result is returned, and the cursor is left positioned before the first row or after the last row as appropriate.
ru: Формы <literal>NEXT</literal>, <literal>PRIOR</literal>, <literal>FIRST</literal>, <literal>LAST</literal>, <literal>ABSOLUTE</literal> и <literal>RELATIVE</literal> выбирают одну строку после соответствущего перемещения курсора. Если в этом положении строки не оказывается, возвращается пустой результат, а курсор остаётся в достигнутом положении перед первой строкой или после последней.

source: The forms using <literal>FORWARD</literal> and <literal>BACKWARD</literal> retrieve the indicated number of rows moving in the forward or backward direction, leaving the cursor positioned on the last-returned row (or after/before all rows, if the <replaceable class="parameter">count</replaceable> exceeds the number of rows available).
ru: Формы <literal>FORWARD</literal> и <literal>BACKWARD</literal> получают указанное число строк, сдвигаясь соответственно вперёд или назад; в результате курсор оказывается на последней выданной строке (или перед/после всех строк, если <replaceable class="parameter">число</replaceable> превышает количество доступных строк).

source: <literal>RELATIVE 0</literal>, <literal>FORWARD 0</literal>, and <literal>BACKWARD 0</literal> all request fetching the current row without moving the cursor, that is, re-fetching the most recently fetched row. This will succeed unless the cursor is positioned before the first row or after the last row; in which case, no row is returned.
ru: Формы <literal>RELATIVE 0</literal>, <literal>FORWARD 0</literal> и <literal>BACKWARD 0</literal> действуют одинаково — они считывают текущую строку, не перемещая курсор, то есть, повторно выбирая строку, выбранную последней. Эта операция будет успешна, только если курсор не расположен до первой или после последней строки; в этом случае строка возвращена не будет.

source: This page describes usage of cursors at the SQL command level. If you are trying to use cursors inside a <application>PL/pgSQL</application> function, the rules are different &mdash; see <xref linkend="plpgsql-cursors"/>.
ru: На этой странице описывается применение курсоров на уровне команд SQL. Если вы попытаетесь использовать курсоры внутри функции <application>PL/pgSQL</application>, правила будут другими &mdash; см. <xref remap="4" linkend="plpgsql-cursors"/>.

source: Parameters
ru: Параметры

source: Fetch the next row. This is the default if <replaceable class="parameter">direction</replaceable> is omitted.
ru: Выбрать следующую строку. Это действие подразумевается по умолчанию, если <replaceable class="parameter">направление</replaceable> опущено.

source: Fetch the prior row.
ru: Выбрать предыдущую строку.

source: Fetch the first row of the query (same as <literal>ABSOLUTE 1</literal>).
ru: Выбрать первую строку запроса (аналогично указанию <literal>ABSOLUTE 1</literal>).

source: Fetch the last row of the query (same as <literal>ABSOLUTE -1</literal>).
ru: Выбрать последнюю строку запроса (аналогично <literal>ABSOLUTE -1</literal>).

source: Fetch the <replaceable class="parameter">count</replaceable>'th row of the query, or the <literal>abs(<replaceable class="parameter">count</replaceable>)</literal>'th row from the end if <replaceable class="parameter">count</replaceable> is negative. Position before first row or after last row if <replaceable class="parameter">count</replaceable> is out of range; in particular, <literal>ABSOLUTE 0</literal> positions before the first row.
ru: Выбрать строку под номером <replaceable class="parameter">число</replaceable> с начала, либо под номером <literal>abs(<replaceable class="parameter">число</replaceable>)</literal> с конца, если <replaceable class="parameter">число</replaceable> отрицательно. Если <replaceable class="parameter">число</replaceable> выходит за границы набора строк, курсор размещается перед первой или после последней строки; в частности, с <literal>ABSOLUTE 0</literal> курсор оказывается перед первой строкой.

source: Fetch the <replaceable class="parameter">count</replaceable>'th succeeding row, or the <literal>abs(<replaceable class="parameter">count</replaceable>)</literal>'th prior row if <replaceable class="parameter">count</replaceable> is negative. <literal>RELATIVE 0</literal> re-fetches the current row, if any.
ru: Выбрать строку под номером <replaceable class="parameter">число</replaceable>, считая со следующей вперёд, либо под номером <literal>abs(<replaceable class="parameter">число</replaceable>)</literal>, считая с предыдущей назад, если <replaceable class="parameter">число</replaceable> отрицательно. <literal>RELATIVE 0</literal> повторно считывает текущую строку, если таковая имеется.

source: Fetch the next <replaceable class="parameter">count</replaceable> rows (same as <literal>FORWARD <replaceable class="parameter">count</replaceable></literal>).
ru: Выбрать следующее <replaceable class="parameter">число</replaceable> строк (аналогично <literal>FORWARD <replaceable class="parameter">число</replaceable></literal>).

source: Fetch all remaining rows (same as <literal>FORWARD ALL</literal>).
ru: Выбрать все оставшиеся строки (аналогично <literal>FORWARD ALL</literal>).

source: Fetch the next row (same as <literal>NEXT</literal>).
ru: Выбрать следующую строку (аналогично <literal>NEXT</literal>).

source: Fetch the next <replaceable class="parameter">count</replaceable> rows. <literal>FORWARD 0</literal> re-fetches the current row.
ru: Выбрать следующее <replaceable class="parameter">число</replaceable> строк. <literal>FORWARD 0</literal> повторно выбирает текущую строку.

source: Fetch all remaining rows.
ru: Выбрать все оставшиеся строки.

source: Fetch the prior row (same as <literal>PRIOR</literal>).
ru: Выбрать предыдущую строку (аналогично <literal>PRIOR</literal>).

source: Fetch the prior <replaceable class="parameter">count</replaceable> rows (scanning backwards). <literal>BACKWARD 0</literal> re-fetches the current row.
ru: Выбрать предыдущее <replaceable class="parameter">число</replaceable> строк (с перемещением назад). <literal>BACKWARD 0</literal> повторно выбирает текущую строку.

source: Fetch all prior rows (scanning backwards).
ru: Выбрать все предыдущие строки (с перемещением назад).

source: <replaceable class="parameter">direction</replaceable> defines the fetch direction and number of rows to fetch. It can be one of the following: <placeholder-1/>
ru: Параметр <replaceable class="parameter">направление</replaceable> задаёт направление движения и число выбираемых строк. Он может принимать одно из следующих значений: <placeholder-1/>

source: <replaceable class="parameter">count</replaceable> is a possibly-signed integer constant, determining the location or number of rows to fetch. For <literal>FORWARD</literal> and <literal>BACKWARD</literal> cases, specifying a negative <replaceable class="parameter">count</replaceable> is equivalent to changing the sense of <literal>FORWARD</literal> and <literal>BACKWARD</literal>.
ru: Здесь <replaceable class="parameter">число</replaceable> — целочисленная константа, возможно со знаком, определяющая смещение или количество выбираемых строк. Для вариантов <literal>FORWARD</literal> и <literal>BACKWARD</literal> указание отрицательного <replaceable class="parameter">числа</replaceable> равнозначно смене направления <literal>FORWARD</literal> на <literal>BACKWARD</literal> и наоборот.

source: An open cursor's name.
ru: Имя открытого курсора.

source: Outputs
ru: Выводимая информация

source: On successful completion, a <command>FETCH</command> command returns a command tag of the form <screen> FETCH <replaceable class="parameter">count</replaceable> </screen> The <replaceable class="parameter">count</replaceable> is the number of rows fetched (possibly zero). Note that in <application>psql</application>, the command tag will not actually be displayed, since <application>psql</application> displays the fetched rows instead.
ru: При успешном выполнении <command>FETCH</command> возвращает метку команды вида <screen> FETCH <replaceable class="parameter">число</replaceable> </screen> Здесь <replaceable class="parameter">count</replaceable> — количество выбранных строк (может быть и нулевым). Заметьте, что в <application>psql</application> метка команды не выдаётся, так как вместо неё <application>psql</application> выводит выбранные строки.

source: Notes
ru: Замечания

source: The cursor should be declared with the <literal>SCROLL</literal> option if one intends to use any variants of <command>FETCH</command> other than <command>FETCH NEXT</command> or <command>FETCH FORWARD</command> with a positive count. For simple queries <productname>PostgreSQL</productname> will allow backwards fetch from cursors not declared with <literal>SCROLL</literal>, but this behavior is best not relied on. If the cursor is declared with <literal>NO SCROLL</literal>, no backward fetches are allowed.
ru: Если перемещение курсора в <command>FETCH</command> не ограничивается вариантами <command>FETCH NEXT</command> или <command>FETCH FORWARD</command> с положительным числом, курсор должен быть объявлен с указанием <literal>SCROLL</literal>. Для простых запросов <productname>PostgreSQL</productname> допускает обратное перемещение курсора, объявленного без <literal>SCROLL</literal>, но на это поведение лучше не рассчитывать. Если курсор объявлен с указанием <literal>NO SCROLL</literal>, перемещение назад запрещается.

source: <literal>ABSOLUTE</literal> fetches are not any faster than navigating to the desired row with a relative move: the underlying implementation must traverse all the intermediate rows anyway. Negative absolute fetches are even worse: the query must be read to the end to find the last row, and then traversed backward from there. However, rewinding to the start of the query (as with <literal>FETCH ABSOLUTE 0</literal>) is fast.
ru: Вариант <literal>ABSOLUTE</literal> нисколько не быстрее, чем перемещение к требуемой строке с относительным сдвигом: нижележащий механизм всё равно должен прочитать все промежуточные строки. Выборки по абсолютному отрицательному положению ещё хуже: сначала запрос необходимо прочитать до конца и найти последнюю строку, а затем вернуться назад к указанной строке. Однако перемотка к началу запроса (<literal>FETCH ABSOLUTE 0</literal>) выполняется быстро.

source: <xref linkend="sql-declare"/> is used to define a cursor. Use <xref linkend="sql-move"/> to change cursor position without retrieving data.
ru: Определить курсор позволяет команда <xref linkend="sql-declare"/>, а переместить его, не читая данные, — команда <xref linkend="sql-move"/>.

source: Examples
ru: Примеры

source: BEGIN WORK; -- Set up a cursor: DECLARE liahona SCROLL CURSOR FOR SELECT * FROM films; -- Fetch the first 5 rows in the cursor liahona: FETCH FORWARD 5 FROM liahona; code | title | did | date_prod | kind | len -------+-------------------------+-----+------------+----------+------- BL101 | The Third Man | 101 | 1949-12-23 | Drama | 01:44 BL102 | The African Queen | 101 | 1951-08-11 | Romantic | 01:43 JL201 | Une Femme est une Femme | 102 | 1961-03-12 | Romantic | 01:25 P_301 | Vertigo | 103 | 1958-11-14 | Action | 02:08 P_302 | Becket | 103 | 1964-02-03 | Drama | 02:28 -- Fetch the previous row: FETCH PRIOR FROM liahona; code | title | did | date_prod | kind | len -------+---------+-----+------------+--------+------- P_301 | Vertigo | 103 | 1958-11-14 | Action | 02:08 -- Close the cursor and end the transaction: CLOSE liahona; COMMIT WORK;
ru: BEGIN WORK; -- Создание курсора: DECLARE liahona SCROLL CURSOR FOR SELECT * FROM films; -- Получение первых 5 строк через курсор liahona: FETCH FORWARD 5 FROM liahona; code | title | did | date_prod | kind | len -------+-------------------------+-----+------------+----------+------- BL101 | The Third Man | 101 | 1949-12-23 | Drama | 01:44 BL102 | The African Queen | 101 | 1951-08-11 | Romantic | 01:43 JL201 | Une Femme est une Femme | 102 | 1961-03-12 | Romantic | 01:25 P_301 | Vertigo | 103 | 1958-11-14 | Action | 02:08 P_302 | Becket | 103 | 1964-02-03 | Drama | 02:28 -- Получение предыдущей строки: FETCH PRIOR FROM liahona; code | title | did | date_prod | kind | len -------+---------+-----+------------+--------+------- P_301 | Vertigo | 103 | 1958-11-14 | Action | 02:08 -- Закрытие курсора и завершение транзакции: CLOSE liahona; COMMIT WORK;

source: The following example traverses a table using a cursor: <placeholder-1/>
ru: Следующий пример демонстрирует перемещение курсора в таблице: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The SQL standard defines <command>FETCH</command> for use in embedded SQL only. The variant of <command>FETCH</command> described here returns the data as if it were a <command>SELECT</command> result rather than placing it in host variables. Other than this point, <command>FETCH</command> is fully upward-compatible with the SQL standard.
ru: В стандарте SQL команда <command>FETCH</command> определена только для встраиваемого SQL. Описанная здесь реализация <command>FETCH</command> возвращает данные подобно оператору <command>SELECT</command>, а не помещает их в переменные исполняющей среды. В остальном, <command>FETCH</command> полностью прямо-совместима со стандартом SQL.

source: The <command>FETCH</command> forms involving <literal>FORWARD</literal> and <literal>BACKWARD</literal>, as well as the forms <literal>FETCH <replaceable class="parameter">count</replaceable></literal> and <literal>FETCH ALL</literal>, in which <literal>FORWARD</literal> is implicit, are <productname>PostgreSQL</productname> extensions.
ru: Формы <command>FETCH</command> с <literal>FORWARD</literal> и <literal>BACKWARD</literal>, а также формы <literal>FETCH <replaceable class="parameter">число</replaceable></literal> и <literal>FETCH ALL</literal> (в которых <literal>FORWARD</literal> подразумевается) являются расширениями <productname>PostgreSQL</productname>.

source: The SQL standard allows only <literal>FROM</literal> preceding the cursor name; the option to use <literal>IN</literal>, or to leave them out altogether, is an extension.
ru: В стандарте SQL перед именем курсора допускается только указание <literal>FROM</literal>; возможность указать <literal>IN</literal> или опустить оба указания относится к расширениям.

source: See Also
ru: См. также
