Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/rollback_to.po
Languages: ru

source: <primary>savepoints</primary> <secondary>rolling back</secondary>
ru: <primary>точки сохранения</primary> <secondary>откат</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: roll back to a savepoint
ru: откатиться к точке сохранения

source: savepoint_name
ru: имя_точки_сохранения

source: Description
ru: Описание

source: Roll back all commands that were executed after the savepoint was established. The savepoint remains valid and can be rolled back to again later, if needed.
ru: Откатывает все команды, выполненные после установления точки сохранения. Точка сохранения остаётся действующей и при необходимости можно снова откатиться к ней позже.

source: <command>ROLLBACK TO SAVEPOINT</command> implicitly destroys all savepoints that were established after the named savepoint.
ru: <command>ROLLBACK TO SAVEPOINT</command> неявно уничтожает все точки сохранения, установленные после заданной точки.

source: Parameters
ru: Параметры

source: The savepoint to roll back to.
ru: Точка сохранения, к которой нужно откатиться.

source: Notes
ru: Замечания

source: Use <xref linkend="sql-release-savepoint"/> to destroy a savepoint without discarding the effects of commands executed after it was established.
ru: Чтобы уничтожить точку сохранения, не отменяя действия команд, выполненных после неё, применяется команда <xref linkend="sql-release-savepoint"/>.

source: Specifying a savepoint name that has not been established is an error.
ru: Указание имени точки сохранения, не установленной ранее, считается ошибкой.

source: Cursors have somewhat non-transactional behavior with respect to savepoints. Any cursor that is opened inside a savepoint will be closed when the savepoint is rolled back. If a previously opened cursor is affected by a <command>FETCH</command> or <command>MOVE</command> command inside a savepoint that is later rolled back, the cursor remains at the position that <command>FETCH</command> left it pointing to (that is, the cursor motion caused by <command>FETCH</command> is not rolled back). Closing a cursor is not undone by rolling back, either. However, other side-effects caused by the cursor's query (such as side-effects of volatile functions called by the query) <emphasis>are</emphasis> rolled back if they occur during a savepoint that is later rolled back. A cursor whose execution causes a transaction to abort is put in a cannot-execute state, so while the transaction can be restored using <command>ROLLBACK TO SAVEPOINT</command>, the cursor can no longer be used.
ru: Курсоры проявляют не совсем транзакционное поведение применительно к точкам сохранения. Любой курсор, открытый внутри точки сохранения, будет закрыт при откате к этой точке. Если ранее открытый курсор был перемещён командой <command>FETCH</command> или <command>MOVE</command> внутри точки сохранения, к которой затем произошёл откат, курсор остаётся в той позиции, в которой он остался после <command>FETCH</command> (то есть, перемещение курсора, производимое командой <command>FETCH</command>, не откатывается). Также при откате не отменяется и закрытие курсора. Однако другие побочные эффекты, вызываемые запросом курсора (например, побочные действия изменчивых функций, вызываемых в запросе) <emphasis>отменяются</emphasis>, если они производятся после точки сохранения, к которой затем происходит откат. Курсор, выполнение которого приводит к прерыванию транзакции, переводится в нерабочее состояние, так что даже если восстановить транзакцию, выполнив <command>ROLLBACK TO SAVEPOINT</command>, этот курсор нельзя будет использовать.

source: Examples
ru: Примеры

source: To undo the effects of the commands executed after <literal>my_savepoint</literal> was established: <placeholder-1/>
ru: Отмена действия команд, выполненных после установки точки сохранения <literal>my_savepoint</literal>: <placeholder-1/>

source: Cursor positions are not affected by savepoint rollback: <placeholder-1/>
ru: Откат к точке сохранения не отражается на положении курсора: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <acronym>SQL</acronym> standard specifies that the key word <literal>SAVEPOINT</literal> is mandatory, but <productname>PostgreSQL</productname> and <productname>Oracle</productname> allow it to be omitted. SQL allows only <literal>WORK</literal>, not <literal>TRANSACTION</literal>, as a noise word after <literal>ROLLBACK</literal>. Also, SQL has an optional clause <literal>AND [ NO ] CHAIN</literal> which is not currently supported by <productname>PostgreSQL</productname>. Otherwise, this command conforms to the SQL standard.
ru: В стандарте <acronym>SQL</acronym> говорится, что ключевое слово <literal>SAVEPOINT</literal> является обязательным, но <productname>PostgreSQL</productname> и <productname>Oracle</productname> позволяют опускать его. SQL допускает <literal>WORK</literal>, но не <literal>TRANSACTION</literal>, в качестве избыточного слова после <literal>ROLLBACK</literal>. Кроме того, в SQL есть дополнительное предложение <literal>AND [ NO ] CHAIN</literal>, которое в настоящее время не поддерживается в <productname>PostgreSQL</productname>. В остальном эта команда соответствует стандарту SQL.

source: See Also
ru: См. также
