Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/savepoint.po
Languages: ru

source: <primary>savepoints</primary> <secondary>defining</secondary>
ru: <primary>точки сохранения</primary> <secondary>определение</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new savepoint within the current transaction
ru: определить новую точку сохранения в текущей транзакции

source: savepoint_name
ru: имя_точки_сохранения

source: Description
ru: Описание

source: <command>SAVEPOINT</command> establishes a new savepoint within the current transaction.
ru: <command>SAVEPOINT</command> устанавливает новую точку сохранения в текущей транзакции.

source: A savepoint is a special mark inside a transaction that allows all commands that are executed after it was established to be rolled back, restoring the transaction state to what it was at the time of the savepoint.
ru: Точка сохранения — это специальная отметка внутри транзакции, которая позволяет откатить все команды, выполненные после неё, и восстановить таким образом состояние на момент установки этой точки.

source: Parameters
ru: Параметры

source: The name to give to the new savepoint.
ru: Имя, назначаемое новой точке сохранения.

source: Notes
ru: Замечания

source: Use <xref linkend="sql-rollback-to"/> to rollback to a savepoint. Use <xref linkend="sql-release-savepoint"/> to destroy a savepoint, keeping the effects of commands executed after it was established.
ru: Для отката к установленной точке сохранения предназначена команда <xref linkend="sql-rollback-to"/>. Чтобы уничтожить точку сохранения, сохраняя изменения, произведённые после того, как она была установлена, применяется команда <xref linkend="sql-release-savepoint"/>.

source: Savepoints can only be established when inside a transaction block. There can be multiple savepoints defined within a transaction.
ru: Точки сохранения могут быть установлены только внутри блока транзакции. В одной транзакции можно определить несколько точек сохранения.

source: Examples
ru: Примеры

source: To establish a savepoint and later undo the effects of all commands executed after it was established: <placeholder-1/> The above transaction will insert the values 1 and 3, but not 2.
ru: Установление точки сохранения и затем отмена действия всех команд, выполненных после установленной точки: <placeholder-1/> Показанная транзакция вставит в таблицу значения 1 и 3, но не 2.

source: To establish and later destroy a savepoint: <placeholder-1/> The above transaction will insert both 3 and 4.
ru: Этот пример показывает, как установить и затем уничтожить точку сохранения: <placeholder-1/> Данная транзакция вставит значения 3 и 4.

source: Compatibility
ru: Совместимость

source: SQL requires a savepoint to be destroyed automatically when another savepoint with the same name is established. In <productname>PostgreSQL</productname>, the old savepoint is kept, though only the more recent one will be used when rolling back or releasing. (Releasing the newer savepoint with <command>RELEASE SAVEPOINT</command> will cause the older one to again become accessible to <command>ROLLBACK TO SAVEPOINT</command> and <command>RELEASE SAVEPOINT</command>.) Otherwise, <command>SAVEPOINT</command> is fully SQL conforming.
ru: Стандарт SQL требует, чтобы точка сохранения уничтожалась автоматически, когда устанавливается другая точка сохранения с тем же именем. В <productname>PostgreSQL</productname> старая точка сохранения остаётся, хотя при откате или уничтожении будет выбираться только самая последняя. (После уничтожения последней точки командой <command>RELEASE SAVEPOINT</command> доступной для команд <command>ROLLBACK TO SAVEPOINT</command> и <command>RELEASE SAVEPOINT</command> становится следующая.) В остальном оператор <command>SAVEPOINT</command> полностью соответствует стандарту.

source: See Also
ru: См. также
