Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/set.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change a run-time parameter
ru: изменить параметр времени выполнения

source: configuration_parameter
ru: параметр_конфигурации

source: value
ru: значение

source: timezone
ru: часовой_пояс

source: Description
ru: Описание

source: The <command>SET</command> command changes run-time configuration parameters. Many of the run-time parameters listed in <xref linkend="runtime-config"/> can be changed on-the-fly with <command>SET</command>. (But some require superuser privileges to change, and others cannot be changed after server or session start.) <command>SET</command> only affects the value used by the current session.
ru: Команда <command>SET</command> изменяет конфигурационные параметры времени выполнения. С помощью <command>SET</command> можно &laquo;на лету&raquo; изменить многие из параметров, перечисленных в <xref remap="6" linkend="runtime-config"/>. (Но для изменения некоторых могут потребоваться права суперпользователя, а другие нельзя изменять после запуска сервера или сеанса.) <command>SET</command> влияет на значение параметра только в рамках текущего сеанса.

source: If <command>SET</command> (or equivalently <command>SET SESSION</command>) is issued within a transaction that is later aborted, the effects of the <command>SET</command> command disappear when the transaction is rolled back. Once the surrounding transaction is committed, the effects will persist until the end of the session, unless overridden by another <command>SET</command>.
ru: Если команда <command>SET</command> (или равнозначная <command>SET SESSION</command>) выполняется внутри транзакции, которая затем прерывается, эффект команды <command>SET</command> пропадает, когда транзакция откатывается. Если же окружающая транзакция фиксируется, этот эффект сохраняется до конца сеанса, если его не переопределит другая команда <command>SET</command>.

source: The effects of <command>SET LOCAL</command> last only till the end of the current transaction, whether committed or not. A special case is <command>SET</command> followed by <command>SET LOCAL</command> within a single transaction: the <command>SET LOCAL</command> value will be seen until the end of the transaction, but afterwards (if the transaction is committed) the <command>SET</command> value will take effect.
ru: Действие <command>SET LOCAL</command> продолжается только до конца текущей транзакции, независимо от того, фиксируется она или нет. Особый случай представляет использование <command>SET</command> с последующей <command>SET LOCAL</command> в одной транзакции: значение, заданное <command>SET LOCAL</command>, будет сохраняться до конца транзакции, но после этого (если транзакция фиксируется) восстановится значение, заданное командой <command>SET</command>.

source: The effects of <command>SET</command> or <command>SET LOCAL</command> are also canceled by rolling back to a savepoint that is earlier than the command.
ru: Действия <command>SET</command> или <command>SET LOCAL</command> также отменяются при откате к точке сохранения, установленной до выполнения этих команд.

source: If <command>SET LOCAL</command> is used within a function that has a <literal>SET</literal> option for the same variable (see <xref linkend="sql-createfunction"/>), the effects of the <command>SET LOCAL</command> command disappear at function exit; that is, the value in effect when the function was called is restored anyway. This allows <command>SET LOCAL</command> to be used for dynamic or repeated changes of a parameter within a function, while still having the convenience of using the <literal>SET</literal> option to save and restore the caller's value. However, a regular <command>SET</command> command overrides any surrounding function's <literal>SET</literal> option; its effects will persist unless rolled back.
ru: Если <command>SET LOCAL</command> применяется в функции, параметр <literal>SET</literal> для которой устанавливает значение той же переменной (см. <xref remap="4" linkend="sql-createfunction"/>), действие команды <command>SET LOCAL</command> прекращается при выходе из функции; то есть, в любом случае восстанавливается значение, существовавшее при вызове функции. Это позволяет использовать <command>SET LOCAL</command> для динамических и неоднократных изменений параметра в рамках функции, и при этом иметь удобную возможность использовать параметр <literal>SET</literal> для сохранения и восстановления значения, полученного извне. Однако обычная команда <command>SET</command> переопределяет любой параметр <literal>SET</literal> окружающей функции; её действие сохраняется, если не происходит откат транзакции.

source: In <productname>PostgreSQL</productname> versions 8.0 through 8.2, the effects of a <command>SET LOCAL</command> would be canceled by releasing an earlier savepoint, or by successful exit from a <application>PL/pgSQL</application> exception block. This behavior has been changed because it was deemed unintuitive.
ru: В <productname>PostgreSQL</productname> с версии 8.0 до 8.2 действие <command>SET LOCAL</command> могло отменяться при освобождении ранее установленной точки сохранения или при успешном выходе из блока исключения <application>PL/pgSQL</application>. Затем это поведение было признано неинтуитивным, и было изменено.

source: Parameters
ru: Параметры

source: Specifies that the command takes effect for the current session. (This is the default if neither <literal>SESSION</literal> nor <literal>LOCAL</literal> appears.)
ru: Указывает, что команда действует в рамках текущего сеанса. (Это поведение по умолчанию, если не указано ни <literal>SESSION</literal>, ни <literal>LOCAL</literal>.)

source: Specifies that the command takes effect for only the current transaction. After <command>COMMIT</command> or <command>ROLLBACK</command>, the session-level setting takes effect again. Issuing this outside of a transaction block emits a warning and otherwise has no effect.
ru: Указывает, что команда действует только в рамках текущей транзакции. После <command>COMMIT</command> или <command>ROLLBACK</command> в силу вновь вступает значение, определённое на уровне сеанса. При выполнении такой команды вне блока транзакции выдаётся предупреждение и больше ничего не происходит.

source: Name of a settable run-time parameter. Available parameters are documented in <xref linkend="runtime-config"/> and below.
ru: Имя устанавливаемого параметра времени выполнения. Доступные параметры описаны в <xref remap="6" linkend="runtime-config"/> и ниже.

source: New value of parameter. Values can be specified as string constants, identifiers, numbers, or comma-separated lists of these, as appropriate for the particular parameter. <literal>DEFAULT</literal> can be written to specify resetting the parameter to its default value (that is, whatever value it would have had if no <command>SET</command> had been executed in the current session).
ru: Новое значение параметра. Параметры могут задаваться в виде строковых констант, идентификаторов, чисел или списков перечисленных типов через запятую, в зависимости от конкретного параметра. Указание <literal>DEFAULT</literal> в данном контексте позволяет сбросить параметр к значению по умолчанию (то есть, к тому значению, которое он имел бы, если в текущем сеансе не выполнялись бы команды <command>SET</command>).

source: <literal>SET SCHEMA '<replaceable>value</replaceable>'</literal> is an alias for <literal>SET search_path TO <replaceable>value</replaceable></literal>. Only one schema can be specified using this syntax.
ru: <literal>SET SCHEMA '<replaceable>значение</replaceable>'</literal> — альтернативное написание команды <literal>SET search_path TO <replaceable>значение</replaceable></literal>. Такой синтаксис позволяет указать только одну схему.

source: <literal>SET NAMES <replaceable>value</replaceable></literal> is an alias for <literal>SET client_encoding TO <replaceable>value</replaceable></literal>.
ru: <literal>SET NAMES <replaceable>значение</replaceable></literal> — альтернативное написание команды <literal>SET client_encoding TO <replaceable>значение</replaceable></literal>.

source: Sets the internal seed for the random number generator (the function <function>random</function>). Allowed values are floating-point numbers between -1 and 1, which are then multiplied by 2<superscript>31</superscript>-1.
ru: Устанавливает внутреннее начальное значение для генератора случайных чисел (функции <function>random</function>). В качестве значения допускаются числа с плавающей точкой от -1 до 1, для внутреннего применения они затем умножаются на 2<superscript>31</superscript>-1.

source: SELECT setseed(<replaceable>value</replaceable>);
ru: SELECT setseed(<replaceable>значение</replaceable>);

source: The seed can also be set by invoking the function <function>setseed</function>: <placeholder-1/>
ru: Это начальное значение также можно установить, вызвав функцию <function>setseed</function>: <placeholder-1/>

source: The time zone for Berkeley, California.
ru: Часовой пояс Беркли, штат Калифорния.

source: The time zone for Italy.
ru: Часовой пояс Италии.

source: The time zone 7 hours west from UTC (equivalent to PDT). Positive values are east from UTC.
ru: Часовой пояс, сдвинутый от UTC на 7 часов к западу (равнозначен PDT). Положительные значения означают сдвиг от UTC к востоку.

source: The time zone 8 hours west from UTC (equivalent to PST).
ru: Часовой пояс, сдвинутый от UTC на 8 часов к западу (равнозначен PST).

source: Set the time zone to your local time zone (that is, the server's default value of <varname>timezone</varname>).
ru: Устанавливает в качестве часового пояса местный часовой пояс (то есть, значение серверного параметра <varname>timezone</varname> по умолчанию).

source: <literal>SET TIME ZONE <replaceable>value</replaceable></literal> is an alias for <literal>SET timezone TO <replaceable>value</replaceable></literal>. The syntax <literal>SET TIME ZONE</literal> allows special syntax for the time zone specification. Here are examples of valid values: <placeholder-1/>
ru: <literal>SET TIME ZONE <replaceable>значение</replaceable></literal> — альтернативное написание команды <literal>SET timezone TO <replaceable>значение</replaceable></literal>. Синтаксис <literal>SET TIME ZONE</literal> позволяет указывать часовой пояс в специальном формате. Например, допускаются следующие значения: <placeholder-1/>

source: Timezone settings given as numbers or intervals are internally translated to POSIX timezone syntax. For example, after <literal>SET TIME ZONE -7</literal>, <command>SHOW TIME ZONE</command> would report <literal>&lt;-07&gt;+07</literal>.
ru: Значения часового пояса, заданные в виде чисел или интервалов, внутри переводятся в формат часовых поясов POSIX. Например, после <literal>SET TIME ZONE -7</literal>, команда <command>SHOW TIME ZONE</command> покажет <literal>&lt;-07&gt;+07</literal>.

source: See <xref linkend="datatype-timezones"/> for more information about time zones.
ru: Узнать о часовых поясах подробнее можно в <xref remap="6" linkend="datatype-timezones"/>.

source: Besides the configuration parameters documented in <xref linkend="runtime-config"/>, there are a few that can only be adjusted using the <command>SET</command> command or that have a special syntax: <placeholder-1/>
ru: Помимо конфигурационных параметров, описанных в <xref remap="6" linkend="runtime-config"/>, есть ещё несколько параметров, которые можно изменить только командой <command>SET</command> или которые имеют особый синтаксис: <placeholder-1/>

source: Notes
ru: Замечания

source: The function <function>set_config</function> provides equivalent functionality; see <xref linkend="functions-admin"/>. Also, it is possible to UPDATE the <link linkend="view-pg-settings"><structname>pg_settings</structname></link> system view to perform the equivalent of <command>SET</command>.
ru: Также изменить значение параметра можно с помощью функции <function>set_config</function>; см. <xref remap="4" linkend="functions-admin"/>. Кроме того, выполнив UPDATE в системном представлении <link linkend="view-pg-settings"><structname>pg_settings</structname></link>, можно произвести то же действие, что выполняет <command>SET</command>.

source: Examples
ru: Примеры

source: Set the schema search path: <placeholder-1/>
ru: Установка пути поиска схем: <placeholder-1/>

source: Set the style of date to traditional <productname>POSTGRES</productname> with <quote>day before month</quote> input convention: <screen> SET datestyle TO postgres, dmy; </screen>
ru: Установка традиционного стиля даты <productname>POSTGRES</productname> с форматом ввода <quote>день, месяц, год</quote>: <screen> SET datestyle TO postgres, dmy; </screen>

source: Set the time zone for Berkeley, California: <screen> SET TIME ZONE 'PST8PDT'; </screen>
ru: Установка часового пояса для Беркли, штат Калифорния: <screen> SET TIME ZONE 'PST8PDT'; </screen>

source: Set the time zone for Italy: <screen> SET TIME ZONE 'Europe/Rome'; </screen>
ru: Установка часового пояса Италии: <screen> SET TIME ZONE 'Europe/Rome'; </screen>

source: Compatibility
ru: Совместимость

source: <literal>SET TIME ZONE</literal> extends syntax defined in the SQL standard. The standard allows only numeric time zone offsets while <productname>PostgreSQL</productname> allows more flexible time-zone specifications. All other <literal>SET</literal> features are <productname>PostgreSQL</productname> extensions.
ru: <literal>SET TIME ZONE</literal> расширяет синтаксис, определённый в стандарте SQL. Стандарт допускает только числовые смещения часовых поясов, тогда как <productname>PostgreSQL</productname> позволяет задавать часовой пояс более гибко. Все другие функции <literal>SET</literal> являются расширениями <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
