Repository: pluzanov/pg-doc-ru
Catalog: postgresql-doc/ref/set_session_auth.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: set the session user identifier and the current user identifier of the current session
ru: установить идентификатор пользователя сеанса и идентификатор текущего пользователя в рамках сеанса

source: user_name
ru: имя_пользователя

source: Description
ru: Описание

source: This command sets the session user identifier and the current user identifier of the current SQL session to be <replaceable class="parameter">user_name</replaceable>. The user name can be written as either an identifier or a string literal. Using this command, it is possible, for example, to temporarily become an unprivileged user and later switch back to being a superuser.
ru: Эта команда меняет идентификатор пользователя сеанса и идентификатор текущего пользователя в рамках активного сеанса SQL на <replaceable class="parameter">имя_пользователя</replaceable>. Имя пользователя может быть записано в виде идентификатора или строковой константы. С помощью этой команды, можно, например, временно переключиться на непривилегированного пользователя, сохранив возможность затем стать суперпользователем.

source: The session user identifier is initially set to be the (possibly authenticated) user name provided by the client. The current user identifier is normally equal to the session user identifier, but might change temporarily in the context of <literal>SECURITY DEFINER</literal> functions and similar mechanisms; it can also be changed by <xref linkend="sql-set-role"/>. The current user identifier is relevant for permission checking.
ru: Идентификатором пользователя сеанса изначально принимается имя пользователя, введённое клиентом (возможно, прошедшее проверку подлинности). Идентификатор текущего пользователя обычно совпадает с идентификатором пользователя сеанса, но может временно меняться в функциях с характеристикой <literal>SECURITY DEFINER</literal> и подобными механизмами; также его можно изменить командой <xref linkend="sql-set-role"/>. Идентификатор текущего пользователя принимается во внимание при проверке разрешений.

source: The session user identifier can be changed only if the initial session user (the <firstterm>authenticated user</firstterm>) had the superuser privilege. Otherwise, the command is accepted only if it specifies the authenticated user name.
ru: Идентификатор пользователя сеанса можно изменить, только если начальный пользователь сеанса (<firstterm>аутентифицированный пользователь</firstterm>) имеет права суперпользователя. В противном случае эта команда разрешается, только если в ней указывается имя аутентифицированного пользователя.

source: The <literal>SESSION</literal> and <literal>LOCAL</literal> modifiers act the same as for the regular <xref linkend="sql-set"/> command.
ru: Указания <literal>SESSION</literal> и <literal>LOCAL</literal> действуют на эту команду так же, как и на обычную команду <xref linkend="sql-set"/>.

source: The <literal>DEFAULT</literal> and <literal>RESET</literal> forms reset the session and current user identifiers to be the originally authenticated user name. These forms can be executed by any user.
ru: Формы <literal>DEFAULT</literal> и <literal>RESET</literal> сбрасывают идентификаторы текущего пользователя и пользователя сеанса, так что текущим становится пользователь, изначально проходивший проверку подлинности. Эти формы могут выполняться любым пользователем.

source: Notes
ru: Замечания

source: <command>SET SESSION AUTHORIZATION</command> cannot be used within a <literal>SECURITY DEFINER</literal> function.
ru: <command>SET SESSION AUTHORIZATION</command> нельзя использовать в функции с характеристикой <literal>SECURITY DEFINER</literal>.

source: Examples
ru: Примеры

source: Compatibility
ru: Совместимость

source: The SQL standard allows some other expressions to appear in place of the literal <replaceable>user_name</replaceable>, but these options are not important in practice. <productname>PostgreSQL</productname> allows identifier syntax (<literal>"<replaceable>username</replaceable>"</literal>), which SQL does not. SQL does not allow this command during a transaction; <productname>PostgreSQL</productname> does not make this restriction because there is no reason to. The <literal>SESSION</literal> and <literal>LOCAL</literal> modifiers are a <productname>PostgreSQL</productname> extension, as is the <literal>RESET</literal> syntax.
ru: Стандарт SQL позволяет вместо строковой константы <replaceable>имя_пользователя</replaceable> указывать некоторые другие выражения, но на практике это не очень полезно. <productname>PostgreSQL</productname> допускает синтаксис идентификаторов (<literal>"<replaceable>имя_пользователя</replaceable>"</literal>), а стандарт SQL — нет. Стандарт не позволяет выполнять эту команду в транзакции; в <productname>PostgreSQL</productname> такого ограничения нет, так как для него нет причины. Указания <literal>SESSION</literal> и <literal>LOCAL</literal> относятся к расширениям <productname>PostgreSQL</productname>, так же, как и синтаксис <literal>RESET</literal>.

source: The privileges necessary to execute this command are left implementation-defined by the standard.
ru: Набор прав, требуемых для выполнения этой команды, согласно стандарту, определяется реализацией.

source: See Also
ru: См. также
