Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_foreign_data_wrapper.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a foreign-data wrapper
ru: изменить определение обёртки сторонних данных

source: name
ru: имя

source: handler_function
ru: функция_обработчик

source: validator_function
ru: функция_проверки

source: option
ru: параметр

source: value
ru: значение

source: new_owner
ru: новый_владелец

source: new_name
ru: новое_имя

source: Description
ru: Описание

source: <command>ALTER FOREIGN DATA WRAPPER</command> changes the definition of a foreign-data wrapper. The first form of the command changes the support functions or the generic options of the foreign-data wrapper (at least one clause is required). The second form changes the owner of the foreign-data wrapper.
ru: <command>ALTER FOREIGN DATA WRAPPER</command> изменяет определение обёртки сторонних данных. Первая форма команды меняет вспомогательные функции или общие параметры обёртки (требуется минимум одно предложение), а вторая — владельца обёртки.

source: Only superusers can alter foreign-data wrappers. Additionally, only superusers can own foreign-data wrappers.
ru: Настраивать обёртки сторонних данных могут только суперпользователи и только суперпользователи могут быть их владельцами.

source: Parameters
ru: Параметры

source: The name of an existing foreign-data wrapper.
ru: Имя существующей обёртки сторонних данных.

source: Specifies a new handler function for the foreign-data wrapper.
ru: Задаёт новое имя функции-обработчика для обёртки сторонних данных.

source: This is used to specify that the foreign-data wrapper should no longer have a handler function.
ru: Эти ключевые слова указывают, что обёртка сторонних данных теперь не имеет функции-обработчика.

source: Note that foreign tables that use a foreign-data wrapper with no handler cannot be accessed.
ru: Заметьте, что обращаться к сторонним таблицам, если их обёртка сторонних данных не имеет обработчика, нельзя.

source: Specifies a new validator function for the foreign-data wrapper.
ru: Задаёт новое имя функции проверки для обёртки сторонних данных.

source: Note that it is possible that pre-existing options of the foreign-data wrapper, or of dependent servers, user mappings, or foreign tables, are invalid according to the new validator. <productname>PostgreSQL</productname> does not check for this. It is up to the user to make sure that these options are correct before using the modified foreign-data wrapper. However, any options specified in this <command>ALTER FOREIGN DATA WRAPPER</command> command will be checked using the new validator.
ru: Заметьте, что возможна ситуация, что предыдущие параметры обёртки данных, зависимых серверов, сопоставлений пользователей или сторонних таблиц окажутся неприемлемыми для новой функции проверки. <productname>PostgreSQL</productname> не проверяет их, поэтому пользователь сам должен убедиться в правильности этих параметров, прежде чем использовать изменённую обёртку данных. Однако параметры, изменяемые в данной команде <command>ALTER FOREIGN DATA WRAPPER</command>, будут проверены новой функцией проверки.

source: This is used to specify that the foreign-data wrapper should no longer have a validator function.
ru: Эти ключевые слова указывают, что обёртка сторонних данных теперь не имеет функции проверки.

source: Change options for the foreign-data wrapper. <literal>ADD</literal>, <literal>SET</literal>, and <literal>DROP</literal> specify the action to be performed. <literal>ADD</literal> is assumed if no operation is explicitly specified. Option names must be unique; names and values are also validated using the foreign data wrapper's validator function, if any.
ru: Эта форма настраивает параметры обёртки сторонних данных. <literal>ADD</literal>, <literal>SET</literal> и <literal>DROP</literal> определяют, какое действие будет выполнено (добавление, установка и удаление, соответственно). Если действие не задано явно, подразумевается <literal>ADD</literal>. Имена параметров должны быть уникальными, они вместе со значениями проверяются функцией проверки, если она установлена.

source: The user name of the new owner of the foreign-data wrapper.
ru: Имя пользователя, назначаемого новым владельцем обёртки сторонних данных.

source: The new name for the foreign-data wrapper.
ru: Новое имя обёртки сторонних данных.

source: Examples
ru: Примеры

source: Change a foreign-data wrapper <literal>dbi</literal>, add option <literal>foo</literal>, drop <literal>bar</literal>: <placeholder-1/>
ru: Изменение параметров обёртки сторонних данных <literal>dbi</literal>: добавление параметра <literal>foo</literal>, удаление <literal>bar</literal>: <placeholder-1/>

source: Change the foreign-data wrapper <literal>dbi</literal> validator to <literal>bob.myvalidator</literal>: <placeholder-1/>
ru: Установление для обёртки сторонних данных <literal>dbi</literal> новой функции проверки <literal>bob.myvalidator</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER FOREIGN DATA WRAPPER</command> conforms to ISO/IEC 9075-9 (SQL/MED), except that the <literal>HANDLER</literal>, <literal>VALIDATOR</literal>, <literal>OWNER TO</literal>, and <literal>RENAME</literal> clauses are extensions.
ru: <command>ALTER FOREIGN DATA WRAPPER</command> соответствует стандарту ISO/IEC 9075-9 (SQL/MED), за исключением предложений <literal>HANDLER</literal>, <literal>VALIDATOR</literal>, <literal>OWNER TO</literal> и <literal>RENAME</literal>, являющихся расширениями.

source: See Also
ru: См. также
