Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_opfamily.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of an operator family
ru: изменить определение семейства операторов

source: name
ru: имя

source: index_method
ru: метод_индекса

source: strategy_number
ru: номер_стратегии

source: operator_name
ru: имя_оператора

source: op_type
ru: тип_операнда

source: sort_family_name
ru: семейство_сортировки

source: support_number
ru: номер_опорной_функции

source: function_name
ru: имя_функции

source: argument_type
ru: тип_аргумента

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER OPERATOR FAMILY</command> changes the definition of an operator family. You can add operators and support functions to the family, remove them from the family, or change the family's name or owner.
ru: <command>ALTER OPERATOR FAMILY</command> меняет определение семейства операторов. Она позволяет добавлять в семейство операторы и опорные функции, удалять их из семейства или менять имя и владельца семейства операторов.

source: When operators and support functions are added to a family with <command>ALTER OPERATOR FAMILY</command>, they are not part of any specific operator class within the family, but are just <quote>loose</quote> within the family. This indicates that these operators and functions are compatible with the family's semantics, but are not required for correct functioning of any specific index. (Operators and functions that are so required should be declared as part of an operator class, instead; see <xref linkend="sql-createopclass"/>.) <productname>PostgreSQL</productname> will allow loose members of a family to be dropped from the family at any time, but members of an operator class cannot be dropped without dropping the whole class and any indexes that depend on it. Typically, single-data-type operators and functions are part of operator classes because they are needed to support an index on that specific data type, while cross-data-type operators and functions are made loose members of the family.
ru: Когда операторы и опорные функции добавляются в семейство с помощью <command>ALTER OPERATOR FAMILY</command>, они не становятся частью какого-либо определённого класса операторов в семействе, а просто считаются <quote>слабосвязанными</quote> с семейством. Это показывает, что эти операторы и функции семантически совместимы с семейством, но не требуются для корректной работы какого-либо индекса. (Операторы и функции, которые действительно требуются для этого, должны быть включены не в семейство, а в класс операторов; см. <xref remap="4" linkend="sql-createopclass"/>.) <productname>PostgreSQL</productname> позволяет удалять слабосвязанные члены из семейства в любое время, но члены класса операторов не могут быть удалены, пока не будет удалён весь класс и все зависимые от него индексы. Обычно в классы операторов включаются операторы и функции, работающие с одним типом данным (так как они нужны для поддержки индексов данных такого типа), а функции и операторы, работающие с разными типами, становятся слабосвязанными членами семейства.

source: You must be a superuser to use <command>ALTER OPERATOR FAMILY</command>. (This restriction is made because an erroneous operator family definition could confuse or even crash the server.)
ru: Выполнить <command>ALTER OPERATOR FAMILY</command> может только суперпользователь. (Это ограничение введено потому, что ошибочное определение семейства операторов может вызвать нарушения или даже сбой в работе сервера.)

source: <command>ALTER OPERATOR FAMILY</command> does not presently check whether the operator family definition includes all the operators and functions required by the index method, nor whether the operators and functions form a self-consistent set. It is the user's responsibility to define a valid operator family.
ru: <command>ALTER OPERATOR FAMILY</command> в настоящее время не проверяет, включает ли определение семейства операторов все операторы и функции, требуемые для индексного метода, и образуют ли они целостный набор. Ответственность за правильность определения семейства лежит на пользователе.

source: Refer to <xref linkend="xindex"/> for further information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="xindex"/>.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing operator family.
ru: Имя (возможно, дополненное схемой) существующего семейства операторов.

source: The name of the index method this operator family is for.
ru: Имя индексного метода, для которого предназначено это семейство операторов.

source: The index method's strategy number for an operator associated with the operator family.
ru: Номер стратегии индексного метода для оператора, связанного с данным семейством операторов.

source: The name (optionally schema-qualified) of an operator associated with the operator family.
ru: Имя (возможно, дополненное схемой) оператора, связанного с данным семейством операторов.

source: In an <literal>OPERATOR</literal> clause, the operand data type(s) of the operator, or <literal>NONE</literal> to signify a left-unary or right-unary operator. Unlike the comparable syntax in <command>CREATE OPERATOR CLASS</command>, the operand data types must always be specified.
ru: В предложении <literal>OPERATOR</literal> указывается тип(ы) данных оператора или <literal>NONE</literal>, если это левый или правый унарный оператор. В отличие от похожего синтаксиса в <command>CREATE OPERATOR CLASS</command>, здесь типы операндов должны указываться всегда.

source: In an <literal>ADD FUNCTION</literal> clause, the operand data type(s) the function is intended to support, if different from the input data type(s) of the function. For B-tree comparison functions and hash functions it is not necessary to specify <replaceable class="parameter">op_type</replaceable> since the function's input data type(s) are always the correct ones to use. For B-tree sort support functions and all functions in GiST, SP-GiST and GIN operator classes, it is necessary to specify the operand data type(s) the function is to be used with.
ru: В предложении <literal>ADD FUNCTION</literal> это тип данных, который должна поддерживать эта функция, если он отличается от входного типа данных функции. Для функций сравнения B-деревьев и хеш-функций указывать <replaceable class="parameter">тип_операнда</replaceable> необязательно, так как их входные типы данных всегда будут верными. Однако для функций поддержки сортировки B-деревьев и всех функций в классах операторов GiST, SP-GiST и GIN необходимо указать тип(ы) операндов, с которыми будут использоваться эти функции.

source: In a <literal>DROP FUNCTION</literal> clause, the operand data type(s) the function is intended to support must be specified.
ru: В предложении <literal>DROP FUNCTION</literal> тип операнда, который должна поддерживать эта функция.

source: The name (optionally schema-qualified) of an existing <literal>btree</literal> operator family that describes the sort ordering associated with an ordering operator.
ru: Имя (возможно, дополненное схемой) существующего семейства операторов <literal>btree</literal>, описывающего порядок сортировки, связанный с оператором сортировки.

source: If neither <literal>FOR SEARCH</literal> nor <literal>FOR ORDER BY</literal> is specified, <literal>FOR SEARCH</literal> is the default.
ru: Если не указано ни <literal>FOR SEARCH</literal> (для поиска), ни <literal>FOR ORDER BY</literal> (для сортировки), подразумевается <literal>FOR SEARCH</literal>.

source: The index method's support procedure number for a function associated with the operator family.
ru: Номер опорной процедуры индексного метода для функции, связанной с данным семейством операторов.

source: The name (optionally schema-qualified) of a function that is an index method support procedure for the operator family.
ru: Имя (возможно, дополненное схемой) функции, которая является опорной процедурой индексного метода для данного семейства операторов.

source: The parameter data type(s) of the function.
ru: Тип данных параметра функции.

source: The new name of the operator family.
ru: Новое имя семейства операторов.

source: The new owner of the operator family.
ru: Новый владелец семейства операторов.

source: The new schema for the operator family.
ru: Новая схема семейства операторов.

source: The <literal>OPERATOR</literal> and <literal>FUNCTION</literal> clauses can appear in any order.
ru: Предложения <literal>OPERATOR</literal> и <literal>FUNCTION</literal> могут указываться в любом порядке.

source: Notes
ru: Замечания

source: Notice that the <literal>DROP</literal> syntax only specifies the <quote>slot</quote> in the operator family, by strategy or support number and input data type(s). The name of the operator or function occupying the slot is not mentioned. Also, for <literal>DROP FUNCTION</literal> the type(s) to specify are the input data type(s) the function is intended to support; for GiST, SP-GiST and GIN indexes this might have nothing to do with the actual input argument types of the function.
ru: Заметьте, что в синтаксисе <literal>DROP</literal> указывается только <quote>слот</quote> в семействе операторов, по номеру стратегии или опорной функции, и входные типы данных. Имя оператора или функции, занимающих этот слот, не упоминается. Также учтите, что в <literal>DROP FUNCTION</literal> указываются типы входных данных, которые должна поддерживать функция, но для индексов GiST, SP-GiST и GIN они могут не иметь ничего общего с типами фактических аргументов функции.

source: Because the index machinery does not check access permissions on functions before using them, including a function or operator in an operator family is tantamount to granting public execute permission on it. This is usually not an issue for the sorts of functions that are useful in an operator family.
ru: Так как механизмы индексов не проверяют права доступа к функциям прежде чем вызывать их, включение функций или операторов в семейство операторов по сути даёт всем право на выполнение их. Обычно это не проблема для таких функций, какие бывают полезны в семействе операторов.

source: The operators should not be defined by SQL functions. A SQL function is likely to be inlined into the calling query, which will prevent the optimizer from recognizing that the query matches an index.
ru: Операторы не должны реализовываться в функциях на языке SQL. SQL-функция вероятнее всего будет встроена в вызывающий запрос, что помешает оптимизатору понять, что этот запрос соответствует индексу.

source: Before <productname>PostgreSQL</productname> 8.4, the <literal>OPERATOR</literal> clause could include a <literal>RECHECK</literal> option. This is no longer supported because whether an index operator is <quote>lossy</quote> is now determined on-the-fly at run time. This allows efficient handling of cases where an operator might or might not be lossy.
ru: До <productname>PostgreSQL</productname> 8.4 предложение <literal>OPERATOR</literal> могло включать указание <literal>RECHECK</literal>. Теперь это не поддерживается, так как оператор индекса может быть <quote>неточным</quote> и это определяется на ходу в момент выполнения. Это позволяет эффективно справляться с ситуациями, когда оператор может быть или не быть неточным.

source: Examples
ru: Примеры

source: The following example command adds cross-data-type operators and support functions to an operator family that already contains B-tree operator classes for data types <type>int4</type> and <type>int2</type>.
ru: Следующий пример добавляет опорные функции и операторы смешанных типов в семейство операторов, уже содержащее классы операторов B-дерева для типов данных <type>int4</type> и <type>int2</type>.

source: ALTER OPERATOR FAMILY integer_ops USING btree ADD -- int4 vs int2 OPERATOR 1 &lt; (int4, int2) , OPERATOR 2 &lt;= (int4, int2) , OPERATOR 3 = (int4, int2) , OPERATOR 4 &gt;= (int4, int2) , OPERATOR 5 &gt; (int4, int2) , FUNCTION 1 btint42cmp(int4, int2) , -- int2 vs int4 OPERATOR 1 &lt; (int2, int4) , OPERATOR 2 &lt;= (int2, int4) , OPERATOR 3 = (int2, int4) , OPERATOR 4 &gt;= (int2, int4) , OPERATOR 5 &gt; (int2, int4) , FUNCTION 1 btint24cmp(int2, int4) ;
ru: ALTER OPERATOR FAMILY integer_ops USING btree ADD -- int4 и int2 OPERATOR 1 &lt; (int4, int2) , OPERATOR 2 &lt;= (int4, int2) , OPERATOR 3 = (int4, int2) , OPERATOR 4 &gt;= (int4, int2) , OPERATOR 5 &gt; (int4, int2) , FUNCTION 1 btint42cmp(int4, int2) , -- int2 и int4 OPERATOR 1 &lt; (int2, int4) , OPERATOR 2 &lt;= (int2, int4) , OPERATOR 3 = (int2, int4) , OPERATOR 4 &gt;= (int2, int4) , OPERATOR 5 &gt; (int2, int4) , FUNCTION 1 btint24cmp(int2, int4) ;

source: To remove these entries again:
ru: Удаление этих же элементов:

source: Compatibility
ru: Совместимость

source: There is no <command>ALTER OPERATOR FAMILY</command> statement in the SQL standard.
ru: Команда <command>ALTER OPERATOR FAMILY</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
