Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_system.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change a server configuration parameter
ru: изменить параметр конфигурации сервера

source: configuration_parameter
ru: параметр_конфигурации

source: value
ru: значение

source: Description
ru: Описание

source: <command>ALTER SYSTEM</command> is used for changing server configuration parameters across the entire database cluster. It can be more convenient than the traditional method of manually editing the <filename>postgresql.conf</filename> file. <command>ALTER SYSTEM</command> writes the given parameter setting to the <filename>postgresql.auto.conf</filename> file, which is read in addition to <filename>postgresql.conf</filename>. Setting a parameter to <literal>DEFAULT</literal>, or using the <command>RESET</command> variant, removes that configuration entry from the <filename>postgresql.auto.conf</filename> file. Use <literal>RESET ALL</literal> to remove all such configuration entries.
ru: Оператор <command>ALTER SYSTEM</command> применяется для изменения параметров конфигурации сервера, распространяющихся на весь кластер баз данных. Пользоваться им может быть удобнее, чем вручную редактировать файл <filename>postgresql.conf</filename>. <command>ALTER SYSTEM</command> записывает заданное значение параметра в файл <filename>postgresql.auto.conf</filename>, который считывается сервером в дополнение к <filename>postgresql.conf</filename>. При указании в качестве значения параметра <literal>DEFAULT</literal> или применении формы <command>RESET</command> соответствующий элемент конфигурации удаляется из <filename>postgresql.auto.conf</filename>. Удалить все настроенные таким способом параметры позволяет предложение <literal>RESET ALL</literal>.

source: Values set with <command>ALTER SYSTEM</command> will be effective after the next server configuration reload, or after the next server restart in the case of parameters that can only be changed at server start. A server configuration reload can be commanded by calling the SQL function <function>pg_reload_conf()</function>, running <literal>pg_ctl reload</literal>, or sending a <systemitem>SIGHUP</systemitem> signal to the main server process.
ru: Значения, установленные командой <command>ALTER SYSTEM</command>, вступают в силу после следующей перезагрузки конфигурации сервера либо после перезапуска сервера (если это параметры, воспринимаемые только при запуске). Перезагрузить конфигурацию сервера можно, вызвав SQL-функцию <function>pg_reload_conf()</function>, выполнив <literal>pg_ctl reload</literal> или отправив сигнал <systemitem>SIGHUP</systemitem> главному серверному процессу.

source: Only superusers can use <command>ALTER SYSTEM</command>. Also, since this command acts directly on the file system and cannot be rolled back, it is not allowed inside a transaction block or function.
ru: Выполнить <command>ALTER SYSTEM</command> могут только суперпользователи. А так как эта команда работает непосредственно с файловой системой и не может быть отменена, её нельзя поместить в блок транзакции или функцию.

source: Parameters
ru: Параметры

source: Name of a settable configuration parameter. Available parameters are documented in <xref linkend="runtime-config"/>.
ru: Имя устанавливаемого параметра конфигурации. Список доступных параметров приведён в <xref remap="6" linkend="runtime-config"/>.

source: New value of the parameter. Values can be specified as string constants, identifiers, numbers, or comma-separated lists of these, as appropriate for the particular parameter. <literal>DEFAULT</literal> can be written to specify removing the parameter and its value from <filename>postgresql.auto.conf</filename>.
ru: Новое значение параметра. Значениями могут быть строковые константы, идентификаторы, числа или списки таких элементов через запятую, в зависимости от конкретного параметра. Если в качестве значения указать <literal>DEFAULT</literal>, параметр и его значение удаляется из <filename>postgresql.auto.conf</filename>.

source: Notes
ru: Замечания

source: This command can't be used to set <xref linkend="guc-data-directory"/>, nor parameters that are not allowed in <filename>postgresql.conf</filename> (e.g., <link linkend="runtime-config-preset">preset options</link>).
ru: С помощью этой команды нельзя задать <xref linkend="guc-data-directory"/>, равно как и другие параметры, недопустимые в <filename>postgresql.conf</filename> (например, <link linkend="runtime-config-preset">предустановленные параметры</link>).

source: See <xref linkend="config-setting"/> for other ways to set the parameters.
ru: Другие способы настройки параметров описаны в <xref remap="6" linkend="config-setting"/>.

source: Examples
ru: Примеры

source: Set the <literal>wal_level</literal>: <placeholder-1/>
ru: Установка уровня ведения журнала транзакций (<literal>wal_level</literal>): <placeholder-1/>

source: Undo that, restoring whatever setting was effective in <filename>postgresql.conf</filename>: <placeholder-1/>
ru: Отмена изменения, восстановление значения, заданного в <filename>postgresql.conf</filename>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <command>ALTER SYSTEM</command> statement is a <productname>PostgreSQL</productname> extension.
ru: Оператор <command>ALTER SYSTEM</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
