Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_table.po
Languages: ru

source: These forms control the application of row security policies belonging to the table when the user is the table owner. If enabled, row level security policies will be applied when the user is the table owner. If disabled (the default) then row level security will not be applied when the user is the table owner. See also <xref linkend="sql-createpolicy"/>.
ru: Эти формы управляют применением относящихся к таблице политик защиты строк, когда пользователь является её владельцем. Если это поведение включается, политики защиты на уровне строк будут действовать и на владельца таблицы. Если оно отключено (по умолчанию), защита на уровне строк не будет действовать на пользователя, являющегося владельцем таблицы. См. также <xref remap="4" linkend="sql-createpolicy"/>.

source: This form selects the default index for future <xref linkend="sql-cluster"/> operations. It does not actually re-cluster the table.
ru: Эта форма выбирает индекс по умолчанию для последующих операций <xref linkend="sql-cluster"/>. Собственно кластеризация таблицы при этом не выполняется.

source: Changing cluster options acquires a <literal>SHARE UPDATE EXCLUSIVE</literal> lock.
ru: Для изменения параметров кластеризации запрашивается блокировка <literal>SHARE UPDATE EXCLUSIVE</literal>.

source: This form removes the most recently used <xref linkend="sql-cluster"/> index specification from the table. This affects future cluster operations that don't specify an index.
ru: Эта форма удаляет последнее заданное указание индекса для <xref linkend="sql-cluster"/>. Её действие отразится на будущих операциях кластеризации, для которых не будет задан индекс.

source: This form adds an <literal>oid</literal> system column to the table (see <xref linkend="ddl-system-columns"/>). It does nothing if the table already has OIDs.
ru: Эта форма добавляет в таблицу системный столбец <literal>oid</literal> (см. <xref remap="4" linkend="ddl-system-columns"/>). Если в таблице уже есть такой столбец, она не делает ничего.

source: Note that this is not equivalent to <literal>ADD COLUMN oid oid</literal>; that would add a normal column that happened to be named <literal>oid</literal>, not a system column.
ru: Заметьте, что это не равнозначно команде <literal>ADD COLUMN oid oid</literal> (эта команда добавит не системный, а обычный столбец с подходящим именем <literal>oid</literal>).

source: This form removes the <literal>oid</literal> system column from the table. This is exactly equivalent to <literal>DROP COLUMN oid RESTRICT</literal>, except that it will not complain if there is already no <literal>oid</literal> column.
ru: Эта форма удаляет из таблицы системный столбец <literal>oid</literal>. Это в точности равнозначно <literal>DROP COLUMN oid RESTRICT</literal>, за исключением того, что в случае отсутствия столбца <literal>oid</literal> ошибки не будет.

source: This form changes the table's tablespace to the specified tablespace and moves the data file(s) associated with the table to the new tablespace. Indexes on the table, if any, are not moved; but they can be moved separately with additional <literal>SET TABLESPACE</literal> commands. All tables in the current database in a tablespace can be moved by using the <literal>ALL IN TABLESPACE</literal> form, which will lock all tables to be moved first and then move each one. This form also supports <literal>OWNED BY</literal>, which will only move tables owned by the roles specified. If the <literal>NOWAIT</literal> option is specified then the command will fail if it is unable to acquire all of the locks required immediately. Note that system catalogs are not moved by this command, use <command>ALTER DATABASE</command> or explicit <command>ALTER TABLE</command> invocations instead if desired. The <literal>information_schema</literal> relations are not considered part of the system catalogs and will be moved. See also <xref linkend="sql-createtablespace"/>.
ru: Эта форма меняет табличное пространство таблицы на заданное и перемещает файлы данных, связанные с таблицей, в новое пространство. Индексы таблицы, если они имеются, не перемещаются; однако их можно переместить отдельно дополнительными командами <literal>SET TABLESPACE</literal>. Форма <literal>ALL IN TABLESPACE</literal> позволяет перенести в другое табличное пространство все таблицы текущей базы данных, при этом она сначала блокирует все таблицы, а затем переносит каждую из них. Эта форма также поддерживает указание <literal>OWNED BY</literal>, с которым перемещаются только таблицы указанного владельца. Если указан параметр <literal>NOWAIT</literal>, команда завершится ошибкой, если не сможет получить все требуемые блокировки немедленно. Заметьте, что системные каталоги эта форма не перемещает; если требуется переместить их, следует использовать <command>ALTER DATABASE</command> или явные вызовы <command>ALTER TABLE</command>. Отношения <literal>information_schema</literal> не считаются частью системных каталогов и подлежат перемещению. См. также <xref linkend="sql-createtablespace"/>.

source: This form changes the table from unlogged to logged or vice-versa (see <xref linkend="sql-createtable-unlogged"/>). It cannot be applied to a temporary table.
ru: Эта форма меняет характеристику журналирования таблицы, делает таблицу журналируемой/нежурналируемой, соответственно (см. <xref remap="4" linkend="sql-createtable-unlogged"/>). К временной таблице она неприменима.

source: While <command>CREATE TABLE</command> allows <literal>OIDS</literal> to be specified in the <literal>WITH (<replaceable class="parameter">storage_parameter</replaceable>)</literal> syntax, <command>ALTER TABLE</command> does not treat <literal>OIDS</literal> as a storage parameter. Instead use the <literal>SET WITH OIDS</literal> and <literal>SET WITHOUT OIDS</literal> forms to change OID status.
ru: Хотя <command>CREATE TABLE</command> позволяет указать <literal>OIDS</literal> в синтаксисе <literal>WITH (<replaceable class="parameter">параметр_хранения</replaceable>)</literal>, <command>ALTER TABLE</command> не воспринимает <literal>OIDS</literal> как параметр хранения. Поэтому для изменения характеристики OID следует применять формы <literal>SET WITH OIDS</literal> и <literal>SET WITHOUT OIDS</literal>.

source: This form resets one or more storage parameters to their defaults. As with <literal>SET</literal>, a table rewrite might be needed to update the table entirely.
ru: Эта форма сбрасывает один или несколько параметров хранения к значениям по умолчанию. Как и с <literal>SET</literal>, для полного обновления таблицы может потребоваться перезаписать таблицу.

source: This form adds the target table as a new child of the specified parent table. Subsequently, queries against the parent will include records of the target table. To be added as a child, the target table must already contain all the same columns as the parent (it could have additional columns, too). The columns must have matching data types, and if they have <literal>NOT NULL</literal> constraints in the parent then they must also have <literal>NOT NULL</literal> constraints in the child.
ru: Эта форма назначает целевую таблицу потомком заданной родительской таблицы. Впоследствии запросы к родительской таблице будут включать записи и целевой таблицы. Чтобы таблица могла стать потомком, она должна содержать те же столбцы, что и родительская (хотя она может включать и дополнительные столбцы). Столбцы должны иметь одинаковые типы данных и, если в родительской таблице какие-то из них имеют ограничение <literal>NOT NULL</literal>, они должны иметь ограничение <literal>NOT NULL</literal> и в таблице-потомке.

source: There must also be matching child-table constraints for all <literal>CHECK</literal> constraints of the parent, except those marked non-inheritable (that is, created with <literal>ALTER TABLE ... ADD CONSTRAINT ... NO INHERIT</literal>) in the parent, which are ignored; all child-table constraints matched must not be marked non-inheritable. Currently <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, and <literal>FOREIGN KEY</literal> constraints are not considered, but this might change in the future.
ru: Также в таблице-потомке должны присутствовать все ограничения <literal>CHECK</literal> родительской таблицы, за исключением ненаследуемых (то есть созданных командой <literal>ALTER TABLE ... ADD CONSTRAINT ... NO INHERIT</literal>), которые игнорируются; при этом все соответствующие ограничения в таблице-потомке не должны быть ненаследуемыми. В настоящее время ограничения <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal> и <literal>FOREIGN KEY</literal> не учитываются, но в будущем это может измениться.

source: This form removes the target table from the list of children of the specified parent table. Queries against the parent table will no longer include records drawn from the target table.
ru: Эта форма удаляет целевую таблицу из списка потомков указанной родительской таблицы. Результаты запросов к родительской таблице после этого не будут включать записи, взятые из целевой таблицы.

source: This form links the table to a composite type as though <command>CREATE TABLE OF</command> had formed it. The table's list of column names and types must precisely match that of the composite type; the presence of an <literal>oid</literal> system column is permitted to differ. The table must not inherit from any other table. These restrictions ensure that <command>CREATE TABLE OF</command> would permit an equivalent table definition.
ru: Эта форма связывает таблицу с составным типом, как если бы она была сформирована командой <command>CREATE TABLE OF</command>. При этом список имён и типов столбцов должен точно соответствовать тому, что образует составной тип; отличие возможно в системном столбце <literal>oid</literal>. Кроме того, таблица не должна быть потомком какой-либо другой таблицы. Эти ограничения — залог того, что команда <command>CREATE TABLE OF</command> позволит создать таблицу с таким же определением.

source: This form dissociates a typed table from its type.
ru: Эта форма разрывает связь типизированной таблицы с её типом.

source: This form changes the owner of the table, sequence, view, materialized view, or foreign table to the specified user.
ru: Эта форма меняет владельца таблицы, последовательности, представления, материализованного представления или сторонней таблицы на заданного пользователя.

source: This form changes the information which is written to the write-ahead log to identify rows which are updated or deleted. This option has no effect except when logical replication is in use. <literal>DEFAULT</literal> (the default for non-system tables) records the old values of the columns of the primary key, if any. <literal>USING INDEX</literal> records the old values of the columns covered by the named index, which must be unique, not partial, not deferrable, and include only columns marked <literal>NOT NULL</literal>. <literal>FULL</literal> records the old values of all columns in the row. <literal>NOTHING</literal> records no information about the old row. (This is the default for system tables.) In all cases, no old values are logged unless at least one of the columns that would be logged differs between the old and new versions of the row.
ru: Эта форма меняет информацию, записываемую в журнал упреждающей записи для идентификации изменяемых или удаляемых строк. Данный параметр действует только при использовании логической репликации. В режиме <literal>DEFAULT</literal> (по умолчанию для не системных таблиц) записывается старые значения столбцов первичного ключа, если он есть. В режиме <literal>USING INDEX</literal> записываются старые значения столбцов, составляющих заданный индекс, который должен быть уникальным, не частичным, не отложенным и включать только столбцы, помеченные <literal>NOT NULL</literal>. В режиме <literal>FULL</literal> записываются старые значения всех столбцов в строке, а в режиме <literal>NOTHING</literal> (по умолчанию для системных таблиц) никакая информация о старой строке не записывается. Во всех случаях старые значения записываются в журнал, только если как минимум в одном столбце из тех, что должны быть записаны, произошли изменения в новой строке.

source: The <literal>RENAME</literal> forms change the name of a table (or an index, sequence, view, materialized view, or foreign table), the name of an individual column in a table, or the name of a constraint of the table. There is no effect on the stored data.
ru: Формы <literal>RENAME</literal> меняют имя таблицы (или индекса, последовательности, представления, материализованного представления или сторонней таблицы), имя отдельного столбца таблицы или имя ограничения таблицы. На хранимые данные это не влияет.

source: This form moves the table into another schema. Associated indexes, constraints, and sequences owned by table columns are moved as well.
ru: Эта форма перемещает таблицу в другую схему. Вместе с таблицей перемещаются связанные с ней индексы и ограничения, а также последовательности, принадлежащие столбцам таблицы.

source: <command>ALTER TABLE</command> changes the definition of an existing table. There are several subforms described below. Note that the lock level required may differ for each subform. An <literal>ACCESS EXCLUSIVE</literal> lock is held unless explicitly noted. When multiple subcommands are listed, the lock held will be the strictest one required from any subcommand. <placeholder-1/>
ru: <command>ALTER TABLE</command> меняет определение существующей таблицы. Несколько её разновидностей описаны ниже. Заметьте, что для разных разновидностей могут требоваться разные уровни блокировок. Если явно не отмечено другое, требуется блокировка <literal>ACCESS EXCLUSIVE</literal>. При перечислении нескольких подкоманд будет запрашиваться самая сильная блокировка из требуемых ими. <placeholder-1/>

source: All the actions except <literal>RENAME</literal>, <literal>SET TABLESPACE</literal> and <literal>SET SCHEMA</literal> can be combined into a list of multiple alterations to apply in parallel. For example, it is possible to add several columns and/or alter the type of several columns in a single command. This is particularly useful with large tables, since only one pass over the table need be made.
ru: Все действия, кроме <literal>RENAME</literal>, <literal>SET TABLESPACE</literal> и <literal>SET SCHEMA</literal>, можно объединить в список множественных изменений и применить параллельно. Например, можно добавить несколько столбцов и/или изменить тип столбцов в одной команде. Это особенно полезно для больших таблиц, так как вся таблица обрабатывается за один проход.

source: You must own the table to use <command>ALTER TABLE</command>. To change the schema or tablespace of a table, you must also have <literal>CREATE</literal> privilege on the new schema or tablespace. To add the table as a new child of a parent table, you must own the parent table as well. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the table's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the table. However, a superuser can alter ownership of any table anyway.) To add a column or alter a column type or use the <literal>OF</literal> clause, you must also have <literal>USAGE</literal> privilege on the data type.
ru: Выполнить <command>ALTER TABLE</command> может только владелец соответствующей таблицы. Чтоб сменить схему или табличное пространство таблицы, необходимо также иметь право <literal>CREATE</literal> в новой схеме или табличном пространстве. Чтобы сделать таблицу потомком другой таблицы, нужно быть владельцем и родительской таблицы. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в схеме таблицы. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать таблицу. Однако суперпользователь может сменить владельца таблицы в любом случае.) Чтобы добавить столбец, сменить тип столбца или применить предложение <literal>OF</literal>, необходимо также иметь право <literal>USAGE</literal> для соответствующего типа данных.

source: Parameters
ru: Параметры

source: Do not throw an error if the table does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если таблица не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing table to alter. If <literal>ONLY</literal> is specified before the table name, only that table is altered. If <literal>ONLY</literal> is not specified, the table and all its descendant tables (if any) are altered. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Имя (возможно, дополненное схемой) существующей таблицы, подлежащей изменению. Если перед именем таблицы указано <literal>ONLY</literal>, изменяется только заданная таблица. Без <literal>ONLY</literal> изменяется и заданная таблица, и все её потомки (если таковые есть). После имени таблицы можно также добавить необязательное указание <literal>*</literal>, чтобы явно обозначить, что изменению подлежат все дочерние таблицы.

source: Name of a new or existing column.
ru: Имя нового или существующего столбца.

source: New name for an existing column.
ru: Новое имя существующего столбца.

source: New name for the table.
ru: Новое имя таблицы.

source: Data type of the new column, or new data type for an existing column.
ru: Тип данных нового столбца или новый тип данных существующего столбца.

source: New table constraint for the table.
ru: Новое ограничение таблицы.

source: Name of a new or existing constraint.
ru: Имя нового или существующего ограничения.

source: Automatically drop objects that depend on the dropped column or constraint (for example, views referencing the column).
ru: Автоматически удалять объекты, зависящие от удаляемого столбца или ограничения (например, представления, содержащие этот столбец).

source: Refuse to drop the column or constraint if there are any dependent objects. This is the default behavior.
ru: Отказать в удалении столбца или ограничения, если существуют зависящие от них объекты. Это поведение по умолчанию.

source: Name of a single trigger to disable or enable.
ru: Имя включаемого или отключаемого триггера.

source: Disable or enable all triggers belonging to the table. (This requires superuser privilege if any of the triggers are internally generated constraint triggers such as those that are used to implement foreign key constraints or deferrable uniqueness and exclusion constraints.)
ru: Отключить или включить все триггеры, принадлежащие таблице. (Для этого требуются права суперпользователя, если в числе этих триггеров оказываются сгенерированные внутрисистемные триггеры исключений, например те, что реализуют ограничения внешнего ключа или отложенные ограничения уникальности и исключений.)

source: Disable or enable all triggers belonging to the table except for internally generated constraint triggers such as those that are used to implement foreign key constraints or deferrable uniqueness and exclusion constraints.
ru: Отключить или включить все триггеры, принадлежащие таблице, за исключением сгенерированных внутрисистемных триггеров исключений, например, тех, что реализуют ограничения внешнего ключа или отложенные ограничения уникальности и исключений.

source: The name of an existing index.
ru: Имя существующего индекса.

source: The name of a table storage parameter.
ru: Имя параметра хранения таблицы

source: The new value for a table storage parameter. This might be a number or a word depending on the parameter.
ru: Новое значение параметра хранения таблицы. Это может быть число или строка, в зависимости от параметра.

source: A parent table to associate or de-associate with this table.
ru: Родительская таблица, с которой будет установлена или разорвана связь данной таблицы.

source: The user name of the new owner of the table.
ru: Имя пользователя, назначаемого новым владельцем таблицы.

source: The name of the tablespace to which the table will be moved.
ru: Имя табличного пространства, в которое будет перемещена таблица.

source: The name of the schema to which the table will be moved.
ru: Имя схемы, в которую будет перемещена таблица.

source: The key word <literal>COLUMN</literal> is noise and can be omitted.
ru: Ключевое слово <literal>COLUMN</literal> не несёт смысловой нагрузки и может быть опущено.

source: When a column is added with <literal>ADD COLUMN</literal>, all existing rows in the table are initialized with the column's default value (NULL if no <literal>DEFAULT</literal> clause is specified). If there is no <literal>DEFAULT</literal> clause, this is merely a metadata change and does not require any immediate update of the table's data; the added NULL values are supplied on readout, instead.
ru: Когда столбец добавляется с помощью <literal>ADD COLUMN</literal>, во всех существующих в таблице строках этот столбец инициализируется значением по умолчанию (или NULL, если предложение <literal>DEFAULT</literal> для столбца отсутствует). Если предложение <literal>DEFAULT</literal> отсутствует, это сводится только к изменению метаданных, непосредственного изменения данных таблицы не происходит; добавленные значения NULL выводятся при чтении.

source: Adding a column with a <literal>DEFAULT</literal> clause or changing the type of an existing column will require the entire table and its indexes to be rewritten. As an exception when changing the type of an existing column, if the <literal>USING</literal> clause does not change the column contents and the old type is either binary coercible to the new type or an unconstrained domain over the new type, a table rewrite is not needed; but any indexes on the affected columns must still be rebuilt. Adding or removing a system <literal>oid</literal> column also requires rewriting the entire table. Table and/or index rebuilds may take a significant amount of time for a large table; and will temporarily require as much as double the disk space.
ru: Добавление столбца с предложением <literal>DEFAULT</literal> или изменение типа существующего столбца влечёт за собой перезапись всей таблицы и её индексов. Но возможно исключение при смене типа существующего столбца: если предложение <literal>USING</literal> не меняет содержимое столбца и старый тип двоично приводится к новому или является неограниченным доменом поверх нового типа, перезапись таблицы не требуется; хотя все индексы с затронутыми столбцами всё же требуется перестроить. При добавлении или удалении системного столбца <literal>oid</literal> также необходима перезапись всей таблицы. Для перестроения больших таблиц и/или их индексов может понадобиться довольно много времени и временно потребуется вдвое больше места на диске.

source: Adding a <literal>CHECK</literal> or <literal>NOT NULL</literal> constraint requires scanning the table to verify that existing rows meet the constraint, but does not require a table rewrite.
ru: Добавление ограничений <literal>CHECK</literal> или <literal>NOT NULL</literal> влечёт за собой необходимость просканировать таблицу, чтобы проверить, что все существующие строки удовлетворяют ограничению, но перезаписывать таблицу при этом не требуется.
