Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_sequence.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a sequence generator
ru: изменить определение генератора последовательности

source: name
ru: имя

source: increment
ru: шаг

source: minvalue
ru: мин_значение

source: maxvalue
ru: макс_значение

source: start
ru: начало

source: restart
ru: перезапуск

source: cache
ru: кеш

source: table_name
ru: имя_таблицы

source: column_name
ru: имя_столбца

source: new_owner
ru: новый_владелец

source: new_name
ru: новое_имя

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER SEQUENCE</command> changes the parameters of an existing sequence generator. Any parameters not specifically set in the <command>ALTER SEQUENCE</command> command retain their prior settings.
ru: <command>ALTER SEQUENCE</command> меняет параметры существующего генератора последовательности. Параметры, не определяемые явно в команде <command>ALTER SEQUENCE</command>, сохраняют свои предыдущие значения.

source: You must own the sequence to use <command>ALTER SEQUENCE</command>. To change a sequence's schema, you must also have <literal>CREATE</literal> privilege on the new schema. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the sequence's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the sequence. However, a superuser can alter ownership of any sequence anyway.)
ru: Выполнить <command>ALTER SEQUENCE</command> может только владелец соответствующей последовательности. Чтобы сменить схему последовательности, необходимо также иметь право <literal>CREATE</literal> в новой схеме. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в схеме последовательности. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать последовательность. Однако суперпользователь может сменить владельца последовательности в любом случае.)

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of a sequence to be altered.
ru: Имя (возможно, дополненное схемой) последовательности, подлежащей изменению.

source: Do not throw an error if the sequence does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если последовательность не существует. В этом случае будет выдано замечание.

source: The clause <literal>INCREMENT BY <replaceable class="parameter">increment</replaceable></literal> is optional. A positive value will make an ascending sequence, a negative one a descending sequence. If unspecified, the old increment value will be maintained.
ru: Предложение <literal>INCREMENT BY <replaceable class="parameter">шаг</replaceable></literal> является необязательным. При положительном значении шага генерируется возрастающая последовательность, при отрицательном ­­­— убывающая; если шаг не указан, сохраняется предыдущее значение.

source: The optional clause <literal>MINVALUE <replaceable class="parameter">minvalue</replaceable></literal> determines the minimum value a sequence can generate. If <literal>NO MINVALUE</literal> is specified, the defaults of 1 and -2<superscript>63</superscript>-1 for ascending and descending sequences, respectively, will be used. If neither option is specified, the current minimum value will be maintained.
ru: Необязательное предложение <literal>MINVALUE <replaceable class="parameter">мин_значение</replaceable></literal> определяет минимальное значение, которое будет генерировать данная последовательность. Если указано <literal>NO MINVALUE</literal>, для возрастающей последовательности этим значением будет 1, а для убывающей — -2<superscript>63</superscript>-1. В отсутствие этих указаний будет сохранено текущее минимальное значение.

source: The optional clause <literal>MAXVALUE <replaceable class="parameter">maxvalue</replaceable></literal> determines the maximum value for the sequence. If <literal>NO MAXVALUE</literal> is specified, the defaults are 2<superscript>63</superscript>-1 and -1 for ascending and descending sequences, respectively, will be used. If neither option is specified, the current maximum value will be maintained.
ru: Необязательное предложение <literal>MAXVALUE <replaceable class="parameter">макс_значение</replaceable></literal> определяет максимальное значение, которое будет генерировать данная последовательность. Если указано <literal>NO MAXVALUE</literal>, для возрастающей последовательности этим значением будет 2<superscript>63</superscript>-1, а для убывающей — -1. В отсутствие этих указаний будет сохранено текущее максимальное значение.

source: The optional clause <literal>START WITH <replaceable class="parameter">start</replaceable></literal> changes the recorded start value of the sequence. This has no effect on the <emphasis>current</emphasis> sequence value; it simply sets the value that future <command>ALTER SEQUENCE RESTART</command> commands will use.
ru: Необязательное предложение <literal>START WITH <replaceable class="parameter">начало</replaceable></literal> меняет записанное начальное значение последовательности. При этом <emphasis>текущее</emphasis> значение последовательности не меняется, а только устанавливается значение, которое будет применено будущими командами <command>ALTER SEQUENCE RESTART</command>.

source: The optional clause <literal>RESTART [ WITH <replaceable class="parameter">restart</replaceable> ]</literal> changes the current value of the sequence. This is equivalent to calling the <function>setval</function> function with <literal>is_called</literal> = <literal>false</literal>: the specified value will be returned by the <emphasis>next</emphasis> call of <function>nextval</function>. Writing <literal>RESTART</literal> with no <replaceable class="parameter">restart</replaceable> value is equivalent to supplying the start value that was recorded by <command>CREATE SEQUENCE</command> or last set by <command>ALTER SEQUENCE START WITH</command>.
ru: Необязательное предложение <literal>RESTART [ WITH <replaceable class="parameter">перезапуск</replaceable> ]</literal> меняет текущее значение последовательности. Оно равнозначно вызову функции <function>setval</function> с параметром <literal>is_called</literal> = <literal>false</literal>: указанное значение перезапуска будет возвращено при <emphasis>следующем</emphasis> вызове функции <function>nextval</function>. Отсутствие в <literal>RESTART</literal> значения <replaceable class="parameter">перезапуск</replaceable> равносильно передаче стартового значения, записанного командой <command>CREATE SEQUENCE</command> или последнего установленного командой <command>ALTER SEQUENCE START WITH</command>.

source: The clause <literal>CACHE <replaceable class="parameter">cache</replaceable></literal> enables sequence numbers to be preallocated and stored in memory for faster access. The minimum value is 1 (only one value can be generated at a time, i.e., no cache). If unspecified, the old cache value will be maintained.
ru: Предложение <literal>CACHE <replaceable class="parameter">кеш</replaceable></literal> разрешает предварительно выделять и сохранять в памяти числа последовательности для ускорения доступа к ним. Минимальное значение равно 1 (т. е. за один раз генерируется только одно значение, кеширования нет). Если это предложение отсутствует, сохраняется старое значение размера кеша.

source: The optional <literal>CYCLE</literal> key word can be used to enable the sequence to wrap around when the <replaceable class="parameter">maxvalue</replaceable> or <replaceable class="parameter">minvalue</replaceable> has been reached by an ascending or descending sequence respectively. If the limit is reached, the next number generated will be the <replaceable class="parameter">minvalue</replaceable> or <replaceable class="parameter">maxvalue</replaceable>, respectively.
ru: Необязательное ключевое слово <literal>CYCLE</literal> позволяет зациклить последовательность при достижении <replaceable class="parameter">макс_значения</replaceable> или <replaceable class="parameter">мин_значения</replaceable> для возрастающей и убывающей последовательности, соответственно. Когда этот предел достигается, следующим числом этих последовательностей будет соответственно <replaceable class="parameter">мин_значение</replaceable> или <replaceable class="parameter">макс_значение</replaceable>.

source: If the optional <literal>NO CYCLE</literal> key word is specified, any calls to <function>nextval</function> after the sequence has reached its maximum value will return an error. If neither <literal>CYCLE</literal> or <literal>NO CYCLE</literal> are specified, the old cycle behavior will be maintained.
ru: Если добавляется необязательное указание <literal>NO CYCLE</literal>, при каждом вызове <function>nextval</function> после достижения предельного значения будет возникать ошибка. Если же указания <literal>CYCLE</literal> и <literal>NO CYCLE</literal> отсутствуют, сохраняется предыдущее поведение зацикливания.

source: <literal>OWNED BY</literal> <replaceable class="parameter">table_name</replaceable>.<replaceable class="parameter">column_name</replaceable>
ru: <literal>OWNED BY</literal> <replaceable class="parameter">имя_таблицы</replaceable>.<replaceable class="parameter">имя_столбца</replaceable>

source: The <literal>OWNED BY</literal> option causes the sequence to be associated with a specific table column, such that if that column (or its whole table) is dropped, the sequence will be automatically dropped as well. If specified, this association replaces any previously specified association for the sequence. The specified table must have the same owner and be in the same schema as the sequence. Specifying <literal>OWNED BY NONE</literal> removes any existing association, making the sequence <quote>free-standing</quote>.
ru: Указание <literal>OWNED BY</literal> связывает последовательность с определённым столбцом таблицы, с тем чтобы при удалении этого столбца (или всей таблицы) автоматически удалилась и последовательность. Это указание заменяет любую ранее установленную связь данной последовательности. Целевая таблица должна иметь того же владельца и находиться в той же схеме, что и последовательность. Указание <literal>OWNED BY NONE</literal> убирает все существующие связи, обозначая последовательность <quote>независимой</quote>.

source: The user name of the new owner of the sequence.
ru: Имя пользователя, назначаемого новым владельцем последовательности.

source: The new name for the sequence.
ru: Новое имя последовательности.

source: The new schema for the sequence.
ru: Новая схема последовательности.

source: Notes
ru: Замечания

source: To avoid blocking of concurrent transactions that obtain numbers from the same sequence, <command>ALTER SEQUENCE</command>'s effects on the sequence generation parameters are never rolled back; those changes take effect immediately and are not reversible. However, the <literal>OWNED BY</literal>, <literal>OWNER TO</literal>, <literal>RENAME TO</literal>, and <literal>SET SCHEMA</literal> clauses cause ordinary catalog updates that can be rolled back.
ru: Во избежание блокировки параллельных транзакций, получающих числа из одной последовательности, воздействие <command>ALTER SEQUENCE</command> на параметры генерирования последовательности никогда не отменяется, эти изменения необратимы и вступают в силу немедленно. Однако предложения <literal>OWNED BY</literal>, <literal>OWNER TO</literal>, <literal>RENAME TO</literal> и <literal>SET SCHEMA</literal> приводят к обычным изменениям каталога и могут быть отменены как часть транзакции.

source: <command>ALTER SEQUENCE</command> will not immediately affect <function>nextval</function> results in backends, other than the current one, that have preallocated (cached) sequence values. They will use up all cached values prior to noticing the changed sequence generation parameters. The current backend will be affected immediately.
ru: <command>ALTER SEQUENCE</command> не оказывает немедленного влияния на результаты <function>nextval</function> в серверных процессах, кроме текущего, которые могли предварительно сгенерировать (кешировать) значения последовательности. Эти процессы заметят изменения только после того, как будут израсходованы все кешированные значения. Текущий серверный процесс реагирует на изменения сразу.

source: <command>ALTER SEQUENCE</command> does not affect the <function>currval</function> status for the sequence. (Before <productname>PostgreSQL</productname> 8.3, it sometimes did.)
ru: <command>ALTER SEQUENCE</command> не влияет на значение <function>currval</function> последовательности. (В <productname>PostgreSQL</productname> до версии 8.3 это могло происходить.)

source: For historical reasons, <command>ALTER TABLE</command> can be used with sequences too; but the only variants of <command>ALTER TABLE</command> that are allowed with sequences are equivalent to the forms shown above.
ru: По историческим причинам <command>ALTER TABLE</command> тоже может работать с последовательностями, но все разновидности <command>ALTER TABLE</command>, допустимые для управления последовательностями, равнозначны вышеперечисленным формам.

source: Examples
ru: Примеры

source: Restart a sequence called <literal>serial</literal>, at 105: <placeholder-1/>
ru: Перезапуск последовательности <literal>serial</literal> с числа 105: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER SEQUENCE</command> conforms to the <acronym>SQL</acronym> standard, except for the <literal>START WITH</literal>, <literal>OWNED BY</literal>, <literal>OWNER TO</literal>, <literal>RENAME TO</literal>, and <literal>SET SCHEMA</literal> clauses, which are <productname>PostgreSQL</productname> extensions.
ru: Оператор <command>ALTER SEQUENCE</command> соответствует стандарту <acronym>SQL</acronym>, за исключением предложений <literal>START WITH</literal>, <literal>OWNED BY</literal>, <literal>OWNER TO</literal>, <literal>RENAME TO</literal> и <literal>SET SCHEMA</literal>, являющихся расширениями <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
