Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_domain.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a domain
ru: изменить определение домена

source: name
ru: имя

source: expression
ru: выражение

source: domain_constraint
ru: ограничение_домена

source: constraint_name
ru: имя_ограничения

source: new_constraint_name
ru: имя_нового_ограничения

source: new_owner
ru: новый_владелец

source: new_name
ru: новое_имя

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER DOMAIN</command> changes the definition of an existing domain. There are several sub-forms:
ru: <command>ALTER DOMAIN</command> изменяет определение существующего домена. Эта команда имеет несколько разновидностей:

source: These forms set or remove the default value for a domain. Note that defaults only apply to subsequent <command>INSERT</command> commands; they do not affect rows already in a table using the domain.
ru: Эти формы задают/убирают значение по умолчанию для домена. Заметьте, что эти значения по умолчанию применяются только при последующих командах <command>INSERT</command>; они не меняются в строках с данным доменом, уже добавленных в таблицу.

source: These forms change whether a domain is marked to allow NULL values or to reject NULL values. You can only <literal>SET NOT NULL</literal> when the columns using the domain contain no null values.
ru: Эти формы определяют, будет ли домен принимать значения NULL или нет. <literal>SET NOT NULL</literal> можно выполнить, только если столбцы с этим доменом ещё не содержат значений NULL.

source: ADD <replaceable class="parameter">domain_constraint</replaceable> [ NOT VALID ]
ru: ADD <replaceable class="parameter">ограничение_домена</replaceable> [ NOT VALID ]

source: This form adds a new constraint to a domain using the same syntax as <xref linkend="sql-createdomain"/>. When a new constraint is added to a domain, all columns using that domain will be checked against the newly added constraint. These checks can be suppressed by adding the new constraint using the <literal>NOT VALID</literal> option; the constraint can later be made valid using <command>ALTER DOMAIN ... VALIDATE CONSTRAINT</command>. Newly inserted or updated rows are always checked against all constraints, even those marked <literal>NOT VALID</literal>. <literal>NOT VALID</literal> is only accepted for <literal>CHECK</literal> constraints.
ru: Эта форма добавляет новое ограничение для домена с тем же синтаксисом, что описан в <xref remap="6" linkend="sql-createdomain"/>. Когда добавляется новое ограничение домена, все столбцы с этим доменом будут проверены на соответствие этому ограничению. Эти проверки можно подавить, добавив указание <literal>NOT VALID</literal>, а затем активировать позднее с помощью команды <command>ALTER DOMAIN ... VALIDATE CONSTRAINT</command>. Вновь вставленные или изменённые строки всегда проверяются по всем ограничениям, даже тем, что отмечены как <literal>NOT VALID</literal>. Указание <literal>NOT VALID</literal> допускается только для ограничений <literal>CHECK</literal>.

source: This form drops constraints on a domain. If <literal>IF EXISTS</literal> is specified and the constraint does not exist, no error is thrown. In this case a notice is issued instead.
ru: Эта форма убирает ограничения домена. Если указано <literal>IF EXISTS</literal> и заданное ограничение не существует, это не считается ошибкой. В этом случае выдаётся только замечание.

source: This form changes the name of a constraint on a domain.
ru: Эта форма меняет название ограничения домена.

source: This form validates a constraint previously added as <literal>NOT VALID</literal>, that is, verify that all data in columns using the domain satisfy the specified constraint.
ru: Эта форма включает проверку ограничения, ранее добавленного как <literal>NOT VALID</literal>, то есть, проверяет все данные в столбцах с этим доменом на соответствие этому ограничению.

source: This form changes the owner of the domain to the specified user.
ru: Эта форма меняет владельца домена на заданного пользователя.

source: This form changes the name of the domain.
ru: Эта форма меняет название домена.

source: This form changes the schema of the domain. Any constraints associated with the domain are moved into the new schema as well.
ru: Эта форма меняет схему домена. Все ограничения, связанные с данным доменом, так же переносятся в новую схему.

source: You must own the domain to use <command>ALTER DOMAIN</command>. To change the schema of a domain, you must also have <literal>CREATE</literal> privilege on the new schema. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the domain's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the domain. However, a superuser can alter ownership of any domain anyway.)
ru: Выполнить <command>ALTER DOMAIN</command> может только владелец соответствующего домена. Чтобы сменить схему домена, необходимо также иметь право <literal>CREATE</literal> в новой схеме. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в схеме домена. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать домен. Однако суперпользователь может сменить владельца домена в любом случае.)

source: Parameters
ru: Параметры

source: The name (possibly schema-qualified) of an existing domain to alter.
ru: Имя (возможно, дополненное схемой) существующего домена, подлежащего изменению.

source: New domain constraint for the domain.
ru: Новое ограничение домена.

source: Name of an existing constraint to drop or rename.
ru: Имя существующего ограничения, подлежащего удалению или переименованию.

source: Do not verify existing column data for constraint validity.
ru: Не проверять существующие данные в столбцах на соответствие ограничению.

source: Automatically drop objects that depend on the constraint.
ru: Автоматически удалять объекты, зависящие от данного ограничения.

source: Refuse to drop the constraint if there are any dependent objects. This is the default behavior.
ru: Отказать в удалении ограничения, если существуют зависящие от него объекты. Это поведение по умолчанию.

source: The new name for the domain.
ru: Новое имя домена.

source: The new name for the constraint.
ru: Новое имя ограничения.

source: The user name of the new owner of the domain.
ru: Имя пользователя, назначаемого новым владельцем домена.

source: The new schema for the domain.
ru: Новая схема домена.

source: Notes
ru: Замечания

source: Currently, <command>ALTER DOMAIN ADD CONSTRAINT</command>, <command>ALTER DOMAIN VALIDATE CONSTRAINT</command>, and <command>ALTER DOMAIN SET NOT NULL</command> will fail if the validated named domain or any derived domain is used within a composite-type column of any table in the database. They should eventually be improved to be able to verify the new constraint for such nested columns.
ru: В настоящее время команды <command>ALTER DOMAIN ADD CONSTRAINT</command>, <command>ALTER DOMAIN VALIDATE CONSTRAINT</command> и <command>ALTER DOMAIN SET NOT NULL</command> выдают ошибку, если проверяемый указанный домен или производный от него используется в столбце составного типа в любой таблице БД. В дальнейшем они будут доработаны, с тем чтобы новое ограничение проверялось и при такой вложенности.

source: Examples
ru: Примеры

source: To add a <literal>NOT NULL</literal> constraint to a domain: <placeholder-1/> To remove a <literal>NOT NULL</literal> constraint from a domain: <placeholder-2/>
ru: Добавление ограничения <literal>NOT NULL</literal> к домену: <placeholder-1/> Удаление ограничения <literal>NOT NULL</literal> из домена: <placeholder-2/>

source: To add a check constraint to a domain: <placeholder-1/>
ru: Добавление ограничения-проверки к домену: <placeholder-1/>

source: To remove a check constraint from a domain: <placeholder-1/>
ru: Удаление ограничения-проверки из домена: <placeholder-1/>

source: To rename a check constraint on a domain: <placeholder-1/>
ru: Переименование ограничения-проверки в домене: <placeholder-1/>

source: To move the domain into a different schema: <placeholder-1/>
ru: Перемещение домена в другую схему: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER DOMAIN</command> conforms to the <acronym>SQL</acronym> standard, except for the <literal>OWNER</literal>, <literal>RENAME</literal>, <literal>SET SCHEMA</literal>, and <literal>VALIDATE CONSTRAINT</literal> variants, which are <productname>PostgreSQL</productname> extensions. The <literal>NOT VALID</literal> clause of the <literal>ADD CONSTRAINT</literal> variant is also a <productname>PostgreSQL</productname> extension.
ru: <command>ALTER DOMAIN</command> соответствует стандарту <acronym>SQL</acronym>, за исключением подвидов <literal>OWNER</literal>, <literal>RENAME</literal>, <literal>SET SCHEMA</literal> и <literal>VALIDATE CONSTRAINT</literal>, которые являются расширениями <productname>PostgreSQL</productname>. Предложение <literal>NOT VALID</literal> вариации <literal>ADD CONSTRAINT</literal> также является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
