Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_type.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a type
ru: изменить определение типа

source: name
ru: имя

source: action
ru: действие

source: new_owner
ru: новый_владелец

source: attribute_name
ru: имя_атрибута

source: new_attribute_name
ru: новое_имя_атрибута

source: new_name
ru: новое_имя

source: new_schema
ru: новая_схема

source: new_enum_value
ru: новое_значение_перечисления

source: existing_enum_value
ru: существующее_значение_перечисления

source: where <placeholder-1/> is one of:
ru: Где возможные варианты <placeholder-1/>:

source: data_type
ru: тип_данных

source: collation
ru: правило_сортировки

source: Description
ru: Описание

source: This form adds a new attribute to a composite type, using the same syntax as <xref linkend="sql-createtype"/>.
ru: Эта форма добавляет в составной тип новый атрибут с тем же синтаксисом, что и <xref linkend="sql-createtype"/>.

source: This form drops an attribute from a composite type. If <literal>IF EXISTS</literal> is specified and the attribute does not exist, no error is thrown. In this case a notice is issued instead.
ru: Эта форма удаляет атрибут из составного типа. Если указано <literal>IF EXISTS</literal> и атрибут не существует, это не считается ошибкой. В этом случае выдаётся только замечание.

source: This form changes the type of an attribute of a composite type.
ru: Эта форма меняет тип атрибута составного типа.

source: This form changes the owner of the type.
ru: Эта форма меняет владельца типа.

source: This form changes the name of the type or the name of an individual attribute of a composite type.
ru: Эта форма меняет имя типа или имя отдельного атрибута составного типа.

source: This form moves the type into another schema.
ru: Эта форма переносит тип в другую схему.

source: This form adds a new value to an enum type. The new value's place in the enum's ordering can be specified as being <literal>BEFORE</literal> or <literal>AFTER</literal> one of the existing values. Otherwise, the new item is added at the end of the list of values.
ru: Эта форма добавляет новое значение в тип-перечисление. Порядок нового значения в перечислении можно указать, добавив <literal>BEFORE</literal> (перед) или <literal>AFTER</literal> (после) с одним из существующих значений. Если такое указание отсутствует, новый элемент добавляется в конец списка значений.

source: If <literal>IF NOT EXISTS</literal> is specified, it is not an error if the type already contains the new value: a notice is issued but no other action is taken. Otherwise, an error will occur if the new value is already present.
ru: С указанием <literal>IF NOT EXISTS</literal>, если тип уже содержит новое значение, ошибки не произойдёт: будет выдано замечание и ничего больше. Без этого указания, если такое значение уже представлено, возникнет ошибка.

source: Automatically propagate the operation to typed tables of the type being altered, and their descendants.
ru: Автоматически распространять действие операции на типизированные таблицы, имеющий данный тип, и их потомки.

source: Refuse the operation if the type being altered is the type of a typed table. This is the default.
ru: Отказать в выполнении операции, если изменяемый тип является типом типизированной таблицы. Это поведение по умолчанию.

source: <command>ALTER TYPE</command> changes the definition of an existing type. There are several subforms: <placeholder-1/>
ru: <command>ALTER TYPE</command> изменяет определение существующего типа. Эта команда имеет несколько разновидностей: <placeholder-1/>

source: The <literal>ADD ATTRIBUTE</literal>, <literal>DROP ATTRIBUTE</literal>, and <literal>ALTER ATTRIBUTE</literal> actions can be combined into a list of multiple alterations to apply in parallel. For example, it is possible to add several attributes and/or alter the type of several attributes in a single command.
ru: Операции <literal>ADD ATTRIBUTE</literal>, <literal>DROP ATTRIBUTE</literal> и <literal>ALTER ATTRIBUTE</literal> можно объединить в один список множественных изменений для параллельного выполнения. Например, в одной команде можно добавить сразу несколько атрибутов и/или изменить тип нескольких атрибутов.

source: You must own the type to use <command>ALTER TYPE</command>. To change the schema of a type, you must also have <literal>CREATE</literal> privilege on the new schema. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the type's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the type. However, a superuser can alter ownership of any type anyway.) To add an attribute or alter an attribute type, you must also have <literal>USAGE</literal> privilege on the data type.
ru: Выполнить <command>ALTER TYPE</command> может только владелец соответствующего типа. Чтобы сменить схему типа, необходимо также иметь право <literal>CREATE</literal> в новой схеме. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в схеме типа. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать тип. Однако суперпользователь может сменить владельца типа в любом случае.) Чтобы добавить атрибут или изменить тип атрибута, также требуется иметь право <literal>USAGE</literal> для соответствующего типа данных.

source: Parameters
ru: Параметры

source: The name (possibly schema-qualified) of an existing type to alter.
ru: Имя (возможно, дополненное схемой) существующего типа, подлежащего изменению.

source: The new name for the type.
ru: Новое имя типа.

source: The user name of the new owner of the type.
ru: Имя пользователя, назначаемого новым владельцем типа.

source: The new schema for the type.
ru: Новая схема типа.

source: The name of the attribute to add, alter, or drop.
ru: Имя атрибута, подлежащего добавлению, изменению или удалению.

source: The new name of the attribute to be renamed.
ru: Новое имя атрибута

source: The data type of the attribute to add, or the new type of the attribute to alter.
ru: Тип данных добавляемого атрибута, либо новый тип данных изменяемого атрибута.

source: The new value to be added to an enum type's list of values. Like all enum literals, it needs to be quoted.
ru: Новое значение добавляется в список значений перечисления. Как и все элементы перечисления, оно должно заключаться в кавычки.

source: The existing enum value that the new value should be added immediately before or after in the enum type's sort ordering. Like all enum literals, it needs to be quoted.
ru: Существующие значение в перечислении, непосредственно перед или после которого по порядку перечисления будет добавлено новое значение. Как и все элементы перечисления, оно должно заключаться в кавычки.

source: Notes
ru: Замечания

source: <command>ALTER TYPE ... ADD VALUE</command> (the form that adds a new value to an enum type) cannot be executed inside a transaction block.
ru: <command>ALTER TYPE ... ADD VALUE</command> (форму, добавляющую в тип-перечисление новое значение) нельзя выполнять внутри блока транзакции.

source: Comparisons involving an added enum value will sometimes be slower than comparisons involving only original members of the enum type. This will usually only occur if <literal>BEFORE</literal> or <literal>AFTER</literal> is used to set the new value's sort position somewhere other than at the end of the list. However, sometimes it will happen even though the new value is added at the end (this occurs if the OID counter <quote>wrapped around</quote> since the original creation of the enum type). The slowdown is usually insignificant; but if it matters, optimal performance can be regained by dropping and recreating the enum type, or by dumping and reloading the database.
ru: Сравнения с добавленными значениями перечисления иногда бывают медленнее сравнений, в которых задействуются только начальные члены типа-перечисления. Обычно это происходит, только если <literal>BEFORE</literal> или <literal>AFTER</literal> устанавливает порядок нового элемента не в конце списка. Однако, иногда это наблюдается даже тогда, когда новое значение добавляется в конец списка (это происходит, если счётчик OID <quote>прокручивается</quote> с момента изначального создания типа-перечисления). Это замедление обычно несущественное, но если это важно, вернуть максимальную производительность можно, удалив и создав заново это перечисление, либо выгрузив копию базы данных и загрузив её вновь.

source: Examples
ru: Примеры

source: To rename a data type: <placeholder-1/>
ru: Переименование типа данных: <placeholder-1/>

source: To change the owner of the type <literal>email</literal> to <literal>joe</literal>: <placeholder-1/>
ru: Смена владельца типа <literal>email</literal> на <literal>joe</literal>: <placeholder-1/>

source: To change the schema of the type <literal>email</literal> to <literal>customers</literal>: <placeholder-1/>
ru: Смена схемы типа <literal>email</literal> на <literal>customers</literal>: <placeholder-1/>

source: To add a new attribute to a type: <placeholder-1/>
ru: Добавление в тип нового атрибута: <placeholder-1/>

source: To add a new value to an enum type in a particular sort position: <placeholder-1/>
ru: Добавление нового значения в тип-перечисление, в определённое положение по порядку: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The variants to add and drop attributes are part of the SQL standard; the other variants are PostgreSQL extensions.
ru: Формы команды, предназначенные для добавления и удаления атрибутов, являются частью стандарта SQL; другие формы относятся к расширениям PostgreSQL.

source: See Also
ru: См. также
