Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_table.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a table
ru: изменить определение таблицы

source: action
ru: действие

source: new_column_name
ru: новое_имя_столбца

source: new_constraint_name
ru: имя_нового_ограничения

source: new_name
ru: новое_имя

source: new_schema
ru: новая_схема

source: new_tablespace
ru: новое_табл_пространство

source: where <placeholder-1/> is one of:
ru: Где возможные варианты <placeholder-1/>:

source: collation
ru: правило_сортировки

source: column_constraint
ru: ограничение_столбца

source: expression
ru: выражение

source: attribute_option
ru: атрибут

source: table_constraint
ru: ограничение_таблицы

source: table_constraint_using_index
ru: ограничение_таблицы_по_индексу

source: rewrite_rule_name
ru: имя_правила_перезаписи

source: index_name
ru: имя_индекса

source: storage_parameter
ru: параметр_хранения

source: parent_table
ru: таблица_родитель

source: new_owner
ru: новый_владелец

source: and <placeholder-1/> is:
ru: и <placeholder-1/>:

source: Description
ru: Описание

source: This form drops a column from a table. Indexes and table constraints involving the column will be automatically dropped as well. You will need to say <literal>CASCADE</literal> if anything outside the table depends on the column, for example, foreign key references or views. If <literal>IF EXISTS</literal> is specified and the column does not exist, no error is thrown. In this case a notice is issued instead.
ru: Эта форма удаляет столбец из таблицы. При этом автоматически будут удалены индексы и ограничения таблицы, связанные с этим столбцом. Если от этого столбца зависят какие-либо объекты вне этой таблицы, например, внешние ключи или представления, удалить и их можно, добавив указание <literal>CASCADE</literal>. Если в команде указано <literal>IF EXISTS</literal> и этот столбец не существует, это не считается ошибкой, вместо этого просто выдаётся замечание.

source: This form changes the type of a column of a table. Indexes and simple table constraints involving the column will be automatically converted to use the new column type by reparsing the originally supplied expression. The optional <literal>COLLATE</literal> clause specifies a collation for the new column; if omitted, the collation is the default for the new column type. The optional <literal>USING</literal> clause specifies how to compute the new column value from the old; if omitted, the default conversion is the same as an assignment cast from old data type to new. A <literal>USING</literal> clause must be provided if there is no implicit or assignment cast from old to new type.
ru: Эта форма меняет тип столбца таблицы. Индексы и простые табличные ограничения, включающие этот столбец, будут автоматически преобразованы для использования нового типа столбца, для чего будет заново разобрано определяющее их выражение. Необязательное предложение <literal>COLLATE</literal> задаёт правило сортировки для нового столбца; если оно опущено, выбирается правило сортировки по умолчанию для нового типа. Необязательное предложение <literal>USING</literal> определяет, как новое значение столбца будет получено из старого; если оно отсутствует, выполняется приведение типа по умолчанию, как обычное присваивание значения старого типа новому. Предложение <literal>USING</literal> становится обязательным, если неявное приведение или присваивание с приведением старого типа к новому не определено.

source: These forms set or remove the default value for a column. Default values only apply in subsequent <command>INSERT</command> or <command>UPDATE</command> commands; they do not cause rows already in the table to change.
ru: Эти формы задают или удаляют значение по умолчанию для столбцов. Значения по умолчанию применяются только при последующих командах <command>INSERT</command> или <command>UPDATE</command>; их изменения не отражаются в строках, уже существующих в таблице.

source: These forms change whether a column is marked to allow null values or to reject null values. You can only use <literal>SET NOT NULL</literal> when the column contains no null values.
ru: Эти формы определяют, будет ли столбец принимать значения NULL или нет. Задать <literal>SET NOT NULL</literal> можно, только если столбец не содержит значений NULL.

source: This form sets the per-column statistics-gathering target for subsequent <xref linkend="sql-analyze"/> operations. The target can be set in the range 0 to 10000; alternatively, set it to -1 to revert to using the system default statistics target (<xref linkend="guc-default-statistics-target"/>). For more information on the use of statistics by the <productname>PostgreSQL</productname> query planner, refer to <xref linkend="planner-stats"/>.
ru: Эта форма задаёт ориентир сбора статистики по столбцу для последующих операций <xref linkend="sql-analyze"/>. Диапазон допустимых значений ориентира: 0..10000; при -1 применяется системное значение по умолчанию (<xref linkend="guc-default-statistics-target"/>). За дополнительными сведениями об использовании статистики планировщиком запросов <productname>PostgreSQL</productname> обратитесь к <xref remap="3" linkend="planner-stats"/>.

source: <literal>SET STATISTICS</literal> acquires a <literal>SHARE UPDATE EXCLUSIVE</literal> lock.
ru: <literal>SET STATISTICS</literal> запрашивает блокировку <literal>SHARE UPDATE EXCLUSIVE</literal>.

source: This form sets or resets per-attribute options. Currently, the only defined per-attribute options are <literal>n_distinct</literal> and <literal>n_distinct_inherited</literal>, which override the number-of-distinct-values estimates made by subsequent <xref linkend="sql-analyze"/> operations. <literal>n_distinct</literal> affects the statistics for the table itself, while <literal>n_distinct_inherited</literal> affects the statistics gathered for the table plus its inheritance children. When set to a positive value, <command>ANALYZE</command> will assume that the column contains exactly the specified number of distinct nonnull values. When set to a negative value, which must be greater than or equal to -1, <command>ANALYZE</command> will assume that the number of distinct nonnull values in the column is linear in the size of the table; the exact count is to be computed by multiplying the estimated table size by the absolute value of the given number. For example, a value of -1 implies that all values in the column are distinct, while a value of -0.5 implies that each value appears twice on the average. This can be useful when the size of the table changes over time, since the multiplication by the number of rows in the table is not performed until query planning time. Specify a value of 0 to revert to estimating the number of distinct values normally. For more information on the use of statistics by the <productname>PostgreSQL</productname> query planner, refer to <xref linkend="planner-stats"/>.
ru: Эта форма устанавливает или сбрасывает параметры атрибутов. В настоящее время единственными параметрами атрибутов являются <literal>n_distinct</literal> и <literal>n_distinct_inherited</literal>, которые переопределяют оценку кол-ва_различных_значений, производимую последующими операциями <xref linkend="sql-analyze"/>. Атрибут <literal>n_distinct</literal> влияет на расчёт статистики по самой таблице, а <literal>n_distinct_inherited</literal> — на статистику по таблице и её потомкам. Если заданное значение положительно, <command>ANALYZE</command> будет считать, что столбец содержит именно это количество различных значений не NULL. Если заданное значение отрицательно (оно должно быть больше или равно -1), <command>ANALYZE</command> будет считать, что количество различных значений не NULL в столбце линейно зависит от размера таблицы; точное число будет получено умножением примерного размера таблицы на абсолютное значение параметра. Например, при -1 будет предполагаться, что различны все значения в столбце, а при -0,5 — что в среднем каждое значение повторяется дважды. Это может быть полезно, когда размер таблицы меняется со временем, так как умножение на число строк в таблице производится только во время планирования запроса. С 0 количество различных значений оценивается как обычно. За дополнительными сведениями об использовании статистики планировщиком запросов <productname>PostgreSQL</productname> обратитесь к <xref remap="3" linkend="planner-stats"/>.

source: Changing per-attribute options acquires a <literal>SHARE UPDATE EXCLUSIVE</literal> lock.
ru: Для изменения параметров атрибутов запрашивается блокировка <literal>SHARE UPDATE EXCLUSIVE</literal>.

source: <primary>TOAST</primary><secondary>per-column storage settings</secondary>
ru: <primary>TOAST</primary><secondary>режимы хранения столбцов</secondary>

source: This form sets the storage mode for a column. This controls whether this column is held inline or in a secondary <acronym>TOAST</acronym> table, and whether the data should be compressed or not. <literal>PLAIN</literal> must be used for fixed-length values such as <type>integer</type> and is inline, uncompressed. <literal>MAIN</literal> is for inline, compressible data. <literal>EXTERNAL</literal> is for external, uncompressed data, and <literal>EXTENDED</literal> is for external, compressed data. <literal>EXTENDED</literal> is the default for most data types that support non-<literal>PLAIN</literal> storage. Use of <literal>EXTERNAL</literal> will make substring operations on very large <type>text</type> and <type>bytea</type> values run faster, at the penalty of increased storage space. Note that <literal>SET STORAGE</literal> doesn't itself change anything in the table, it just sets the strategy to be pursued during future table updates. See <xref linkend="storage-toast"/> for more information.
ru: Эта форма устанавливает режим хранения столбца. Она определяет, хранятся ли данные внутри таблицы или в отдельной таблице <acronym>TOAST</acronym>, а также, сжимаются ли они. Режим <literal>PLAIN</literal> должен применяться для значений фиксированной длины, таких как <type>integer</type>; это вариант хранения внутри, без сжатия. Режим <literal>MAIN</literal> применяется для хранения внутри, но сжатых данных, <literal>EXTERNAL</literal> — для внешнего хранения несжатых данных, а <literal>EXTENDED</literal> — для внешнего хранения сжатых данных. <literal>EXTENDED</literal> используется по умолчанию для большинства типов данных, поддерживающих хранилище не <literal>PLAIN</literal>. Применение <literal>EXTERNAL</literal> позволяет ускорить операции с подстроками на очень больших значениях <type>text</type> и <type>bytea</type>, за счёт проигрыша в объёме хранилища. Заметьте, что предложение <literal>SET STORAGE</literal> само по себе не меняет ничего в таблице, оно только задаёт стратегию, которая будет реализована при будущих изменениях в таблице. За дополнительными сведениями обратитесь к <xref remap="3" linkend="storage-toast"/>.

source: This form adds a new constraint to a table using the same syntax as <xref linkend="sql-createtable"/>, plus the option <literal>NOT VALID</literal>, which is currently only allowed for foreign key and CHECK constraints. If the constraint is marked <literal>NOT VALID</literal>, the potentially-lengthy initial check to verify that all rows in the table satisfy the constraint is skipped. The constraint will still be enforced against subsequent inserts or updates (that is, they'll fail unless there is a matching row in the referenced table, in the case of foreign keys; and they'll fail unless the new row matches the specified check constraints). But the database will not assume that the constraint holds for all rows in the table, until it is validated by using the <literal>VALIDATE CONSTRAINT</literal> option.
ru: Эта форма добавляет в таблицу новое ограничение, с тем же синтаксисом, что и <xref linkend="sql-createtable"/>, и дополнительным указанием <literal>NOT VALID</literal>, которое в настоящее время разрешено только для ограничений внешнего ключа и ограничений-проверок. Если ограничение помечено как <literal>NOT VALID</literal>, потенциально длительная начальная проверка того, что ему удовлетворяют все строки, пропускается. Тем не менее это ограничение будет действовать при последующих добавлениях или изменениях (то есть, эти операции не будут выполнены, если, в случае с внешним ключом, в главной таблице не найдётся соответствующая строка, либо, в случае с ограничением-проверкой, новая строка нарушит проверочное условие). Но база данных не будет считать, что ограничение выполняется для всех строк таблицы, пока оно не будет проверено с применением указания <literal>VALIDATE CONSTRAINT</literal>.

source: This form adds a new <literal>PRIMARY KEY</literal> or <literal>UNIQUE</literal> constraint to a table based on an existing unique index. All the columns of the index will be included in the constraint.
ru: Эта форма добавляет в таблицу новое ограничение <literal>PRIMARY KEY</literal> или <literal>UNIQUE</literal> на базе существующего уникального индекса. В это ограничение будут включены все столбцы данного индекса.

source: The index cannot have expression columns nor be a partial index. Also, it must be a b-tree index with default sort ordering. These restrictions ensure that the index is equivalent to one that would be built by a regular <literal>ADD PRIMARY KEY</literal> or <literal>ADD UNIQUE</literal> command.
ru: Индекс не может быть частичным и включать столбцы-выражения. Кроме того, это должен быть индекс-B-дерево с порядком сортировки по умолчанию. С такими ограничениями добавляемые индексы не будут ничем отличаться от индексов, создаваемых обычными командами <literal>ADD PRIMARY KEY</literal> и <literal>ADD UNIQUE</literal>.

source: If <literal>PRIMARY KEY</literal> is specified, and the index's columns are not already marked <literal>NOT NULL</literal>, then this command will attempt to do <literal>ALTER COLUMN SET NOT NULL</literal> against each such column. That requires a full table scan to verify the column(s) contain no nulls. In all other cases, this is a fast operation.
ru: В случае с указанием <literal>PRIMARY KEY</literal>, если столбцы индекса ещё не помечены <literal>NOT NULL</literal>, данная команда попытается выполнить <literal>ALTER COLUMN SET NOT NULL</literal> для каждого столбца. При этом потребуется произвести полное сканирование таблицы, чтобы убедиться, что столбец(ы) не содержит NULL. Во всех остальных случаях это быстрая операция.

source: If a constraint name is provided then the index will be renamed to match the constraint name. Otherwise the constraint will be named the same as the index.
ru: Если задано имя ограничения, индекс будет переименован и получит заданное имя. В противном случае, именем ограничения станет имя индекса.

source: After this command is executed, the index is <quote>owned</quote> by the constraint, in the same way as if the index had been built by a regular <literal>ADD PRIMARY KEY</literal> or <literal>ADD UNIQUE</literal> command. In particular, dropping the constraint will make the index disappear too.
ru: После выполнения этой команды индекс становится <quote>принадлежащим</quote> ограничению, так же, как если бы он был создан обычной командой <literal>ADD PRIMARY KEY</literal> или <literal>ADD UNIQUE</literal>. Это значит, в частности, что при удалении ограничения индекс будет удалён вместе с ним.

source: Adding a constraint using an existing index can be helpful in situations where a new constraint needs to be added without blocking table updates for a long time. To do that, create the index using <command>CREATE INDEX CONCURRENTLY</command>, and then install it as an official constraint using this syntax. See the example below.
ru: Добавление ограничения на базе существующего индекса бывает полезно в ситуациях, когда новое ограничение требуется добавить, не блокируя изменения в таблице на долгое время. Для этого можно создать индекс командой <command>CREATE INDEX CONCURRENTLY</command>, а затем задействовать его как полноценное ограничение, используя эту запись. См. следующий пример.

source: This form alters the attributes of a constraint that was previously created. Currently only foreign key constraints may be altered.
ru: Эта форма меняет атрибуты созданного ранее ограничения. В настоящее время изменять можно только ограничения внешнего ключа.

source: This form validates a foreign key or check constraint that was previously created as <literal>NOT VALID</literal>, by scanning the table to ensure there are no rows for which the constraint is not satisfied. Nothing happens if the constraint is already marked valid.
ru: Эта форма проверяет ограничение внешнего ключа или ограничение-проверку, созданное ранее с указанием <literal>NOT VALID</literal>, сканируя всю таблицу с целью убедиться, что ограничению удовлетворяют все строки. Если ограничение уже помечено как верное, ничего не происходит.

source: Validation can be a long process on larger tables. The value of separating validation from initial creation is that you can defer validation to less busy times, or can be used to give additional time to correct pre-existing errors while preventing new errors. Note also that validation on its own does not prevent normal write commands against the table while it runs.
ru: Проверка больших таблиц может быть довольно длительной. Смысл отделения проверки от собственно создания ограничения состоит в том, что это позволяет отложить проверку на время меньшей активности или провести дополнительную работу с существующими ошибками и при этом не допустить новых. Заметьте также, что во время осуществления проверки сама по себе она не препятствует выполнению обычных команд записи в таблицу.

source: Validation acquires only a <literal>SHARE UPDATE EXCLUSIVE</literal> lock on the table being altered. If the constraint is a foreign key then a <literal>ROW SHARE</literal> lock is also required on the table referenced by the constraint.
ru: При проверке запрашивается только блокировка <literal>SHARE UPDATE EXCLUSIVE</literal> целевой таблицы. Для ограничений внешнего ключа требуется также блокировка <literal>ROW SHARE</literal> в таблице, на которую ссылается ограничение.

source: This form drops the specified constraint on a table. If <literal>IF EXISTS</literal> is specified and the constraint does not exist, no error is thrown. In this case a notice is issued instead.
ru: Эта форма удаляет указанное ограничение таблицы. Если указано <literal>IF EXISTS</literal> и заданное ограничение не существует, это не считается ошибкой. В этом случае выдаётся только замечание.

source: These forms configure the firing of trigger(s) belonging to the table. A disabled trigger is still known to the system, but is not executed when its triggering event occurs. For a deferred trigger, the enable status is checked when the event occurs, not when the trigger function is actually executed. One can disable or enable a single trigger specified by name, or all triggers on the table, or only user triggers (this option excludes internally generated constraint triggers such as those that are used to implement foreign key constraints or deferrable uniqueness and exclusion constraints). Disabling or enabling internally generated constraint triggers requires superuser privileges; it should be done with caution since of course the integrity of the constraint cannot be guaranteed if the triggers are not executed. The trigger firing mechanism is also affected by the configuration variable <xref linkend="guc-session-replication-role"/>. Simply enabled triggers will fire when the replication role is <quote>origin</quote> (the default) or <quote>local</quote>. Triggers configured as <literal>ENABLE REPLICA</literal> will only fire if the session is in <quote>replica</quote> mode, and triggers configured as <literal>ENABLE ALWAYS</literal> will fire regardless of the current replication mode.
ru: Эти формы настраивают срабатывание триггера(ов), принадлежащего таблице. Отключённый триггер сохраняется в системе, но не выполняется, когда происходит вызывающего его событие. Для отложенных триггеров состояние включения проверяется при возникновении события, а не когда на самом деле вызывается функция триггера. Эта команда может отключить или включить один триггер по имени, либо все триггеры таблицы, либо только пользовательские триггеры (исключая сгенерированные внутрисистемные триггеры ограничений, например, триггеры, реализующие ограничения внешнего ключа или отложенные ограничения уникальности или исключений). Для отключения или включения сгенерированных внутрисистемных триггеров ограничений требуются права суперпользователя; отключать их следует с осторожностью, так как очевидно, что гарантировать целостность ограничений, если триггеры не работают, невозможно. На механизм срабатывания триггеров также влияет конфигурационная переменная <xref linkend="guc-session-replication-role"/>. Просто включаемые триггеры будут срабатывать, когда роль репликации — <quote>origin</quote> (по умолчанию) или <quote>local</quote>. Триггеры, включённые указанием <literal>ENABLE REPLICA</literal>, будут срабатывать, только если текущий режим сеанса — <quote>replica</quote>, а после указания <literal>ENABLE ALWAYS</literal> триггеры срабатывают вне зависимости от текущего режима репликации.

source: This command acquires a <literal>SHARE ROW EXCLUSIVE</literal> lock.
ru: Эта команда запрашивает блокировку <literal>SHARE ROW EXCLUSIVE</literal>.

source: These forms configure the firing of rewrite rules belonging to the table. A disabled rule is still known to the system, but is not applied during query rewriting. The semantics are as for disabled/enabled triggers. This configuration is ignored for <literal>ON SELECT</literal> rules, which are always applied in order to keep views working even if the current session is in a non-default replication role.
ru: Эти формы настраивают срабатывание правил перезаписи, относящихся к таблице. Отключённое правило сохраняется в системе, но не применяется во время переписывания запроса. По сути эти операции подобны операциям включения/отключения триггеров. Однако это не распространяется на правила <literal>ON SELECT</literal> — они применяются всегда, чтобы представления продолжали работать, даже в сеансах, исполняющих не основную роль репликации.

source: These forms control the application of row security policies belonging to the table. If enabled and no policies exist for the table, then a default-deny policy is applied. Note that policies can exist for a table even if row level security is disabled - in this case, the policies will NOT be applied and the policies will be ignored. See also <xref linkend="sql-createpolicy"/>.
ru: Эти формы управляют применением относящихся к таблице политик защиты строк. Если защита включается, но политики для таблицы не определены, применяется политика запрета доступа по умолчанию. Заметьте, что политики могут быть определены для таблицы, даже если защита на уровне строк отключена — в этом случае политики НЕ применяются и их ограничения игнорируются. См. также <xref remap="4" linkend="sql-createpolicy"/>.
