Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_collation.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a collation
ru: изменить определение правила сортировки

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER COLLATION</command> changes the definition of a collation.
ru: <command>ALTER COLLATION</command> изменяет определение правила сортировки.

source: You must own the collation to use <command>ALTER COLLATION</command>. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the collation's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the collation. However, a superuser can alter ownership of any collation anyway.)
ru: Выполнить <command>ALTER COLLATION</command> может только владелец соответствующего правила сортировки. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в схеме правила сортировки. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать правило сортировки. Однако суперпользователь может сменить владельца правила сортировки в любом случае.)

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing collation.
ru: Имя (возможно, дополненное схемой) существующего правила сортировки.

source: The new name of the collation.
ru: Новое имя правила сортировки.

source: The new owner of the collation.
ru: Новый владелец правила сортировки.

source: The new schema for the collation.
ru: Новая схема правила сортировки.

source: Examples
ru: Примеры

source: To rename the collation <literal>de_DE</literal> to <literal>german</literal>: <placeholder-1/>
ru: Переименование правила сортировки <literal>de_DE</literal> в <literal>german</literal>: <placeholder-1/>

source: To change the owner of the collation <literal>en_US</literal> to <literal>joe</literal>: <placeholder-1/>
ru: Изменение владельца правила сортировки <literal>en_US</literal> на <literal>joe</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>ALTER COLLATION</command> statement in the SQL standard.
ru: Оператор <command>ALTER COLLATION</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
