Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_database.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change a database
ru: изменить атрибуты базы данных

source: name
ru: имя

source: option
ru: параметр

source: where <placeholder-1/> can be:
ru: Здесь <placeholder-1/>:

source: allowconn
ru: разр_подключения

source: connlimit
ru: предел_подключений

source: istemplate
ru: это_шаблон

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_tablespace
ru: новое_табл_пространство

source: configuration_parameter
ru: параметр_конфигурации

source: value
ru: значение

source: Description
ru: Описание

source: <command>ALTER DATABASE</command> changes the attributes of a database.
ru: <command>ALTER DATABASE</command> изменяет атрибуты базы данных.

source: The first form changes certain per-database settings. (See below for details.) Only the database owner or a superuser can change these settings.
ru: Первая форма оператора меняет параметры на уровне базы данных. (Подробнее описано ниже.) Изменять эти параметры может только владелец базы данных или суперпользователь.

source: The second form changes the name of the database. Only the database owner or a superuser can rename a database; non-superuser owners must also have the <literal>CREATEDB</literal> privilege. The current database cannot be renamed. (Connect to a different database if you need to do that.)
ru: Вторая форма меняет имя базы данных. Переименовать базу данных может только владелец БД или суперпользователь (не суперпользователю требуется также право <literal>CREATEDB</literal>). Переименовать текущую базу данных нельзя. (Если вам нужно сделать это, сначала подключитесь к другой базе.)

source: The third form changes the owner of the database. To alter the owner, you must own the database and also be a direct or indirect member of the new owning role, and you must have the <literal>CREATEDB</literal> privilege. (Note that superusers have all these privileges automatically.)
ru: Третья форма меняет владельца базы данных. Чтобы сменить владельца базы, необходимо быть её владельцем и также непосредственным или опосредованным членом новой роли-владельца, и кроме того, иметь право <literal>CREATEDB</literal>. (Заметьте, что суперпользователи наделяются всеми этими правами автоматически.)

source: The fourth form changes the default tablespace of the database. Only the database owner or a superuser can do this; you must also have create privilege for the new tablespace. This command physically moves any tables or indexes in the database's old default tablespace to the new tablespace. The new default tablespace must be empty for this database, and no one can be connected to the database. Tables and indexes in non-default tablespaces are unaffected.
ru: Четвёртая форма меняет табличное пространство по умолчанию для базы данных. Произвести это изменение может только её владелец или суперпользователь; кроме того, необходимо иметь право для создания нового табличного пространства. Эта команда физически переносит все таблицы или индексы из прежнего основного табличного пространства БД в новое. Новое табличное пространство должно быть пустым для этой базы данных и к ней никто не должен быть подключён. Таблицы и индексы, находящиеся не в основном табличном пространстве, при этом не затрагиваются.

source: The remaining forms change the session default for a run-time configuration variable for a <productname>PostgreSQL</productname> database. Whenever a new session is subsequently started in that database, the specified value becomes the session default value. The database-specific default overrides whatever setting is present in <filename>postgresql.conf</filename> or has been received from the <command>postgres</command> command line. Only the database owner or a superuser can change the session defaults for a database. Certain variables cannot be set this way, or can only be set by a superuser.
ru: Остальные формы меняют значение по умолчанию конфигурационных переменных времени выполнения для базы данных <productname>PostgreSQL</productname>. Когда устанавливается следующий сеанс работы с указанной базой данных, заданное этой командой значение становится значением по умолчанию. Значения переменных, заданные для базы данных, переопределяют значения, определённые в <filename>postgresql.conf</filename> или полученные через командную строку <command>postgres</command>. Менять сеансовые значения переменных для базы данных может только её владелец или суперпользователь. Некоторые параметры изменить таким образом нельзя, а некоторые может изменить только суперпользователь.

source: Parameters
ru: Параметры

source: The name of the database whose attributes are to be altered.
ru: Имя базы данных, атрибуты которой изменяются.

source: If false then no one can connect to this database.
ru: Если false, никто не сможет подключаться к этой базе данных.

source: How many concurrent connections can be made to this database. -1 means no limit.
ru: Число разрешённых одновременно подключений к этой базе данных (-1 снимает ограничение).

source: If true, then this database can be cloned by any user with <literal>CREATEDB</literal> privileges; if false, then only superusers or the owner of the database can clone it.
ru: Если true, базу данных сможет клонировать любой пользователь с правами <literal>CREATEDB</literal>; в противном случае, клонировать эту базу смогут только суперпользователи и её владелец.

source: The new name of the database.
ru: Новое имя базы данных.

source: The new owner of the database.
ru: Новый владелец базы данных.

source: The new default tablespace of the database.
ru: Новое основное табличное пространство базы данных.

source: Set this database's session default for the specified configuration parameter to the given value. If <replaceable>value</replaceable> is <literal>DEFAULT</literal> or, equivalently, <literal>RESET</literal> is used, the database-specific setting is removed, so the system-wide default setting will be inherited in new sessions. Use <literal>RESET ALL</literal> to clear all database-specific settings. <literal>SET FROM CURRENT</literal> saves the session's current value of the parameter as the database-specific value.
ru: Устанавливает сеансовое значение по умолчанию для указанного параметра конфигурации. Если указывается <replaceable>значение</replaceable> <literal>DEFAULT</literal> или равнозначный вариант, <literal>RESET</literal>, определение параметра на уровне базы данных удаляется, так что в новых сеансах будет действовать значение по умолчанию, определённое на уровне системы. Для очистки всех значений параметров на уровне базы данных выполните <literal>RESET ALL</literal>. <literal>SET FROM CURRENT</literal> устанавливает значение параметра на уровне базы данных из текущего значения в активном сеансе.

source: See <xref linkend="sql-set"/> and <xref linkend="runtime-config"/> for more information about allowed parameter names and values.
ru: За подробными сведениями об именах и значениях параметров обратитесь к <xref remap="3" linkend="sql-set"/> и <xref remap="3" linkend="runtime-config"/>.

source: Notes
ru: Замечания

source: It is also possible to tie a session default to a specific role rather than to a database; see <xref linkend="sql-alterrole"/>. Role-specific settings override database-specific ones if there is a conflict.
ru: Также возможно связать параметры сеанса не с базой данных, а с определённой ролью; см. <xref remap="4" linkend="sql-alterrole"/>. В случае конфликта параметры на уровне роли переопределяют параметры на уровне базы данных.

source: Examples
ru: Примеры

source: To disable index scans by default in the database <literal>test</literal>: <placeholder-1/>
ru: Отключение сканирования индекса по умолчанию в базе данных <literal>test</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <command>ALTER DATABASE</command> statement is a <productname>PostgreSQL</productname> extension.
ru: Оператор <command>ALTER DATABASE</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
