Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_function.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a function
ru: изменить определение функции

source: name
ru: имя

source: argmode
ru: режим_аргумента

source: argname
ru: имя_аргумента

source: argtype
ru: тип_аргумента

source: action
ru: действие

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_schema
ru: новая_схема

source: extension_name
ru: имя_расширения

source: where <placeholder-1/> is one of:
ru: Где возможные варианты <placeholder-1/>:

source: execution_cost
ru: стоимость_выполнения

source: result_rows
ru: строк_в_результате

source: configuration_parameter
ru: параметр_конфигурации

source: value
ru: значение

source: Description
ru: Описание

source: <command>ALTER FUNCTION</command> changes the definition of a function.
ru: <command>ALTER FUNCTION</command> изменяет определение функции.

source: You must own the function to use <command>ALTER FUNCTION</command>. To change a function's schema, you must also have <literal>CREATE</literal> privilege on the new schema. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the function's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the function. However, a superuser can alter ownership of any function anyway.)
ru: Выполнить <command>ALTER FUNCTION</command> может только владелец соответствующей функции. Чтобы сменить схему функции, необходимо также иметь право <literal>CREATE</literal> в новой схеме. Чтобы сменить владельца, требуется также быть непосредственным или опосредованным членом новой роли, а эта роль должна иметь право <literal>CREATE</literal> в схеме функции. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать функцию. Однако суперпользователь может сменить владельца функции в любом случае.)

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing function.
ru: Имя (возможно, дополненное схемой) существующей функции.

source: The mode of an argument: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal>, or <literal>VARIADIC</literal>. If omitted, the default is <literal>IN</literal>. Note that <command>ALTER FUNCTION</command> does not actually pay any attention to <literal>OUT</literal> arguments, since only the input arguments are needed to determine the function's identity. So it is sufficient to list the <literal>IN</literal>, <literal>INOUT</literal>, and <literal>VARIADIC</literal> arguments.
ru: Режим аргумента: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal> или <literal>VARIADIC</literal>. По умолчанию подразумевается <literal>IN</literal>. Заметьте, что <command>ALTER FUNCTION</command> на самом деле не учитывает аргументы <literal>OUT</literal>, так как для идентификации функции нужны только типы входных аргументов. Поэтому достаточно перечислить только аргументы <literal>IN</literal>, <literal>INOUT</literal> и <literal>VARIADIC</literal>.

source: The name of an argument. Note that <command>ALTER FUNCTION</command> does not actually pay any attention to argument names, since only the argument data types are needed to determine the function's identity.
ru: Имя аргумента. Заметьте, что на самом деле <command>ALTER FUNCTION</command> не обращает внимание на имена аргументов, так как для однозначной идентификации функции достаточно только типов аргументов.

source: The data type(s) of the function's arguments (optionally schema-qualified), if any.
ru: Тип данных аргументов функции (возможно, дополненный именем схемы), если таковые имеются.

source: The new name of the function.
ru: Новое имя функции.

source: The new owner of the function. Note that if the function is marked <literal>SECURITY DEFINER</literal>, it will subsequently execute as the new owner.
ru: Новый владелец функции. Заметьте, что если функция помечена как <literal>SECURITY DEFINER</literal>, в дальнейшем она будет выполняться от имени нового владельца.

source: The new schema for the function.
ru: Новая схема функции.

source: The name of the extension that the function is to depend on.
ru: Имя расширения, от которого будет зависеть функция.

source: <literal>CALLED ON NULL INPUT</literal> changes the function so that it will be invoked when some or all of its arguments are null. <literal>RETURNS NULL ON NULL INPUT</literal> or <literal>STRICT</literal> changes the function so that it is not invoked if any of its arguments are null; instead, a null result is assumed automatically. See <xref linkend="sql-createfunction"/> for more information.
ru: <literal>CALLED ON NULL INPUT</literal> меняет функцию так, чтобы она вызывалась, когда некоторые или все её аргументы равны NULL. <literal>RETURNS NULL ON NULL INPUT</literal> или <literal>STRICT</literal> меняет функцию так, чтобы она не вызывалась, когда некоторые или все её аргументы равны NULL, а вместо вызова автоматически выдавался результат NULL. За подробностями обратитесь к <xref remap="3" linkend="sql-createfunction"/>.

source: Change the volatility of the function to the specified setting. See <xref linkend="sql-createfunction"/> for details.
ru: Устанавливает заданный вариант изменчивости функции. Подробнее это описано в <xref remap="6" linkend="sql-createfunction"/>.

source: Change whether the function is a security definer or not. The key word <literal>EXTERNAL</literal> is ignored for SQL conformance. See <xref linkend="sql-createfunction"/> for more information about this capability.
ru: Устанавливает, является ли функция определяющей контекст безопасности или нет. Ключевое слово <literal>EXTERNAL</literal> игнорируется для соответствия стандарту SQL. Подробнее это свойство описано в <xref remap="6" linkend="sql-createfunction"/>.

source: Change whether the function is deemed safe for parallelism. See <xref linkend="sql-createfunction"/> for details.
ru: Устанавливает, будет ли функция считаться безопасной для распараллеливания. Подробнее это описано в <xref linkend="sql-createfunction"/>.

source: Change whether the function is considered leakproof or not. See <xref linkend="sql-createfunction"/> for more information about this capability.
ru: Устанавливает, является ли функция герметичной или нет. Подробнее это свойство описано в <xref remap="6" linkend="sql-createfunction"/>.

source: Change the estimated execution cost of the function. See <xref linkend="sql-createfunction"/> for more information.
ru: Изменяет ориентировочную стоимость выполнения функции. Подробнее это описывается в <xref remap="6" linkend="sql-createfunction"/>.

source: Change the estimated number of rows returned by a set-returning function. See <xref linkend="sql-createfunction"/> for more information.
ru: Изменяет ориентировочное число строк в результате функции, возвращающей множество. Подробнее это описывается в <xref remap="6" linkend="sql-createfunction"/>.

source: Add or change the assignment to be made to a configuration parameter when the function is called. If <replaceable>value</replaceable> is <literal>DEFAULT</literal> or, equivalently, <literal>RESET</literal> is used, the function-local setting is removed, so that the function executes with the value present in its environment. Use <literal>RESET ALL</literal> to clear all function-local settings. <literal>SET FROM CURRENT</literal> saves the session's current value of the parameter as the value to be applied when the function is entered.
ru: Добавляет или изменяет установку параметра конфигурации, выполняемую при вызове функции. Если задано <replaceable>значение</replaceable> <literal>DEFAULT</literal> или, что равнозначно, выполняется действие <literal>RESET</literal>, локальное переопределение для функции удаляется и функция выполняется со значением, установленным в окружении. Для удаления всех установок параметров для данной функции укажите <literal>RESET ALL</literal>. <literal>SET FROM CURRENT</literal> сохраняет в качестве значения параметра, которое будет применяться при вызове функции, текущее значение в активном сеансе.

source: See <xref linkend="sql-set"/> and <xref linkend="runtime-config"/> for more information about allowed parameter names and values.
ru: За подробными сведениями об именах и значениях параметров обратитесь к <xref remap="3" linkend="sql-set"/> и <xref remap="3" linkend="runtime-config"/>.

source: Ignored for conformance with the SQL standard.
ru: Игнорируется для соответствия стандарту SQL.

source: Examples
ru: Примеры

source: To rename the function <literal>sqrt</literal> for type <type>integer</type> to <literal>square_root</literal>: <placeholder-1/>
ru: Переименование функции <literal>sqrt</literal> для типа <type>integer</type> в <literal>square_root</literal>: <placeholder-1/>

source: To change the owner of the function <literal>sqrt</literal> for type <type>integer</type> to <literal>joe</literal>: <placeholder-1/>
ru: Смена владельца функции <literal>sqrt</literal> для типа <type>integer</type> на <literal>joe</literal>: <placeholder-1/>

source: To change the schema of the function <literal>sqrt</literal> for type <type>integer</type> to <literal>maths</literal>: <placeholder-1/>
ru: Смена схемы функции <literal>sqrt</literal> для типа <type>integer</type> на <literal>maths</literal>: <placeholder-1/>

source: To mark the function <literal>sqrt</literal> for type <type>integer</type> as being dependent on the extension <literal>mathlib</literal>: <placeholder-1/>
ru: Обозначение функции <literal>sqrt</literal> для типа <type>integer</type> как зависимой от расширения <literal>mathlib</literal>: <placeholder-1/>

source: To adjust the search path that is automatically set for a function: <placeholder-1/>
ru: Изменение пути поиска, чтобы он устанавливался автоматически при вызове функции: <placeholder-1/>

source: To disable automatic setting of <varname>search_path</varname> for a function: <placeholder-1/> The function will now execute with whatever search path is used by its caller.
ru: Отмена автоматического определения <varname>search_path</varname> для функции: <placeholder-1/> Теперь функция будет выполняться с тем путём, который задан в момент вызова.

source: Compatibility
ru: Совместимость

source: This statement is partially compatible with the <command>ALTER FUNCTION</command> statement in the SQL standard. The standard allows more properties of a function to be modified, but does not provide the ability to rename a function, make a function a security definer, attach configuration parameter values to a function, or change the owner, schema, or volatility of a function. The standard also requires the <literal>RESTRICT</literal> key word, which is optional in <productname>PostgreSQL</productname>.
ru: Этот оператор частично совместим с оператором <command>ALTER FUNCTION</command> в стандарте SQL. Стандарт позволяет менять больше свойств функции, но не позволяет переименовывать функции, переключать контекст безопасности, связывать с функциями значения параметров конфигурации, а также менять владельца, схему и тип изменчивости функции. Также в стандарте слово <literal>RESTRICT</literal> считается обязательным, тогда как в <productname>PostgreSQL</productname> оно не требуется.

source: See Also
ru: См. также
