Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_index.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of an index
ru: изменить определение индекса

source: name
ru: имя

source: new_name
ru: новое_имя

source: tablespace_name
ru: табл_пространство

source: extension_name
ru: имя_расширения

source: storage_parameter
ru: параметр_хранения

source: value
ru: значение

source: role_name
ru: имя_роли

source: new_tablespace
ru: новое_табл_пространство

source: Description
ru: Описание

source: The <literal>RENAME</literal> form changes the name of the index. There is no effect on the stored data.
ru: Форма <literal>RENAME</literal> меняет имя индекса. На сохранённые данные это не влияет.

source: This form changes the index's tablespace to the specified tablespace and moves the data file(s) associated with the index to the new tablespace. To change the tablespace of an index, you must own the index and have <literal>CREATE</literal> privilege on the new tablespace. All indexes in the current database in a tablespace can be moved by using the <literal>ALL IN TABLESPACE</literal> form, which will lock all indexes to be moved and then move each one. This form also supports <literal>OWNED BY</literal>, which will only move indexes owned by the roles specified. If the <literal>NOWAIT</literal> option is specified then the command will fail if it is unable to acquire all of the locks required immediately. Note that system catalogs will not be moved by this command, use <command>ALTER DATABASE</command> or explicit <command>ALTER INDEX</command> invocations instead if desired. See also <xref linkend="sql-createtablespace"/>.
ru: Эта форма меняет табличное пространство индекса на заданное и переносит в него файл(ы) данных, связанные с индексом. Для изменения табличного пространства индекса нужно быть владельцем индекса и иметь право <literal>CREATE</literal> в новом табличном пространстве. Форма <literal>ALL IN TABLESPACE</literal> позволяет перенести из заданного пространства все индексы в текущей базе данных, блокируя их для перемещения и затем перемещая каждый индекс. Эта форма также поддерживает указание <literal>OWNED BY</literal>, с которым будут перемещены только индексы, принадлежащие заданным ролям. Если указан параметр <literal>NOWAIT</literal>, команда завершится ошибкой, если не сможет немедленно получить все требуемые блокировки. Заметьте, что эта команда не переместит системные каталоги; вместо неё следует использовать <command>ALTER DATABASE</command> или явные вызовы <command>ALTER INDEX</command>. См. также <xref remap="4" linkend="sql-createtablespace"/>.

source: This form marks the index as dependent on the extension, such that if the extension is dropped, the index will automatically be dropped as well.
ru: Эта форма помечает индекс как зависимый от расширения, так что при удалении расширения будет автоматически удалён и индекс.

source: This form changes one or more index-method-specific storage parameters for the index. See <xref linkend="sql-createindex"/> for details on the available parameters. Note that the index contents will not be modified immediately by this command; depending on the parameter you might need to rebuild the index with <xref linkend="sql-reindex"/> to get the desired effects.
ru: Эта форма настраивает один или несколько специфичных для индекса параметров хранения. Список доступных параметров приведён в <xref remap="6" linkend="sql-createindex"/>. Заметьте, что эта команда не меняет содержимое индекса немедленно; для получения желаемого эффекта в зависимости от параметров может потребоваться перестроить индекс командой <xref linkend="sql-reindex"/>.

source: This form resets one or more index-method-specific storage parameters to their defaults. As with <literal>SET</literal>, a <literal>REINDEX</literal> might be needed to update the index entirely.
ru: Эта форма сбрасывает один или несколько специфичных для индекса параметров хранения к значениям по умолчанию. Как и с <literal>SET</literal>, для полного обновления индекса может потребоваться выполнить <literal>REINDEX</literal>.

source: <command>ALTER INDEX</command> changes the definition of an existing index. There are several subforms: <placeholder-1/>
ru: <command>ALTER INDEX</command> меняет определение существующего индекса. Эта команда имеет несколько разновидностей: <placeholder-1/>

source: Parameters
ru: Параметры

source: Do not throw an error if the index does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если индекс не существует. В этом случае будет выдано замечание.

source: The name (possibly schema-qualified) of an existing index to alter.
ru: Имя (возможно, дополненное схемой) существующего индекса, подлежащего изменению.

source: The new name for the index.
ru: Новое имя индекса.

source: The tablespace to which the index will be moved.
ru: Табличное пространство, в которое будет перемещён индекс.

source: The name of the extension that the index is to depend on.
ru: Имя расширения, от которого будет зависеть индекс.

source: The name of an index-method-specific storage parameter.
ru: Имя специфичного для индекса параметра хранения.

source: The new value for an index-method-specific storage parameter. This might be a number or a word depending on the parameter.
ru: Новое значение специфичного для индекса параметра хранения. Это может быть число или строка, в зависимости от параметра.

source: Notes
ru: Замечания

source: These operations are also possible using <xref linkend="sql-altertable"/>. <command>ALTER INDEX</command> is in fact just an alias for the forms of <command>ALTER TABLE</command> that apply to indexes.
ru: Эти операции также возможно выполнить с помощью <xref linkend="sql-altertable"/>. На самом деле <command>ALTER INDEX</command> ­­­— это просто синоним нескольких форм <command>ALTER TABLE</command>, работающих с индексами.

source: There was formerly an <command>ALTER INDEX OWNER</command> variant, but this is now ignored (with a warning). An index cannot have an owner different from its table's owner. Changing the table's owner automatically changes the index as well.
ru: Ранее существовала форма <command>ALTER INDEX OWNER</command>, но сейчас она игнорируется (с предупреждением). Владельцем индекса может быть только владелец соответствующей таблицы. При смене владельца таблицы владелец индекса меняется автоматически.

source: Changing any part of a system catalog index is not permitted.
ru: Какие-либо изменения индексов системного каталога не допускаются.

source: Examples
ru: Примеры

source: To rename an existing index: <placeholder-1/>
ru: Переименование существующего индекса: <placeholder-1/>

source: To move an index to a different tablespace: <placeholder-1/>
ru: Перемещение индекса в другое табличное пространство: <placeholder-1/>

source: To change an index's fill factor (assuming that the index method supports it): <placeholder-1/>
ru: Изменение фактора заполнения индекса (предполагается, что это поддерживает метод индекса): <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER INDEX</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>ALTER INDEX</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
