Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_tsconfig.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a text search configuration
ru: изменить определение конфигурации текстового поиска

source: token_type
ru: тип_фрагмента

source: dictionary_name
ru: имя_словаря

source: old_dictionary
ru: старый_словарь

source: new_dictionary
ru: новый_словарь

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER TEXT SEARCH CONFIGURATION</command> changes the definition of a text search configuration. You can modify its mappings from token types to dictionaries, or change the configuration's name or owner.
ru: <command>ALTER TEXT SEARCH CONFIGURATION</command> изменяет определение конфигурации текстового поиска. Эта команда позволяет настроить сопоставления типов фрагментов со словарями или сменить владельца или имя конфигурации.

source: You must be the owner of the configuration to use <command>ALTER TEXT SEARCH CONFIGURATION</command>.
ru: Выполнить <command>ALTER TEXT SEARCH CONFIGURATION</command> может только владелец соответствующей конфигурации.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing text search configuration.
ru: Имя (возможно, дополненное схемой) существующей конфигурации текстового поиска.

source: The name of a token type that is emitted by the configuration's parser.
ru: Имя типа фрагмента, выдаваемое при разборе конфигурации.

source: The name of a text search dictionary to be consulted for the specified token type(s). If multiple dictionaries are listed, they are consulted in the specified order.
ru: Имя словаря текстового поиска, в котором будет искаться указанный тип фрагмента. Если указаны несколько словарей, они просматриваются в порядке перечисления.

source: The name of a text search dictionary to be replaced in the mapping.
ru: Имя словаря текстового поиска, которое будет заменено в сопоставлении.

source: The name of a text search dictionary to be substituted for <replaceable class="parameter">old_dictionary</replaceable>.
ru: Имя словаря текстового поиска, которое будет подставлено там, где был <replaceable class="parameter">старый_словарь</replaceable>.

source: The new name of the text search configuration.
ru: Новое имя конфигурации текстового поиска.

source: The new owner of the text search configuration.
ru: Новый владелец конфигурации текстового поиска.

source: The new schema for the text search configuration.
ru: Новая схема конфигурации текстового поиска.

source: The <literal>ADD MAPPING FOR</literal> form installs a list of dictionaries to be consulted for the specified token type(s); it is an error if there is already a mapping for any of the token types. The <literal>ALTER MAPPING FOR</literal> form does the same, but first removing any existing mapping for those token types. The <literal>ALTER MAPPING REPLACE</literal> forms substitute <replaceable class="parameter">new_dictionary</replaceable> for <replaceable class="parameter">old_dictionary</replaceable> anywhere the latter appears. This is done for only the specified token types when <literal>FOR</literal> appears, or for all mappings of the configuration when it doesn't. The <literal>DROP MAPPING</literal> form removes all dictionaries for the specified token type(s), causing tokens of those types to be ignored by the text search configuration. It is an error if there is no mapping for the token types, unless <literal>IF EXISTS</literal> appears.
ru: Форма <literal>ADD MAPPING FOR</literal> настраивает список словарей, которые будут просматриваться в поиске указанных типов фрагментов; если сопоставление для каких-либо типов уже задано, возникнет ошибка. Форма <literal>ALTER MAPPING FOR</literal> делает то же самое, но она сначала удаляет существующее сопоставление для этих типов фрагментов. Формы <literal>ALTER MAPPING REPLACE</literal> подставляют <replaceable class="parameter">новый_словарь</replaceable> вместо <replaceable class="parameter">старый_словарь</replaceable> везде, где упоминается последний. Это выполняется только для указанных типов фрагментов, когда присутствует <literal>FOR</literal>, либо для всех сопоставлений в конфигурации в противном случае. Форма <literal>DROP MAPPING</literal> удаляет все словари для заданных типов фрагментов, в результате чего фрагменты этих типов будут игнорироваться конфигурацией. Если сопоставлений для заданных типов фрагментов нет, возникает ошибка, если только не добавлено указание <literal>IF EXISTS</literal>.

source: Examples
ru: Примеры

source: The following example replaces the <literal>english</literal> dictionary with the <literal>swedish</literal> dictionary anywhere that <literal>english</literal> is used within <literal>my_config</literal>.
ru: В следующем примере словарь <literal>english</literal> заменяется на <literal>swedish</literal> везде, где использовался <literal>english</literal> в конфигурации <literal>my_config</literal>.

source: Compatibility
ru: Совместимость

source: There is no <command>ALTER TEXT SEARCH CONFIGURATION</command> statement in the SQL standard.
ru: Оператор <command>ALTER TEXT SEARCH CONFIGURATION</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
