Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_table.po
Languages: ru

source: The main reason for providing the option to specify multiple changes in a single <command>ALTER TABLE</command> is that multiple table scans or rewrites can thereby be combined into a single pass over the table.
ru: Возможность объединения множества изменений в одну команду <command>ALTER TABLE</command> полезна в основном тем, что позволяет совместить сканирования и перезаписи таблицы, требуемые этим операциям, и выполнить их за один проход.

source: The <literal>DROP COLUMN</literal> form does not physically remove the column, but simply makes it invisible to SQL operations. Subsequent insert and update operations in the table will store a null value for the column. Thus, dropping a column is quick but it will not immediately reduce the on-disk size of your table, as the space occupied by the dropped column is not reclaimed. The space will be reclaimed over time as existing rows are updated. (These statements do not apply when dropping the system <literal>oid</literal> column; that is done with an immediate rewrite.)
ru: Форма <literal>DROP COLUMN</literal> не удаляет столбец физически, а просто делает его невидимым для операций SQL. При последующих операциях добавления или изменения в этот столбец будет записываться значение NULL. Таким образом, удаление столбца выполняется быстро, но при этом размер таблицы на диске не уменьшается, так как пространство, занимаемое удалённым столбцом, не высвобождается. Это пространство будет освобождено со временем, по мере изменения существующих строк. (При удалении системного столбца <literal>oid</literal> это поведение не наблюдается, так как немедленно выполняется перезапись таблицы.)

source: To force immediate reclamation of space occupied by a dropped column, you can execute one of the forms of <command>ALTER TABLE</command> that performs a rewrite of the whole table. This results in reconstructing each row with the dropped column replaced by a null value.
ru: Чтобы принудительно высвободить пространство, занимаемое столбцом, который был удалён, можно выполнить одну из форм <command>ALTER TABLE</command>, производящих перезапись всей таблицы. В результате все строки будут воссозданы так, что в удалённом столбце будет содержаться NULL.

source: The rewriting forms of <command>ALTER TABLE</command> are not MVCC-safe. After a table rewrite, the table will appear empty to concurrent transactions, if they are using a snapshot taken before the rewrite occurred. See <xref linkend="mvcc-caveats"/> for more details.
ru: Перезаписывающие формы <command>ALTER TABLE</command> небезопасны с точки зрения MVCC. После перезаписи таблица будет выглядеть пустой для параллельных транзакций, если они работают со снимком, полученным до момента перезаписи. За подробностями обратитесь к <xref remap="3" linkend="mvcc-caveats"/>.

source: The <literal>USING</literal> option of <literal>SET DATA TYPE</literal> can actually specify any expression involving the old values of the row; that is, it can refer to other columns as well as the one being converted. This allows very general conversions to be done with the <literal>SET DATA TYPE</literal> syntax. Because of this flexibility, the <literal>USING</literal> expression is not applied to the column's default value (if any); the result might not be a constant expression as required for a default. This means that when there is no implicit or assignment cast from old to new type, <literal>SET DATA TYPE</literal> might fail to convert the default even though a <literal>USING</literal> clause is supplied. In such cases, drop the default with <literal>DROP DEFAULT</literal>, perform the <literal>ALTER TYPE</literal>, and then use <literal>SET DEFAULT</literal> to add a suitable new default. Similar considerations apply to indexes and constraints involving the column.
ru: В указании <literal>USING</literal> предложения <literal>SET DATA TYPE</literal> на самом деле можно записать выражение со старыми значениями строки; то есть, оно может ссылаться как на преобразуемые столбцы, так и на другие. Это позволяет записывать в <literal>SET DATA TYPE</literal> очень общие преобразования данных. Ввиду такой гибкости, выражение <literal>USING</literal> не применяется к значению по умолчанию данного столбца (если таковое есть); результат может быть не константным выражением, что требуется для значения по умолчанию. Это означает, что в случае отсутствия явного приведения или присваивания старого типа новому, <literal>SET DATA TYPE</literal> может не справиться с преобразованием значения по умолчанию, несмотря на то, что применяется предложение <literal>USING</literal>. В этих случаях нужно удалить значение по умолчанию с помощью <literal>DROP DEFAULT</literal>, выполнить <literal>ALTER TYPE</literal>, а затем с помощью <literal>SET DEFAULT</literal> задать новое подходящее значение по умолчанию. Подобные соображения применимы и в отношении индексов и ограничений с этим столбцом.

source: If a table has any descendant tables, it is not permitted to add, rename, or change the type of a column, or rename an inherited constraint in the parent table without doing the same to the descendants. That is, <command>ALTER TABLE ONLY</command> will be rejected. This ensures that the descendants always have columns matching the parent.
ru: Если у таблицы есть дочерние таблицы, добавлять, переименовывать или менять тип столбца, либо переименовывать наследуемое ограничение в родительской таблице, не делая того же самого во всех дочерних таблицах, нельзя. То есть, команда <command>ALTER TABLE ONLY</command> выполнена не будет. Это гарантирует, что дочерние таблицы всегда будут содержать те же столбцы, что и родительская.

source: A recursive <literal>DROP COLUMN</literal> operation will remove a descendant table's column only if the descendant does not inherit that column from any other parents and never had an independent definition of the column. A nonrecursive <literal>DROP COLUMN</literal> (i.e., <command>ALTER TABLE ONLY ... DROP COLUMN</command>) never removes any descendant columns, but instead marks them as independently defined rather than inherited.
ru: Рекурсивная операция <literal>DROP COLUMN</literal> удалит столбец из дочерней таблицы, только если этот столбец не наследуется от каких-то других родителей и не была определён в дочерней таблице независимо. Нерекурсивная операция <literal>DROP COLUMN</literal> (т. е., <command>ALTER TABLE ONLY ... DROP COLUMN</command>) никогда не удаляет унаследованные столбцы, но вместо этого помечает их как независимо определённые, а не наследуемые.

source: The <literal>TRIGGER</literal>, <literal>CLUSTER</literal>, <literal>OWNER</literal>, and <literal>TABLESPACE</literal> actions never recurse to descendant tables; that is, they always act as though <literal>ONLY</literal> were specified. Adding a constraint recurses only for <literal>CHECK</literal> constraints that are not marked <literal>NO INHERIT</literal>.
ru: Действия <literal>TRIGGER</literal>, <literal>CLUSTER</literal>, <literal>OWNER</literal> и <literal>TABLESPACE</literal> никогда не распространяются рекурсивно на дочерние таблицы; то есть, они всегда выполняются так, как будто указано <literal>ONLY</literal>. Операция добавления ограничения выполняется рекурсивно только для ограничений <literal>CHECK</literal>, не помеченных как <literal>NO INHERIT</literal>.

source: Changing any part of a system catalog table is not permitted.
ru: Какие-либо изменения таблиц системного каталога не допускаются.

source: Refer to <xref linkend="sql-createtable"/> for a further description of valid parameters. <xref linkend="ddl"/> has further information on inheritance.
ru: За более подробным описанием допустимых параметров обратитесь к <xref remap="3" linkend="sql-createtable"/>. Дополнительно о наследовании можно узнать в <xref remap="6" linkend="ddl"/>.

source: Examples
ru: Примеры

source: To add a column of type <type>varchar</type> to a table: <placeholder-1/>
ru: Добавление в таблицу столбца типа <type>varchar</type>: <placeholder-1/>

source: To drop a column from a table: <placeholder-1/>
ru: Удаление столбца из таблицы: <placeholder-1/>

source: To change the types of two existing columns in one operation: <placeholder-1/>
ru: Изменение типов двух существующих столбцов в одной операции: <placeholder-1/>

source: To change an integer column containing Unix timestamps to <type>timestamp with time zone</type> via a <literal>USING</literal> clause: <placeholder-1/>
ru: Смена типа целочисленного столбца, содержащего время в стиле Unix, на тип <type>timestamp with time zone</type> с применением предложения <literal>USING</literal>: <placeholder-1/>

source: The same, when the column has a default expression that won't automatically cast to the new data type: <placeholder-1/>
ru: То же самое, но в случае, когда у столбца есть значение по умолчанию, не приводимое автоматически к новому типу данных: <placeholder-1/>

source: To rename an existing column: <placeholder-1/>
ru: Переименование существующего столбца: <placeholder-1/>

source: To rename an existing table: <placeholder-1/>
ru: Переименование существующей таблицы: <placeholder-1/>

source: To rename an existing constraint: <placeholder-1/>
ru: Переименование существующего ограничения: <placeholder-1/>

source: To add a not-null constraint to a column: <placeholder-1/> To remove a not-null constraint from a column: <placeholder-2/>
ru: Добавление в столбец ограничения NOT NULL: <placeholder-1/> Удаление ограничения NOT NULL из столбца: <placeholder-2/>

source: To add a check constraint to a table and all its children: <placeholder-1/>
ru: Добавление ограничения-проверки в таблицу и все её потомки: <placeholder-1/>

source: To add a check constraint only to a table and not to its children: <placeholder-1/> (The check constraint will not be inherited by future children, either.)
ru: Добавление ограничения-проверки только в таблицу, но не в её потомки: <placeholder-1/> (Данное ограничение-проверка не будет наследоваться и будущими потомками тоже.)

source: To remove a check constraint from a table and all its children: <placeholder-1/>
ru: Удаление ограничения-проверки из таблицы и из всех её потомков: <placeholder-1/>

source: To remove a check constraint from one table only: <placeholder-1/> (The check constraint remains in place for any child tables.)
ru: Удаление ограничения-проверки только из самой таблицы: <placeholder-1/> (Ограничение-проверка остаётся во всех дочерних таблицах.)

source: To add a foreign key constraint to a table: <placeholder-1/>
ru: Добавление в таблицу ограничения внешнего ключа: <placeholder-1/>

source: To add a foreign key constraint to a table with the least impact on other work: <placeholder-1/>
ru: Добавление в таблицу ограничения внешнего ключа с наименьшим влиянием на работу других: <placeholder-1/>

source: To add a (multicolumn) unique constraint to a table: <placeholder-1/>
ru: Добавление в таблицу ограничения уникальности (по нескольким столбцам): <placeholder-1/>

source: To add an automatically named primary key constraint to a table, noting that a table can only ever have one primary key: <placeholder-1/>
ru: Добавление в таблицу первичного ключа с автоматическим именем (учтите, что в таблице может быть только один первичный ключ): <placeholder-1/>

source: To move a table to a different tablespace: <placeholder-1/>
ru: Перемещение таблицы в другое табличное пространство: <placeholder-1/>

source: To move a table to a different schema: <placeholder-1/>
ru: Перемещение таблицы в другую схему: <placeholder-1/>

source: To recreate a primary key constraint, without blocking updates while the index is rebuilt: <placeholder-1/>
ru: Пересоздание ограничения первичного ключа без блокировки изменений в процессе перестроения индекса: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The forms <literal>ADD</literal> (without <literal>USING INDEX</literal>), <literal>DROP</literal>, <literal>SET DEFAULT</literal>, and <literal>SET DATA TYPE</literal> (without <literal>USING</literal>) conform with the SQL standard. The other forms are <productname>PostgreSQL</productname> extensions of the SQL standard. Also, the ability to specify more than one manipulation in a single <command>ALTER TABLE</command> command is an extension.
ru: Формы <literal>ADD</literal> (без <literal>USING INDEX</literal>), <literal>DROP</literal>, <literal>SET DEFAULT</literal> и <literal>SET DATA TYPE</literal> (без <literal>USING</literal>) соответствуют стандарту SQL. Другие формы являются расширениями стандарта SQL, реализованными в <productname>PostgreSQL</productname>. Кроме того, расширением является возможность указать в одной команде <command>ALTER TABLE</command> несколько операций изменения.

source: <command>ALTER TABLE DROP COLUMN</command> can be used to drop the only column of a table, leaving a zero-column table. This is an extension of SQL, which disallows zero-column tables.
ru: <command>ALTER TABLE DROP COLUMN</command> позволяет удалить единственный столбец таблицы и оставить таблицу без столбцов. Это является расширением стандарта SQL, который не допускает существование таблиц с нулём столбцов.

source: See Also
ru: См. также
