Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/alter_view.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a view
ru: изменить определение представления

source: name
ru: имя

source: column_name
ru: имя_столбца

source: expression
ru: выражение

source: new_owner
ru: новый_владелец

source: new_name
ru: новое_имя

source: new_schema
ru: новая_схема

source: view_option_name
ru: имя_параметра_представления

source: view_option_value
ru: значение_параметра_представления

source: Description
ru: Описание

source: <command>ALTER VIEW</command> changes various auxiliary properties of a view. (If you want to modify the view's defining query, use <command>CREATE OR REPLACE VIEW</command>.)
ru: <command>ALTER VIEW</command> изменяет различные дополнительные свойства представления. (Для изменения запроса, определяющего представление, используйте команду <command>CREATE OR REPLACE VIEW</command>.)

source: You must own the view to use <command>ALTER VIEW</command>. To change a view's schema, you must also have <literal>CREATE</literal> privilege on the new schema. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the view's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the view. However, a superuser can alter ownership of any view anyway.)
ru: Выполнить <command>ALTER VIEW</command> может только владелец представления. Чтобы сменить схему представления, необходимо также иметь право <literal>CREATE</literal> в новой схеме. Чтобы сменить владельца, требуется также быть непосредственным или опосредованным членом новой роли, а эта роль должна иметь право <literal>CREATE</literal> в схеме представления. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать представление. Однако суперпользователь может сменить владельца представления в любом случае.)

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing view.
ru: Имя (возможно, дополненное схемой) существующего представления.

source: Do not throw an error if the view does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если представление не существует. В этом случае будет выдано замечание.

source: These forms set or remove the default value for a column. A view column's default value is substituted into any <command>INSERT</command> or <command>UPDATE</command> command whose target is the view, before applying any rules or triggers for the view. The view's default will therefore take precedence over any default values from underlying relations.
ru: Эти формы устанавливают или удаляют значение по умолчанию в заданном столбце. Значение по умолчанию подставляется в команды <command>INSERT</command> и <command>UPDATE</command>, вносящие данные в представление, до применения каких-либо правил или триггеров в этом представлении. Таким образом, значения по умолчанию в представлении имеют приоритет перед значениями по умолчанию в нижележащих отношениях.

source: The user name of the new owner of the view.
ru: Имя пользователя, назначаемого новым владельцем представления.

source: The new name for the view.
ru: Новое имя представления.

source: The new schema for the view.
ru: Новая схема представления.

source: Changes the check option of the view. The value must be <literal>local</literal> or <literal>cascaded</literal>.
ru: Изменяет параметр проверки представления. Допустимые значения: <literal>local</literal> (локальная) или <literal>cascaded</literal> (каскадная).

source: Changes the security-barrier property of the view. The value must be Boolean value, such as <literal>true</literal> or <literal>false</literal>.
ru: Изменяет свойство представления, включающее барьер безопасности. Значение должно быть логическим: <literal>true</literal> или <literal>false</literal>.

source: Sets or resets a view option. Currently supported options are: <placeholder-1/>
ru: Устанавливает или сбрасывает параметры представления. В настоящее время поддерживаются параметры: <placeholder-1/>

source: Notes
ru: Замечания

source: For historical reasons, <command>ALTER TABLE</command> can be used with views too; but the only variants of <command>ALTER TABLE</command> that are allowed with views are equivalent to the ones shown above.
ru: По историческим причинам команду <command>ALTER TABLE</command> можно использовать и с представлениями; но единственно допустимые для работы с представлениями вариации <command>ALTER TABLE</command> равносильны вышеперечисленным командам.

source: Examples
ru: Примеры

source: To rename the view <literal>foo</literal> to <literal>bar</literal>: <placeholder-1/>
ru: Переименование представления <literal>foo</literal> в <literal>bar</literal>: <placeholder-1/>

source: CREATE TABLE base_table (id int, ts timestamptz); CREATE VIEW a_view AS SELECT * FROM base_table; ALTER VIEW a_view ALTER COLUMN ts SET DEFAULT now(); INSERT INTO base_table(id) VALUES(1); -- ts will receive a NULL INSERT INTO a_view(id) VALUES(2); -- ts will receive the current time
ru: CREATE TABLE base_table (id int, ts timestamptz); CREATE VIEW a_view AS SELECT * FROM base_table; ALTER VIEW a_view ALTER COLUMN ts SET DEFAULT now(); INSERT INTO base_table(id) VALUES(1); -- в ts окажется значение NULL INSERT INTO a_view(id) VALUES(2); -- в ts окажется текущее время

source: To attach a default column value to an updatable view: <placeholder-1/>
ru: Добавление значения столбца по умолчанию в изменяемое представление: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER VIEW</command> is a <productname>PostgreSQL</productname> extension of the SQL standard.
ru: <command>ALTER VIEW</command> — реализованное в <productname>PostgreSQL</productname> расширение стандарта SQL.

source: See Also
ru: См. также
