Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/analyze.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: collect statistics about a database
ru: собрать статистику по базе данных

source: table_name
ru: имя_таблицы

source: column_name
ru: имя_столбца

source: Description
ru: Описание

source: <command>ANALYZE</command> collects statistics about the contents of tables in the database, and stores the results in the <link linkend="catalog-pg-statistic"><structname>pg_statistic</structname></link> system catalog. Subsequently, the query planner uses these statistics to help determine the most efficient execution plans for queries.
ru: <command>ANALYZE</command> собирает статистическую информацию о содержимом таблиц в базе данных и сохраняет результаты в системном каталоге <link linkend="catalog-pg-statistic"><structname>pg_statistic</structname></link>. Впоследствии планировщик запросов будет использовать эту статистику для выбора наиболее эффективных планов выполнения запросов.

source: With no parameter, <command>ANALYZE</command> examines every table in the current database. With a parameter, <command>ANALYZE</command> examines only that table. It is further possible to give a list of column names, in which case only the statistics for those columns are collected.
ru: Без параметров команда <command>ANALYZE</command> анализирует все таблицы в текущей базе данных. Если в параметрах передано имя таблицы, <command>ANALYZE</command> обрабатывает только заданную таблицу. Также эта команда принимает список имён столбцов, что позволяет запустить сбор статистики только по этим столбцам.

source: Parameters
ru: Параметры

source: Enables display of progress messages.
ru: Включает вывод сообщений о процессе выполнения.

source: The name (possibly schema-qualified) of a specific table to analyze. If omitted, all regular tables (but not foreign tables) in the current database are analyzed.
ru: Имя (возможно, дополненное схемой) конкретной таблицы, подлежащей анализу. Если опущено, анализироваться будут все обычные (не сторонние) таблицы в текущей базе данных.

source: The name of a specific column to analyze. Defaults to all columns.
ru: Имя столбца, подлежащего анализу. По умолчанию анализируются все столбцы.

source: Outputs
ru: Выводимая информация

source: When <literal>VERBOSE</literal> is specified, <command>ANALYZE</command> emits progress messages to indicate which table is currently being processed. Various statistics about the tables are printed as well.
ru: С указанием <literal>VERBOSE</literal> команда <command>ANALYZE</command> выдаёт сообщения о процессе анализа, отмечая текущую обрабатываемую таблицу. Также она выводит различные статистические сведения о таблицах.

source: Notes
ru: Замечания

source: Foreign tables are analyzed only when explicitly selected. Not all foreign data wrappers support <command>ANALYZE</command>. If the table's wrapper does not support <command>ANALYZE</command>, the command prints a warning and does nothing.
ru: Сторонние таблицы анализируются только при явном указании и только если соответствующая обёртка сторонних данных поддерживает команду <command>ANALYZE</command>. Если эта команда не поддерживается, при выполнении <command>ANALYZE</command> выводится предупреждение и больше ничего не происходит.

source: In the default <productname>PostgreSQL</productname> configuration, the autovacuum daemon (see <xref linkend="autovacuum"/>) takes care of automatic analyzing of tables when they are first loaded with data, and as they change throughout regular operation. When autovacuum is disabled, it is a good idea to run <command>ANALYZE</command> periodically, or just after making major changes in the contents of a table. Accurate statistics will help the planner to choose the most appropriate query plan, and thereby improve the speed of query processing. A common strategy for read-mostly databases is to run <xref linkend="sql-vacuum"/> and <command>ANALYZE</command> once a day during a low-usage time of day. (This will not be sufficient if there is heavy update activity.)
ru: В стандартной конфигурации <productname>PostgreSQL</productname> работающий демон автоочистки (см. <xref remap="4" linkend="autovacuum"/>) запускает анализ таблиц автоматически, когда они изначально заполняются данными, и периодически, по мере того, как они меняются. Если автоочистка отключена, рекомендуется запускать <command>ANALYZE</command> время от времени, либо после кардинальных изменений в таблице. Точная статистика помогает планировщику выбрать наиболее эффективный план запроса и тем самым увеличивает скорость выполнения запроса. Обычно для баз, где данные в основном читаются, выполняют <xref linkend="sql-vacuum"/> и <command>ANALYZE</command> раз в день, во время наименьшей активности. (Этого будет недостаточно, если данные меняются очень активно.)

source: <command>ANALYZE</command> requires only a read lock on the target table, so it can run in parallel with other activity on the table.
ru: <command>ANALYZE</command> запрашивает для целевой таблицы блокировку только на чтение, так что эта команда может выполняться параллельно с другими операциями с таблицей.

source: The statistics collected by <command>ANALYZE</command> usually include a list of some of the most common values in each column and a histogram showing the approximate data distribution in each column. One or both of these can be omitted if <command>ANALYZE</command> deems them uninteresting (for example, in a unique-key column, there are no common values) or if the column data type does not support the appropriate operators. There is more information about the statistics in <xref linkend="maintenance"/>.
ru: Статистика, собираемая командой <command>ANALYZE</command>, обычно включает список из нескольких самых частых значений в каждом столбце и гистограмму, отражающую примерное распределение данных во всех столбцах. Один или оба этих элемента статистики могут быть опущены, если <command>ANALYZE</command> сочтёт их неинтересными (например, в столбце уникального ключа нет повторяющихся значений), либо если тип данных столбца не поддерживает соответствующие операторы. Более подробно статистика описывается в <xref remap="6" linkend="maintenance"/>.

source: For large tables, <command>ANALYZE</command> takes a random sample of the table contents, rather than examining every row. This allows even very large tables to be analyzed in a small amount of time. Note, however, that the statistics are only approximate, and will change slightly each time <command>ANALYZE</command> is run, even if the actual table contents did not change. This might result in small changes in the planner's estimated costs shown by <xref linkend="sql-explain"/>. In rare situations, this non-determinism will cause the planner's choices of query plans to change after <command>ANALYZE</command> is run. To avoid this, raise the amount of statistics collected by <command>ANALYZE</command>, as described below.
ru: В больших таблицах <command>ANALYZE</command> не просматривает все строки, а обрабатывает только небольшую случайную выборку. Это позволяет проанализировать за короткое время даже очень большие таблицы. Однако учтите, что такая статистика будет лишь приблизительной и может немного меняться при каждом выполнении <command>ANALYZE</command>, даже если фактическое содержимое таблицы остаётся неизменным. Это может приводить к небольшим изменениям в оценках стоимости запросов, выводимых командой <xref linkend="sql-explain"/>. В редких случаях вследствие этой недетерменированности планировщик меняет свой выбор после выполнения <command>ANALYZE</command>. Чтобы избежать этого, увеличьте объём статистики, собираемой командой <command>ANALYZE</command>, как описано ниже.

source: The extent of analysis can be controlled by adjusting the <xref linkend="guc-default-statistics-target"/> configuration variable, or on a column-by-column basis by setting the per-column statistics target with <command>ALTER TABLE ... ALTER COLUMN ... SET STATISTICS</command> (see <xref linkend="sql-altertable"/>). The target value sets the maximum number of entries in the most-common-value list and the maximum number of bins in the histogram. The default target value is 100, but this can be adjusted up or down to trade off accuracy of planner estimates against the time taken for <command>ANALYZE</command> and the amount of space occupied in <literal>pg_statistic</literal>. In particular, setting the statistics target to zero disables collection of statistics for that column. It might be useful to do that for columns that are never used as part of the <literal>WHERE</literal>, <literal>GROUP BY</literal>, or <literal>ORDER BY</literal> clauses of queries, since the planner will have no use for statistics on such columns.
ru: Количеством статистики можно управлять, настраивая конфигурационную переменную <xref linkend="guc-default-statistics-target"/> или устанавливая ориентир статистики на уровне столбцов командой <command>ALTER TABLE ... ALTER COLUMN ... SET STATISTICS</command> (см. <xref remap="4" linkend="sql-altertable"/>). Ориентир задаёт максимальное число записей в списке наиболее распространённых значений и максимальное число интервалов в гистограмме. По умолчанию значение ориентира равно 100, но его можно увеличить или уменьшить в поисках баланса между точностью оценок планировщика и временем, требующимся для выполнения <command>ANALYZE</command>, а также объёмом статистики в таблице <literal>pg_statistic</literal>. Если установить ориентир статистики равным нулю, статистика по таким столбцам собираться не будет. Это может быть полезно для столбцов, которые никогда не фигурируют в предложениях <literal>WHERE</literal>, <literal>GROUP BY</literal> и <literal>ORDER BY</literal>, так как планировщик никогда не будет использовать их статистику.

source: The largest statistics target among the columns being analyzed determines the number of table rows sampled to prepare the statistics. Increasing the target causes a proportional increase in the time and space needed to do <command>ANALYZE</command>.
ru: Число строк таблицы, выбираемых для подготовки статистики, определяется наибольшим ориентиром статистики по всем анализируемым столбцам этой таблицы. Увеличение ориентира приводит к пропорциональному увеличению времени и пространства, требуемого для выполнения <command>ANALYZE</command>.

source: One of the values estimated by <command>ANALYZE</command> is the number of distinct values that appear in each column. Because only a subset of the rows are examined, this estimate can sometimes be quite inaccurate, even with the largest possible statistics target. If this inaccuracy leads to bad query plans, a more accurate value can be determined manually and then installed with <command>ALTER TABLE ... ALTER COLUMN ... SET (n_distinct = ...)</command> (see <xref linkend="sql-altertable"/>).
ru: Одним из показателей, оцениваемых командой <command>ANALYZE</command>, является число различных значений, встречающихся в каждом столбце. Так как рассматривается только подмножество всех строк, эта оценка иногда может быть весьма неточной, даже при самых больших ориентирах статистики. Если эта неточность приводит к плохому выбору плана запроса, более точное значение можно определить вручную и затем задать его командой <command>ALTER TABLE ... ALTER COLUMN ... SET (n_distinct = ...)</command> (см. <xref remap="4" linkend="sql-altertable"/>).

source: If the table being analyzed has one or more children, <command>ANALYZE</command> will gather statistics twice: once on the rows of the parent table only, and a second time on the rows of the parent table with all of its children. This second set of statistics is needed when planning queries that traverse the entire inheritance tree. The autovacuum daemon, however, will only consider inserts or updates on the parent table itself when deciding whether to trigger an automatic analyze for that table. If that table is rarely inserted into or updated, the inheritance statistics will not be up to date unless you run <command>ANALYZE</command> manually.
ru: Если у анализируемой таблицы есть один или несколько потомков, <command>ANALYZE</command> соберёт статистику дважды: сначала по строкам только родительской таблицы, а затем по строкам родительской и всех дочерних таблиц. Второй набор статистики необходим для планирования запросов, обращающихся ко всему дереву наследования. Демон автоочистки, однако, принимая решение об автоматическом запуске анализа, будет учитывать операции добавления или изменения данных только в самой родительской таблице. Если именно в этой таблице изменение и добавление происходит редко, наследуемая статистика может терять актуальность, если не запускать <command>ANALYZE</command> вручную.

source: If any of the child tables are foreign tables whose foreign data wrappers do not support <command>ANALYZE</command>, those child tables are ignored while gathering inheritance statistics.
ru: Если какие-либо из дочерних таблиц являются сторонними таблицами и их обёртки сторонних данных не поддерживают <command>ANALYZE</command>, эти дочерние таблицы игнорируются при сборе статистики наследования.

source: If the table being analyzed is completely empty, <command>ANALYZE</command> will not record new statistics for that table. Any existing statistics will be retained.
ru: Если анализируемая таблица оказалась пустой, <command>ANALYZE</command> не будет обновлять статистику по этой таблице; в базе сохранится статистика, собранная ранее.

source: Compatibility
ru: Совместимость

source: There is no <command>ANALYZE</command> statement in the SQL standard.
ru: Оператор <command>ANALYZE</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
