Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/begin.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: start a transaction block
ru: начать блок транзакции

source: transaction_mode
ru: режим_транзакции

source: where <placeholder-1/> is one of:
ru: Где возможные варианты <placeholder-1/>:

source: Description
ru: Описание

source: <command>BEGIN</command> initiates a transaction block, that is, all statements after a <command>BEGIN</command> command will be executed in a single transaction until an explicit <xref linkend="sql-commit"/> or <xref linkend="sql-rollback"/> is given. By default (without <command>BEGIN</command>), <productname>PostgreSQL</productname> executes transactions in <quote>autocommit</quote> mode, that is, each statement is executed in its own transaction and a commit is implicitly performed at the end of the statement (if execution was successful, otherwise a rollback is done).
ru: <command>BEGIN</command> начинает блок транзакции, то есть обозначает, что все операторы после команды <command>BEGIN</command> и до явной команды <xref linkend="sql-commit"/> или <xref linkend="sql-rollback"/> будут выполняться в одной транзакции. По умолчанию (без <command>BEGIN</command>) <productname>PostgreSQL</productname> выполняет транзакции в режиме <quote>autocommit</quote> (автофиксация), то есть каждый оператор выполняется в своей отдельной транзакции, которая неявно фиксируется в конце оператора (если оператор был выполнен успешно; в противном случае, транзакция откатывается).

source: Statements are executed more quickly in a transaction block, because transaction start/commit requires significant CPU and disk activity. Execution of multiple statements inside a transaction is also useful to ensure consistency when making several related changes: other sessions will be unable to see the intermediate states wherein not all the related updates have been done.
ru: В блоке транзакции операторы выполняются быстрее, так как для запуска/фиксации транзакции производится масса операций, нагружающих процессор и диск. Кроме того, выполнение нескольких операторов в одной транзакции позволяет обеспечить целостность при внесении серии связанных изменений; другие сеансы не видят промежуточное состояние, когда произошли ещё не все связанные изменения.

source: If the isolation level, read/write mode, or deferrable mode is specified, the new transaction has those characteristics, as if <xref linkend="sql-set-transaction"/> was executed.
ru: Если указан уровень изоляции, режим чтения/записи или устанавливается отложенный режим, новая транзакция получает те же характеристики, что и после выполнения <xref linkend="sql-set-transaction"/>.

source: Parameters
ru: Параметры

source: Optional key words. They have no effect.
ru: Необязательные ключевые слова, не оказывают никакого влияния.

source: Refer to <xref linkend="sql-set-transaction"/> for information on the meaning of the other parameters to this statement.
ru: За описанием других параметров обратитесь к <xref remap="3" linkend="sql-set-transaction"/>.

source: Notes
ru: Замечания

source: <xref linkend="sql-start-transaction"/> has the same functionality as <command>BEGIN</command>.
ru: <xref linkend="sql-start-transaction"/> делает то же, что и <command>BEGIN</command>.

source: Use <xref linkend="sql-commit"/> or <xref linkend="sql-rollback"/> to terminate a transaction block.
ru: Для завершения блока транзакции используйте <xref linkend="sql-commit"/> или <xref linkend="sql-rollback"/>.

source: Issuing <command>BEGIN</command> when already inside a transaction block will provoke a warning message. The state of the transaction is not affected. To nest transactions within a transaction block, use savepoints (see <xref linkend="sql-savepoint"/>).
ru: При попытке выполнить <command>BEGIN</command> внутри уже начатого блока транзакции будет выдано предупреждение, а состояние транзакции не изменится. Для вложения подтранзакций внутри блока транзакций используйте точки сохранения (см. <xref remap="4" linkend="sql-savepoint"/>).

source: For reasons of backwards compatibility, the commas between successive <replaceable class="parameter">transaction_modes</replaceable> can be omitted.
ru: Для сохранения обратной совместимости допускается перечисление <replaceable class="parameter">режимов_транзакции</replaceable> без запятых.

source: Examples
ru: Примеры

source: To begin a transaction block: <placeholder-1/>
ru: Начало блока транзакции: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>BEGIN</command> is a <productname>PostgreSQL</productname> language extension. It is equivalent to the SQL-standard command <xref linkend="sql-start-transaction"/>, whose reference page contains additional compatibility information.
ru: <command>BEGIN</command> — это языковое расширение <productname>PostgreSQL</productname>. Эта команда равнозначна соответствующей стандарту SQL команде <xref linkend="sql-start-transaction"/>, на справочной странице которой можно найти дополнительные сведения о совместимости.

source: The <literal>DEFERRABLE</literal> <replaceable class="parameter">transaction_mode</replaceable> is a <productname>PostgreSQL</productname> language extension.
ru: Значение <literal>DEFERRABLE</literal> параметра <replaceable class="parameter">режим_транзакции</replaceable> является языковым расширением <productname>PostgreSQL</productname>.

source: Incidentally, the <literal>BEGIN</literal> key word is used for a different purpose in embedded SQL. You are advised to be careful about the transaction semantics when porting database applications.
ru: По стечению обстоятельств ключевое слово <literal>BEGIN</literal> имеет другое значение во встраиваемом SQL, поэтому при портировании приложений баз данных рекомендуется внимательно сверить семантику транзакций.

source: See Also
ru: См. также
