Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/close.po
Languages: ru

source: <primary>cursor</primary><secondary>CLOSE</secondary>
ru: <primary>курсор</primary><secondary>CLOSE</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: close a cursor
ru: закрыть курсор

source: Description
ru: Описание

source: <command>CLOSE</command> frees the resources associated with an open cursor. After the cursor is closed, no subsequent operations are allowed on it. A cursor should be closed when it is no longer needed.
ru: <command>CLOSE</command> освобождает ресурсы, связанные с открытым курсором. Когда курсор закрыт, никакие операции с ним невозможны. Закрывать курсор следует, когда он становится ненужным.

source: Every non-holdable open cursor is implicitly closed when a transaction is terminated by <command>COMMIT</command> or <command>ROLLBACK</command>. A holdable cursor is implicitly closed if the transaction that created it aborts via <command>ROLLBACK</command>. If the creating transaction successfully commits, the holdable cursor remains open until an explicit <command>CLOSE</command> is executed, or the client disconnects.
ru: Все не удерживаемые открытые курсоры закрываются неявно при завершении транзакции командами <command>COMMIT</command> или <command>ROLLBACK</command>. Удерживаемый курсор закрывается неявно, если транзакция, его создавшая, прерывается командой <command>ROLLBACK</command>. Если создавшая его транзакция завершается успешной фиксацией, удерживаемый курсор остаётся открытым до явного вызова команды <command>CLOSE</command> или отключения клиента.

source: Parameters
ru: Параметры

source: The name of an open cursor to close.
ru: Имя открытого курсора, который будет закрыт.

source: Close all open cursors.
ru: Закрывает все открытые курсоры.

source: <productname>PostgreSQL</productname> does not have an explicit <command>OPEN</command> cursor statement; a cursor is considered open when it is declared. Use the <xref linkend="sql-declare"/> statement to declare a cursor.
ru: В <productname>PostgreSQL</productname> нет явной команды <command>OPEN</command> для курсора; курсор считается открытым при объявлении. Чтобы объявить курсор, используйте оператор <xref linkend="sql-declare"/>.

source: You can see all available cursors by querying the <link linkend="view-pg-cursors"><structname>pg_cursors</structname></link> system view.
ru: Получить список всех доступных курсоров можно, обратившись к системному представлению <link linkend="view-pg-cursors"><structname>pg_cursors</structname></link>.

source: If a cursor is closed after a savepoint which is later rolled back, the <command>CLOSE</command> is not rolled back; that is, the cursor remains closed.
ru: Если курсор был закрыт после точки сохранения, а затем произошёл откат к этой точке, действие команды <command>CLOSE</command> не отменяется; то есть курсор остаётся закрытым.

source: Examples
ru: Примеры

source: Close the cursor <literal>liahona</literal>: <placeholder-1/>
ru: Следующая команда закрывает курсор <literal>liahona</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CLOSE</command> is fully conforming with the SQL standard. <command>CLOSE ALL</command> is a <productname>PostgreSQL</productname> extension.
ru: Оператор <command>CLOSE</command> полностью соответствует стандарту SQL. <command>CLOSE ALL</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
