Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_type.po
Languages: ru

source: The name of an existing data type that the new type will have the same representation as. The values of <replaceable class="parameter">internallength</replaceable>, <replaceable class="parameter">passedbyvalue</replaceable>, <replaceable class="parameter">alignment</replaceable>, and <replaceable class="parameter">storage</replaceable> are copied from that type, unless overridden by explicit specification elsewhere in this <command>CREATE TYPE</command> command.
ru: Имя существующего типа данных, от которого новый тип получит свойства представления. Из этого типа будут скопированы значения параметров <replaceable class="parameter">internallength</replaceable>, <replaceable class="parameter">passedbyvalue</replaceable>, <replaceable class="parameter">alignment</replaceable> и <replaceable class="parameter">storage</replaceable>, если их не переопределят явные указания, заданные дополнительно в этой команде <command>CREATE TYPE</command>.

source: The category code (a single ASCII character) for this type. The default is <literal>'U'</literal> for <quote>user-defined type</quote>. Other standard category codes can be found in <xref linkend="catalog-typcategory-table"/>. You may also choose other ASCII characters in order to create custom categories.
ru: Код категории (один символ ASCII) для этого типа. По умолчанию подразумевается <literal>'U'</literal> (что означает пользовательский тип, <quote>User-defined</quote>). Коды других стандартных категорий можно найти в <xref remap="6" linkend="catalog-typcategory-table"/>. Для нестандартных категорий можно выбрать другие ASCII-символы.

source: True if this type is a preferred type within its type category, else false. The default is false. Be very careful about creating a new preferred type within an existing type category, as this could cause surprising changes in behavior.
ru: Если значение этого параметра равно true, создаваемый тип будет предпочитаемым в своей категории. По умолчанию подразумевается false. Будьте очень осторожны, создавая новый предпочитаемый тип в существующей категории, так как это может поменять поведение выражений неожиданным образом.

source: The default value for the data type. If this is omitted, the default is null.
ru: Значение по умолчанию для создаваемого типа данных. Если не указано, значением по умолчанию будет NULL.

source: The type being created is an array; this specifies the type of the array elements.
ru: Создаваемый тип будет массивом; этот параметр определяет тип элементов массива.

source: The delimiter character to be used between values in arrays made of this type.
ru: Символ, разделяющий значения в массивах, образованных из значений создаваемого типа.

source: True if this type's operations can use collation information. The default is false.
ru: Если значение этого параметра равно true, в операциях с создаваемым типом может учитываться информация о правилах сортировки. По умолчанию подразумевается false.

source: Notes
ru: Замечания

source: Because there are no restrictions on use of a data type once it's been created, creating a base type or range type is tantamount to granting public execute permission on the functions mentioned in the type definition. This is usually not an issue for the sorts of functions that are useful in a type definition. But you might want to think twice before designing a type in a way that would require <quote>secret</quote> information to be used while converting it to or from external form.
ru: Так как на использование типа данных после создания не накладываются ограничения, объявление базового типа или типа-диапазона по сути даёт всем право на выполнение функций, упомянутых в определении типа. Обычно это не проблема для таких функций, какие бывают полезны в определении типов. Но прежде чем создать тип, преобразование которого во внешнюю форму и обратно будет использовать <quote>секретную</quote> информацию, стоит подумать дважды.

source: Before <productname>PostgreSQL</productname> version 8.3, the name of a generated array type was always exactly the element type's name with one underscore character (<literal>_</literal>) prepended. (Type names were therefore restricted in length to one less character than other names.) While this is still usually the case, the array type name may vary from this in case of maximum-length names or collisions with user type names that begin with underscore. Writing code that depends on this convention is therefore deprecated. Instead, use <structname>pg_type</structname>.<structfield>typarray</structfield> to locate the array type associated with a given type.
ru: В <productname>PostgreSQL</productname> до версии 8.3 имя генерируемого типа-массива всегда образовалось из имени типа элемента и добавленного спереди символа подчёркивания (<literal>_</literal>). (Таким образом, допустимая максимальная длина имени типа была на символ меньше, чем длины других имён.) Хотя и сейчас имя типа массива чаще всего образуется таким образом, оно может быть и другим в случае достижения максимальной длины или конфликтов с именами пользовательских типов, начинающихся с подчёркивания. Поэтому полагаться на это соглашение в коде не рекомендуется. Вместо этого, имя типа массива, связанного с данным типом, следует определять по значению <structname>pg_type</structname>.<structfield>typarray</structfield>.

source: It may be advisable to avoid using type and table names that begin with underscore. While the server will change generated array type names to avoid collisions with user-given names, there is still risk of confusion, particularly with old client software that may assume that type names beginning with underscores always represent arrays.
ru: Вообще же можно посоветовать не использовать имена типов и таблиц, начинающиеся с подчёркивания. Хотя сервер сможет сгенерировать другое имя, не конфликтующее с пользовательским, некоторая путаница всё же возможна, особенно со старыми клиентскими приложениями, которые могут полагать, что имя типа, начинающееся с подчёркивания, всегда относится к типу массива.

source: Before <productname>PostgreSQL</productname> version 8.2, the shell-type creation syntax <literal>CREATE TYPE <replaceable>name</replaceable></literal> did not exist. The way to create a new base type was to create its input function first. In this approach, <productname>PostgreSQL</productname> will first see the name of the new data type as the return type of the input function. The shell type is implicitly created in this situation, and then it can be referenced in the definitions of the remaining I/O functions. This approach still works, but is deprecated and might be disallowed in some future release. Also, to avoid accidentally cluttering the catalogs with shell types as a result of simple typos in function definitions, a shell type will only be made this way when the input function is written in C.
ru: В <productname>PostgreSQL</productname> до версии 8.2 у <literal>CREATE TYPE <replaceable>name</replaceable></literal> отсутствовала форма для создания типа-пустышки. Поэтому для создания нового базового типа требовалось сначала создать функцию ввода. При таком подходе <productname>PostgreSQL</productname> воспринимал тип возврата функции ввода как имя нового типа данных и неявно создавал тип-пустышку, на который затем можно было ссылаться в определениях остальных функций ввода/вывода. Этот подход по-прежнему работает, но считается устаревшим и может быть запрещён в будущих версиях. Кроме того, во избежание непреднамеренного заполнения каталогов типами-пустышками, появляющимися в результате простых опечаток в определении функций, тип-пустышка будет создаваться таким образом, только если функция ввода написана на C.

source: In <productname>PostgreSQL</productname> versions before 7.3, it was customary to avoid creating a shell type at all, by replacing the functions' forward references to the type name with the placeholder pseudotype <type>opaque</type>. The <type>cstring</type> arguments and results also had to be declared as <type>opaque</type> before 7.3. To support loading of old dump files, <command>CREATE TYPE</command> will accept I/O functions declared using <type>opaque</type>, but it will issue a notice and change the function declarations to use the correct types.
ru: В <productname>PostgreSQL</productname> до версии 7.3 было принято вовсе не создавать тип-пустышку, заменяя в определении функций ссылки на ещё не созданный тип именем псевдотипа <type>opaque</type>. Аргументы <type>cstring</type> и результаты так же должны были объявляться как <type>opaque</type> до версии 7.3. Для поддержки загрузки старых файлов экспорта БД, <command>CREATE TYPE</command> примет ссылки на функции ввода/вывода, объявленные с типом <type>opaque</type>, но при этом выдаст замечание и изменит в объявлении функции псевдотип на правильный.

source: Examples
ru: Примеры

source: This example creates a composite type and uses it in a function definition: <placeholder-1/>
ru: В этом примере создаётся составной тип, а затем он используется в определении функции: <placeholder-1/>

source: This example creates an enumerated type and uses it in a table definition: <placeholder-1/>
ru: В этом примере создаётся тип-перечисление, а затем он используется в определении таблицы: <placeholder-1/>

source: This example creates a range type: <placeholder-1/>
ru: В этом примере создаётся тип-диапазон: <placeholder-1/>

source: This example creates the base data type <type>box</type> and then uses the type in a table definition: <placeholder-1/>
ru: В следующем примере создаётся базовый тип данных <type>box</type>, а затем он используется в определении таблицы: <placeholder-1/>

source: If the internal structure of <type>box</type> were an array of four <type>float4</type> elements, we might instead use: <placeholder-1/> which would allow a box value's component numbers to be accessed by subscripting. Otherwise the type behaves the same as before.
ru: Если бы внутренней структурой <type>box</type> был массив из четырёх элементов <type>float4</type>, вместо этого можно было бы использовать определение: <placeholder-1/> В таком случае к числам, составляющим значение этого типа, можно было бы обращаться по индексу. В остальном поведение этого типа будет таким же.

source: This example creates a large object type and uses it in a table definition: <placeholder-1/>
ru: В этом примере создаётся тип большого объекта, а затем он используется в определении таблицы: <placeholder-1/>

source: More examples, including suitable input and output functions, are in <xref linkend="xtypes"/>.
ru: Другие примеры, в том числе демонстрирующие подходящие функции ввода/вывода, можно найти в <xref remap="6" linkend="xtypes"/>.

source: Compatibility
ru: Совместимость

source: The first form of the <command>CREATE TYPE</command> command, which creates a composite type, conforms to the <acronym>SQL</acronym> standard. The other forms are <productname>PostgreSQL</productname> extensions. The <command>CREATE TYPE</command> statement in the <acronym>SQL</acronym> standard also defines other forms that are not implemented in <productname>PostgreSQL</productname>.
ru: Первая форма команды <command>CREATE TYPE</command>, создающая составной тип, соответствует стандарту <acronym>SQL</acronym>. Другие формы являются расширениями <productname>PostgreSQL</productname>. Для оператора <command>CREATE TYPE</command> в стандарте <acronym>SQL</acronym> также определены другие формы, не реализованные в <productname>PostgreSQL</productname>.

source: The ability to create a composite type with zero attributes is a <productname>PostgreSQL</productname>-specific deviation from the standard (analogous to the same case in <command>CREATE TABLE</command>).
ru: Возможность создавать составной тип без атрибутов — специфическое отклонение <productname>PostgreSQL</productname> от стандарта (как и аналогичная особенность команды <command>CREATE TABLE</command>).

source: See Also
ru: См. также
