Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_aggregate.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new aggregate function
ru: создать агрегатную функцию

source: name
ru: имя

source: argmode
ru: режим_аргумента

source: argname
ru: имя_аргумента

source: arg_data_type
ru: тип_данных_аргумента

source: sfunc
ru: функция_состояния

source: state_data_type
ru: тип_данных_состояния

source: state_data_size
ru: размер_данных_состояния

source: ffunc
ru: функция_завершения

source: combinefunc
ru: комбинирующая_функция

source: serialfunc
ru: функция_сериализации

source: deserialfunc
ru: функция_десериализации

source: initial_condition
ru: начальное_условие

source: msfunc
ru: функция_состояния_движ

source: minvfunc
ru: обратная_функция_движ

source: mstate_data_type
ru: тип_данных_состояния_движ

source: mstate_data_size
ru: размер_данных_состояния_движ

source: mffunc
ru: функция_завершения_движ

source: minitial_condition
ru: начальное_условие_движ

source: sort_operator
ru: оператор_сортировки

source: or the old syntax
ru: или старый синтаксис

source: base_type
ru: базовый_тип

source: Description
ru: Описание

source: <command>CREATE AGGREGATE</command> defines a new aggregate function. Some basic and commonly-used aggregate functions are included with the distribution; they are documented in <xref linkend="functions-aggregate"/>. If one defines new types or needs an aggregate function not already provided, then <command>CREATE AGGREGATE</command> can be used to provide the desired features.
ru: <command>CREATE AGGREGATE</command> создаёт новую агрегатную функцию. Некоторое количество базовых и часто используемых агрегатных функций включено в дистрибутив, они описаны в <xref remap="6" linkend="functions-aggregate"/>. Но если нужно адаптировать их к новым типам или создать недостающие агрегатные функции, это можно сделать с помощью команды <command>CREATE AGGREGATE</command>.

source: If a schema name is given (for example, <literal>CREATE AGGREGATE myschema.myagg ...</literal>) then the aggregate function is created in the specified schema. Otherwise it is created in the current schema.
ru: Если указывается имя схемы (например, <literal>CREATE AGGREGATE myschema.myagg ...</literal>), агрегатная функция создаётся в указанной схеме. В противном случае она создаётся в текущей схеме.

source: An aggregate function is identified by its name and input data type(s). Two aggregates in the same schema can have the same name if they operate on different input types. The name and input data type(s) of an aggregate must also be distinct from the name and input data type(s) of every ordinary function in the same schema. This behavior is identical to overloading of ordinary function names (see <xref linkend="sql-createfunction"/>).
ru: Агрегатная функция идентифицируется по имени и типам входных данных. Две агрегатных функции в одной схеме могут иметь одно имя, только если они работают с разными типами данных. Имя и тип(ы) входных данных агрегата не могут совпадать с именем и типами данных любой другой обычной функции в той же схеме. Это же правило действует при перегрузке имён обычных функций (см. <xref remap="4" linkend="sql-createfunction"/>).

source: <replaceable class="parameter">sfunc</replaceable>( internal-state, next-data-values ) ---&gt; next-internal-state <replaceable class="parameter">ffunc</replaceable>( internal-state ) ---&gt; aggregate-value
ru: <replaceable class="parameter">функция_состояния</replaceable>( внутреннее-состояние, следующие-значения-данных ) ---&gt; следующее-внутреннее-состояние <replaceable class="parameter">функция_завершения</replaceable>( внутреннее-состояние ) ---&gt; агрегатное_значение

source: A simple aggregate function is made from one or two ordinary functions: a state transition function <replaceable class="parameter">sfunc</replaceable>, and an optional final calculation function <replaceable class="parameter">ffunc</replaceable>. These are used as follows: <placeholder-1/>
ru: Простую агрегатную функцию образуют одна или две обычные функции: функция перехода состояния <replaceable class="parameter">функция_состояния</replaceable> и необязательная функция окончательного вычисления <replaceable class="parameter">функция_завершения</replaceable>. Они используются следующим образом: <placeholder-1/>

source: <productname>PostgreSQL</productname> creates a temporary variable of data type <replaceable class="parameter">stype</replaceable> to hold the current internal state of the aggregate. At each input row, the aggregate argument value(s) are calculated and the state transition function is invoked with the current state value and the new argument value(s) to calculate a new internal state value. After all the rows have been processed, the final function is invoked once to calculate the aggregate's return value. If there is no final function then the ending state value is returned as-is.
ru: <productname>PostgreSQL</productname> создаёт временную переменную типа <replaceable class="parameter">тип_данных_состояния</replaceable> для хранения текущего внутреннего состояния агрегата. Затем для каждой поступающей строки вычисляются значения аргументов агрегата и вызывается функция перехода состояния с текущим значением состояния и полученными аргументами; эта функция вычисляет следующее внутреннее состояние. Когда таким образом будут обработаны все строки, вызывается завершающая функция, которая должна вычислить возвращаемое значение агрегата. Если функция завершения отсутствует, просто возвращается конечное значение состояния.

source: An aggregate function can provide an initial condition, that is, an initial value for the internal state value. This is specified and stored in the database as a value of type <type>text</type>, but it must be a valid external representation of a constant of the state value data type. If it is not supplied then the state value starts out null.
ru: Агрегатная функция может определить начальное условие, то есть начальное значение для внутренней переменной состояния. Это значение задаётся и сохраняется в базе данных в виде строки типа <type>text</type>, но оно должно быть допустимым внешним представлением константы типа данных переменной состояния. По умолчанию начальным значением состояния считается NULL.

source: If the state transition function is declared <quote>strict</quote>, then it cannot be called with null inputs. With such a transition function, aggregate execution behaves as follows. Rows with any null input values are ignored (the function is not called and the previous state value is retained). If the initial state value is null, then at the first row with all-nonnull input values, the first argument value replaces the state value, and the transition function is invoked at each subsequent row with all-nonnull input values. This is handy for implementing aggregates like <function>max</function>. Note that this behavior is only available when <replaceable class="parameter">state_data_type</replaceable> is the same as the first <replaceable class="parameter">arg_data_type</replaceable>. When these types are different, you must supply a nonnull initial condition or use a nonstrict transition function.
ru: Если функция перехода состояния объявлена как <quote>strict</quote> (строгая), её нельзя вызывать с входными значениями NULL. В этом случае агрегатная функция выполняется следующим образом. Строки со значениями NULL игнорируются (функция перехода не вызывается и предыдущее значение состояния не меняется) и если начальное состояние равно NULL, то в первой же строке, в которой все входные значения не NULL, первый аргумент заменяет значение состояния, а функция перехода вызывается для каждой последующей строки, в которой все входные значения не NULL. Это поведение удобно для реализации таких агрегатных функций, как <function>max</function>. Заметьте, что такое поведение возможно, только если <replaceable class="parameter">тип_данных_состояния</replaceable> совпадает с первым <replaceable class="parameter">типом_данных_аргумента</replaceable>. Если же эти типы различаются, необходимо задать начальное условие не NULL или использовать нестрогую функцию перехода состояния.

source: If the state transition function is not strict, then it will be called unconditionally at each input row, and must deal with null inputs and null state values for itself. This allows the aggregate author to have full control over the aggregate's handling of null values.
ru: Если функция перехода состояния не является строгой, она вызывается безусловно для каждой поступающей строки и должна сама обрабатывать вводимые значения и переменную состояния, равные NULL. Это позволяет разработчику агрегатной функции полностью управлять тем, как она воспринимает значения NULL.

source: If the final function is declared <quote>strict</quote>, then it will not be called when the ending state value is null; instead a null result will be returned automatically. (Of course this is just the normal behavior of strict functions.) In any case the final function has the option of returning a null value. For example, the final function for <function>avg</function> returns null when it sees there were zero input rows.
ru: Если функция завершения объявлена как <quote>strict</quote> (строгая), она не будет вызвана при конечном значении состояния, равном NULL; вместо этого автоматически возвращается результат NULL. (Разумеется, это вполне нормальное поведение для строгих функций.) Когда функция завершения вызывается, она в любом случае может возвратить значение NULL. Например, функция завершения для <function>avg</function> возвращает NULL, если определяет, что было обработано ноль строк.

source: Sometimes it is useful to declare the final function as taking not just the state value, but extra parameters corresponding to the aggregate's input values. The main reason for doing this is if the final function is polymorphic and the state value's data type would be inadequate to pin down the result type. These extra parameters are always passed as NULL (and so the final function must not be strict when the <literal>FINALFUNC_EXTRA</literal> option is used), but nonetheless they are valid parameters. The final function could for example make use of <function>get_fn_expr_argtype</function> to identify the actual argument type in the current call.
ru: Иногда бывает полезно объявить функцию завершения как принимающую не только состояние, но и дополнительные параметры, соответствующие входным данным агрегата. В основном это имеет смысл для полиморфных функций завершения, которым может быть недостаточно знать тип данных только переменной состояния, чтобы вывести тип результата. Эти дополнительные параметры всегда передаются как NULL (так что функция завершения не должна быть строгой, когда применяется <literal>FINALFUNC_EXTRA</literal>), но в остальном это обычные параметры. Функция завершения может выяснить фактические типы аргументов в текущем вызове, воспользовавшись системным вызовом <function>get_fn_expr_argtype</function>.

source: An aggregate can optionally support <firstterm>moving-aggregate mode</firstterm>, as described in <xref linkend="xaggr-moving-aggregates"/>. This requires specifying the <literal>MSFUNC</literal>, <literal>MINVFUNC</literal>, and <literal>MSTYPE</literal> parameters, and optionally the <literal>MSPACE</literal>, <literal>MFINALFUNC</literal>, <literal>MFINALFUNC_EXTRA</literal>, and <literal>MINITCOND</literal> parameters. Except for <literal>MINVFUNC</literal>, these parameters work like the corresponding simple-aggregate parameters without <literal>M</literal>; they define a separate implementation of the aggregate that includes an inverse transition function.
ru: Агрегатная функция может дополнительно поддерживать <firstterm>режим движущегося агрегата</firstterm>, как описано в <xref remap="6" linkend="xaggr-moving-aggregates"/>. Для применения этого режима требуется указать параметры <literal>MSFUNC</literal>, <literal>MINVFUNC</literal> и <literal>MSTYPE</literal>, а также, возможно, параметры <literal>MSPACE</literal>, <literal>MFINALFUNC</literal>, <literal>MFINALFUNC_EXTRA</literal> и <literal>MINITCOND</literal>. За исключением <literal>MINVFUNC</literal>, эти параметры работают как соответствующие параметры простого агрегата без начальной буквы <literal>M</literal>; они определяют отдельную реализацию агрегата, включающую функцию обратного перехода.

source: The syntax with <literal>ORDER BY</literal> in the parameter list creates a special type of aggregate called an <firstterm>ordered-set aggregate</firstterm>; or if <literal>HYPOTHETICAL</literal> is specified, then a <firstterm>hypothetical-set aggregate</firstterm> is created. These aggregates operate over groups of sorted values in order-dependent ways, so that specification of an input sort order is an essential part of a call. Also, they can have <firstterm>direct</firstterm> arguments, which are arguments that are evaluated only once per aggregation rather than once per input row. Hypothetical-set aggregates are a subclass of ordered-set aggregates in which some of the direct arguments are required to match, in number and data types, the aggregated argument columns. This allows the values of those direct arguments to be added to the collection of aggregate-input rows as an additional <quote>hypothetical</quote> row.
ru: Если в список параметров добавлено указание <literal>ORDER BY</literal>, создаётся особый типа агрегата, называемый <firstterm>сортирующим агрегатом</firstterm>; с указанием <literal>HYPOTHETICAL</literal> создаётся <firstterm>гипотезирующий агрегат</firstterm>. Эти агрегаты работают с группами отсортированных значений и зависят от порядка сортировки, поэтому определение порядка сортировки входных данных является неотъемлемой частью их вызова. Кроме того, они могут иметь <firstterm>непосредственные</firstterm> аргументы, которые вычисляются единожды для всей процедуры агрегирования, а не для каждой поступающей строки. Гипотезирующие агрегаты представляют собой подкласс сортирующих агрегатов, в которых непосредственные аргументы должны совпадать, по количеству и типам данных, с агрегируемыми аргументами. Это позволяет добавить значения этих непосредственных аргументов в набор агрегируемых строк в качестве дополнительной <quote>гипотетической</quote> строки.

source: An aggregate can optionally support <firstterm>partial aggregation</firstterm>, as described in <xref linkend="xaggr-partial-aggregates"/>. This requires specifying the <literal>COMBINEFUNC</literal> parameter. If the <replaceable class="parameter">state_data_type</replaceable> is <type>internal</type>, it's usually also appropriate to provide the <literal>SERIALFUNC</literal> and <literal>DESERIALFUNC</literal> parameters so that parallel aggregation is possible. Note that the aggregate must also be marked <literal>PARALLEL SAFE</literal> to enable parallel aggregation.
ru: Агрегатная функция может дополнительно поддерживать <firstterm>частичное агрегирование</firstterm>, как описано в <xref remap="6" linkend="xaggr-partial-aggregates"/>. Для этого требуется задать параметр <literal>COMBINEFUNC</literal>. Если в качестве <replaceable class="parameter">типа_данных_состояния</replaceable> выбран <type>internal</type>, обычно уместно также задать <literal>SERIALFUNC</literal> и <literal>DESERIALFUNC</literal>, чтобы было возможно параллельное агрегирование. Заметьте, что для параллельного агрегирования агрегатная функция также должна быть помечена как <literal>PARALLEL SAFE</literal> (безопасная для распараллеливания).

source: Aggregates that behave like <function>MIN</function> or <function>MAX</function> can sometimes be optimized by looking into an index instead of scanning every input row. If this aggregate can be so optimized, indicate it by specifying a <firstterm>sort operator</firstterm>. The basic requirement is that the aggregate must yield the first element in the sort ordering induced by the operator; in other words: <placeholder-1/> must be equivalent to: <placeholder-2/> Further assumptions are that the aggregate ignores null inputs, and that it delivers a null result if and only if there were no non-null inputs. Ordinarily, a data type's <literal>&lt;</literal> operator is the proper sort operator for <function>MIN</function>, and <literal>&gt;</literal> is the proper sort operator for <function>MAX</function>. Note that the optimization will never actually take effect unless the specified operator is the <quote>less than</quote> or <quote>greater than</quote> strategy member of a B-tree index operator class.
ru: Агрегаты, работающие подобно <function>MIN</function> и <function>MAX</function>, иногда можно соптимизировать, заменив сканирование всех строк таблицы обращением к индексу. Если агрегат подлежит такой оптимизации, это можно указать, определив <firstterm>оператор сортировки</firstterm>. Основное требование при этом: агрегат должен выдавать в результате первый элемент по порядку сортировки, задаваемому оператором; другими словами: <placeholder-1/> должно быть равнозначно: <placeholder-2/> Дополнительно предполагается, что агрегат игнорирует значения NULL и возвращает NULL, только если строк со значениями не NULL не нашлось. Обычно оператор <literal>&lt;</literal> является подходящим оператором сортировки для <function>MIN</function>, а <literal>&gt;</literal> — для <function>MAX</function>. Заметьте, что обращение к индексу может дать эффект, только если заданный оператор реализует стратегию <quote>меньше</quote> или <quote>больше</quote> в классе операторов индекса-B-дерева.

source: To be able to create an aggregate function, you must have <literal>USAGE</literal> privilege on the argument types, the state type(s), and the return type, as well as <literal>EXECUTE</literal> privilege on the supporting functions.
ru: Чтобы создать агрегатную функцию, необходимо иметь право <literal>USAGE</literal> для типов аргументов, типа(ов) состояния и типа результата, а также право <literal>EXECUTE</literal> для опорных функций.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of the aggregate function to create.
ru: Имя (возможно, дополненное схемой) создаваемой агрегатной функции.

source: The mode of an argument: <literal>IN</literal> or <literal>VARIADIC</literal>. (Aggregate functions do not support <literal>OUT</literal> arguments.) If omitted, the default is <literal>IN</literal>. Only the last argument can be marked <literal>VARIADIC</literal>.
ru: Режим аргумента: <literal>IN</literal> или <literal>VARIADIC</literal>. (Агрегатные функции не поддерживают выходные аргументы (<literal>OUT</literal>).) По умолчанию подразумевается <literal>IN</literal>. Режим <literal>VARIADIC</literal> может быть указан только последним.

source: The name of an argument. This is currently only useful for documentation purposes. If omitted, the argument has no name.
ru: Имя аргумента. В настоящее время используется только в целях документирования. Если опущено, соответствующий аргумент будет безымянным.

source: An input data type on which this aggregate function operates. To create a zero-argument aggregate function, write <literal>*</literal> in place of the list of argument specifications. (An example of such an aggregate is <function>count(*)</function>.)
ru: Тип входных данных, с которым работает эта агрегатная функция. Для создания агрегатной функции без аргументов вставьте <literal>*</literal> вместо списка с определениями аргументов. (Пример такой агрегатной функции: <function>count(*)</function>.)

source: In the old syntax for <command>CREATE AGGREGATE</command>, the input data type is specified by a <literal>basetype</literal> parameter rather than being written next to the aggregate name. Note that this syntax allows only one input parameter. To define a zero-argument aggregate function with this syntax, specify the <literal>basetype</literal> as <literal>"ANY"</literal> (not <literal>*</literal>). Ordered-set aggregates cannot be defined with the old syntax.
ru: В прежнем синтаксисе <command>CREATE AGGREGATE</command> тип входных данных задавался параметром <literal>basetype</literal>, а не записывался после имени агрегата. Это позволяло указать только один входной параметр. Чтобы определить функцию без аргументов, используя этот синтаксис, в качестве значения <literal>basetype</literal> нужно указать <literal>"ANY"</literal> (не <literal>*</literal>). Создать сортирующий агрегат старый синтаксис не позволял.

source: The name of the state transition function to be called for each input row. For a normal <replaceable class="parameter">N</replaceable>-argument aggregate function, the <replaceable class="parameter">sfunc</replaceable> must take <replaceable class="parameter">N</replaceable>+1 arguments, the first being of type <replaceable class="parameter">state_data_type</replaceable> and the rest matching the declared input data type(s) of the aggregate. The function must return a value of type <replaceable class="parameter">state_data_type</replaceable>. This function takes the current state value and the current input data value(s), and returns the next state value.
ru: Имя функции перехода состояния, вызываемой для каждой входной строки. Для обычных агрегатных функций с <replaceable class="parameter">N</replaceable> аргументами, <replaceable class="parameter">функция_состояния</replaceable> должна принимать <replaceable class="parameter">N</replaceable>+1 аргумент, первый должен иметь тип <replaceable class="parameter">тип_данных_состояния</replaceable>, а остальные — типы соответствующих входных данных. Возвращать она должна значение типа <replaceable class="parameter">тип_данных_состояния</replaceable>. Эта функция принимает текущее значение состояния и текущие значения входных данных, и возвращает следующее значение состояния.

source: For ordered-set (including hypothetical-set) aggregates, the state transition function receives only the current state value and the aggregated arguments, not the direct arguments. Otherwise it is the same.
ru: В сортирующих (и в том числе, гипотезирующих) агрегатах функция перехода состояния получает только текущее значение состояния и агрегируемые аргументы, без непосредственных аргументов. Других отличий у неё нет.

source: The data type for the aggregate's state value.
ru: Тип данных значения состояния для агрегатной функции.

source: The approximate average size (in bytes) of the aggregate's state value. If this parameter is omitted or is zero, a default estimate is used based on the <replaceable>state_data_type</replaceable>. The planner uses this value to estimate the memory required for a grouped aggregate query. The planner will consider using hash aggregation for such a query only if the hash table is estimated to fit in <xref linkend="guc-work-mem"/>; therefore, large values of this parameter discourage use of hash aggregation.
ru: Средний размер значения состояния агрегата (в байтах). Если этот параметр опущен или равен нулю, применяемая оценка по умолчанию определяется по типу <replaceable>тип_данных_состояния</replaceable>. Планировщик использует это значение для оценивания объёма памяти, требуемому для агрегатного запроса с группировкой. Планировщик может применить агрегирование по хешу для такого запроса, только если хеш-таблица, судя по оценке, поместится в <xref linkend="guc-work-mem"/>; таким образом, при больших значениях этого параметра агрегирование по хешу будет менее желательным.
