Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_sequence.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new sequence generator
ru: создать генератор последовательности

source: name
ru: имя

source: increment
ru: шаг

source: minvalue
ru: мин_значение

source: maxvalue
ru: макс_значение

source: start
ru: начало

source: cache
ru: кеш

source: table_name
ru: имя_таблицы

source: column_name
ru: имя_столбца

source: Description
ru: Описание

source: <command>CREATE SEQUENCE</command> creates a new sequence number generator. This involves creating and initializing a new special single-row table with the name <replaceable class="parameter">name</replaceable>. The generator will be owned by the user issuing the command.
ru: <command>CREATE SEQUENCE</command> создаёт генератор последовательности. Эта операция включает создание и инициализацию специальной таблицы <replaceable class="parameter">имя</replaceable>, содержащей одну строку. Владельцем генератора будет пользователь, выполняющий эту команду.

source: If a schema name is given then the sequence is created in the specified schema. Otherwise it is created in the current schema. Temporary sequences exist in a special schema, so a schema name cannot be given when creating a temporary sequence. The sequence name must be distinct from the name of any other sequence, table, index, view, or foreign table in the same schema.
ru: Если указано имя схемы, последовательность создаётся в заданной схеме, в противном случае — в текущей. Временные последовательности существуют в специальной схеме, так что при создании таких последовательностей имя схемы задать нельзя. Имя последовательности должно отличаться от имён других последовательностей, таблиц, индексов, представлений или сторонних таблиц, уже существующих в этой схеме.

source: After a sequence is created, you use the functions <function>nextval</function>, <function>currval</function>, and <function>setval</function> to operate on the sequence. These functions are documented in <xref linkend="functions-sequence"/>.
ru: После создания последовательности работать с ней можно, вызывая функции <function>nextval</function>, <function>currval</function> и <function>setval</function>. Эти функции документированы в <xref remap="6" linkend="functions-sequence"/>.

source: Although you cannot update a sequence directly, you can use a query like: <placeholder-1/> to examine the parameters and current state of a sequence. In particular, the <literal>last_value</literal> field of the sequence shows the last value allocated by any session. (Of course, this value might be obsolete by the time it's printed, if other sessions are actively doing <function>nextval</function> calls.)
ru: Хотя непосредственно изменить значение последовательности нельзя, получить её параметры и текущее состояние можно таким запросом: <placeholder-1/> В частности, поле <literal>last_value</literal> последовательности будет содержать последнее значение, выделенное для какого-либо сеанса. (Конечно, ко времени вывода это значение может стать неактуальным, если другие сеансы активно вызывают <function>nextval</function>.)

source: Parameters
ru: Параметры

source: <literal>TEMPORARY</literal> or <literal>TEMP</literal>
ru: <literal>TEMPORARY</literal> или <literal>TEMP</literal>

source: If specified, the sequence object is created only for this session, and is automatically dropped on session exit. Existing permanent sequences with the same name are not visible (in this session) while the temporary sequence exists, unless they are referenced with schema-qualified names.
ru: Если указано, объект последовательности создаётся только для данного сеанса и автоматически удаляется при завершении сеанса. Существующая постоянная последовательность с тем же именем не будут видна (в этом сеансе), пока существует временная, однако к ней можно обратиться, дополнив имя указанием схемы.

source: Do not throw an error if a relation with the same name already exists. A notice is issued in this case. Note that there is no guarantee that the existing relation is anything like the sequence that would have been created - it might not even be a sequence.
ru: Не считать ошибкой, если отношение с таким именем уже существует. В этом случае будет выдано замечание. Заметьте, что нет никакой гарантии, что существующее отношение как-то соотносится с последовательностью, которая могла бы быть создана — это может быть даже не последовательность.

source: The name (optionally schema-qualified) of the sequence to be created.
ru: Имя (возможно, дополненное схемой) создаваемой последовательности.

source: The optional clause <literal>INCREMENT BY <replaceable class="parameter">increment</replaceable></literal> specifies which value is added to the current sequence value to create a new value. A positive value will make an ascending sequence, a negative one a descending sequence. The default value is 1.
ru: Необязательное предложение <literal>INCREMENT BY <replaceable class="parameter">шаг</replaceable></literal> определяет, какое число будет добавляться к текущему значению последовательности для получения нового значения. С положительным шагом последовательность будет возрастающей, а с отрицательным — убывающей. Значение по умолчанию: 1.

source: The optional clause <literal>MINVALUE <replaceable class="parameter">minvalue</replaceable></literal> determines the minimum value a sequence can generate. If this clause is not supplied or <option>NO MINVALUE</option> is specified, then defaults will be used. The defaults are 1 and -2<superscript>63</superscript>-1 for ascending and descending sequences, respectively.
ru: Необязательное предложение <literal>MINVALUE <replaceable class="parameter">мин_значение</replaceable></literal> определяет наименьшее число, которое будет генерировать последовательность. Если это предложение опущено, либо указано <option>NO MINVALUE</option>, используется значение по умолчанию: 1 и -2<superscript>63</superscript>-1 для возрастающих и убывающих последовательностей, соответственно.

source: The optional clause <literal>MAXVALUE <replaceable class="parameter">maxvalue</replaceable></literal> determines the maximum value for the sequence. If this clause is not supplied or <option>NO MAXVALUE</option> is specified, then default values will be used. The defaults are 2<superscript>63</superscript>-1 and -1 for ascending and descending sequences, respectively.
ru: Необязательное предложение <literal>MAXVALUE <replaceable class="parameter">макс_значение</replaceable></literal> определяет наибольшее значение. Если это предложение опущено, либо указано <option>NO MAXVALUE</option>, используется значение по умолчанию: 2<superscript>63</superscript>-1 и -1 для возрастающих и убывающих последовательностей, соответственно.

source: The optional clause <literal>START WITH <replaceable class="parameter">start</replaceable></literal> allows the sequence to begin anywhere. The default starting value is <replaceable class="parameter">minvalue</replaceable> for ascending sequences and <replaceable class="parameter">maxvalue</replaceable> for descending ones.
ru: Необязательное предложение <literal>START WITH <replaceable class="parameter">начало</replaceable></literal> позволяет запустить последовательность с любого значения. По умолчанию началом считается <replaceable class="parameter">мин_значение</replaceable> для возрастающих последовательностей и <replaceable class="parameter">макс_значение</replaceable> для убывающих.

source: The optional clause <literal>CACHE <replaceable class="parameter">cache</replaceable></literal> specifies how many sequence numbers are to be preallocated and stored in memory for faster access. The minimum value is 1 (only one value can be generated at a time, i.e., no cache), and this is also the default.
ru: Необязательное предложение <literal>CACHE <replaceable class="parameter">кеш</replaceable></literal> определяет, сколько чисел последовательности будет выделяться и сохраняться в памяти для ускорения доступа к ним. Минимальное значение равно 1 (за один раз генерируется только одно значение, т. е. кеширования нет), и оно же предполагается по умолчанию.

source: The <literal>CYCLE</literal> option allows the sequence to wrap around when the <replaceable class="parameter">maxvalue</replaceable> or <replaceable class="parameter">minvalue</replaceable> has been reached by an ascending or descending sequence respectively. If the limit is reached, the next number generated will be the <replaceable class="parameter">minvalue</replaceable> or <replaceable class="parameter">maxvalue</replaceable>, respectively.
ru: Параметр <literal>CYCLE</literal> позволяет зациклить последовательность при достижении <replaceable class="parameter">макс_значения</replaceable> или <replaceable class="parameter">мин_значения</replaceable> для возрастающей или убывающей последовательности, соответственно. Когда этот предел достигается, следующим числом этих последовательностей будет соответственно <replaceable class="parameter">мин_значение</replaceable> или <replaceable class="parameter">макс_значение</replaceable>.

source: If <literal>NO CYCLE</literal> is specified, any calls to <function>nextval</function> after the sequence has reached its maximum value will return an error. If neither <literal>CYCLE</literal> or <literal>NO CYCLE</literal> are specified, <literal>NO CYCLE</literal> is the default.
ru: Если указывается <literal>NO CYCLE</literal>, при каждом вызове <function>nextval</function> после достижения предельного значения будет возникать ошибка. Если указания <literal>CYCLE</literal> и <literal>NO CYCLE</literal> отсутствуют, по умолчанию предполагается <literal>NO CYCLE</literal>.

source: <literal>OWNED BY</literal> <replaceable class="parameter">table_name</replaceable>.<replaceable class="parameter">column_name</replaceable>
ru: <literal>OWNED BY</literal> <replaceable class="parameter">имя_таблицы</replaceable>.<replaceable class="parameter">имя_столбца</replaceable>

source: The <literal>OWNED BY</literal> option causes the sequence to be associated with a specific table column, such that if that column (or its whole table) is dropped, the sequence will be automatically dropped as well. The specified table must have the same owner and be in the same schema as the sequence. <literal>OWNED BY NONE</literal>, the default, specifies that there is no such association.
ru: Предложение <literal>OWNED BY</literal> позволяет связать последовательность с определённым столбцом таблицы так, чтобы при удалении этого столбца (или всей таблицы) последовательность удалялась автоматически. Указанная таблица должна иметь того же владельца и находиться в той же схеме, что и последовательность. Подразумеваемое по умолчанию предложение <literal>OWNED BY NONE</literal> указывает, что такая связь не устанавливается.

source: Notes
ru: Замечания

source: Use <command>DROP SEQUENCE</command> to remove a sequence.
ru: Для удаления последовательности применяется команда <command>DROP SEQUENCE</command>.

source: Sequences are based on <type>bigint</type> arithmetic, so the range cannot exceed the range of an eight-byte integer (-9223372036854775808 to 9223372036854775807).
ru: Последовательности основаны на арифметике <type>bigint</type>, так что их значения не могут выходить за диапазон восьмибайтовых целых (-9223372036854775808 .. 9223372036854775807).

source: Because <function>nextval</function> and <function>setval</function> calls are never rolled back, sequence objects cannot be used if <quote>gapless</quote> assignment of sequence numbers is needed. It is possible to build gapless assignment by using exclusive locking of a table containing a counter; but this solution is much more expensive than sequence objects, especially if many transactions need sequence numbers concurrently.
ru: Так как вызовы <function>nextval</function> и <function>setval</function> никогда не откатываются, объекты последовательностей не подходят, если требуется обеспечить непрерывное назначение номеров последовательностей. Непрерывное назначение можно организовать, используя исключительную блокировку таблицы со счётчиком; однако это решение будет гораздо дороже, чем применение объектов последовательностей, особенно когда последовательные номера будут затребоваться сразу многими транзакциями.

source: Unexpected results might be obtained if a <replaceable class="parameter">cache</replaceable> setting greater than one is used for a sequence object that will be used concurrently by multiple sessions. Each session will allocate and cache successive sequence values during one access to the sequence object and increase the sequence object's <literal>last_value</literal> accordingly. Then, the next <replaceable class="parameter">cache</replaceable>-1 uses of <function>nextval</function> within that session simply return the preallocated values without touching the sequence object. So, any numbers allocated but not used within a session will be lost when that session ends, resulting in <quote>holes</quote> in the sequence.
ru: Если значение параметра <replaceable class="parameter">кеш</replaceable> больше единицы, и объект последовательности используется параллельно в нескольких сеансах, результат может оказаться не вполне ожидаемым. Каждый сеанс будет выделять и кешировать несколько очередных значений последовательности при одном обращении к объекту последовательности и соответственно увеличивать <literal>последнее_значение</literal> этого объекта. Затем при следующих <replaceable class="parameter">кеш</replaceable>-1 вызовах <function>nextval</function> в этом сеансе будет просто возвращать заготовленные значения, не касаясь объекта последовательности. В результате, все числа, выделенные, но не использованные в сеансе, будут потеряны при завершении сеанса, что приведёт к образовании <quote>дырок</quote> в последовательности.

source: Furthermore, although multiple sessions are guaranteed to allocate distinct sequence values, the values might be generated out of sequence when all the sessions are considered. For example, with a <replaceable class="parameter">cache</replaceable> setting of 10, session A might reserve values 1..10 and return <function>nextval</function>=1, then session B might reserve values 11..20 and return <function>nextval</function>=11 before session A has generated <literal>nextval</literal>=2. Thus, with a <replaceable class="parameter">cache</replaceable> setting of one it is safe to assume that <function>nextval</function> values are generated sequentially; with a <replaceable class="parameter">cache</replaceable> setting greater than one you should only assume that the <function>nextval</function> values are all distinct, not that they are generated purely sequentially. Also, <literal>last_value</literal> will reflect the latest value reserved by any session, whether or not it has yet been returned by <function>nextval</function>.
ru: Более того, хотя разным сеансам гарантированно выделяются различные значения последовательности, если рассмотреть все сеансы в целом, порядок этих значений может быть нарушен. Например, при значении <replaceable class="parameter">кеш</replaceable>, равном 10, сеанс A может зарезервировать значения 1..10 и получить <function>nextval</function>=1, затем сеанс B может зарезервировать значения 11..20 и получить <function>nextval</function>=11 до того, как в сеансе A сгенерируется <literal>nextval</literal>=2. Таким образом, при значении <replaceable class="parameter">кеш</replaceable>, равном одному, можно быть уверенными в том, что <function>nextval</function> генерирует последовательные значения; но если <replaceable class="parameter">кеш</replaceable> больше одного, рассчитывать можно только на то, что все значения <function>nextval</function> различны; их порядок может быть непоследовательным. Кроме того, <literal>last_value</literal> возвращает последнее зарезервированное значение для всех сеансов, вне зависимости от того, было ли оно уже возвращено функцией <function>nextval</function>.

source: Another consideration is that a <function>setval</function> executed on such a sequence will not be noticed by other sessions until they have used up any preallocated values they have cached.
ru: Также следует учитывать, что действие функции <function>setval</function>, выполненной для такой последовательности, проявится в других сеансах только после того, как в них будут использованы все предварительно закешированные значения.

source: Examples
ru: Примеры

source: Create an ascending sequence called <literal>serial</literal>, starting at 101: <placeholder-1/>
ru: Создание возрастающей последовательности с именем <literal>serial</literal>, с начальным значением 101: <placeholder-1/>

source: Select the next number from this sequence: <placeholder-1/>
ru: Получение следующего номера этой последовательности: <placeholder-1/>

source: Use this sequence in an <command>INSERT</command> command: <placeholder-1/>
ru: Использование этой последовательности в команде <command>INSERT</command>: <placeholder-1/>

source: Update the sequence value after a <command>COPY FROM</command>: <placeholder-1/>
ru: Изменение значения последовательности после <command>COPY FROM</command>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The standard's <literal>AS &lt;data type&gt;</literal> expression is not supported.
ru: Описанное в стандарте выражение <literal>AS &lt;тип данных&gt;</literal> не поддерживается.

source: Obtaining the next value is done using the <function>nextval()</function> function instead of the standard's <command>NEXT VALUE FOR</command> expression.
ru: Для получения следующего значения применяется функция <function>nextval()</function>, а не выражение <command>NEXT VALUE FOR</command>, как того требует стандарт.

source: The <literal>OWNED BY</literal> clause is a <productname>PostgreSQL</productname> extension.
ru: Предложение <literal>OWNED BY</literal> является расширением <productname>PostgreSQL</productname>.

source: <command>CREATE SEQUENCE</command> conforms to the <acronym>SQL</acronym> standard, with the following exceptions: <placeholder-1/>
ru: Команда <command>CREATE SEQUENCE</command> соответствует стандарту <acronym>SQL</acronym>, со следующими исключениями: <placeholder-1/>

source: See Also
ru: См. также
