Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_trigger.po
Languages: ru

source: SQL allows you to define aliases for the <quote>old</quote> and <quote>new</quote> rows or tables for use in the definition of the triggered action (e.g., <literal>CREATE TRIGGER ... ON tablename REFERENCING OLD ROW AS somename NEW ROW AS othername ...</literal>). Since <productname>PostgreSQL</productname> allows trigger procedures to be written in any number of user-defined languages, access to the data is handled in a language-specific way.
ru: SQL позволяет определить синонимы для строк <quote>old</quote> и <quote>new</quote> или таблиц, которые затем можно будет использовать в определении действия триггера (например, <literal>CREATE TRIGGER ... ON имя_таблицы REFERENCING OLD ROW AS некоторое_имя NEW ROW AS другое_имя...</literal>). <productname>PostgreSQL</productname> позволяет писать процедуры триггеров на различных языках, так что механизм доступа к данным зависит от конкретного языка.

source: <productname>PostgreSQL</productname> does not allow the old and new tables to be referenced in statement-level triggers, i.e., the tables that contain all the old and/or new rows, which are referred to by the <literal>OLD TABLE</literal> and <literal>NEW TABLE</literal> clauses in the <acronym>SQL</acronym> standard.
ru: <productname>PostgreSQL</productname> не позволяет обращаться к старой и новой таблице в триггерах на уровне оператора, т. е. к таблицам, содержащим все старые и/или новые строки, обозначаемые как <literal>OLD TABLE</literal> и <literal>NEW TABLE</literal> в стандарте <acronym>SQL</acronym>.

source: <productname>PostgreSQL</productname> only allows the execution of a user-defined function for the triggered action. The standard allows the execution of a number of other SQL commands, such as <command>CREATE TABLE</command>, as the triggered action. This limitation is not hard to work around by creating a user-defined function that executes the desired commands.
ru: <productname>PostgreSQL</productname> позволяет задать в качестве действия триггера только функцию, определённую пользователем. Стандарт допускает также выполнение ряда других команд SQL, например, <command>CREATE TABLE</command>. Однако это ограничение несложно преодолеть, создав пользовательскую функцию, выполняющую требуемые команды.

source: The <command>CREATE TRIGGER</command> statement in <productname>PostgreSQL</productname> implements a subset of the <acronym>SQL</acronym> standard. The following functionalities are currently missing: <placeholder-1/>
ru: Оператор <command>CREATE TRIGGER</command> в <productname>PostgreSQL</productname> реализует подмножество возможностей, описанных в стандарте <acronym>SQL</acronym>. В настоящее время в нём отсутствует следующая функциональность: <placeholder-1/>

source: SQL specifies that multiple triggers should be fired in time-of-creation order. <productname>PostgreSQL</productname> uses name order, which was judged to be more convenient.
ru: В стандарте SQL определено, что несколько триггеров должны срабатывать по порядку создания. <productname>PostgreSQL</productname> упорядочивает их по именам, так как это было признано более удобным.

source: SQL specifies that <literal>BEFORE DELETE</literal> triggers on cascaded deletes fire <emphasis>after</emphasis> the cascaded <literal>DELETE</literal> completes. The <productname>PostgreSQL</productname> behavior is for <literal>BEFORE DELETE</literal> to always fire before the delete action, even a cascading one. This is considered more consistent. There is also nonstandard behavior if <literal>BEFORE</literal> triggers modify rows or prevent updates during an update that is caused by a referential action. This can lead to constraint violations or stored data that does not honor the referential constraint.
ru: В стандарте SQL определено, что триггеры <literal>BEFORE DELETE</literal> при каскадном удалении срабатывают <emphasis>после</emphasis> завершения каскадного <literal>DELETE</literal>. В <productname>PostgreSQL</productname> триггеры <literal>BEFORE DELETE</literal> всегда срабатывают перед операцией удаления, даже если она каскадная. Это поведение выбрано как более логичное. Ещё одно отклонение от стандарта проявляется, когда триггеры <literal>BEFORE</literal>, срабатывающие в результате ссылочной операции, изменяют строки или не дают выполнить изменение. Это может привести к нарушению ограничений или сохранению данных, не соблюдающих ссылочную целостность.

source: The ability to specify multiple actions for a single trigger using <literal>OR</literal> is a <productname>PostgreSQL</productname> extension of the SQL standard.
ru: Возможность задать несколько действий для одного триггера с помощью ключевого слова <literal>OR</literal> — реализованное в <productname>PostgreSQL</productname> расширение стандарта SQL.

source: The ability to fire triggers for <command>TRUNCATE</command> is a <productname>PostgreSQL</productname> extension of the SQL standard, as is the ability to define statement-level triggers on views.
ru: Возможность вызывать триггеры для <command>TRUNCATE</command> — реализованное в <productname>PostgreSQL</productname> расширение стандарта SQL, как и возможность определять триггеры на уровне оператора для представлений.

source: <command>CREATE CONSTRAINT TRIGGER</command> is a <productname>PostgreSQL</productname> extension of the <acronym>SQL</acronym> standard.
ru: <command>CREATE CONSTRAINT TRIGGER</command> — реализованное в <productname>PostgreSQL</productname> расширение стандарта <acronym>SQL</acronym>.

source: See Also
ru: См. также
