Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_opclass.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new operator class
ru: создать класс операторов

source: index_method
ru: метод_индекса

source: family_name
ru: имя_семейства

source: strategy_number
ru: номер_стратегии

source: operator_name
ru: имя_оператора

source: op_type
ru: тип_операнда

source: sort_family_name
ru: семейство_сортировки

source: support_number
ru: номер_опорной_функции

source: function_name
ru: имя_функции

source: argument_type
ru: тип_аргумента

source: storage_type
ru: тип_хранения

source: Description
ru: Описание

source: <command>CREATE OPERATOR CLASS</command> creates a new operator class. An operator class defines how a particular data type can be used with an index. The operator class specifies that certain operators will fill particular roles or <quote>strategies</quote> for this data type and this index method. The operator class also specifies the support procedures to be used by the index method when the operator class is selected for an index column. All the operators and functions used by an operator class must be defined before the operator class can be created.
ru: <command>CREATE OPERATOR CLASS</command> создаёт класс операторов. Класс операторов устанавливает, как данный тип будет использоваться в индексе, определяя, какие операторы исполняют конкретные роли или <quote>стратегии</quote> для этого типа данных и метода индекса. Также класс операторов определяет вспомогательные процедуры, которые будет задействовать метод индекса в случае выбора данного класса для столбца индекса. Все операторы и функции, используемые классом операторов, должны существовать до создания этого класса.

source: If a schema name is given then the operator class is created in the specified schema. Otherwise it is created in the current schema. Two operator classes in the same schema can have the same name only if they are for different index methods.
ru: Если указывается имя схемы, класс операторов создаётся в указанной схеме, в противном случае — в текущей. Два класса операторов в одной схеме могут иметь одинаковые имена, только если они предназначены для разных методов индекса.

source: The user who defines an operator class becomes its owner. Presently, the creating user must be a superuser. (This restriction is made because an erroneous operator class definition could confuse or even crash the server.)
ru: Владельцем класса операторов становится пользователь, создавший его. В настоящее время создавать классы операторов могут только суперпользователи. (Это ограничение введено потому, что ошибочное определение класса может вызвать нарушения или даже сбой в работе сервера.)

source: <command>CREATE OPERATOR CLASS</command> does not presently check whether the operator class definition includes all the operators and functions required by the index method, nor whether the operators and functions form a self-consistent set. It is the user's responsibility to define a valid operator class.
ru: <command>CREATE OPERATOR CLASS</command> в настоящее время не проверяет, включает ли определение класса операторов все операторы и функции, требуемые для метода индекса, и образуют ли они целостный набор. Ответственность за правильность определения класса операторов лежит на пользователе.

source: Related operator classes can be grouped into <firstterm>operator families</firstterm>. To add a new operator class to an existing family, specify the <literal>FAMILY</literal> option in <command>CREATE OPERATOR CLASS</command>. Without this option, the new class is placed into a family named the same as the new class (creating that family if it doesn't already exist).
ru: Связанные классы операторов могут быть сгруппированы в <firstterm>семейства операторов</firstterm>. Чтобы поместить класс в существующее семейство, добавьте параметр <literal>FAMILY</literal> в <command>CREATE OPERATOR CLASS</command>. Без этого параметра новый класс помещается в семейство, имеющее то же имя, что и класс (если такое семейство не существует, оно создаётся).

source: Refer to <xref linkend="xindex"/> for further information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="xindex"/>.

source: Parameters
ru: Параметры

source: The name of the operator class to be created. The name can be schema-qualified.
ru: Имя создаваемого класса операторов, возможно, дополненное схемой.

source: If present, the operator class will become the default operator class for its data type. At most one operator class can be the default for a specific data type and index method.
ru: Если присутствует это указание, класс операторов становится классом по умолчанию для своего типа данных. Для определённого типа данных и метода индекса можно определить не больше одного класса операторов по умолчанию.

source: The column data type that this operator class is for.
ru: Тип данных столбца, для которого предназначен этот класс операторов.

source: The name of the index method this operator class is for.
ru: Имя индексного метода, для которого предназначен этот класс операторов.

source: The name of the existing operator family to add this operator class to. If not specified, a family named the same as the operator class is used (creating it, if it doesn't already exist).
ru: Имя существующего семейства операторов, в которое будет добавлен этот класс. Если не указано, подразумевается семейство с тем же именем, что и класс (если такое семейство не существует, оно создаётся).

source: The index method's strategy number for an operator associated with the operator class.
ru: Номер стратегии индексного метода для оператора, связанного с данным классом операторов.

source: The name (optionally schema-qualified) of an operator associated with the operator class.
ru: Имя (возможно, дополненное схемой) оператора, связанного с данным классом операторов.

source: In an <literal>OPERATOR</literal> clause, the operand data type(s) of the operator, or <literal>NONE</literal> to signify a left-unary or right-unary operator. The operand data types can be omitted in the normal case where they are the same as the operator class's data type.
ru: В предложении <literal>OPERATOR</literal> это тип данных операнда, либо ключевое слово <literal>NONE</literal>, характеризующее левый унарный или правый унарный оператор. Типы операндов обычно можно опустить, когда они совпадают с типом данных класса операторов.

source: In a <literal>FUNCTION</literal> clause, the operand data type(s) the function is intended to support, if different from the input data type(s) of the function (for B-tree comparison functions and hash functions) or the class's data type (for B-tree sort support functions and all functions in GiST, SP-GiST, GIN and BRIN operator classes). These defaults are correct, and so <replaceable class="parameter">op_type</replaceable> need not be specified in <literal>FUNCTION</literal> clauses, except for the case of a B-tree sort support function that is meant to support cross-data-type comparisons.
ru: В предложении <literal>FUNCTION</literal> это тип данных операнда, который должна поддерживать эта функция, если он отличается от входного типа данных функции (для функций сравнения в B-деревьях и хеш-функций) или типа данных класса (для функций поддержки сортировки в B-деревьях и всех функций в классах операторов GiST, SP-GiST, GIN и BRIN). Обычно предполагаемые по умолчанию типы оказываются верными, так что <replaceable class="parameter">тип_операнда</replaceable> указывать в <literal>FUNCTION</literal> не нужно, кроме функций сортировки B-дерева, предназначенных для сравнений разных типов данных.

source: The name (optionally schema-qualified) of an existing <literal>btree</literal> operator family that describes the sort ordering associated with an ordering operator.
ru: Имя (возможно, дополненное схемой) существующего семейства операторов <literal>btree</literal>, описывающего порядок сортировки, связанный с оператором сортировки.

source: If neither <literal>FOR SEARCH</literal> nor <literal>FOR ORDER BY</literal> is specified, <literal>FOR SEARCH</literal> is the default.
ru: Если не указано ни <literal>FOR SEARCH</literal> (для поиска), ни <literal>FOR ORDER BY</literal> (для сортировки), подразумевается <literal>FOR SEARCH</literal>.

source: The index method's support procedure number for a function associated with the operator class.
ru: Номер опорной процедуры индексного метода для функции, связанной с данным классом операторов.

source: The name (optionally schema-qualified) of a function that is an index method support procedure for the operator class.
ru: Имя (возможно, дополненное схемой) функции, которая является опорной процедурой индексного метода для данного класса операторов.

source: The parameter data type(s) of the function.
ru: Тип данных параметра функции.

source: The data type actually stored in the index. Normally this is the same as the column data type, but some index methods (currently GiST, GIN and BRIN) allow it to be different. The <literal>STORAGE</literal> clause must be omitted unless the index method allows a different type to be used.
ru: Тип данных, фактически сохраняемых в индексе. Обычно это тип данных столбца, но некоторые методы индекса (в настоящее время, GiST, GIN и BRIN) могут работать с отличным от него типом. Предложение <literal>STORAGE</literal> может присутствовать, только если метод индекса позволяет использовать другой тип данных.

source: The <literal>OPERATOR</literal>, <literal>FUNCTION</literal>, and <literal>STORAGE</literal> clauses can appear in any order.
ru: Предложения <literal>OPERATOR</literal>, <literal>FUNCTION</literal> и <literal>STORAGE</literal> могут указываться в любом порядке.

source: Because the index machinery does not check access permissions on functions before using them, including a function or operator in an operator class is tantamount to granting public execute permission on it. This is usually not an issue for the sorts of functions that are useful in an operator class.
ru: Так как механизмы индексов не проверяют права доступа к функциям, прежде чем вызывать их, включение функций или операторов в класс операторов по сути даёт всем право на выполнение их. Обычно это не проблема для таких функций, какие бывают полезны в классе операторов.

source: The operators should not be defined by SQL functions. A SQL function is likely to be inlined into the calling query, which will prevent the optimizer from recognizing that the query matches an index.
ru: Операторы не должны реализовываться в функциях на языке SQL. SQL-функция вероятнее всего будет встроена в вызывающий запрос, что помешает оптимизатору понять, что этот запрос соответствует индексу.

source: Before <productname>PostgreSQL</productname> 8.4, the <literal>OPERATOR</literal> clause could include a <literal>RECHECK</literal> option. This is no longer supported because whether an index operator is <quote>lossy</quote> is now determined on-the-fly at run time. This allows efficient handling of cases where an operator might or might not be lossy.
ru: До <productname>PostgreSQL</productname> 8.4 предложение <literal>OPERATOR</literal> могло включать указание <literal>RECHECK</literal>. Теперь это не поддерживается, так как оператор индекса может быть <quote>неточным</quote> и это определяется на ходу в момент выполнения. Это позволяет эффективно справляться с ситуациями, когда оператор может быть или не быть неточным.

source: Examples
ru: Примеры

source: The following example command defines a GiST index operator class for the data type <literal>_int4</literal> (array of <type>int4</type>). See the <xref linkend="intarray"/> module for the complete example.
ru: Команда в следующем примере определяет класс операторов индекса GiST для типа данных <literal>_int4</literal> (массива из <type>int4</type>). Полный пример приведён в модуле <xref linkend="intarray"/>.

source: Compatibility
ru: Совместимость

source: <command>CREATE OPERATOR CLASS</command> is a <productname>PostgreSQL</productname> extension. There is no <command>CREATE OPERATOR CLASS</command> statement in the SQL standard.
ru: <command>CREATE OPERATOR CLASS</command> является расширением <productname>PostgreSQL</productname>. Команда <command>CREATE OPERATOR CLASS</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
