Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_operator.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new operator
ru: создать оператор

source: name
ru: имя

source: function_name
ru: имя_функции

source: left_type
ru: тип_слева

source: right_type
ru: тип_справа

source: com_op
ru: коммут_оператор

source: neg_op
ru: обратный_оператор

source: res_proc
ru: процедура_ограничения

source: join_proc
ru: процедура_соединения

source: Description
ru: Описание

source: <command>CREATE OPERATOR</command> defines a new operator, <replaceable class="parameter">name</replaceable>. The user who defines an operator becomes its owner. If a schema name is given then the operator is created in the specified schema. Otherwise it is created in the current schema.
ru: <command>CREATE OPERATOR</command> определяет новый оператор, <replaceable class="parameter">имя</replaceable>. Владельцем оператора становится пользователь, его создавший. Если указано имя схемы, оператор создаётся в ней, в противном случае — в текущей схеме.

source: <literal>--</literal> and <literal>/*</literal> cannot appear anywhere in an operator name, since they will be taken as the start of a comment.
ru: Сочетания символов <literal>--</literal> и <literal>/*</literal> не могут присутствовать в имени оператора, так как они будут обозначать начало комментария.

source: A multicharacter operator name cannot end in <literal>+</literal> or <literal>-</literal>, unless the name also contains at least one of these characters: <literallayout> ~ ! @ # % ^ &amp; | ` ? </literallayout> For example, <literal>@-</literal> is an allowed operator name, but <literal>*-</literal> is not. This restriction allows <productname>PostgreSQL</productname> to parse SQL-compliant commands without requiring spaces between tokens.
ru: Многосимвольное имя оператора не может заканчиваться знаком <literal>+</literal> или <literal>-</literal>, если только оно не содержит также один из этих символов: <literallayout> ~ ! @ # % ^ &amp; | ` ? </literallayout> Например, <literal>@-</literal> — допустимое имя оператора, а <literal>*-</literal> — нет. Благодаря этому ограничению, <productname>PostgreSQL</productname> может разбирать корректные SQL-запросы без пробелов между компонентами.

source: The use of <literal>=&gt;</literal> as an operator name is deprecated. It may be disallowed altogether in a future release.
ru: Использование <literal>=&gt;</literal> в качестве имени оператора считается устаревшим и может быть вовсе запрещено в будущих выпусках.

source: The operator name is a sequence of up to <symbol>NAMEDATALEN</symbol>-1 (63 by default) characters from the following list: <literallayout> + - * / &lt; &gt; = ~ ! @ # % ^ &amp; | ` ? </literallayout> There are a few restrictions on your choice of name: <placeholder-1/>
ru: Имя оператора образует последовательность из нескольких символов (не более чем <symbol>NAMEDATALEN</symbol>-1, по умолчанию 63) из следующего списка: <literallayout> + - * / &lt; &gt; = ~ ! @ # % ^ &amp; | ` ? </literallayout> Однако выбор имени ограничен ещё следующими условиями: <placeholder-1/>

source: The operator <literal>!=</literal> is mapped to <literal>&lt;&gt;</literal> on input, so these two names are always equivalent.
ru: Оператор <literal>!=</literal> отображается в <literal>&lt;&gt;</literal> при вводе, так что эти два имени всегда равнозначны.

source: At least one of <literal>LEFTARG</literal> and <literal>RIGHTARG</literal> must be defined. For binary operators, both must be defined. For right unary operators, only <literal>LEFTARG</literal> should be defined, while for left unary operators only <literal>RIGHTARG</literal> should be defined.
ru: Необходимо определить либо <literal>LEFTARG</literal>, либо <literal>RIGHTARG</literal>, а для бинарных операторов оба аргумента. Для правых унарных операторов должен быть определён только <literal>LEFTARG</literal>, а для левых унарных — только <literal>RIGHTARG</literal>.

source: The <replaceable class="parameter">function_name</replaceable> procedure must have been previously defined using <command>CREATE FUNCTION</command> and must be defined to accept the correct number of arguments (either one or two) of the indicated types.
ru: Процедура <replaceable class="parameter">имя_функции</replaceable> должна быть уже определена с помощью <command>CREATE FUNCTION</command> и иметь соответствующее число аргументов (один или два) указанных типов.

source: The other clauses specify optional operator optimization clauses. Their meaning is detailed in <xref linkend="xoper-optimization"/>.
ru: Другие предложения определяют дополнительные характеристики оптимизации. Их значение описано в <xref remap="6" linkend="xoper-optimization"/>.

source: To be able to create an operator, you must have <literal>USAGE</literal> privilege on the argument types and the return type, as well as <literal>EXECUTE</literal> privilege on the underlying function. If a commutator or negator operator is specified, you must own these operators.
ru: Чтобы создать оператор, необходимо иметь право <literal>USAGE</literal> для типов аргументов и результата, а также право <literal>EXECUTE</literal> для нижележащей функции. Если указывается коммутативный или обратный оператор, нужно быть его владельцем.

source: Parameters
ru: Параметры

source: The name of the operator to be defined. See above for allowable characters. The name can be schema-qualified, for example <literal>CREATE OPERATOR myschema.+ (...)</literal>. If not, then the operator is created in the current schema. Two operators in the same schema can have the same name if they operate on different data types. This is called <firstterm>overloading</firstterm>.
ru: Имя определяемого оператора. Допустимые в нём символы перечислены ниже. Указанное имя может быть дополнено схемой, например так: <literal>CREATE OPERATOR myschema.+ (...)</literal>. Если схема не указана, оператор создаётся в текущей схеме. При этом два оператора в одной схеме могут иметь одно имя, если они работают с разными типами данных. Такое определение операторов называется <firstterm>перегрузкой</firstterm>.

source: The function used to implement this operator.
ru: Функция, реализующая этот оператор.

source: The data type of the operator's left operand, if any. This option would be omitted for a left-unary operator.
ru: Тип данных левого операнда оператора, если он есть. Этот параметр опускается для левых унарных операторов.

source: The data type of the operator's right operand, if any. This option would be omitted for a right-unary operator.
ru: Тип данных правого операнда оператора, если он есть. Этот параметр опускается для правых унарных операторов.

source: The commutator of this operator.
ru: Оператор, коммутирующий для данного.

source: The negator of this operator.
ru: Оператор, обратный для данного.

source: The restriction selectivity estimator function for this operator.
ru: Функция оценки избирательности ограничения для данного оператора.

source: The join selectivity estimator function for this operator.
ru: Функция оценки избирательности соединения для этого оператора.

source: Indicates this operator can support a hash join.
ru: Показывает, что этот оператор поддерживает соединение по хешу.

source: Indicates this operator can support a merge join.
ru: Показывает, что этот оператор поддерживает соединение слиянием.

source: To give a schema-qualified operator name in <replaceable class="parameter">com_op</replaceable> or the other optional arguments, use the <literal>OPERATOR()</literal> syntax, for example: <placeholder-1/>
ru: Чтобы задать имя оператора с указанием схемы в <replaceable class="parameter">коммут_оператор</replaceable> или другом дополнительном аргументе, применяется синтаксис <literal>OPERATOR()</literal>, например: <placeholder-1/>

source: Notes
ru: Замечания

source: Refer to <xref linkend="xoper"/> for further information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="xoper"/>.

source: It is not possible to specify an operator's lexical precedence in <command>CREATE OPERATOR</command>, because the parser's precedence behavior is hard-wired. See <xref linkend="sql-precedence"/> for precedence details.
ru: Задать лексический приоритет оператора в команде <command>CREATE OPERATOR</command> невозможно, так как обработка приоритетов жёстко зашита в анализаторе. Подробнее приоритеты описаны в <xref remap="6" linkend="sql-precedence"/>.

source: The obsolete options <literal>SORT1</literal>, <literal>SORT2</literal>, <literal>LTCMP</literal>, and <literal>GTCMP</literal> were formerly used to specify the names of sort operators associated with a merge-joinable operator. This is no longer necessary, since information about associated operators is found by looking at B-tree operator families instead. If one of these options is given, it is ignored except for implicitly setting <literal>MERGES</literal> true.
ru: Устаревшие параметры <literal>SORT1</literal>, <literal>SORT2</literal>, <literal>LTCMP</literal> и <literal>GTCMP</literal> ранее использовались для определения имён операторов сортировки, связанных с оператором, применяемым при соединении слиянием. Теперь это не требуется, так как информацию о связанных операторах теперь дают семейства операторов B-дерева. Если в команде отсутствует явное указание <literal>MERGES</literal>, все эти параметры игнорируются.

source: Use <xref linkend="sql-dropoperator"/> to delete user-defined operators from a database. Use <xref linkend="sql-alteroperator"/> to modify operators in a database.
ru: Для удаления пользовательских операторов из базы данных применяется <xref linkend="sql-dropoperator"/>, а для изменения их свойств — <xref linkend="sql-alteroperator"/>.

source: Examples
ru: Примеры

source: The following command defines a new operator, area-equality, for the data type <type>box</type>: <placeholder-1/>
ru: Следующая команда определяет новый оператор, проверяющий равенство площадей, для типа <type>box</type>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE OPERATOR</command> is a <productname>PostgreSQL</productname> extension. There are no provisions for user-defined operators in the SQL standard.
ru: <command>CREATE OPERATOR</command> является языковым расширением <productname>PostgreSQL</productname>. Средства определения пользовательских операторов в стандарте SQL не описаны.

source: See Also
ru: См. также
