Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_type.po
Languages: ru

source: The optional <replaceable class="parameter">analyze_function</replaceable> performs type-specific statistics collection for columns of the data type. By default, <command>ANALYZE</command> will attempt to gather statistics using the type's <quote>equals</quote> and <quote>less-than</quote> operators, if there is a default b-tree operator class for the type. For non-scalar types this behavior is likely to be unsuitable, so it can be overridden by specifying a custom analysis function. The analysis function must be declared to take a single argument of type <type>internal</type>, and return a <type>boolean</type> result. The detailed API for analysis functions appears in <filename>src/include/commands/vacuum.h</filename>.
ru: Необязательная <replaceable class="parameter">функция_анализа</replaceable> выполняет сбор специфической для этого типа статистики в столбцах с таким типом данных. По умолчанию <command>ANALYZE</command> пытается собрать статистику, используя операторы <quote>равно</quote> и <quote>меньше</quote>, если для этого типа определён класс операторов B-дерева по умолчанию. Для нескалярных типов это поведение скорее всего не подойдёт, поэтому его можно переопределить, задав собственную функцию анализа. Эта функция должна принимать единственный аргумент типа <type>internal</type> и возвращать результат <type>boolean</type>. Более глубоко API функций анализа описан в <filename>src/include/commands/vacuum.h</filename>.

source: While the details of the new type's internal representation are only known to the I/O functions and other functions you create to work with the type, there are several properties of the internal representation that must be declared to <productname>PostgreSQL</productname>. Foremost of these is <replaceable class="parameter">internallength</replaceable>. Base data types can be fixed-length, in which case <replaceable class="parameter">internallength</replaceable> is a positive integer, or variable-length, indicated by setting <replaceable class="parameter">internallength</replaceable> to <literal>VARIABLE</literal>. (Internally, this is represented by setting <literal>typlen</literal> to -1.) The internal representation of all variable-length types must start with a 4-byte integer giving the total length of this value of the type. (Note that the length field is often encoded, as described in <xref linkend="storage-toast"/>; it's unwise to access it directly.)
ru: Если особенности внутреннего представления нового типа известны функциям ввода/вывода и другим функциям, созданным специально для работы с этим типом, необходимо определить ряд характеристик внутреннего представления, о которых должен знать <productname>PostgreSQL</productname>. В первую очередь это <replaceable class="parameter">internallength</replaceable> (внутренняя длина). Если базовый тип данных имеет фиксированную длину, в <replaceable class="parameter">internallength</replaceable> указывается эта длина в виде положительного числа, а если длина переменная, в <replaceable class="parameter">internallength</replaceable> задаётся значение <literal>VARIABLE</literal>. (Внутри при этом <literal>typlen</literal> принимает значение -1.) Внутреннее представление всех типов переменной длины должно начинаться с 4-байтового целого, задающего общую длину значения этого типа. (Заметьте, что поле длины часто кодируется, как описано в <xref remap="6" linkend="storage-toast"/>; обращаться к нему напрямую неразумно.)

source: The optional flag <literal>PASSEDBYVALUE</literal> indicates that values of this data type are passed by value, rather than by reference. Types passed by value must be fixed-length, and their internal representation cannot be larger than the size of the <type>Datum</type> type (4 bytes on some machines, 8 bytes on others).
ru: Необязательный флаг <literal>PASSEDBYVALUE</literal> указывает, что значения этого типа данных передаются по значению, а не по ссылке. Типы, передаваемые по значению, должны быть фиксированной длины и их внутреннее представление не может быть больше размера типа <type>Datum</type> (4 байта на одних машинах, 8 — на других).

source: The <replaceable class="parameter">alignment</replaceable> parameter specifies the storage alignment required for the data type. The allowed values equate to alignment on 1, 2, 4, or 8 byte boundaries. Note that variable-length types must have an alignment of at least 4, since they necessarily contain an <type>int4</type> as their first component.
ru: Параметр <replaceable class="parameter">выравнивание</replaceable> определяет, как требуется выравнивать данные этого типа. Допускается выравнивание по границам 1, 2, 4 или 8 байт. Заметьте, что типы переменной длины должны быть выровнены как минимум по границе 4 байт, так как их первым компонентом обязательно должен быть <type>int4</type>.

source: The <replaceable class="parameter">storage</replaceable> parameter allows selection of storage strategies for variable-length data types. (Only <literal>plain</literal> is allowed for fixed-length types.) <literal>plain</literal> specifies that data of the type will always be stored in-line and not compressed. <literal>extended</literal> specifies that the system will first try to compress a long data value, and will move the value out of the main table row if it's still too long. <literal>external</literal> allows the value to be moved out of the main table, but the system will not try to compress it. <literal>main</literal> allows compression, but discourages moving the value out of the main table. (Data items with this storage strategy might still be moved out of the main table if there is no other way to make a row fit, but they will be kept in the main table preferentially over <literal>extended</literal> and <literal>external</literal> items.)
ru: Параметр <replaceable class="parameter">хранение</replaceable> позволяет выбрать стратегию хранения для типов данных переменной длины. (Для типов с фиксированной длиной поддерживается только вариант <literal>plain</literal>.) Если выбрана стратегия <literal>plain</literal>, данные этого типа всегда хранятся внутри, без сжатия. Со стратегией <literal>extended</literal> система сначала попытается сжать большое значение, а затем выносит его из строки основной таблицы, если оно всё же окажется слишком большим. С <literal>external</literal> значение может быть вынесено из основной таблицы, но система не будет пытаться сжать его. Стратегия <literal>main</literal> позволяет сжать данные, но не стремится вынести их из основной таблицы. (Элементы данных с этой стратегией хранения, тем не менее, могут быть вынесены из основной таблицы, если другого способа уместить их в строке нет, но всё же она отдаёт большее предпочтение основной таблице, по сравнению со стратегиями <literal>extended</literal> и <literal>external</literal>.)

source: All <replaceable class="parameter">storage</replaceable> values other than <literal>plain</literal> imply that the functions of the data type can handle values that have been <firstterm>toasted</firstterm>, as described in <xref linkend="storage-toast"/> and <xref linkend="xtypes-toast"/>. The specific other value given merely determines the default TOAST storage strategy for columns of a toastable data type; users can pick other strategies for individual columns using <literal>ALTER TABLE SET STORAGE</literal>.
ru: Значения <replaceable class="parameter">storage</replaceable>, отличные от <literal>plain</literal>, подразумевают, что функции типа данных могут принимать значения в формате <firstterm>toast</firstterm>, описанном в <xref remap="6" linkend="storage-toast"/> и <xref remap="6" linkend="xtypes-toast"/>. Эти значения просто определяют стратегию хранения TOAST по умолчанию для столбцов отделяемого в TOAST типа данных; пользователи могут выбирать другие стратегии для отдельных столбцов, применяя команду <literal>ALTER TABLE SET STORAGE</literal>.

source: The <replaceable class="parameter">like_type</replaceable> parameter provides an alternative method for specifying the basic representation properties of a data type: copy them from some existing type. The values of <replaceable class="parameter">internallength</replaceable>, <replaceable class="parameter">passedbyvalue</replaceable>, <replaceable class="parameter">alignment</replaceable>, and <replaceable class="parameter">storage</replaceable> are copied from the named type. (It is possible, though usually undesirable, to override some of these values by specifying them along with the <literal>LIKE</literal> clause.) Specifying representation this way is especially useful when the low-level implementation of the new type <quote>piggybacks</quote> on an existing type in some fashion.
ru: Параметр <replaceable class="parameter">тип_образец</replaceable> позволяет задать основные свойства представления типа другим способом: скопировать их из существующего типа. В частности, из указанного типа будут скопированы свойства <replaceable class="parameter">internallength</replaceable>, <replaceable class="parameter">passedbyvalue</replaceable>, <replaceable class="parameter">alignment</replaceable> и <replaceable class="parameter">storage</replaceable>. (Также возможно, хотя обычно это не требуется, переопределить некоторые из этих значений, указав их вместе с предложением <literal>LIKE</literal>.) Определять представление типа таким образом особенно удобно, когда низкоуровневая реализация нового типа некоторым образом опирается на существующий тип.

source: The <replaceable class="parameter">category</replaceable> and <replaceable class="parameter">preferred</replaceable> parameters can be used to help control which implicit cast will be applied in ambiguous situations. Each data type belongs to a category named by a single ASCII character, and each type is either <quote>preferred</quote> or not within its category. The parser will prefer casting to preferred types (but only from other types within the same category) when this rule is helpful in resolving overloaded functions or operators. For more details see <xref linkend="typeconv"/>. For types that have no implicit casts to or from any other types, it is sufficient to leave these settings at the defaults. However, for a group of related types that have implicit casts, it is often helpful to mark them all as belonging to a category and select one or two of the <quote>most general</quote> types as being preferred within the category. The <replaceable class="parameter">category</replaceable> parameter is especially useful when adding a user-defined type to an existing built-in category, such as the numeric or string types. However, it is also possible to create new entirely-user-defined type categories. Select any ASCII character other than an upper-case letter to name such a category.
ru: Параметры <replaceable class="parameter">категория</replaceable> и <replaceable class="parameter">предпочитаемый</replaceable> позволяют определять, какое неявное приведение будет применяться в неоднозначных ситуациях. Каждый тип данных принадлежит к некоторой категории, обозначаемой одним символом ASCII, при этом он может быть, либо не быть <quote>предпочитаемым</quote> в этой категории. Анализатор запроса по возможности выберет приведение к предпочитаемому типу (но только среди других типов той же категории), когда это может помочь разрешить имя перегруженной функции или оператора. За дополнительными подробностями обратитесь к <xref remap="3" linkend="typeconv"/>. Если для типа не определено неявное приведение к какому-либо другому типу или обратное, для этих параметров достаточно оставить значения по умолчанию. Однако если есть группа связанных типов, для которых определены неявные приведения, часто бывает полезно пометить их все как принадлежащие некоторой категории и назначить один или два <quote>наиболее общих</quote> предпочитаемыми в этой категории. Параметр <replaceable class="parameter">категория</replaceable> особенно полезен при добавлении типа, определённого пользователем, в существующую встроенную категорию, например, в категорию числовых или строковых типов. Однако так же возможно создать категории типов, полностью определённые пользователем. В качестве имени такой категории можно выбрать любой ASCII-символ, кроме латинской заглавной буквы.

source: A default value can be specified, in case a user wants columns of the data type to default to something other than the null value. Specify the default with the <literal>DEFAULT</literal> key word. (Such a default can be overridden by an explicit <literal>DEFAULT</literal> clause attached to a particular column.)
ru: Если пользователь хочет назначить столбцам с этим типом данных значение по умолчанию, отличное от NULL, он может задать его в этой команде, указав его после ключевого слова <literal>DEFAULT</literal>. (Такое значение по умолчанию можно переопределить явным предложением <literal>DEFAULT</literal>, добавленным при создании столбца.)

source: To indicate that a type is an array, specify the type of the array elements using the <literal>ELEMENT</literal> key word. For example, to define an array of 4-byte integers (<type>int4</type>), specify <literal>ELEMENT = int4</literal>. More details about array types appear below.
ru: Чтобы обозначить, что тип является массивом, укажите тип элементов массива, добавив ключевое слово <literal>ELEMENT</literal>. Например, чтобы определить массив из четырёхбайтовых целых (<type>int4</type>), укажите <literal>ELEMENT = int4</literal>. Дополнительные сведения о типах массивов приведены ниже.

source: To indicate the delimiter to be used between values in the external representation of arrays of this type, <replaceable class="parameter">delimiter</replaceable> can be set to a specific character. The default delimiter is the comma (<literal>,</literal>). Note that the delimiter is associated with the array element type, not the array type itself.
ru: Параметр <replaceable class="parameter">delimiter</replaceable> позволяет задать разделитель, который будет вставляться между значениями во внешнем представлении массива с элементами этого типа. По умолчанию разделителем является запятая (<literal>,</literal>). Заметьте, что разделитель связывается с типом элементов массива, а не с типом самого массива.

source: If the optional Boolean parameter <replaceable class="parameter">collatable</replaceable> is true, column definitions and expressions of the type may carry collation information through use of the <literal>COLLATE</literal> clause. It is up to the implementations of the functions operating on the type to actually make use of the collation information; this does not happen automatically merely by marking the type collatable.
ru: Если необязательный логический параметр <replaceable class="parameter">сортируемый</replaceable> равен true, определения столбцов и выражения с этим типом могут включать указания о порядке сортировки, в предложении <literal>COLLATE</literal>. Как именно будут использоваться эти указания, зависит от реализации функций, работающих с этим типом; эти указания не действуют автоматически просто от того, что тип помечен как сортируемый.

source: Array Types
ru: Типы массивов

source: Whenever a user-defined type is created, <productname>PostgreSQL</productname> automatically creates an associated array type, whose name consists of the element type's name prepended with an underscore, and truncated if necessary to keep it less than <symbol>NAMEDATALEN</symbol> bytes long. (If the name so generated collides with an existing type name, the process is repeated until a non-colliding name is found.) This implicitly-created array type is variable length and uses the built-in input and output functions <literal>array_in</literal> and <literal>array_out</literal>. The array type tracks any changes in its element type's owner or schema, and is dropped if the element type is.
ru: При создании любого нового типа <productname>PostgreSQL</productname> автоматически создаёт соответствующий тип массива, имя которого он получает, добавляя подчёркивание перед именем типа элементов. Если полученное имя оказывается не короче <symbol>NAMEDATALEN</symbol> байт, оно усекается. (Если полученное таким образом имя конфликтует с именем уже существующего типа, процесс повторяется, пока не будет получено уникальное имя.) Этот неявно создаваемый тип массива имеет переменную длину и использует встроенные функции ввода и вывода <literal>array_in</literal> и <literal>array_out</literal>. Тип массива отражает любые изменения владельца или схемы связанного типа элемента и удаляется сам при удалении типа элемента.

source: You might reasonably ask why there is an <option>ELEMENT</option> option, if the system makes the correct array type automatically. The only case where it's useful to use <option>ELEMENT</option> is when you are making a fixed-length type that happens to be internally an array of a number of identical things, and you want to allow these things to be accessed directly by subscripting, in addition to whatever operations you plan to provide for the type as a whole. For example, type <type>point</type> is represented as just two floating-point numbers, which can be accessed using <literal>point[0]</literal> and <literal>point[1]</literal>. Note that this facility only works for fixed-length types whose internal form is exactly a sequence of identical fixed-length fields. A subscriptable variable-length type must have the generalized internal representation used by <literal>array_in</literal> and <literal>array_out</literal>. For historical reasons (i.e., this is clearly wrong but it's far too late to change it), subscripting of fixed-length array types starts from zero, rather than from one as for variable-length arrays.
ru: Вы можете вполне резонно спросить, зачем нужен параметр <option>ELEMENT</option>, если система создаёт правильный тип массива автоматически. Единственный случай, когда параметр <option>ELEMENT</option> может быть полезен, это когда вы создаёте тип фиксированной длины, который внутри оказывается массивом одинаковых элементов, и вы хотите, чтобы к этим элементам можно было обращаться по индексу, помимо того, что вы можете реализовать какие угодно операции с типом в целом. Например, тип <type>point</type> представлен просто как два числа с плавающей точкой, к которым можно обратиться так: <literal>point[0]</literal> и <literal>point[1]</literal>. Заметьте, что это работает только с типами фиксированной длины, которые представляют собой в точности последовательность одинаковых полей фиксированной длины. Тип массива переменной длины должен иметь обобщённое внутреннее представление, с которым умеют работать <literal>array_in</literal> и <literal>array_out</literal>. По историческим причинам (т. е. это определённо некорректно, но менять уже слишком поздно), индексы в массивах фиксированной длины начинаются с нуля, а не с 1, как в массивах переменной длины.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of a type to be created.
ru: Имя (возможно, дополненное схемой) создаваемого типа.

source: The name of an attribute (column) for the composite type.
ru: Имя атрибута (столбца) составного типа.

source: The name of an existing data type to become a column of the composite type.
ru: Имя существующего типа данных, который станет типом столбца составного типа.

source: The name of an existing collation to be associated with a column of a composite type, or with a range type.
ru: Имя существующего правила сортировки, связываемого со столбцом составного типа или с типом-диапазоном.

source: A string literal representing the textual label associated with one value of an enum type.
ru: Строковая константа, представляющая текстовую метку, связанную с отдельным значением типа-перечисления.

source: The name of the element type that the range type will represent ranges of.
ru: Имя типа элемента, множество значений которого будет представлять тип-диапазон.

source: The name of a b-tree operator class for the subtype.
ru: Имя класса операторов B-дерева для подтипа.

source: The name of the canonicalization function for the range type.
ru: Имя функции канонизации для типа-диапазона.

source: The name of a difference function for the subtype.
ru: Имя функции разницы для значений подтипа.

source: The name of a function that converts data from the type's external textual form to its internal form.
ru: Имя функции, преобразующей данные из внешнего текстового представления типа во внутреннюю форму.

source: The name of a function that converts data from the type's internal form to its external textual form.
ru: Имя функции, преобразующей данные из внутренней формы во внешнее текстовое представление типа.

source: The name of a function that converts data from the type's external binary form to its internal form.
ru: Имя функции, преобразующей данные из внешнего двоичного представления типа во внутреннюю форму.

source: The name of a function that converts data from the type's internal form to its external binary form.
ru: Имя функции, преобразующей данные из внутренней формы во внешнее двоичное представление типа.

source: The name of a function that converts an array of modifier(s) for the type into internal form.
ru: Имя функции, преобразующей массив модификаторов типа во внутреннюю форму.

source: The name of a function that converts the internal form of the type's modifier(s) to external textual form.
ru: Имя функции, преобразующей внутреннюю форму модификаторов типа во внешнее текстовое представление.

source: The name of a function that performs statistical analysis for the data type.
ru: Имя функции, производящей статистический анализ типа данных.

source: A numeric constant that specifies the length in bytes of the new type's internal representation. The default assumption is that it is variable-length.
ru: Числовая константа, задающая размер внутреннего представления нового типа в байтах. По умолчанию предполагается, что тип имеет переменную длину.

source: The storage alignment requirement of the data type. If specified, it must be <literal>char</literal>, <literal>int2</literal>, <literal>int4</literal>, or <literal>double</literal>; the default is <literal>int4</literal>.
ru: Требуемое выравнивание для типа данных. Допустимые значения этого параметра, если он указывается: <literal>char</literal>, <literal>int2</literal>, <literal>int4</literal> или <literal>double</literal>; по умолчанию подразумевается <literal>int4</literal>.

source: The storage strategy for the data type. If specified, must be <literal>plain</literal>, <literal>external</literal>, <literal>extended</literal>, or <literal>main</literal>; the default is <literal>plain</literal>.
ru: Стратегия хранения для типа данных. Допустимые значения этого параметра, если он указывается: <literal>plain</literal>, <literal>external</literal>, <literal>extended</literal> или <literal>main</literal>; по умолчанию подразумевается <literal>plain</literal>.
