Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_rule.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new rewrite rule
ru: создать правило перезаписи

source: condition
ru: условие

source: where <placeholder-1/> can be one of:
ru: Здесь допускается <placeholder-1/>:

source: Description
ru: Описание

source: <command>CREATE RULE</command> defines a new rule applying to a specified table or view. <command>CREATE OR REPLACE RULE</command> will either create a new rule, or replace an existing rule of the same name for the same table.
ru: <command>CREATE RULE</command> создаёт правило, применяемое к указанной таблице или представлению. <command>CREATE OR REPLACE RULE</command> либо создаёт новое правило, либо заменяет существующее с тем же именем для той же таблицы.

source: The <productname>PostgreSQL</productname> rule system allows one to define an alternative action to be performed on insertions, updates, or deletions in database tables. Roughly speaking, a rule causes additional commands to be executed when a given command on a given table is executed. Alternatively, an <literal>INSTEAD</literal> rule can replace a given command by another, or cause a command not to be executed at all. Rules are used to implement SQL views as well. It is important to realize that a rule is really a command transformation mechanism, or command macro. The transformation happens before the execution of the command starts. If you actually want an operation that fires independently for each physical row, you probably want to use a trigger, not a rule. More information about the rules system is in <xref linkend="rules"/>.
ru: Система правил <productname>PostgreSQL</productname> позволяет определить альтернативное действие, заменяющее операции добавления, изменения или удаления данных в таблицах базы данных. Грубо говоря, правило описывает дополнительные команды, которые будут выполняться при вызове определённой команды для определённой таблицы. Кроме того, правило <literal>INSTEAD</literal> может заменить заданную команду другой, либо сделать, чтобы она не выполнялась вовсе. Правила также применяются для реализации SQL-запросов. Важно понимать, что правило это фактически механизм преобразования команд (макрос). Заданное преобразование имеет место до начала выполнения команды. Когда требуется выполнить некоторую операцию независимо для каждой физической строки, скорее всего, для этого нужно применять триггер, а не правило. Более подробно о системе правил можно узнать в <xref remap="6" linkend="rules"/>.

source: Presently, <literal>ON SELECT</literal> rules must be unconditional <literal>INSTEAD</literal> rules and must have actions that consist of a single <command>SELECT</command> command. Thus, an <literal>ON SELECT</literal> rule effectively turns the table into a view, whose visible contents are the rows returned by the rule's <command>SELECT</command> command rather than whatever had been stored in the table (if anything). It is considered better style to write a <command>CREATE VIEW</command> command than to create a real table and define an <literal>ON SELECT</literal> rule for it.
ru: В настоящее время правила <literal>ON SELECT</literal> должны быть безусловными, с характеристикой <literal>INSTEAD</literal> (вместо исходного), и их действия должны состоять из единственной команды <command>SELECT</command>. Таким образом, правило <literal>ON SELECT</literal> по сути превращает таблицу в представление, чьим видимым содержимым являются строки, возвращаемые командой <command>SELECT</command>, заданной в правиле, а не данные, хранящиеся в таблице (если они есть). Вообще же для этой цели лучшим стилем считается пользоваться командой <command>CREATE VIEW</command>, а не создавать реальную таблицу и определять затем правило <literal>ON SELECT</literal> для неё.

source: You can create the illusion of an updatable view by defining <literal>ON INSERT</literal>, <literal>ON UPDATE</literal>, and <literal>ON DELETE</literal> rules (or any subset of those that's sufficient for your purposes) to replace update actions on the view with appropriate updates on other tables. If you want to support <command>INSERT RETURNING</command> and so on, then be sure to put a suitable <literal>RETURNING</literal> clause into each of these rules.
ru: С помощью правил можно создать иллюзию изменяемого представления, определив правила <literal>ON INSERT</literal>, <literal>ON UPDATE</literal> и <literal>ON DELETE</literal> (либо только те, которых достаточно для решения поставленной задачи) и заменив операции изменения данных в представлении соответствующими действиями с другими таблицами. Если требуется поддерживать оператор <command>INSERT RETURNING</command> и подобные ему, в каждое из этих правило обязательно нужно поместить подходящее предложение <literal>RETURNING</literal>.

source: There is a catch if you try to use conditional rules for complex view updates: there <emphasis>must</emphasis> be an unconditional <literal>INSTEAD</literal> rule for each action you wish to allow on the view. If the rule is conditional, or is not <literal>INSTEAD</literal>, then the system will still reject attempts to perform the update action, because it thinks it might end up trying to perform the action on the dummy table of the view in some cases. If you want to handle all the useful cases in conditional rules, add an unconditional <literal>DO INSTEAD NOTHING</literal> rule to ensure that the system understands it will never be called on to update the dummy table. Then make the conditional rules non-<literal>INSTEAD</literal>; in the cases where they are applied, they add to the default <literal>INSTEAD NOTHING</literal> action. (This method does not currently work to support <literal>RETURNING</literal> queries, however.)
ru: Использование правил с условиями для сложных изменений представлений связано с одним ограничением: для каждого действия, которое вы хотите разрешить для представления, <emphasis>необходимо</emphasis> определить безусловное правило <literal>INSTEAD</literal>. Если определено только условное правило, или правило не типа <literal>INSTEAD</literal>, система отвергнет попытки выполнить изменения, предполагая, что в некоторых случаях изменения могут свестись к операциям с фиктивной нижележащей таблицей. При желании обработать все полезные случаи изменений в условных правилах, добавьте безусловное правило <literal>DO INSTEAD NOTHING</literal>, чтобы система понимала, что ей никогда не придётся изменять нижележащую таблицу. Затем создайте условные правила без свойства <literal>INSTEAD</literal>; в тех случаях, когда они будут применяться, их действия будут добавлены к действию по умолчанию <literal>INSTEAD NOTHING</literal>. (Однако, этот способ в настоящее время не подходит для реализации запросов <literal>RETURNING</literal>.)

source: A view that is simple enough to be automatically updatable (see <xref linkend="sql-createview"/>) does not require a user-created rule in order to be updatable. While you can create an explicit rule anyway, the automatic update transformation will generally outperform an explicit rule.
ru: Представления, достаточно простые для реализации автоматического обновления (см. <xref remap="4" linkend="sql-createview"/>), могут быть изменяемыми без пользовательских правил. Хотя вы, тем не менее, можете создать явное правило, обычно автоматическое преобразование будет работать лучше такого правила.

source: Another alternative worth considering is to use <literal>INSTEAD OF</literal> triggers (see <xref linkend="sql-createtrigger"/>) in place of rules.
ru: Другая, заслуживающая рассмотрения, альтернатива правилам — триггеры <literal>INSTEAD OF</literal> (см. <xref remap="4" linkend="sql-createtrigger"/>).

source: Parameters
ru: Параметры

source: The name of a rule to create. This must be distinct from the name of any other rule for the same table. Multiple rules on the same table and same event type are applied in alphabetical name order.
ru: Имя создаваемого правила. Оно должно отличаться от имён любых других правил для той же таблицы. При наличии нескольких правил для одной таблицы и одного типа события они применяются в алфавитном порядке.

source: The event is one of <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, or <literal>DELETE</literal>. Note that an <command>INSERT</command> containing an <literal>ON CONFLICT</literal> clause cannot be used on tables that have either <literal>INSERT</literal> or <literal>UPDATE</literal> rules. Consider using an updatable view instead.
ru: Тип события: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal> или <literal>DELETE</literal>. Заметьте, что команду <command>INSERT</command> с предложением <literal>ON CONFLICT</literal> нельзя использовать с таблицами, для которых определены правила <literal>INSERT</literal> или <literal>UPDATE</literal>. В этом случае подумайте о применении изменяемых представлений.

source: The name (optionally schema-qualified) of the table or view the rule applies to.
ru: Имя (возможно, дополненное схемой) существующей таблицы (или представления), к которой применяется это правило.

source: Any <acronym>SQL</acronym> conditional expression (returning <type>boolean</type>). The condition expression cannot refer to any tables except <literal>NEW</literal> and <literal>OLD</literal>, and cannot contain aggregate functions.
ru: Любое выражение условия <acronym>SQL</acronym> (возвращающее <type>boolean</type>). Это выражение не может ссылаться на какие-либо таблицы, кроме как на <literal>NEW</literal> и <literal>OLD</literal>, и не может содержать агрегатные функции.

source: <literal>INSTEAD</literal> indicates that the commands should be executed <emphasis>instead of</emphasis> the original command.
ru: <literal>INSTEAD</literal> указывает, что заданные команды должны выполняться <emphasis>вместо</emphasis> исходной команды.

source: <literal>ALSO</literal> indicates that the commands should be executed <emphasis>in addition to</emphasis> the original command.
ru: <literal>ALSO</literal> указывает, что заданные команды должны выполняться <emphasis>в дополнение к</emphasis> исходной команде.

source: If neither <literal>ALSO</literal> nor <literal>INSTEAD</literal> is specified, <literal>ALSO</literal> is the default.
ru: Если ни <literal>ALSO</literal>, ни <literal>INSTEAD</literal> не указано, по умолчанию подразумевается <literal>ALSO</literal>.

source: The command or commands that make up the rule action. Valid commands are <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, or <command>NOTIFY</command>.
ru: Команда или команды, составляющие действие правила. Здесь допустимы команды: <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command> и <command>NOTIFY</command>.

source: Within <replaceable class="parameter">condition</replaceable> and <replaceable class="parameter">command</replaceable>, the special table names <literal>NEW</literal> and <literal>OLD</literal> can be used to refer to values in the referenced table. <literal>NEW</literal> is valid in <literal>ON INSERT</literal> and <literal>ON UPDATE</literal> rules to refer to the new row being inserted or updated. <literal>OLD</literal> is valid in <literal>ON UPDATE</literal> and <literal>ON DELETE</literal> rules to refer to the existing row being updated or deleted.
ru: В параметрах <replaceable class="parameter">условие</replaceable> и <replaceable class="parameter">команда</replaceable> можно использовать имена специальных таблиц <literal>NEW</literal> и <literal>OLD</literal> для обращения к значениям в соответствующей таблице. <literal>NEW</literal> (новая) принимается в правилах <literal>ON INSERT</literal> и <literal>ON UPDATE</literal> и обозначает ссылку на новую строку, добавляемую или изменяемую. <literal>OLD</literal> (старая) принимается в правилах <literal>ON UPDATE</literal> и <literal>ON DELETE</literal> и обозначает ссылку на существующую строку, изменяемую или удаляемую.

source: You must be the owner of a table to create or change rules for it.
ru: Чтобы создать или изменить правила для таблицы, нужно быть её владельцем.

source: In a rule for <literal>INSERT</literal>, <literal>UPDATE</literal>, or <literal>DELETE</literal> on a view, you can add a <literal>RETURNING</literal> clause that emits the view's columns. This clause will be used to compute the outputs if the rule is triggered by an <command>INSERT RETURNING</command>, <command>UPDATE RETURNING</command>, or <command>DELETE RETURNING</command> command respectively. When the rule is triggered by a command without <literal>RETURNING</literal>, the rule's <literal>RETURNING</literal> clause will be ignored. The current implementation allows only unconditional <literal>INSTEAD</literal> rules to contain <literal>RETURNING</literal>; furthermore there can be at most one <literal>RETURNING</literal> clause among all the rules for the same event. (This ensures that there is only one candidate <literal>RETURNING</literal> clause to be used to compute the results.) <literal>RETURNING</literal> queries on the view will be rejected if there is no <literal>RETURNING</literal> clause in any available rule.
ru: В правило для <literal>INSERT</literal>, <literal>UPDATE</literal> или <literal>DELETE</literal> для представления можно добавить предложение <literal>RETURNING</literal>, выдающее столбцы представления. Это предложение будет генерировать результат, если правило сработает при выполнении команды <command>INSERT RETURNING</command>, <command>UPDATE RETURNING</command> или <command>DELETE RETURNING</command>. Когда правило срабатывает при выполнении команды без <literal>RETURNING</literal>, предложение <literal>RETURNING</literal> этого правила игнорируется. В текущей реализации только безусловные правила <literal>INSTEAD</literal> могут содержать <literal>RETURNING</literal>; более того, допускается максимум одно предложение <literal>RETURNING</literal> среди всех правил для некоторого события. (Благодаря этому ограничению, только одно предложение <literal>RETURNING</literal> может быть выбрано для вычисления результатов.) Запросы с <literal>RETURNING</literal> к данному представлению не будут выполняться, если ни одно из определённых для него правил не содержит предложение <literal>RETURNING</literal>.

source: It is very important to take care to avoid circular rules. For example, though each of the following two rule definitions are accepted by <productname>PostgreSQL</productname>, the <command>SELECT</command> command would cause <productname>PostgreSQL</productname> to report an error because of recursive expansion of a rule: <placeholder-1/>
ru: Очень важно следить за тем, чтобы правила не зацикливались. Например, два следующих определения правил будут приняты <productname>PostgreSQL</productname>, но при попытке выполнить команду <command>SELECT</command> <productname>PostgreSQL</productname> сообщит об ошибке из-за рекурсивного расширения правила: <placeholder-1/>

source: Presently, if a rule action contains a <command>NOTIFY</command> command, the <command>NOTIFY</command> command will be executed unconditionally, that is, the <command>NOTIFY</command> will be issued even if there are not any rows that the rule should apply to. For example, in: <placeholder-1/> one <command>NOTIFY</command> event will be sent during the <command>UPDATE</command>, whether or not there are any rows that match the condition <literal>id = 42</literal>. This is an implementation restriction that might be fixed in future releases.
ru: В настоящее время, если действие правила содержит команду <command>NOTIFY</command>, эта команда будет выполняться безусловно, то есть, <command>NOTIFY</command> будет выдаваться, даже если не найдётся никаких строк, к которым бы применялось правило. Например, в следующем примере: <placeholder-1/> одно событие <command>NOTIFY</command> будет отправлено при выполнении команды <command>UPDATE</command>, даже если никакие строки не соответствуют условию <literal>id = 42</literal>. Это недостаток текущей реализации, который может быть исправлен в будущих версиях.

source: Compatibility
ru: Совместимость

source: <command>CREATE RULE</command> is a <productname>PostgreSQL</productname> language extension, as is the entire query rewrite system.
ru: Оператор <command>CREATE RULE</command> является языковым расширением <productname>PostgreSQL</productname>, как и вся система перезаписи запросов.

source: See Also
ru: См. также
