Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_extension.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: install an extension
ru: установить расширение

source: extension_name
ru: имя_расширения

source: schema_name
ru: имя_схемы

source: version
ru: версия

source: old_version
ru: старая_версия

source: Description
ru: Описание

source: <command>CREATE EXTENSION</command> loads a new extension into the current database. There must not be an extension of the same name already loaded.
ru: <command>CREATE EXTENSION</command> загружает в текущую базу данных новое расширение. Расширение с таким именем не должно быть уже загружено.

source: Loading an extension essentially amounts to running the extension's script file. The script will typically create new <acronym>SQL</acronym> objects such as functions, data types, operators and index support methods. <command>CREATE EXTENSION</command> additionally records the identities of all the created objects, so that they can be dropped again if <command>DROP EXTENSION</command> is issued.
ru: Загрузка расширения по сути сводится к запуску скрипта расширения. Этот скрипт обычно создаёт новые <acronym>SQL</acronym>-объекты, такие как функции, типы данных, операторы и методы поддержки индексов. <command>CREATE EXTENSION</command> дополнительно записывает идентификаторы всех добавляемых объектов, так что впоследствии их можно удалить, выполнив команду <command>DROP EXTENSION</command>.

source: Loading an extension requires the same privileges that would be required to create its component objects. For most extensions this means superuser or database owner privileges are needed. The user who runs <command>CREATE EXTENSION</command> becomes the owner of the extension for purposes of later privilege checks, as well as the owner of any objects created by the extension's script.
ru: Для загрузки расширения требуются те же права, что необходимы для создания составляющих его объектов. Для большинства расширений это означает, что необходимы права владельца базы данных или суперпользователя. Пользователь, запускающий <command>CREATE EXTENSION</command>, становится владельцем самого расширения (это требуется для последующих проверок доступа), а также владельцем всех объектов, созданных скриптом расширения.

source: Parameters
ru: Параметры

source: Do not throw an error if an extension with the same name already exists. A notice is issued in this case. Note that there is no guarantee that the existing extension is anything like the one that would have been created from the currently-available script file.
ru: Не считать ошибкой, если расширение с таким именем уже существует. В этом случае будет выдано замечание. Заметьте, что нет никакой гарантии, что существующее расширение как-то соотносится с тем, которое могло бы быть создано из указанного скрипта.

source: The name of the extension to be installed. <productname>PostgreSQL</productname> will create the extension using details from the file <literal>SHAREDIR/extension/</literal><replaceable class="parameter">extension_name</replaceable><literal>.control</literal>.
ru: Имя устанавливаемого расширения. <productname>PostgreSQL</productname> создаст расширение, используя инструкции из файла <literal>SHAREDIR/extension/</literal><replaceable class="parameter">имя_расширения</replaceable><literal>.control</literal>.

source: The name of the schema in which to install the extension's objects, given that the extension allows its contents to be relocated. The named schema must already exist. If not specified, and the extension's control file does not specify a schema either, the current default object creation schema is used.
ru: Имя схемы, в которую будут установлены объекты расширения (подразумевается, что расширение позволяет управлять размещением своих объектов). Указанная схема должна уже существовать. Если имя не указано и в управляющем файле расширения оно так же не задано, для создания объектов используется текущая схема.

source: If <replaceable class="parameter">schema_name</replaceable> matches the schema in control file, it will be used normally as there is no conflict.
ru: Если <replaceable class="parameter">имя_схемы</replaceable> совпадает со схемой в управляющем файле, оно будет использоваться как обычно, так как это не порождает никакого конфликта.

source: If the <literal>CASCADE</literal> clause is given, the <replaceable class="parameter">schema_name</replaceable> will only be used for the missing required extensions which do not specify <literal>schema</literal> in their control files.
ru: Если указывается предложение <literal>CASCADE</literal>, <replaceable class="parameter">имя_схемы</replaceable> будет использоваться только для недостающих требующихся расширений, в управляющих файлах которых <literal>схема</literal> не задана.

source: If <replaceable class="parameter">schema_name</replaceable> is not the same as the one in extension's control file and the <literal>CASCADE</literal> clause is not given, error will be thrown.
ru: Если <replaceable class="parameter">имя_схемы</replaceable> не совпадает с именем, заданным в управляющем файле расширения, и отсутствует предложение <literal>CASCADE</literal>, будет выдана ошибка.

source: If the extension specifies <literal>schema</literal> in its control file, the schema cannot be overridden with <literal>SCHEMA</literal> clause. The <literal>SCHEMA</literal> clause in this case works as follows: <placeholder-1/>
ru: Если для расширения в его управляющем файле задаётся <literal>схема</literal>, её нельзя переопределить предложением <literal>SCHEMA</literal>. Предложение <literal>SCHEMA</literal> в этом случае работает следующим образом: <placeholder-1/>

source: Remember that the extension itself is not considered to be within any schema: extensions have unqualified names that must be unique database-wide. But objects belonging to the extension can be within schemas.
ru: Помните, что само расширение не считается принадлежащим какой-либо схеме; имена расширений не дополняются схемой и потому должны быть уникальными во всей базе данных. Однако объекты, принадлежащие расширениям, могут относиться к схемам.

source: The version of the extension to install. This can be written as either an identifier or a string literal. The default version is whatever is specified in the extension's control file.
ru: Версия устанавливаемого расширения. Её можно записать в виде идентификатора или строкового значения. По умолчанию версия считывается из управляющего файла расширения.

source: <literal>FROM</literal> <replaceable class="parameter">old_version</replaceable> must be specified when, and only when, you are attempting to install an extension that replaces an <quote>old style</quote> module that is just a collection of objects not packaged into an extension. This option causes <command>CREATE EXTENSION</command> to run an alternative installation script that absorbs the existing objects into the extension, instead of creating new objects. Be careful that <literal>SCHEMA</literal> specifies the schema containing these pre-existing objects.
ru: Указание <literal>FROM</literal> <replaceable class="parameter">старая_версия</replaceable> может быть добавлено тогда и только тогда, когда устанавливаемое расширение заменяет модуль <quote>старого стиля</quote>, представляющий собой просто набор объектов, не упакованный в расширение. С этим указанием <command>CREATE EXTENSION</command> запускает альтернативный установочный скрипт, собирающий все существующие объекты в расширение, а не создающий новые. Учтите, что <literal>SCHEMA</literal> при этом определяет схему, содержащую эти существующие объекты.

source: The value to use for <replaceable class="parameter">old_version</replaceable> is determined by the extension's author, and might vary if there is more than one version of the old-style module that can be upgraded into an extension. For the standard additional modules supplied with pre-9.1 <productname>PostgreSQL</productname>, use <literal>unpackaged</literal> for <replaceable class="parameter">old_version</replaceable> when updating a module to extension style.
ru: Значение, задаваемое в качестве <replaceable class="parameter">старой_версии</replaceable>, определяется автором расширения и может меняться, если в расширение нужно преобразовать не одну версию модуля в старом стиле. Для стандартных дополнительных модулей, поставляемых в <productname>PostgreSQL</productname> до версии 9.1, при преобразовании модуля в расширение <replaceable class="parameter">старая_версия</replaceable> должна содержать значение <literal>unpackaged</literal>.

source: Try to install extension including the required dependencies recursively. The <literal>SCHEMA</literal> option will be propagated to the required extensions. Other options are not recursively applied when using this clause.
ru: Попытаться установить расширение, рекурсивно устанавливая и все требуемые зависимости. При этом указание <literal>SCHEMA</literal> будет передаваться всем требуемым расширениям. Другие параметры с этим предложением рекурсивно не применяются.

source: Notes
ru: Замечания

source: Before you can use <command>CREATE EXTENSION</command> to load an extension into a database, the extension's supporting files must be installed. Information about installing the extensions supplied with <productname>PostgreSQL</productname> can be found in <link linkend="contrib">Additional Supplied Modules</link>.
ru: Прежде чем вы сможете выполнить <command>CREATE EXTENSION</command> и загрузить расширение в базу данных, необходимо правильно установить сопутствующие файлы расширения. Информацию об установке расширений, поставляемых в составе <productname>PostgreSQL</productname>, можно найти по ссылке <link linkend="contrib">Дополнительные поставляемые модули</link>.

source: The extensions currently available for loading can be identified from the <link linkend="view-pg-available-extensions"><structname>pg_available_extensions</structname></link> or <link linkend="view-pg-available-extension-versions"><structname>pg_available_extension_versions</structname></link> system views.
ru: Расширения, доступные для установки в данный момент, можно найти в системном представлении <link linkend="view-pg-available-extensions"><structname>pg_available_extensions</structname></link> или <link linkend="view-pg-available-extension-versions"><structname>pg_available_extension_versions</structname></link>.

source: For information about writing new extensions, see <xref linkend="extend-extensions"/>.
ru: За информацией для разработчиков расширений обратитесь к <xref remap="3" linkend="extend-extensions"/>.

source: Examples
ru: Примеры

source: Install the <link linkend="hstore">hstore</link> extension into the current database: <placeholder-1/>
ru: Установка расширения <link linkend="hstore">hstore</link> в текущую базу данных: <placeholder-1/>

source: Update a pre-9.1 installation of <literal>hstore</literal> into extension style: <placeholder-1/> Be careful to specify the schema in which you installed the existing <literal>hstore</literal> objects.
ru: Преобразование установленного до версии 9.1 модуля <literal>hstore</literal> в расширение: <placeholder-1/> Будьте внимательны — здесь нужно указать схему, в которую ранее были установлены существующие объекты <literal>hstore</literal>.

source: Compatibility
ru: Совместимость

source: <command>CREATE EXTENSION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>CREATE EXTENSION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
