Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_language.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new procedural language
ru: создать процедурный язык

source: name
ru: имя

source: call_handler
ru: обработчик_вызова

source: inline_handler
ru: обработчик_внедрённого_кода

source: valfunction
ru: функция_проверки

source: Description
ru: Описание

source: <command>CREATE LANGUAGE</command> registers a new procedural language with a <productname>PostgreSQL</productname> database. Subsequently, functions and trigger procedures can be defined in this new language.
ru: <command>CREATE LANGUAGE</command> регистрирует в базе данных <productname>PostgreSQL</productname> новый процедурный язык. Впоследствии на этом языке можно будет определять новые функции и триггерные процедуры.

source: As of <productname>PostgreSQL</productname> 9.1, most procedural languages have been made into <quote>extensions</quote>, and should therefore be installed with <xref linkend="sql-createextension"/> not <command>CREATE LANGUAGE</command>. Direct use of <command>CREATE LANGUAGE</command> should now be confined to extension installation scripts. If you have a <quote>bare</quote> language in your database, perhaps as a result of an upgrade, you can convert it to an extension using <literal>CREATE EXTENSION <replaceable>langname</replaceable> FROM unpackaged</literal>.
ru: Начиная с <productname>PostgreSQL</productname> 9.1, большинство процедурных языков были преобразованы в <quote>расширения</quote>, так что они теперь устанавливаются посредством <xref linkend="sql-createextension"/>, а не <command>CREATE LANGUAGE</command>. Прямое использование <command>CREATE LANGUAGE</command> теперь следует ограничить скриптами установки расширений. Если в вашей базе данных есть <quote>чистое</quote> определение языка, возможно, полученное в результате обновления, его можно преобразовать в расширение, выполнив <literal>CREATE EXTENSION <replaceable>имя_языка</replaceable> FROM unpackaged</literal>.

source: <command>CREATE LANGUAGE</command> effectively associates the language name with handler function(s) that are responsible for executing functions written in the language. Refer to <xref linkend="plhandler"/> for more information about language handlers.
ru: <command>CREATE LANGUAGE</command> по сути связывает имя языка с функциями-обработчиками, исполняющими код, написанный на этом языке. За дополнительными сведениями о языковых обработчиках обратитесь к <xref remap="3" linkend="plhandler"/>.

source: There are two forms of the <command>CREATE LANGUAGE</command> command. In the first form, the user supplies just the name of the desired language, and the <productname>PostgreSQL</productname> server consults the <link linkend="catalog-pg-pltemplate"><structname>pg_pltemplate</structname></link> system catalog to determine the correct parameters. In the second form, the user supplies the language parameters along with the language name. The second form can be used to create a language that is not defined in <structname>pg_pltemplate</structname>, but this approach is considered obsolescent.
ru: Команда <command>CREATE LANGUAGE</command> имеет две формы. В первой форме пользователь задаёт только имя создаваемого языка, и сервер <productname>PostgreSQL</productname> получает подходящие параметры, обращаясь к системному каталогу <link linkend="catalog-pg-pltemplate"><structname>pg_pltemplate</structname></link>. Во второй форме пользователь указывает параметры языка вместе с его именем. Вторая форма позволяет создать язык, не определённый заранее в <structname>pg_pltemplate</structname>, но этот подход считается устаревшим.

source: When the server finds an entry in the <structname>pg_pltemplate</structname> catalog for the given language name, it will use the catalog data even if the command includes language parameters. This behavior simplifies loading of old dump files, which are likely to contain out-of-date information about language support functions.
ru: Когда сервер находит в каталоге <structname>pg_pltemplate</structname> запись для заданного имени языка, он будет использовать данные из каталога, даже если параметры языка указаны в команде. Это поведение упрощает загрузку экспортированных ранее файлов, которые, скорее всего, будут содержать устаревшую информацию о функциях поддержки языка.

source: Ordinarily, the user must have the <productname>PostgreSQL</productname> superuser privilege to register a new language. However, the owner of a database can register a new language within that database if the language is listed in the <structname>pg_pltemplate</structname> catalog and is marked as allowed to be created by database owners (<structfield>tmpldbacreate</structfield> is true). The default is that trusted languages can be created by database owners, but this can be adjusted by superusers by modifying the contents of <structname>pg_pltemplate</structname>. The creator of a language becomes its owner and can later drop it, rename it, or assign it to a new owner.
ru: Обычно, для того чтобы зарегистрировать новый язык, необходимо иметь право суперпользователя <productname>PostgreSQL</productname>. Однако владелец базы данных может зарегистрировать новый язык в этой базе данных, если язык определён в каталоге <structname>pg_pltemplate</structname> и помечен как допускающий создание владельцами БД (<structfield>tmpldbacreate</structfield> содержит true). По умолчанию доверенные языки могут создаваться владельцами базы данных, но это можно изменить, внеся коррективы в <structname>pg_pltemplate</structname>. Создатель языка становится его владельцем и может впоследствии удалить или переименовать его, либо назначить другого владельца.

source: <command>CREATE OR REPLACE LANGUAGE</command> will either create a new language, or replace an existing definition. If the language already exists, its parameters are updated according to the values specified or taken from <structname>pg_pltemplate</structname>, but the language's ownership and permissions settings do not change, and any existing functions written in the language are assumed to still be valid. In addition to the normal privilege requirements for creating a language, the user must be superuser or owner of the existing language. The <literal>REPLACE</literal> case is mainly meant to be used to ensure that the language exists. If the language has a <structname>pg_pltemplate</structname> entry then <literal>REPLACE</literal> will not actually change anything about an existing definition, except in the unusual case where the <structname>pg_pltemplate</structname> entry has been modified since the language was created.
ru: <command>CREATE OR REPLACE LANGUAGE</command> создаст новый язык, либо заменит существующее определение. Если язык уже существует, его параметры изменяются в соответствии со значениями, указанными в команде или полученными из <structname>pg_pltemplate</structname>, при этом владелец языка и права доступа к нему не меняются, и все существующие функции, написанные на этом языке, по-прежнему считаются рабочими. Помимо обладания обычными правами, требующимися для создания языка, пользователь должен быть суперпользователем или владельцем существующего языка. Вариант с <literal>REPLACE</literal> в основном предназначен для случаев, когда язык уже существует. Если для языка есть запись в <structname>pg_pltemplate</structname>, то <literal>REPLACE</literal> фактически ничего не меняет в существующем определении, кроме исключительного случая, когда запись в <structname>pg_pltemplate</structname> была изменена после создания языка.

source: Parameters
ru: Параметры

source: <literal>TRUSTED</literal> specifies that the language does not grant access to data that the user would not otherwise have. If this key word is omitted when registering the language, only users with the <productname>PostgreSQL</productname> superuser privilege can use this language to create new functions.
ru: Указание <literal>TRUSTED</literal> (доверенный) означает, что язык не даёт пользователю доступ к данным, к которым он не имел бы доступа без него. Если при регистрации языка это ключевое слово опущено, использовать этот язык для создания новых функций смогут только суперпользователи <productname>PostgreSQL</productname>.

source: This is a noise word.
ru: Это слово не несёт смысловой нагрузки.

source: The name of the new procedural language. The name must be unique among the languages in the database.
ru: Имя процедурного языка. Оно должно быть уникальным среди всех языков в базе данных.

source: For backward compatibility, the name can be enclosed by single quotes.
ru: В целях обратной совместимости имя можно заключить в апострофы.

source: <replaceable class="parameter">call_handler</replaceable> is the name of a previously registered function that will be called to execute the procedural language's functions. The call handler for a procedural language must be written in a compiled language such as C with version 1 call convention and registered with <productname>PostgreSQL</productname> as a function taking no arguments and returning the <type>language_handler</type> type, a placeholder type that is simply used to identify the function as a call handler.
ru: Здесь <replaceable class="parameter">обработчик_вызова</replaceable> — имя ранее зарегистрированной функции, которая будет вызываться для исполнения процедур (функций) на этом языке. Обработчик вызова для процедурного языка должен быть написан на компилируемом языке, например, на C, с соглашениями о вызовах версии 1 и зарегистрирован в <productname>PostgreSQL</productname> как функция без аргументов, возвращающая фиктивный тип <type>language_handler</type>, который просто показывает, что эта функция — обработчик вызова.

source: <replaceable class="parameter">inline_handler</replaceable> is the name of a previously registered function that will be called to execute an anonymous code block (<xref linkend="sql-do"/> command) in this language. If no <replaceable class="parameter">inline_handler</replaceable> function is specified, the language does not support anonymous code blocks. The handler function must take one argument of type <type>internal</type>, which will be the <command>DO</command> command's internal representation, and it will typically return <type>void</type>. The return value of the handler is ignored.
ru: Здесь <replaceable class="parameter">обработчик_внедрённого_кода</replaceable> — имя ранее зарегистрированной функции, которая будет вызываться для выполнения анонимного блока кода (команды <xref linkend="sql-do"/>) на этом языке. Если <replaceable class="parameter">обработчик_внедрённого_кода</replaceable> не определён, данный язык не будет поддерживать анонимные блоки кода. Этот обработчик должен принимать один аргумент типа <type>internal</type>, содержащий внутреннее представление команды <command>DO</command>, и обычно возвращает тип <type>void</type>. Значение, возвращаемое этим обработчиком, игнорируется.

source: <replaceable class="parameter">valfunction</replaceable> is the name of a previously registered function that will be called when a new function in the language is created, to validate the new function. If no validator function is specified, then a new function will not be checked when it is created. The validator function must take one argument of type <type>oid</type>, which will be the OID of the to-be-created function, and will typically return <type>void</type>.
ru: Здесь <replaceable class="parameter">функция_проверки</replaceable> — имя ранее зарегистрированной функции, которая будет вызываться при создании новой функции на этом языке и проверять её. Если функция проверки не задана, функции на этом языке при создании проверяться не будут. Функция проверки должна принимать один аргумент типа <type>oid</type> с идентификатором создаваемой функции и обычно возвращает <type>void</type>.

source: A validator function would typically inspect the function body for syntactical correctness, but it can also look at other properties of the function, for example if the language cannot handle certain argument types. To signal an error, the validator function should use the <function>ereport()</function> function. The return value of the function is ignored.
ru: Функция проверки обычно проверяет тело создаваемой функции на синтаксические ошибки, но может также проанализировать и другие характеристики функции, например, поддержку определённых типов аргументов этим языком. Значение, возвращаемое этой функцией, игнорируется, об ошибках она должна сигнализировать, вызывая <function>ereport()</function>.

source: The <literal>TRUSTED</literal> option and the support function name(s) are ignored if the server has an entry for the specified language name in <structname>pg_pltemplate</structname>.
ru: Параметр <literal>TRUSTED</literal> и имена вспомогательных функций игнорируются, если на сервере для указанного языка имеется запись в <structname>pg_pltemplate</structname>.

source: Notes
ru: Замечания

source: The <xref linkend="app-createlang"/> program is a simple wrapper around the <command>CREATE LANGUAGE</command> command. It eases installation of procedural languages from the shell command line.
ru: Программа <xref linkend="app-createlang"/> представляет собой простую обёртку команды <command>CREATE LANGUAGE</command>. Она упрощает установку процедурных языков из командной строки оболочки.

source: Use <xref linkend="sql-droplanguage"/>, or better yet the <xref linkend="app-droplang"/> program, to drop procedural languages.
ru: Для удаления процедурных языков следует использовать <xref linkend="sql-droplanguage"/> или, что предпочтительнее, программу <xref linkend="app-droplang"/>.

source: The system catalog <classname>pg_language</classname> (see <xref linkend="catalog-pg-language"/>) records information about the currently installed languages. Also, <command>createlang</command> has an option to list the installed languages.
ru: В системном каталоге <classname>pg_language</classname> (см. <xref remap="4" linkend="catalog-pg-language"/>) записывается информация о языках, установленных в данный момент. Кроме того, у <command>createlang</command> есть параметр, позволяющий просмотреть список установленных языков.

source: To create functions in a procedural language, a user must have the <literal>USAGE</literal> privilege for the language. By default, <literal>USAGE</literal> is granted to <literal>PUBLIC</literal> (i.e., everyone) for trusted languages. This can be revoked if desired.
ru: Чтобы создавать функции на процедурном языке, пользователь должен иметь право <literal>USAGE</literal> для этого языка. По умолчанию для доверенных языков право <literal>USAGE</literal> даётся роли <literal>PUBLIC</literal> (т. е. всем), однако при желании его можно отозвать.

source: Procedural languages are local to individual databases. However, a language can be installed into the <literal>template1</literal> database, which will cause it to be available automatically in all subsequently-created databases.
ru: Процедурные языки являются локальными по отношению к базам данных. Тем не менее, язык можно установить в базу данных <literal>template1</literal>, в результате чего он будет автоматически доступен во всех базах данных, создаваемых из неё впоследствии.

source: The call handler function, the inline handler function (if any), and the validator function (if any) must already exist if the server does not have an entry for the language in <structname>pg_pltemplate</structname>. But when there is an entry, the functions need not already exist; they will be automatically defined if not present in the database. (This might result in <command>CREATE LANGUAGE</command> failing, if the shared library that implements the language is not available in the installation.)
ru: Обработчик вызова, обработчик встроенного кода (при наличии) и функция проверки (при наличии) должны уже существовать, если на сервере нет записи для этого языка в <structname>pg_pltemplate</structname>. Но если такая запись уже есть, функции могут не существовать — в случае отсутствия в базе данных они будут определены автоматически. (Это может привести к сбою в <command>CREATE LANGUAGE</command>, если в установленной системе не найдётся разделяемая библиотека, реализующая этот язык.)

source: In <productname>PostgreSQL</productname> versions before 7.3, it was necessary to declare handler functions as returning the placeholder type <type>opaque</type>, rather than <type>language_handler</type>. To support loading of old dump files, <command>CREATE LANGUAGE</command> will accept a function declared as returning <type>opaque</type>, but it will issue a notice and change the function's declared return type to <type>language_handler</type>.
ru: В <productname>PostgreSQL</productname> до версии 7.3 обязательно требовалось объявить функции-обработчики, как возвращающие фиктивный тип <type>opaque</type>, а не <type>language_handler</type>. Для поддержки загрузки старых файлов экспорта БД, команда <command>CREATE LANGUAGE</command> принимает функции с объявленным типом результата <type>opaque</type>, но при этом выдаётся предупреждение и тип результата меняется на <type>language_handler</type>.

source: Examples
ru: Примеры

source: The preferred way of creating any of the standard procedural languages is just: <placeholder-1/>
ru: Предпочитаемый способ создания любых процедурных языков довольно прост: <placeholder-1/>

source: For a language not known in the <structname>pg_pltemplate</structname> catalog, a sequence such as this is needed: <placeholder-1/>
ru: Для языка, не представленного в каталоге <structname>pg_pltemplate</structname>, требуется выполнить следующие действия: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE LANGUAGE</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>CREATE LANGUAGE</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
