Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_conversion.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new encoding conversion
ru: создать перекодировку

source: name
ru: имя

source: source_encoding
ru: исходная_кодировка

source: dest_encoding
ru: целевая_кодировка

source: function_name
ru: имя_функции

source: Description
ru: Описание

source: <command>CREATE CONVERSION</command> defines a new conversion between character set encodings. Also, conversions that are marked <literal>DEFAULT</literal> can be used for automatic encoding conversion between client and server. For this purpose, two conversions, from encoding A to B <emphasis>and</emphasis> from encoding B to A, must be defined.
ru: <command>CREATE CONVERSION</command> определяет новую перекодировку наборов символов. Кроме того, перекодировки, помеченные как <literal>DEFAULT</literal>, могут применяться для автоматического преобразования кодировки между клиентом и сервером. Для такого применения должны быть определены две перекодировки: из кодировки A в B <emphasis>и</emphasis> из кодировки B в A.

source: To be able to create a conversion, you must have <literal>EXECUTE</literal> privilege on the function and <literal>CREATE</literal> privilege on the destination schema.
ru: Чтобы создать перекодировку, необходимо иметь право <literal>EXECUTE</literal> для реализующей функции и право <literal>CREATE</literal> в целевой схеме.

source: Parameters
ru: Параметры

source: The <literal>DEFAULT</literal> clause indicates that this conversion is the default for this particular source to destination encoding. There should be only one default encoding in a schema for the encoding pair.
ru: Предложение <literal>DEFAULT</literal> показывает, что эта перекодировка должна использоваться по умолчанию для преобразования заданной исходной кодировки в целевую. Для каждой пары кодировок может быть только одна перекодировка по умолчанию.

source: The name of the conversion. The conversion name can be schema-qualified. If it is not, the conversion is defined in the current schema. The conversion name must be unique within a schema.
ru: Имя перекодировки, возможно, дополненное схемой. Если схема не указана, перекодировка создаётся в текущей схеме. Имя перекодировки должно быть уникально в этой схеме.

source: The source encoding name.
ru: Имя исходной кодировки.

source: The destination encoding name.
ru: Имя целевой кодировки.

source: The function used to perform the conversion. The function name can be schema-qualified. If it is not, the function will be looked up in the path.
ru: Функция, выполняющая перекодирование. Имя функции может быть дополнено схемой, в противном случае для поиска функции просматривается путь поиска.

source: conv_proc( integer, -- source encoding ID integer, -- destination encoding ID cstring, -- source string (null terminated C string) internal, -- destination (fill with a null terminated C string) integer -- source string length ) RETURNS void;
ru: conv_proc( integer, -- идентификатор исходной кодировки integer, -- идентификатор целевой кодировки cstring, -- исходная строка (строка, завершающаяся 0, как в C) internal, -- целевая строка (заполняется строкой, завершающейся 0, как в C) integer -- длина исходной строки ) RETURNS void;

source: The function must have the following signature: <placeholder-1/>
ru: Функция должна иметь следующую сигнатуру: <placeholder-1/>

source: Notes
ru: Замечания

source: Use <command>DROP CONVERSION</command> to remove user-defined conversions.
ru: Для удаления перекодировок, созданных пользователем, применяется <command>DROP CONVERSION</command>.

source: The privileges required to create a conversion might be changed in a future release.
ru: Набор прав, требуемых для создания перекодировки, может измениться в будущих версиях.

source: Examples
ru: Примеры

source: To create a conversion from encoding <literal>UTF8</literal> to <literal>LATIN1</literal> using <function>myfunc</function>: <placeholder-1/>
ru: Создание перекодировки из кодировки <literal>UTF8</literal> в <literal>LATIN1</literal> с использованием функции <function>myfunc</function>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE CONVERSION</command> is a <productname>PostgreSQL</productname> extension. There is no <command>CREATE CONVERSION</command> statement in the SQL standard, but a <command>CREATE TRANSLATION</command> statement that is very similar in purpose and syntax.
ru: Оператор <command>CREATE CONVERSION</command> является расширением <productname>PostgreSQL</productname>. В стандарте SQL отсутствует оператор <command>CREATE CONVERSION</command>, но есть очень похожий по предназначению и синтаксису оператор <command>CREATE TRANSLATION</command>.

source: See Also
ru: См. также
