Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_tsconfig.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new text search configuration
ru: создать конфигурацию текстового поиска

source: name
ru: имя

source: parser_name
ru: имя_анализатора

source: source_config
ru: исходная_конфигурация

source: Description
ru: Описание

source: <command>CREATE TEXT SEARCH CONFIGURATION</command> creates a new text search configuration. A text search configuration specifies a text search parser that can divide a string into tokens, plus dictionaries that can be used to determine which tokens are of interest for searching.
ru: <command>CREATE TEXT SEARCH CONFIGURATION</command> создаёт конфигурацию текстового поиска. Конфигурация текстового поиска определяет анализатор текстового поиска, разделяющий строку на фрагменты, и словари, позволяющие установить, какие именно фрагменты представляют интерес при поиске.

source: If only the parser is specified, then the new text search configuration initially has no mappings from token types to dictionaries, and therefore will ignore all words. Subsequent <command>ALTER TEXT SEARCH CONFIGURATION</command> commands must be used to create mappings to make the configuration useful. Alternatively, an existing text search configuration can be copied.
ru: Если задаётся только анализатор, новая конфигурация текстового поиска не будет содержать сопоставления типов фрагментов со словарями и, как следствие, будет игнорировать все слова. Для создания сопоставлений, которые бы сделали конфигурацию полезной, затем нужно будет воспользоваться командой <command>ALTER TEXT SEARCH CONFIGURATION</command>. Другой вариант команды позволяет скопировать конфигурацию текстового поиска.

source: If a schema name is given then the text search configuration is created in the specified schema. Otherwise it is created in the current schema.
ru: Если указывается имя схемы, конфигурация текстового поиска создаётся в указанной схеме. В противном случае она создаётся в текущей схеме.

source: The user who defines a text search configuration becomes its owner.
ru: Владельцем конфигурации текстового поиска становится пользователь её создавший.

source: Refer to <xref linkend="textsearch"/> for further information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="textsearch"/>.

source: Parameters
ru: Параметры

source: The name of the text search configuration to be created. The name can be schema-qualified.
ru: Имя создаваемой конфигурации текстового поиска, возможно, дополненное схемой.

source: The name of the text search parser to use for this configuration.
ru: Имя анализатора текстового поиска, который будет использоваться этой конфигурацией.

source: The name of an existing text search configuration to copy.
ru: Имя существующей конфигурации текстового поиска, которая будет скопирована.

source: Notes
ru: Замечания

source: The <literal>PARSER</literal> and <literal>COPY</literal> options are mutually exclusive, because when an existing configuration is copied, its parser selection is copied too.
ru: Параметры <literal>PARSER</literal> и <literal>COPY</literal> являются взаимоисключающими, так как при копировании существующей конфигурации выбранный в ней анализатор копируется тоже.

source: Compatibility
ru: Совместимость

source: There is no <command>CREATE TEXT SEARCH CONFIGURATION</command> statement in the SQL standard.
ru: Оператор <command>CREATE TEXT SEARCH CONFIGURATION</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
