Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_table.po
Languages: as, ru

source: Create table <structname>circles</structname> with an exclusion constraint that prevents any two circles from overlapping: <placeholder-1/>
ru: Создание таблицы <structname>circles</structname> с ограничением-исключением, не допускающим пересечения двух кругов: <placeholder-1/>

source: Create table <structname>cinemas</structname> in tablespace <structname>diskvol1</structname>: <placeholder-1/>
ru: Создание таблицы <structname>cinemas</structname> в табличном пространстве <structname>diskvol1</structname>: <placeholder-1/>

source: Create a composite type and a typed table: <placeholder-1/>
ru: Создание составного типа и типизированной таблицы: <placeholder-1/>

source: Compatibility
as: Совместимость
ru: Совместимость

source: The <command>CREATE TABLE</command> command conforms to the <acronym>SQL</acronym> standard, with exceptions listed below.
ru: Команда <command>CREATE TABLE</command> соответствует стандарту <acronym>SQL</acronym>, с описанными ниже исключениями.

source: Temporary Tables
ru: Временные таблицы

source: Although the syntax of <literal>CREATE TEMPORARY TABLE</literal> resembles that of the SQL standard, the effect is not the same. In the standard, temporary tables are defined just once and automatically exist (starting with empty contents) in every session that needs them. <productname>PostgreSQL</productname> instead requires each session to issue its own <literal>CREATE TEMPORARY TABLE</literal> command for each temporary table to be used. This allows different sessions to use the same temporary table name for different purposes, whereas the standard's approach constrains all instances of a given temporary table name to have the same table structure.
ru: Хотя синтаксис <literal>CREATE TEMPORARY TABLE</literal> подобен аналогичному в стандарте SQL, результат получается другим. В стандарте временные таблицы определяются только один раз и существуют (изначально пустые) в каждом сеансе, в котором они используются. <productname>PostgreSQL</productname> вместо этого требует, чтобы каждый сеанс выполнял собственную команду <literal>CREATE TEMPORARY TABLE</literal> для каждой временной таблицы, которая будет использоваться. Это позволяет использовать в разных сеансах таблицы с одинаковыми именами для разных целей, тогда как при подходе, регламентированном стандартом, все экземпляры временной таблицы с одним именем должны иметь одинаковую табличную структуру.

source: The standard's definition of the behavior of temporary tables is widely ignored. <productname>PostgreSQL</productname>'s behavior on this point is similar to that of several other SQL databases.
ru: Поведение временных таблиц, описанное в стандарте, в большинстве своём игнорируют и другие СУБД, так что в этом отношении <productname>PostgreSQL</productname> ведёт себя так же, как и ряд других СУБД.

source: The SQL standard also distinguishes between global and local temporary tables, where a local temporary table has a separate set of contents for each SQL module within each session, though its definition is still shared across sessions. Since <productname>PostgreSQL</productname> does not support SQL modules, this distinction is not relevant in <productname>PostgreSQL</productname>.
ru: В стандарте SQL также разделяются глобальные и локальные временные таблицы — в локальной временной таблице содержится отдельный набор данных для каждого модуля SQL в отдельном сеансе, хотя её определение так же разделяется между ними. Так как в <productname>PostgreSQL</productname> модули SQL не поддерживаются, это различие в <productname>PostgreSQL</productname> не существует.

source: For compatibility's sake, <productname>PostgreSQL</productname> will accept the <literal>GLOBAL</literal> and <literal>LOCAL</literal> keywords in a temporary table declaration, but they currently have no effect. Use of these keywords is discouraged, since future versions of <productname>PostgreSQL</productname> might adopt a more standard-compliant interpretation of their meaning.
ru: Совместимости ради, <productname>PostgreSQL</productname> принимает ключевые слова <literal>GLOBAL</literal> и <literal>LOCAL</literal> в объявлении временной таблицы, но в настоящее время они никак не действуют. Использовать их не рекомендуется, так как в будущих версиях <productname>PostgreSQL</productname> может быть принята их интерпретация, более близкая к стандарту.

source: The <literal>ON COMMIT</literal> clause for temporary tables also resembles the SQL standard, but has some differences. If the <literal>ON COMMIT</literal> clause is omitted, SQL specifies that the default behavior is <literal>ON COMMIT DELETE ROWS</literal>. However, the default behavior in <productname>PostgreSQL</productname> is <literal>ON COMMIT PRESERVE ROWS</literal>. The <literal>ON COMMIT DROP</literal> option does not exist in SQL.
ru: Предложение <literal>ON COMMIT</literal> для временных таблиц тоже подобно описанному в стандарте SQL, но есть некоторые отличия. Если предложение <literal>ON COMMIT</literal> опущено, в SQL подразумевается поведение <literal>ON COMMIT DELETE ROWS</literal>. Однако в <productname>PostgreSQL</productname> по умолчанию действует <literal>ON COMMIT PRESERVE ROWS</literal>. Параметр <literal>ON COMMIT DROP</literal> в стандарте SQL отсутствует.

source: Non-deferred Uniqueness Constraints
ru: Неотложенные ограничения уникальности

source: When a <literal>UNIQUE</literal> or <literal>PRIMARY KEY</literal> constraint is not deferrable, <productname>PostgreSQL</productname> checks for uniqueness immediately whenever a row is inserted or modified. The SQL standard says that uniqueness should be enforced only at the end of the statement; this makes a difference when, for example, a single command updates multiple key values. To obtain standard-compliant behavior, declare the constraint as <literal>DEFERRABLE</literal> but not deferred (i.e., <literal>INITIALLY IMMEDIATE</literal>). Be aware that this can be significantly slower than immediate uniqueness checking.
ru: Когда ограничение <literal>UNIQUE</literal> или <literal>PRIMARY KEY</literal> не является отложенным, <productname>PostgreSQL</productname> проверяет уникальность непосредственно в момент добавления или изменения строки. Стандарт SQL говорит, что уникальность должна обеспечиваться только в конце оператора; это различие проявляется, например когда одна команда изменяет множество ключевых значений. Чтобы получить поведение, оговоренное стандартом, объявите ограничение как откладываемое (<literal>DEFERRABLE</literal>), но не отложенное (т. е., <literal>INITIALLY IMMEDIATE</literal>). Учтите, что этот вариант может быть значительно медленнее, чем немедленная проверка ограничений.

source: Column Check Constraints
ru: Ограничения-проверки для столбцов

source: The SQL standard says that <literal>CHECK</literal> column constraints can only refer to the column they apply to; only <literal>CHECK</literal> table constraints can refer to multiple columns. <productname>PostgreSQL</productname> does not enforce this restriction; it treats column and table check constraints alike.
ru: Стандарт SQL говорит, что ограничение <literal>CHECK</literal>, определяемое для столбца, может ссылаться только на столбец, с которым оно связано; только ограничения <literal>CHECK</literal> для таблиц могут ссылаться на несколько столбцов. В <productname>PostgreSQL</productname> этого ограничения нет; он воспринимает ограничения-проверки для столбцов и таблиц одинаково.

source: <literal>EXCLUDE</literal> Constraint
ru: Ограничение <literal>EXCLUDE</literal>

source: The <literal>EXCLUDE</literal> constraint type is a <productname>PostgreSQL</productname> extension.
ru: Ограничения <literal>EXCLUDE</literal> являются расширением <productname>PostgreSQL</productname>.

source: Constraint
ru: Ограничение

source: The <literal>NULL</literal> <quote>constraint</quote> (actually a non-constraint) is a <productname>PostgreSQL</productname> extension to the SQL standard that is included for compatibility with some other database systems (and for symmetry with the <literal>NOT NULL</literal> constraint). Since it is the default for any column, its presence is simply noise.
ru: <quote>Ограничение</quote> <literal>NULL</literal> (на самом деле это не ограничение) является расширением <productname>PostgreSQL</productname> стандарта SQL, которое реализовано для совместимости с некоторыми другими СУБД (и для симметрии с ограничением <literal>NOT NULL</literal>). Так как это поведение по умолчанию для любого столбца, его присутствие не несёт смысловой нагрузки.

source: Inheritance
ru: Наследование

source: Multiple inheritance via the <literal>INHERITS</literal> clause is a <productname>PostgreSQL</productname> language extension. SQL:1999 and later define single inheritance using a different syntax and different semantics. SQL:1999-style inheritance is not yet supported by <productname>PostgreSQL</productname>.
ru: Множественное наследование посредством <literal>INHERITS</literal> является языковым расширением <productname>PostgreSQL</productname>. SQL:1999 и более поздние стандарты определяют единичное наследование с другим синтаксисом и смыслом. Наследование в стиле SQL:1999 пока ещё не поддерживается в <productname>PostgreSQL</productname>.

source: Zero-column Tables
ru: Таблицы с нулём столбцов

source: <productname>PostgreSQL</productname> allows a table of no columns to be created (for example, <literal>CREATE TABLE foo();</literal>). This is an extension from the SQL standard, which does not allow zero-column tables. Zero-column tables are not in themselves very useful, but disallowing them creates odd special cases for <command>ALTER TABLE DROP COLUMN</command>, so it seems cleaner to ignore this spec restriction.
ru: <productname>PostgreSQL</productname> позволяет создать таблицу без столбцов (например, <literal>CREATE TABLE foo();</literal>). Это расширение стандарта SQL, который не допускает таблицы с нулём столбцов. Таблицы с нулём столбцов сами по себе не очень полезны, но если их запретить, возникают странные особые ситуации с командой <command>ALTER TABLE DROP COLUMN</command>, так что лучшим вариантом кажется игнорировать это требование стандарта.

source: <literal>WITH</literal> Clause
ru: Предложение <literal>WITH</literal>

source: The <literal>WITH</literal> clause is a <productname>PostgreSQL</productname> extension; neither storage parameters nor OIDs are in the standard.
as: Предложение <literal>WITH</literal> является расширением <productname>PostgreSQL</productname>; в стандарте ни параметры хранения, ни OID не оговариваются.
ru: Предложение <literal>WITH</literal> является расширением <productname>PostgreSQL</productname>; в стандарте ни параметры хранения, ни OID не оговариваются.

source: Tablespaces
ru: Табличные пространства

source: The <productname>PostgreSQL</productname> concept of tablespaces is not part of the standard. Hence, the clauses <literal>TABLESPACE</literal> and <literal>USING INDEX TABLESPACE</literal> are extensions.
ru: Концепция табличных пространств в <productname>PostgreSQL</productname> отсутствует в стандарте. Как следствие, предложения <literal>TABLESPACE</literal> и <literal>USING INDEX TABLESPACE</literal> являются расширениями.

source: Typed Tables
ru: Типизированные таблицы

source: Typed tables implement a subset of the SQL standard. According to the standard, a typed table has columns corresponding to the underlying composite type as well as one other column that is the <quote>self-referencing column</quote>. PostgreSQL does not support these self-referencing columns explicitly, but the same effect can be had using the OID feature.
ru: Типизированные таблицы реализуют подмножество стандарта SQL. Согласно стандарту, типизированная таблица содержит столбцы, соответствующие нижележащему составному типу, и ещё один столбец, ссылающийся на себя. PostgreSQL не поддерживает ссылающиеся на себя столбцы явно, но тот же эффект можно получить, воспользовавшись OID.

source: See Also
as: См. также
ru: См. также

source: define a new table from the results of a query
as: создать таблицу из результатов запроса

source: query
as: запрос

source: <command>CREATE TABLE AS</command> creates a table and fills it with data computed by a <command>SELECT</command> command. The table columns have the names and data types associated with the output columns of the <command>SELECT</command> (except that you can override the column names by giving an explicit list of new column names).
as: <command>CREATE TABLE AS</command> создаёт таблицу и наполняет её данными, полученными в результате выполнения <command>SELECT</command>. Столбцы этой таблицы получают имена и типы данных в соответствии со столбцами результата <command>SELECT</command> (хотя имена столбцов можно переопределить, добавив явно список новых имён столбцов).

source: <command>CREATE TABLE AS</command> bears some resemblance to creating a view, but it is really quite different: it creates a new table and evaluates the query just once to fill the new table initially. The new table will not track subsequent changes to the source tables of the query. In contrast, a view re-evaluates its defining <command>SELECT</command> statement whenever it is queried.
as: <command>CREATE TABLE AS</command> напоминает создание представления, но на самом деле есть значительная разница: эта команда создаёт новую таблицу и выполняет запрос только раз, чтобы наполнить таблицу начальными данными. Последующие изменения в исходных таблицах запроса в новой таблице отражаться не будут. С представлением, напротив, определяющая его команда <command>SELECT</command> выполняется при каждой выборке из него.

source: <literal>GLOBAL</literal> or <literal>LOCAL</literal>
as: <literal>GLOBAL</literal> или <literal>LOCAL</literal>

source: Ignored for compatibility. Use of these keywords is deprecated; refer to <xref linkend="sql-createtable"/> for details.
as: Для совместимости игнорируются. Использование этих ключевых слов считается устаревшим; за подробностями обратитесь к <xref remap="3" linkend="sql-createtable"/>.

source: If specified, the table is created as a temporary table. Refer to <xref linkend="sql-createtable"/> for details.
as: Если указано, создаваемая таблица будет временной. За подробностями обратитесь к <xref remap="3" linkend="sql-createtable"/>.

source: If specified, the table is created as an unlogged table. Refer to <xref linkend="sql-createtable"/> for details.
as: Если указано, создаваемая таблица будет нежурналируемой. За подробностями обратитесь к <xref remap="3" linkend="sql-createtable"/>.

source: Do not throw an error if a relation with the same name already exists. A notice is issued in this case. Refer to <xref linkend="sql-createtable"/> for details.
as: Не считать ошибкой, если отношение с таким именем уже существует. В этом случае будет выдано замечание. За подробностями обратитесь к описанию <xref linkend="sql-createtable"/>.

source: The name of a column in the new table. If column names are not provided, they are taken from the output column names of the query.
as: Имя столбца в создаваемой таблице. Если имена столбцов не заданы явно, они определяются по именам столбцов результата запроса.

source: This clause specifies optional storage parameters for the new table; see <xref linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/> for more information. The <literal>WITH</literal> clause can also include <literal>OIDS=TRUE</literal> (or just <literal>OIDS</literal>) to specify that rows of the new table should have OIDs (object identifiers) assigned to them, or <literal>OIDS=FALSE</literal> to specify that the rows should not have OIDs. See <xref linkend="sql-createtable"/> for more information.
as: Это предложение определяет дополнительные параметры хранения для новой таблицы: за подробностями обратитесь к <xref remap="3" linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/>. Предложение <literal>WITH</literal> может также включать указание <literal>OIDS=TRUE</literal> (или просто <literal>OIDS</literal>), с которым строкам в новой таблице будут назначаться идентификаторы объектов (OID), либо указание <literal>OIDS=FALSE</literal>, с которым строки не будут содержать OID. За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-createtable"/>.

source: A <xref linkend="sql-select"/>, <link linkend="sql-table">TABLE</link>, or <xref linkend="sql-values"/> command, or an <xref linkend="sql-execute"/> command that runs a prepared <command>SELECT</command>, <command>TABLE</command>, or <command>VALUES</command> query.
as: Команда <xref linkend="sql-select"/>, <link linkend="sql-table">TABLE</link> или <xref linkend="sql-values"/>, либо команда <xref linkend="sql-execute"/>, выполняющая подготовленный запрос <command>SELECT</command>, <command>TABLE</command> или <command>VALUES</command>.

source: This clause specifies whether or not the data produced by the query should be copied into the new table. If not, only the table structure is copied. The default is to copy the data.
as: Это предложение определяет, будут ли данные, выданные запросом, копироваться в новую таблицу. Если нет, то копируется только структура. По умолчанию данные копируются.

source: This command is functionally similar to <xref linkend="sql-selectinto"/>, but it is preferred since it is less likely to be confused with other uses of the <command>SELECT INTO</command> syntax. Furthermore, <command>CREATE TABLE AS</command> offers a superset of the functionality offered by <command>SELECT INTO</command>.
as: Функциональность этой команды подобна <xref linkend="sql-selectinto"/>, но предпочтительнее использовать её, во избежание путаницы с другими применениями синтаксиса <command>SELECT INTO</command>. Кроме того, набор возможностей <command>CREATE TABLE AS</command> шире, чем у <command>SELECT INTO</command>.

source: The <command>CREATE TABLE AS</command> command allows the user to explicitly specify whether OIDs should be included. If the presence of OIDs is not explicitly specified, the <xref linkend="guc-default-with-oids"/> configuration variable is used.
as: Команда <command>CREATE TABLE AS</command> позволяет пользователю явно определить, добавлять ли OID в таблицу. Если присутствие OID не определено явно, оно определяется конфигурационной переменной <xref linkend="guc-default-with-oids"/>.

source: Create a new table <literal>films_recent</literal> consisting of only recent entries from the table <literal>films</literal>: <placeholder-1/>
as: Создание таблицы <literal>films_recent</literal>, содержащей только последние записи из таблицы <literal>films</literal>: <placeholder-1/>

source: To copy a table completely, the short form using the <literal>TABLE</literal> command can also be used: <placeholder-1/>
as: Чтобы скопировать таблицу полностью, можно также использовать короткую форму команды <literal>TABLE</literal>: <placeholder-1/>

source: Create a new temporary table <literal>films_recent</literal>, consisting of only recent entries from the table <literal>films</literal>, using a prepared statement. The new table has OIDs and will be dropped at commit: <placeholder-1/>
as: Создание временной таблицы <literal>films_recent</literal>, содержащей только последние записи таблицы <literal>films</literal>, с применением подготовленного оператора. Новая таблица будет содержать OID и прекратит существование при фиксации транзакции: <placeholder-1/>

source: The standard requires parentheses around the subquery clause; in <productname>PostgreSQL</productname>, these parentheses are optional.
as: Стандарт требует заключать предложение подзапроса в скобки, но в <productname>PostgreSQL</productname> эти скобки необязательны.

source: In the standard, the <literal>WITH [ NO ] DATA</literal> clause is required; in PostgreSQL it is optional.
as: Стандарт требует присутствия указания <literal>WITH [ NO ] DATA</literal>, в PostgreSQL оно необязательно.

source: <productname>PostgreSQL</productname> handles temporary tables in a way rather different from the standard; see <xref linkend="sql-createtable"/> for details.
as: <productname>PostgreSQL</productname> работает с временными таблицами не так, как описано в стандарте; за подробностями обратитесь к <xref remap="3" linkend="sql-createtable"/>.

source: The <productname>PostgreSQL</productname> concept of tablespaces is not part of the standard. Hence, the clause <literal>TABLESPACE</literal> is an extension.
as: Концепция табличных пространств в <productname>PostgreSQL</productname> отсутствует в стандарте. Как следствие, предложение <literal>TABLESPACE</literal> является расширением.

source: <command>CREATE TABLE AS</command> conforms to the <acronym>SQL</acronym> standard. The following are nonstandard extensions: <placeholder-1/>
as: <command>CREATE TABLE AS</command> соответствует стандарту <acronym>SQL</acronym>. Нестандартные расширения перечислены ниже: <placeholder-1/>
