Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_type.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new data type
ru: создать новый тип данных

source: name
ru: имя

source: attribute_name
ru: имя_атрибута

source: data_type
ru: тип_данных

source: collation
ru: правило_сортировки

source: label
ru: метка

source: subtype
ru: подтип

source: subtype_operator_class
ru: класс_оператора_подтипа

source: canonical_function
ru: каноническая_функция

source: subtype_diff_function
ru: функция_разницы_подтипа

source: input_function
ru: функция_ввода

source: output_function
ru: функция_вывода

source: receive_function
ru: функция_получения

source: send_function
ru: функция_отправки

source: type_modifier_input_function
ru: функция_ввода_модификатора_типа

source: type_modifier_output_function
ru: функция_вывода_модификатора_типа

source: analyze_function
ru: функция_анализа

source: internallength
ru: внутр_длина

source: alignment
ru: выравнивание

source: storage
ru: хранение

source: like_type
ru: тип_образец

source: category
ru: категория

source: preferred
ru: предпочитаемый

source: default
ru: по_умолчанию

source: element
ru: элемент

source: delimiter
ru: разделитель

source: collatable
ru: сортируемый

source: Description
ru: Описание

source: <command>CREATE TYPE</command> registers a new data type for use in the current database. The user who defines a type becomes its owner.
ru: <command>CREATE TYPE</command> регистрирует новый тип данных для использования в текущей базе данных. Владельцем типа становится создавший его пользователь.

source: If a schema name is given then the type is created in the specified schema. Otherwise it is created in the current schema. The type name must be distinct from the name of any existing type or domain in the same schema. (Because tables have associated data types, the type name must also be distinct from the name of any existing table in the same schema.)
ru: Если указано имя схемы, тип создаётся в указанной схеме. В противном случае, он создаётся в текущей схеме. Имя типа должно отличаться от имён любых других существующих типов или доменов в той же схеме. (А так как с таблицами связываются типы данных, имя типа должно также отличаться и от имён существующих таблиц в этой схеме.)

source: There are five forms of <command>CREATE TYPE</command>, as shown in the syntax synopsis above. They respectively create a <firstterm>composite type</firstterm>, an <firstterm>enum type</firstterm>, a <firstterm>range type</firstterm>, a <firstterm>base type</firstterm>, or a <firstterm>shell type</firstterm>. The first four of these are discussed in turn below. A shell type is simply a placeholder for a type to be defined later; it is created by issuing <command>CREATE TYPE</command> with no parameters except for the type name. Shell types are needed as forward references when creating range types and base types, as discussed in those sections.
ru: Команда <command>CREATE TYPE</command> имеет пять форм, показанных выше в сводке синтаксиса. Они создают соответственно <firstterm>составной тип</firstterm>, <firstterm>перечисление</firstterm>, <firstterm>диапазон</firstterm>, <firstterm>базовый тип</firstterm> или <firstterm>тип-пустышку</firstterm>. Первые четыре эти типа рассматриваются по порядку ниже. Тип-пустышка представляет собой просто заготовку для типа, который будет определён позже; он создаётся командой <command>CREATE TYPE</command> с одним именем, без параметров. Типы-пустышки необходимы для определения прямых ссылок при создании базовых типов и типов-диапазонов, как описывается в соответствующих разделах.

source: Composite Types
ru: Составные типы

source: The first form of <command>CREATE TYPE</command> creates a composite type. The composite type is specified by a list of attribute names and data types. An attribute's collation can be specified too, if its data type is collatable. A composite type is essentially the same as the row type of a table, but using <command>CREATE TYPE</command> avoids the need to create an actual table when all that is wanted is to define a type. A stand-alone composite type is useful, for example, as the argument or return type of a function.
ru: Первая форма <command>CREATE TYPE</command> создаёт составной тип. Составной тип задаётся списком имён и типами данных атрибутов. Если тип данных является сортируемым, то для атрибута можно также задать правило сортировки. Составной тип по сути не отличается от типа строки таблицы, но <command>CREATE TYPE</command> избавляет от необходимости создавать таблицу, когда всё, что нужно, это создать тип. Отдельный составной тип может быть полезен, например, для передачи аргументов или результатов функции.

source: To be able to create a composite type, you must have <literal>USAGE</literal> privilege on all attribute types.
ru: Чтобы создать составной тип, необходимо иметь право <literal>USAGE</literal> для типов всех его атрибутов.

source: Enumerated Types
ru: Типы перечислений

source: The second form of <command>CREATE TYPE</command> creates an enumerated (enum) type, as described in <xref linkend="datatype-enum"/>. Enum types take a list of one or more quoted labels, each of which must be less than <symbol>NAMEDATALEN</symbol> bytes long (64 bytes in a standard <productname>PostgreSQL</productname> build).
ru: Вторая форма <command>CREATE TYPE</command> создаёт тип-перечисление (такие типы описываются в <xref remap="6" linkend="datatype-enum"/>). Перечисления принимают список из одной или нескольких меток в кавычках, каждая не длиннее <symbol>NAMEDATALEN</symbol> байт (64 байта в стандартной сборке <productname>PostgreSQL</productname>).

source: Range Types
ru: Диапазонные типы

source: The third form of <command>CREATE TYPE</command> creates a new range type, as described in <xref linkend="rangetypes"/>.
ru: Третья форма <command>CREATE TYPE</command> создаёт тип-диапазон (такие типы описываются в <xref remap="6" linkend="rangetypes"/>).

source: The range type's <replaceable class="parameter">subtype</replaceable> can be any type with an associated b-tree operator class (to determine the ordering of values for the range type). Normally the subtype's default b-tree operator class is used to determine ordering; to use a non-default operator class, specify its name with <replaceable class="parameter">subtype_opclass</replaceable>. If the subtype is collatable, and you want to use a non-default collation in the range's ordering, specify the desired collation with the <replaceable class="parameter">collation</replaceable> option.
ru: Задаваемый для диапазона <replaceable class="parameter">подтип</replaceable> может быть любым типом со связанным классом операторов B-дерева (что позволяет определить порядок значений в диапазоне). Обычно порядок элементов определяет класс операторов B-дерева по умолчанию, но его можно изменить, задав имя другого класса в параметре <replaceable class="parameter">класс_операторов_подтипа</replaceable>. Если подтип поддерживает сортировку и требуется, чтобы значения упорядочивались с нестандартным правилом сортировки, его имя можно задать в параметре <replaceable class="parameter">правило_сортировки</replaceable>.

source: The optional <replaceable class="parameter">canonical</replaceable> function must take one argument of the range type being defined, and return a value of the same type. This is used to convert range values to a canonical form, when applicable. See <xref linkend="rangetypes-defining"/> for more information. Creating a <replaceable class="parameter">canonical</replaceable> function is a bit tricky, since it must be defined before the range type can be declared. To do this, you must first create a shell type, which is a placeholder type that has no properties except a name and an owner. This is done by issuing the command <literal>CREATE TYPE <replaceable>name</replaceable></literal>, with no additional parameters. Then the function can be declared using the shell type as argument and result, and finally the range type can be declared using the same name. This automatically replaces the shell type entry with a valid range type.
ru: Необязательная <replaceable class="parameter">каноническая_функция</replaceable> должна принимать один аргумент определяемого типа диапазона и возвращать значение того же типа. Это используется для преобразования значений диапазона в каноническую форму, когда это уместно. За дополнительными сведениями обратитесь к <xref remap="3" linkend="rangetypes-defining"/>. Создаётся <replaceable class="parameter">каноническая_функция</replaceable> несколько нетривиально, так как она должна быть уже определена, прежде чем можно будет объявить тип-диапазон. Для этого нужно сначала создать тип-пустышку, который будет заготовкой типа, не имеющей никаких свойств, кроме имени и владельца. Это можно сделать, выполнив команду <literal>CREATE TYPE <replaceable>имя</replaceable></literal> без дополнительных параметров. Затем можно объявить функцию, для которой тип-пустышка будет типом аргумента и результата, и, наконец, объявить тип-диапазон с тем же именем. При этом тип-пустышка автоматически заменится полноценным типом-диапазоном.

source: The optional <replaceable class="parameter">subtype_diff</replaceable> function must take two values of the <replaceable class="parameter">subtype</replaceable> type as argument, and return a <type>double precision</type> value representing the difference between the two given values. While this is optional, providing it allows much greater efficiency of GiST indexes on columns of the range type. See <xref linkend="rangetypes-defining"/> for more information.
ru: Необязательная <replaceable class="parameter">функция_разницы_подтипа</replaceable> должна принимать в аргументах два значения типа <replaceable class="parameter">подтип</replaceable> и возвращать значение <type>double precision</type>, представляющее разницу между двумя данными значениями. Хотя эту функцию можно не использовать, она позволяет кардинально увеличить эффективность индексов GiST для столбцов с типом-диапазоном. За дополнительными сведениями обратитесь к <xref remap="3" linkend="rangetypes-defining"/>.

source: Base Types
ru: Базовые типы

source: The fourth form of <command>CREATE TYPE</command> creates a new base type (scalar type). To create a new base type, you must be a superuser. (This restriction is made because an erroneous type definition could confuse or even crash the server.)
ru: Четвёртая форма <command>CREATE TYPE</command> создаёт новый базовый тип (скалярный тип). Чтобы создать новый базовый тип, нужно быть суперпользователем. (Это ограничение введено потому, что ошибочное определение типа может вызвать нарушения или даже сбой в работе сервера.)

source: The parameters can appear in any order, not only that illustrated above, and most are optional. You must register two or more functions (using <command>CREATE FUNCTION</command>) before defining the type. The support functions <replaceable class="parameter">input_function</replaceable> and <replaceable class="parameter">output_function</replaceable> are required, while the functions <replaceable class="parameter">receive_function</replaceable>, <replaceable class="parameter">send_function</replaceable>, <replaceable class="parameter">type_modifier_input_function</replaceable>, <replaceable class="parameter">type_modifier_output_function</replaceable> and <replaceable class="parameter">analyze_function</replaceable> are optional. Generally these functions have to be coded in C or another low-level language.
ru: Эти параметры могут перечисляться в любом порядке, не только в показанном выше, и большинство из них необязательные. Прежде чем создавать тип, необходимо зарегистрировать две или более функций (с помощью <command>CREATE FUNCTION</command>). Обязательными являются функции <replaceable class="parameter">функция_ввода</replaceable> и <replaceable class="parameter">функция_вывода</replaceable>, тогда как <replaceable class="parameter">функция_получения</replaceable>, <replaceable class="parameter">функция_отправки</replaceable>, <replaceable class="parameter">функция_модификатора_типа</replaceable>, <replaceable class="parameter">функция_вывода_модификатора_типа</replaceable> и <replaceable class="parameter">функция_анализа</replaceable> могут отсутствовать. Обычно эти функции разрабатываются на C или другом низкоуровневом языке.

source: The <replaceable class="parameter">input_function</replaceable> converts the type's external textual representation to the internal representation used by the operators and functions defined for the type. <replaceable class="parameter">output_function</replaceable> performs the reverse transformation. The input function can be declared as taking one argument of type <type>cstring</type>, or as taking three arguments of types <type>cstring</type>, <type>oid</type>, <type>integer</type>. The first argument is the input text as a C string, the second argument is the type's own OID (except for array types, which instead receive their element type's OID), and the third is the <literal>typmod</literal> of the destination column, if known (-1 will be passed if not). The input function must return a value of the data type itself. Usually, an input function should be declared STRICT; if it is not, it will be called with a NULL first parameter when reading a NULL input value. The function must still return NULL in this case, unless it raises an error. (This case is mainly meant to support domain input functions, which might need to reject NULL inputs.) The output function must be declared as taking one argument of the new data type. The output function must return type <type>cstring</type>. Output functions are not invoked for NULL values.
ru: <replaceable class="parameter">Функция_ввода</replaceable> преобразует внешнее текстовое представление типа во внутреннее, с которым работают операторы и функции, определённые для этого типа. <replaceable class="parameter">Функция_вывода</replaceable> выполняет обратное преобразование. Функцию ввода можно объявить как принимающую один аргумент типа <type>cstring</type>, либо как принимающую три аргумента типов <type>cstring</type>, <type>oid</type> и <type>integer</type>. В первом аргументе передаётся вводимый текст в виде строки в стиле C, во втором аргументе — собственный OID типа (кроме типов массивов, для которых передаётся OID типа элемента), а в третьем — <literal>модификатор_типа</literal> для целевого столбца, если он определён (или -1 в противном случае). Функция ввода должна возвращать значение нового типа данных. Обычно функция ввода должна быть строгой (STRICT); если это не так, при получении на вход значения NULL она будет вызываться с первым параметром NULL. Функция может в этом случае сама вернуть NULL или вызвать ошибку. (Это полезно в основном для поддержки функций ввода доменных типов, которые не должны принимать данные NULL.) Функция вывода должна принимать один аргумент нового типа данных, а возвращать она должна <type>cstring</type>. Для значений NULL функции вывода не вызываются.

source: The optional <replaceable class="parameter">receive_function</replaceable> converts the type's external binary representation to the internal representation. If this function is not supplied, the type cannot participate in binary input. The binary representation should be chosen to be cheap to convert to internal form, while being reasonably portable. (For example, the standard integer data types use network byte order as the external binary representation, while the internal representation is in the machine's native byte order.) The receive function should perform adequate checking to ensure that the value is valid. The receive function can be declared as taking one argument of type <type>internal</type>, or as taking three arguments of types <type>internal</type>, <type>oid</type>, <type>integer</type>. The first argument is a pointer to a <type>StringInfo</type> buffer holding the received byte string; the optional arguments are the same as for the text input function. The receive function must return a value of the data type itself. Usually, a receive function should be declared STRICT; if it is not, it will be called with a NULL first parameter when reading a NULL input value. The function must still return NULL in this case, unless it raises an error. (This case is mainly meant to support domain receive functions, which might need to reject NULL inputs.) Similarly, the optional <replaceable class="parameter">send_function</replaceable> converts from the internal representation to the external binary representation. If this function is not supplied, the type cannot participate in binary output. The send function must be declared as taking one argument of the new data type. The send function must return type <type>bytea</type>. Send functions are not invoked for NULL values.
ru: Необязательная <replaceable class="parameter">функция_получения</replaceable> преобразует двоичное внешнее представление типа во внутреннее представление. Если эта функция отсутствует, новый тип не сможет участвовать в двоичном вводе. Двоичное представление следует выбирать таким, чтобы оно легко переводилось во внутреннюю форму и при этом было переносимым до разумной степени. (Например, для стандартных целочисленных типов данных во внешнем двоичном представлении выбран сетевой порядок байтов, тогда как внутреннее представление определяется порядком байтов в процессоре.) Функция получения должна выполнить проверку вводимого значения на допустимость. Функция получения может быть объявлена как принимающая один аргумент типа <type>internal</type>, либо как принимающая три аргумента типов <type>internal</type>, <type>oid</type> и <type>integer</type>. В первом аргументе передаётся указатель на буфер <type>StringInfo</type>, содержащий полученную байтовую строку, а дополнительные аргументы такие же, как и для функции ввода текста. Функция получения должна возвращать значение нового типа данных. Обычно функция получения должна быть строгой (STRICT); если это не так, при получении на вход значения NULL, она будет вызываться с первым параметром NULL. Функция может в этом случае сама вернуть NULL или вызывать ошибку. (Это полезно в основном для поддержки функций получения доменных типов, которые не должны принимать значения NULL.) Подобным образом, необязательная <replaceable class="parameter">функция_отправки</replaceable> преобразует данные из внутреннего во внешнее двоичное представление. Если эта функция не определена, новый тип не может участвовать в двоичном выводе. Функция отправки должна принимать один аргумент нового типа данных, а возвращать она должна <type>bytea</type>. Для значений NULL функции отправки не вызываются.

source: You should at this point be wondering how the input and output functions can be declared to have results or arguments of the new type, when they have to be created before the new type can be created. The answer is that the type should first be defined as a <firstterm>shell type</firstterm>, which is a placeholder type that has no properties except a name and an owner. This is done by issuing the command <literal>CREATE TYPE <replaceable>name</replaceable></literal>, with no additional parameters. Then the C I/O functions can be defined referencing the shell type. Finally, <command>CREATE TYPE</command> with a full definition replaces the shell entry with a complete, valid type definition, after which the new type can be used normally.
ru: Здесь у вас может возникнуть вопрос, как функции ввода и вывода могут быть объявлены принимающими или возвращающими значения нового типа, если они должны быть созданы до объявления нового типа. Ответ довольно прост: сначала нужно создать <firstterm>тип-пустышку</firstterm>, который будет заготовкой типа, не имеющей никаких свойств, кроме имени и владельца. Это можно сделать, выполнив команду <literal>CREATE TYPE <replaceable>имя</replaceable></literal> без дополнительных параметров. Затем можно будет определить функции ввода/вывода на C, ссылающиеся на этот тип. И наконец, команда <command>CREATE TYPE</command> с полным определением заменит тип-пустышку окончательным и полноценным определением, после чего новый тип можно будет использовать как обычно.

source: The optional <replaceable class="parameter">type_modifier_input_function</replaceable> and <replaceable class="parameter">type_modifier_output_function</replaceable> are needed if the type supports modifiers, that is optional constraints attached to a type declaration, such as <literal>char(5)</literal> or <literal>numeric(30,2)</literal>. <productname>PostgreSQL</productname> allows user-defined types to take one or more simple constants or identifiers as modifiers. However, this information must be capable of being packed into a single non-negative integer value for storage in the system catalogs. The <replaceable class="parameter">type_modifier_input_function</replaceable> is passed the declared modifier(s) in the form of a <type>cstring</type> array. It must check the values for validity (throwing an error if they are wrong), and if they are correct, return a single non-negative <type>integer</type> value that will be stored as the column <quote>typmod</quote>. Type modifiers will be rejected if the type does not have a <replaceable class="parameter">type_modifier_input_function</replaceable>. The <replaceable class="parameter">type_modifier_output_function</replaceable> converts the internal integer typmod value back to the correct form for user display. It must return a <type>cstring</type> value that is the exact string to append to the type name; for example <type>numeric</type>'s function might return <literal>(30,2)</literal>. It is allowed to omit the <replaceable class="parameter">type_modifier_output_function</replaceable>, in which case the default display format is just the stored typmod integer value enclosed in parentheses.
ru: Необязательные <replaceable class="parameter">функция_ввода_модификатора_типа</replaceable> и <replaceable class="parameter">функция_вывода_модификатора_типа</replaceable> требуются, только если типы поддерживают модификаторы, или, другими словами, дополнительные ограничения, связываемые с объявлением типа, например <literal>char(5)</literal> или <literal>numeric(30,2)</literal>. В <productname>PostgreSQL</productname> типы могут принимать в качестве модификаторов одну или несколько простых констант или идентификаторов. Однако эти данные должны упаковываться в единственное неотрицательное целочисленное значение, которое и будет храниться в системных каталогах. <replaceable class="parameter">Функция_ввода_модификатора_типа</replaceable> получает объявленные модификаторы в виде строки <type>cstring</type>. Она должна проверить значения на допустимость (и вызвать ошибку, если они неверны), а затем выдать неотрицательное значение <type>integer</type>, которое будет сохранено в столбце <quote>typmod</quote>. Если для типа не определена <replaceable class="parameter">функция_ввода_модификатора_типа</replaceable>, модификаторы типа приниматься не будут. <replaceable class="parameter">Функция_вывода_модификатора_типа</replaceable> преобразует внутреннее целочисленное значение typmod обратно, в форму, понятную пользователю. Она должна вернуть значение <type>cstring</type>, которое именно в этом виде будет добавлено к имени типа; например, функция для <type>numeric</type> должна вернуть <literal>(30,2)</literal>. <replaceable class="parameter">Функция_вывода_модификатора_типа</replaceable> может быть опущена, в этом случае сохранённое целочисленное значение typmod по умолчанию будет выводиться просто в виде числа, заключённого в скобки.
