Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_aggregate.po
Languages: ru

source: The name of the final function called to compute the aggregate's result after all input rows have been traversed. For a normal aggregate, this function must take a single argument of type <replaceable class="parameter">state_data_type</replaceable>. The return data type of the aggregate is defined as the return type of this function. If <replaceable class="parameter">ffunc</replaceable> is not specified, then the ending state value is used as the aggregate's result, and the return type is <replaceable class="parameter">state_data_type</replaceable>.
ru: Имя функции завершения, вызываемой для вычисления результата агрегатной функции после обработки всех входных строк. Для обычного агрегата эта функция должна принимать единственный аргумент типа <replaceable class="parameter">тип_данных_состояния</replaceable>. Возвращаемым типом агрегата будет тип, который возвращает эта функция. Если <replaceable class="parameter">функция_завершения</replaceable> не указана, результатом агрегата будет конечное значение состояния, а типом результата — <replaceable class="parameter">тип_данных_состояния</replaceable>.

source: For ordered-set (including hypothetical-set) aggregates, the final function receives not only the final state value, but also the values of all the direct arguments.
ru: В сортирующих (и в том числе, гипотезирующих) агрегатах функция завершения получает не только конечное значение состояния, но и значения всех непосредственных аргументов.

source: If <literal>FINALFUNC_EXTRA</literal> is specified, then in addition to the final state value and any direct arguments, the final function receives extra NULL values corresponding to the aggregate's regular (aggregated) arguments. This is mainly useful to allow correct resolution of the aggregate result type when a polymorphic aggregate is being defined.
ru: Если команда содержит указание <literal>FINALFUNC_EXTRA</literal>, то в дополнение к конечному значению состояния и всем непосредственным аргументам функция завершения получает добавочные значения NULL, соответствующие обычным (агрегируемым) аргументам агрегата. Это в основном полезно для правильного определения типа результата при создании полиморфной агрегатной функции.

source: The <replaceable class="parameter">combinefunc</replaceable> function may optionally be specified to allow the aggregate function to support partial aggregation. If provided, the <replaceable class="parameter">combinefunc</replaceable> must combine two <replaceable class="parameter">state_data_type</replaceable> values, each containing the result of aggregation over some subset of the input values, to produce a new <replaceable class="parameter">state_data_type</replaceable> that represents the result of aggregating over both sets of inputs. This function can be thought of as an <replaceable class="parameter">sfunc</replaceable>, where instead of acting upon an individual input row and adding it to the running aggregate state, it adds another aggregate state to the running state.
ru: Дополнительно может быть указана <replaceable class="parameter">комбинирующая_функция</replaceable>, чтобы агрегатная функция поддерживала частичное агрегирование. Если задаётся, <replaceable class="parameter">комбинирующая_функция</replaceable> должна комбинировать два значения <replaceable class="parameter">типа_данных_состояния</replaceable>, содержащих результат агрегирования по некоторому подмножеству входных значений, и вычислять новое значение <replaceable class="parameter">типа_данных_состояния</replaceable>, представляющее результат агрегирования по обоим множествам данных. Эту функцию можно считать своего рода <replaceable class="parameter">функцией_состояния</replaceable>, которая вместо обработки отдельной входной строки и включения её данных в текущее агрегируемое состояние включает некоторое агрегированное состояние в текущее.

source: The <replaceable class="parameter">combinefunc</replaceable> must be declared as taking two arguments of the <replaceable class="parameter">state_data_type</replaceable> and returning a value of the <replaceable class="parameter">state_data_type</replaceable>. Optionally this function may be <quote>strict</quote>. In this case the function will not be called when either of the input states are null; the other state will be taken as the correct result.
ru: Указанная <replaceable class="parameter">комбинирующая_функция</replaceable> должна быть объявлена как принимающая два аргумента <replaceable class="parameter">типа_данных_состояния</replaceable> и возвращающая значение <replaceable class="parameter">типа_данных_состояния</replaceable>. Эта функция дополнительно может быть объявлена <quote>строгой</quote>. В этом случае данная функция не будет вызываться, когда одно из входных состояний — NULL; в качестве корректного результата будет выдано другое состояние.

source: For aggregate functions whose <replaceable class="parameter">state_data_type</replaceable> is <type>internal</type>, the <replaceable class="parameter">combinefunc</replaceable> must not be strict. In this case the <replaceable class="parameter">combinefunc</replaceable> must ensure that null states are handled correctly and that the state being returned is properly stored in the aggregate memory context.
ru: Для агрегатных функций, у которых <replaceable class="parameter">тип_данных_состояния</replaceable> — <type>internal</type>, <replaceable class="parameter">комбинирующая_функция</replaceable> не должна быть <quote>строгой</quote>. При этом <replaceable class="parameter">комбинирующая_функция</replaceable> должна позаботиться о том, чтобы состояния NULL обрабатывались корректно и возвращаемое состояние располагалось в контексте памяти агрегирования.

source: An aggregate function whose <replaceable class="parameter">state_data_type</replaceable> is <type>internal</type> can participate in parallel aggregation only if it has a <replaceable class="parameter">serialfunc</replaceable> function, which must serialize the aggregate state into a <type>bytea</type> value for transmission to another process. This function must take a single argument of type <type>internal</type> and return type <type>bytea</type>. A corresponding <replaceable class="parameter">deserialfunc</replaceable> is also required.
ru: Агрегатная функция, у которой <replaceable class="parameter">тип_данных_состояния</replaceable> — <type>internal</type>, может участвовать в параллельном агрегировании, только если для неё задана <replaceable class="parameter">функция_сериализации</replaceable>, которая должна сериализовать агрегатное состояние в значение <type>bytea</type> для передачи другому процессу. Эта функция должна принимать один аргумент типа <type>internal</type> и возвращать тип <type>bytea</type>. Также при этом нужно задать соответствующую <replaceable class="parameter">функцию_десериализации</replaceable>.

source: Deserialize a previously serialized aggregate state back into <replaceable class="parameter">state_data_type</replaceable>. This function must take two arguments of types <type>bytea</type> and <type>internal</type>, and produce a result of type <type>internal</type>. (Note: the second, <type>internal</type> argument is unused, but is required for type safety reasons.)
ru: Десериализует ранее сериализованное агрегатное состояние обратно в <replaceable class="parameter">тип_данных_состояния</replaceable>. Эта функция должна принимать два аргумента типов <type>bytea</type> и <type>internal</type> и выдавать результат типа <type>internal</type>. (Замечание: второй аргумент типа <type>internal</type> не используется, но требуется из соображений типобезопасности.)

source: The initial setting for the state value. This must be a string constant in the form accepted for the data type <replaceable class="parameter">state_data_type</replaceable>. If not specified, the state value starts out null.
ru: Начальное значение переменной состояния. Оно должно задаваться строковой константой в форме, пригодной для ввода в <replaceable class="parameter">тип_данных_состояния</replaceable>. Если не указано, начальным значением состояния будет NULL.

source: The name of the forward state transition function to be called for each input row in moving-aggregate mode. This is exactly like the regular transition function, except that its first argument and result are of type <replaceable>mstate_data_type</replaceable>, which might be different from <replaceable>state_data_type</replaceable>.
ru: Имя функции прямого перехода состояния, вызываемой для каждой входной строки в режиме движущегося агрегата. Это точно такая же функция, как и обычная функция перехода, но её первый аргумент и результат имеют тип <replaceable>тип_данных_состояния_движ</replaceable>, который может отличаться от типа <replaceable>тип_данных_состояния</replaceable>.

source: The name of the inverse state transition function to be used in moving-aggregate mode. This function has the same argument and result types as <replaceable>msfunc</replaceable>, but it is used to remove a value from the current aggregate state, rather than add a value to it. The inverse transition function must have the same strictness attribute as the forward state transition function.
ru: Имя функции обратного перехода состояния, применяемой в режиме движущегося агрегата. У этой функции те же типы аргумента и результатов, что и у <replaceable>функции_состояния_движ</replaceable>, но она предназначена не для добавления, а для удаления значения из текущего состояния агрегата. Функция обратного перехода должна иметь ту же характеристику строгости, что и функция прямого перехода.

source: The data type for the aggregate's state value, when using moving-aggregate mode.
ru: Тип данных значения состояния для агрегатной функции в режиме движущегося агрегата.

source: The approximate average size (in bytes) of the aggregate's state value, when using moving-aggregate mode. This works the same as <replaceable>state_data_size</replaceable>.
ru: Примерный размер значения состояния в режиме движущегося агрегата. Он имеет то же значение, что и <replaceable>размер_данных_состояния</replaceable>.

source: The name of the final function called to compute the aggregate's result after all input rows have been traversed, when using moving-aggregate mode. This works the same as <replaceable>ffunc</replaceable>, except that its first argument's type is <replaceable>mstate_data_type</replaceable> and extra dummy arguments are specified by writing <literal>MFINALFUNC_EXTRA</literal>. The aggregate result type determined by <replaceable>mffunc</replaceable> or <replaceable>mstate_data_type</replaceable> must match that determined by the aggregate's regular implementation.
ru: Имя функции завершения, вызываемой в режиме движущегося агрегата для вычисления результата агрегатной функции после обработки всех входных строк. Она работает так же, как <replaceable>функция_завершения</replaceable>, но её первый аргумент имеет тип <replaceable>тип_данных_состояния_движ</replaceable>, а дополнительными пустыми аргументами управляет параметр <literal>MFINALFUNC_EXTRA</literal>. Тип результата, который определяет <replaceable>функция_завершения_движ</replaceable>, или <replaceable>тип_данных_состояния_движ</replaceable>, должен совпадать с типом результата обычной реализации агрегата.

source: The initial setting for the state value, when using moving-aggregate mode. This works the same as <replaceable>initial_condition</replaceable>.
ru: Начальное значение переменной состояния в режиме движущегося агрегата. Оно применяется так же, как <replaceable>начальное_условие</replaceable>.

source: The associated sort operator for a <function>MIN</function>- or <function>MAX</function>-like aggregate. This is just an operator name (possibly schema-qualified). The operator is assumed to have the same input data types as the aggregate (which must be a single-argument normal aggregate).
ru: Связанный оператор сортировки для реализации агрегатов, подобных <function>MIN</function> или <function>MAX</function>. Здесь указывается просто имя оператора (возможно, дополненное схемой). Предполагается, что оператор поддерживает те же типы входных данных, что и агрегат (который должен быть обычным и иметь один аргумент).

source: The meanings of <literal>PARALLEL SAFE</literal>, <literal>PARALLEL RESTRICTED</literal>, and <literal>PARALLEL UNSAFE</literal> are the same as for <xref linkend="sql-createfunction"/>. An aggregate will not be considered for parallelization if it is marked <literal>PARALLEL UNSAFE</literal> (which is the default!) or <literal>PARALLEL RESTRICTED</literal>. Note that the parallel-safety markings of the aggregate's support functions are not consulted by the planner, only the marking of the aggregate itself.
ru: Указания <literal>PARALLEL SAFE</literal>, <literal>PARALLEL RESTRICTED</literal> и <literal>PARALLEL UNSAFE</literal> имеют те же значения, что и в <xref linkend="sql-createfunction"/>. Агрегатная функция не будет считаться распараллеливаемой, если она имеет характеристику <literal>PARALLEL UNSAFE</literal> (она подразумевается по умолчанию!) или <literal>PARALLEL RESTRICTED</literal>. Заметьте, что планировщик не обращает внимание на допустимость распараллеливания опорных функций агрегата, а учитывает только характеристику самой агрегатной функции.

source: For ordered-set aggregates only, this flag specifies that the aggregate arguments are to be processed according to the requirements for hypothetical-set aggregates: that is, the last few direct arguments must match the data types of the aggregated (<literal>WITHIN GROUP</literal>) arguments. The <literal>HYPOTHETICAL</literal> flag has no effect on run-time behavior, only on parse-time resolution of the data types and collations of the aggregate's arguments.
ru: Этот признак, допустимый только для сортирующих агрегатов, указывает, что агрегатные аргументы должны обрабатываться согласно требованиям гипотезирующих агрегатов: то есть последние несколько прямых аргументов должны соответствовать по типам агрегатным аргументам (<literal>WITHIN GROUP</literal>). Признак <literal>HYPOTHETICAL</literal> не влияет на поведение во время выполнения, он учитывается только при разрешении типов данных и правил сортировки аргументов.

source: The parameters of <command>CREATE AGGREGATE</command> can be written in any order, not just the order illustrated above.
ru: Параметры <command>CREATE AGGREGATE</command> могут записываться в любом порядке, не обязательно так, как показано выше.

source: Notes
ru: Замечания

source: In parameters that specify support function names, you can write a schema name if needed, for example <literal>SFUNC = public.sum</literal>. Do not write argument types there, however &mdash; the argument types of the support functions are determined from other parameters.
ru: В параметрах, определяющих имена вспомогательных функций, при необходимости можно написать имя схемы, например: <literal>SFUNC = public.sum</literal>. Однако типы аргументов там не указываются &mdash; типы аргументов вспомогательных функций определяются другими параметрами.

source: If an aggregate supports moving-aggregate mode, it will improve calculation efficiency when the aggregate is used as a window function for a window with moving frame start (that is, a frame start mode other than <literal>UNBOUNDED PRECEDING</literal>). Conceptually, the forward transition function adds input values to the aggregate's state when they enter the window frame from the bottom, and the inverse transition function removes them again when they leave the frame at the top. So, when values are removed, they are always removed in the same order they were added. Whenever the inverse transition function is invoked, it will thus receive the earliest added but not yet removed argument value(s). The inverse transition function can assume that at least one row will remain in the current state after it removes the oldest row. (When this would not be the case, the window function mechanism simply starts a fresh aggregation, rather than using the inverse transition function.)
ru: Если агрегатная функция поддерживает режим движущегося агрегата, это увеличивает эффективность вычислений, когда она применяется в качестве оконной функции для окна с движущимся началом рамки (то есть, когда начало определяется не как <literal>UNBOUNDED PRECEDING</literal>). По сути, функция прямого перехода добавляет входные значения к состоянию агрегата, когда они поступают в рамку окна снизу, а функция обратного перехода снова вычитает их, когда они покидают рамку сверху. Поэтому вычитаются значения в том же порядке, в каком добавлялись. Когда бы ни вызывалась функция обратного перехода, она таким образом получит первое из добавленных, но ещё не удалённых значений аргумента. Функция обратного перехода может рассчитывать на то, что после того, как она удалит самые старые данные, в текущем состоянии останется ещё как минимум одна строка. (Когда это правило могло бы нарушиться, механизм оконных функций просто начинает агрегировать данные заново, а не вызывает функцию обратного перехода.)

source: The forward transition function for moving-aggregate mode is not allowed to return NULL as the new state value. If the inverse transition function returns NULL, this is taken as an indication that the inverse function cannot reverse the state calculation for this particular input, and so the aggregate calculation will be redone from scratch for the current frame starting position. This convention allows moving-aggregate mode to be used in situations where there are some infrequent cases that are impractical to reverse out of the running state value.
ru: Функция прямого перехода для режима движущегося агрегата не может возвращать NULL в качестве нового значения состояния. Если NULL возвращает функция обратного перехода, это показывает, что она не может произвести обратное вычисление для этих конкретных данных, и что вычисление агрегата следует выполнить заново от начальной позиции текущей рамки. Благодаря этому соглашению, режим движущегося агрегата можно использовать, даже если иногда возникают ситуации, в которых обратный расчёт состояния производить непрактично.

source: If no moving-aggregate implementation is supplied, the aggregate can still be used with moving frames, but <productname>PostgreSQL</productname> will recompute the whole aggregation whenever the start of the frame moves. Note that whether or not the aggregate supports moving-aggregate mode, <productname>PostgreSQL</productname> can handle a moving frame end without recalculation; this is done by continuing to add new values to the aggregate's state. It is assumed that the final function does not damage the aggregate's state value, so that the aggregation can be continued even after an aggregate result value has been obtained for one set of frame boundaries.
ru: Агрегатную функцию можно использовать с движущимися рамками и без реализации движущегося агрегата, но при этом <productname>PostgreSQL</productname> будет заново агрегировать все данные при каждом перемещении начала рамки. Заметьте, что вне зависимости от того, поддерживает ли агрегатная функция режим движущегося агрегата, <productname>PostgreSQL</productname> может обойтись без повторных вычислений при сдвиге конца рамки; новые значения просто продолжают добавляться в состояние агрегата. Предполагается, что функция завершения не повреждает значение состояния агрегата, так что вычисление агрегата можно продолжить даже после получения результата для строк в определённой рамке.

source: The syntax for ordered-set aggregates allows <literal>VARIADIC</literal> to be specified for both the last direct parameter and the last aggregated (<literal>WITHIN GROUP</literal>) parameter. However, the current implementation restricts use of <literal>VARIADIC</literal> in two ways. First, ordered-set aggregates can only use <literal>VARIADIC "any"</literal>, not other variadic array types. Second, if the last direct parameter is <literal>VARIADIC "any"</literal>, then there can be only one aggregated parameter and it must also be <literal>VARIADIC "any"</literal>. (In the representation used in the system catalogs, these two parameters are merged into a single <literal>VARIADIC "any"</literal> item, since <structname>pg_proc</structname> cannot represent functions with more than one <literal>VARIADIC</literal> parameter.) If the aggregate is a hypothetical-set aggregate, the direct arguments that match the <literal>VARIADIC "any"</literal> parameter are the hypothetical ones; any preceding parameters represent additional direct arguments that are not constrained to match the aggregated arguments.
ru: Синтаксис сортирующих агрегатных функций позволяет указать <literal>VARIADIC</literal> и в последнем непосредственном параметре, и в последнем агрегатном (<literal>WITHIN GROUP</literal>). Однако в текущей реализации на применение <literal>VARIADIC</literal> накладываются два ограничения. Во-первых, в сортирующих агрегатах можно использовать только <literal>VARIADIC "any"</literal>, но не другие типы переменных массивов. Во-вторых, если последним непосредственным аргументом является <literal>VARIADIC "any"</literal>, то допускается только один агрегатный аргумент и это тоже должен быть <literal>VARIADIC "any"</literal>. (В представлении, используемом в системных каталогах, эти два параметра объединяются в один элемент <literal>VARIADIC "any"</literal>, так как в <structname>pg_proc</structname> нельзя представить функцию с несколькими параметрами <literal>VARIADIC</literal>.) Если агрегатная функция является гипотезирующей, непосредственные аргументы, соответствующие параметру <literal>VARIADIC "any"</literal>, будут гипотетическими; любые предшествующие параметры представляют дополнительные непосредственные аргументы, которые могут не соответствовать агрегатным.

source: Currently, ordered-set aggregates do not need to support moving-aggregate mode, since they cannot be used as window functions.
ru: В настоящее время сортирующие агрегатные функции не поддерживают режим движущегося агрегата, так как их нельзя применять в качестве оконных функций.

source: Partial (including parallel) aggregation is currently not supported for ordered-set aggregates. Also, it will never be used for aggregate calls that include <literal>DISTINCT</literal> or <literal>ORDER BY</literal> clauses, since those semantics cannot be supported during partial aggregation.
ru: Частичное (в том числе, параллельное) агрегирование в настоящее время не поддерживается для сортирующих агрегатных функций. Также оно никогда не будет применяться для агрегатных вызовов с предложениями <literal>DISTINCT</literal> или <literal>ORDER BY</literal>, так как они по природе своей не могут быть реализованы с частичным агрегированием.

source: Examples
ru: Примеры

source: See <xref linkend="xaggr"/>.
ru: См. <xref remap="4" linkend="xaggr"/>.

source: Compatibility
ru: Совместимость

source: <command>CREATE AGGREGATE</command> is a <productname>PostgreSQL</productname> language extension. The SQL standard does not provide for user-defined aggregate functions.
ru: Оператор <command>CREATE AGGREGATE</command> является языковым расширением <productname>PostgreSQL</productname>. В стандарте SQL не предусмотрено создание пользовательских агрегатных функций.

source: See Also
ru: См. также
