Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_schema.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new schema
ru: создать схему

source: schema_name
ru: имя_схемы

source: role_specification
ru: указание_роли

source: schema_element
ru: элемент_схемы

source: where <placeholder-1/> can be:
ru: Здесь <placeholder-1/>:

source: user_name
ru: имя_пользователя

source: Description
ru: Описание

source: <command>CREATE SCHEMA</command> enters a new schema into the current database. The schema name must be distinct from the name of any existing schema in the current database.
ru: <command>CREATE SCHEMA</command> создаёт новую схему в текущей базе данных. Имя схемы должно отличаться от имён других существующих схем в текущей базе данных.

source: A schema is essentially a namespace: it contains named objects (tables, data types, functions, and operators) whose names can duplicate those of other objects existing in other schemas. Named objects are accessed either by <quote>qualifying</quote> their names with the schema name as a prefix, or by setting a search path that includes the desired schema(s). A <literal>CREATE</literal> command specifying an unqualified object name creates the object in the current schema (the one at the front of the search path, which can be determined with the function <function>current_schema</function>).
ru: Схема по сути представляет собой пространство имён: она содержит именованные объекты (таблицы, типы данных, функции и операторы), имена которых могут совпадать с именами других объектов, существующих в других схемах. Для обращения к объекту нужно либо <quote>дополнить</quote> его имя именем схемы в виде префикса, либо установить путь поиска, включающий требуемую схему. Команда <literal>CREATE</literal>, в которой указывается неполное имя объекта, создаёт объект в текущей схеме (схеме, стоящей первой в пути поиска; узнать её позволяет функция <function>current_schema</function>).

source: Optionally, <command>CREATE SCHEMA</command> can include subcommands to create objects within the new schema. The subcommands are treated essentially the same as separate commands issued after creating the schema, except that if the <literal>AUTHORIZATION</literal> clause is used, all the created objects will be owned by that user.
ru: Команда <command>CREATE SCHEMA</command> может дополнительно включать подкоманды, создающие объекты в новой схеме. Эти подкоманды по сути воспринимаются как отдельные команды, выполняемые после создания схемы, за исключением того, что с предложением <literal>AUTHORIZATION</literal> все создаваемые объекты будут принадлежать указанному в нём пользователю.

source: Parameters
ru: Параметры

source: The name of a schema to be created. If this is omitted, the <replaceable class="parameter">user_name</replaceable> is used as the schema name. The name cannot begin with <literal>pg_</literal>, as such names are reserved for system schemas.
ru: Имя создаваемой схемы. Если оно опущено, именем схемы будет <replaceable class="parameter">имя_пользователя</replaceable>. Это имя не может начинаться с <literal>pg_</literal>, так как такие имена зарезервированы для системных схем.

source: The role name of the user who will own the new schema. If omitted, defaults to the user executing the command. To create a schema owned by another role, you must be a direct or indirect member of that role, or be a superuser.
ru: Имя пользователя (роли), назначаемого владельцем новой схемы. Если опущено, по умолчанию владельцем будет пользователь, выполняющий команды. Чтобы назначить владельцем создаваемой схемы другую роль, необходимо быть непосредственным или опосредованным членом этой роли, либо суперпользователем.

source: An SQL statement defining an object to be created within the schema. Currently, only <command>CREATE TABLE</command>, <command>CREATE VIEW</command>, <command>CREATE INDEX</command>, <command>CREATE SEQUENCE</command>, <command>CREATE TRIGGER</command> and <command>GRANT</command> are accepted as clauses within <command>CREATE SCHEMA</command>. Other kinds of objects may be created in separate commands after the schema is created.
ru: Оператор SQL, определяющий объект, создаваемый в новой схеме. В настоящее время <command>CREATE SCHEMA</command> может содержать только подкоманды <command>CREATE TABLE</command>, <command>CREATE VIEW</command>, <command>CREATE INDEX</command>, <command>CREATE SEQUENCE</command>, <command>CREATE TRIGGER</command> и <command>GRANT</command>. Создать объекты других типов можно отдельными командами после создания схемы.

source: Do nothing (except issuing a notice) if a schema with the same name already exists. <replaceable class="parameter">schema_element</replaceable> subcommands cannot be included when this option is used.
ru: Не делать ничего (только выдать замечание), если схема с таким именем уже существует. Когда используется это указание, эта команда не может содержать подкоманды <replaceable class="parameter">элемент_схемы</replaceable>.

source: Notes
ru: Замечания

source: To create a schema, the invoking user must have the <literal>CREATE</literal> privilege for the current database. (Of course, superusers bypass this check.)
ru: Чтобы создать схему, пользователь должен иметь право <literal>CREATE</literal> в текущей базе данных. (Разумеется, на суперпользователей это условие не распространяется.)

source: Examples
ru: Примеры

source: Create a schema: <placeholder-1/>
ru: Создание схемы: <placeholder-1/>

source: Create a schema for user <literal>joe</literal>; the schema will also be named <literal>joe</literal>: <placeholder-1/>
ru: Создание схемы для пользователя <literal>joe</literal>; схема так же получит имя <literal>joe</literal>: <placeholder-1/>

source: Create a schema named <literal>test</literal> that will be owned by user <literal>joe</literal>, unless there already is a schema named <literal>test</literal>. (It does not matter whether <literal>joe</literal> owns the pre-existing schema.) <placeholder-1/>
ru: Создание схемы с именем <literal>test</literal>, владельцем которой будет пользователь <literal>joe</literal>, если только схема <literal>test</literal> ещё не существует. (Является ли владельцем существующей схемы пользователь <literal>joe</literal>, значения не имеет.) <placeholder-1/>

source: Create a schema and create a table and view within it: <placeholder-1/> Notice that the individual subcommands do not end with semicolons.
ru: Создание схемы, в которой сразу создаются таблица и представление: <placeholder-1/> Заметьте, что отдельные подкоманды не завершаются точкой с запятой.

source: The following is an equivalent way of accomplishing the same result: <placeholder-1/>
ru: Следующие команды приводят к тому же результату другим способом: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The SQL standard allows a <literal>DEFAULT CHARACTER SET</literal> clause in <command>CREATE SCHEMA</command>, as well as more subcommand types than are presently accepted by <productname>PostgreSQL</productname>.
ru: Стандарт SQL также допускает в команде <command>CREATE SCHEMA</command> предложение <literal>DEFAULT CHARACTER SET</literal> и дополнительные типы подкоманд, которые <productname>PostgreSQL</productname> в настоящее время не принимает.

source: The SQL standard specifies that the subcommands in <command>CREATE SCHEMA</command> can appear in any order. The present <productname>PostgreSQL</productname> implementation does not handle all cases of forward references in subcommands; it might sometimes be necessary to reorder the subcommands in order to avoid forward references.
ru: В стандарте SQL говорится, что подкоманды в <command>CREATE SCHEMA</command> могут следовать в любом порядке. Однако текущая реализация в <productname>PostgreSQL</productname> не воспринимает все возможные варианты ссылок вперёд в подкомандах, поэтому иногда возникает необходимость переупорядочить подкоманды, чтобы исключить такие ссылки.

source: According to the SQL standard, the owner of a schema always owns all objects within it. <productname>PostgreSQL</productname> allows schemas to contain objects owned by users other than the schema owner. This can happen only if the schema owner grants the <literal>CREATE</literal> privilege on their schema to someone else, or a superuser chooses to create objects in it.
ru: Согласно стандарту SQL, владелец схемы всегда владеет всеми объектами в ней, но <productname>PostgreSQL</productname> допускает размещение в схемах объектов, принадлежащих не владельцу схемы. Такая ситуация возможна, только если владелец схемы даст право <literal>CREATE</literal> в этой схеме кому-либо другому, либо объекты в ней будет создавать суперпользователь.

source: The <literal>IF NOT EXISTS</literal> option is a <productname>PostgreSQL</productname> extension.
ru: Указание <literal>IF NOT EXISTS</literal> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
