Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_collation.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new collation
ru: создать правило сортировки

source: locale
ru: локаль

source: lc_collate
ru: категория_сортировки

source: lc_ctype
ru: категория_типов_символов

source: existing_collation
ru: существующее_правило

source: Description
ru: Описание

source: <command>CREATE COLLATION</command> defines a new collation using the specified operating system locale settings, or by copying an existing collation.
ru: <command>CREATE COLLATION</command> определяет новое правило сортировки, используя параметры локали операционной системы, либо копируя существующее правило.

source: To be able to create a collation, you must have <literal>CREATE</literal> privilege on the destination schema.
ru: Чтобы создать правило сортировки, необходимо иметь право <literal>CREATE</literal> в целевой схеме.

source: Parameters
ru: Параметры

source: The name of the collation. The collation name can be schema-qualified. If it is not, the collation is defined in the current schema. The collation name must be unique within that schema. (The system catalogs can contain collations with the same name for other encodings, but these are ignored if the database encoding does not match.)
ru: Имя правила сортировки, возможно, дополненное схемой. Если схема не указана, правило сортировки создаётся в текущей схеме. Заданное имя правила должно быть уникальным в этой схеме. (Системные каталоги могут содержать правила сортировки с одним именем, но предназначенные для разных кодировок, однако они будут игнорироваться, если их кодировка не совпадает с кодировкой базы данных.)

source: This is a shortcut for setting <symbol>LC_COLLATE</symbol> and <symbol>LC_CTYPE</symbol> at once. If you specify this, you cannot specify either of those parameters.
ru: Это краткая запись для одновременной установки <symbol>LC_COLLATE</symbol> и <symbol>LC_CTYPE</symbol>. Если указан этот вариант, задать любой из этих параметров отдельно нельзя.

source: Use the specified operating system locale for the <symbol>LC_COLLATE</symbol> locale category. The locale must be applicable to the current database encoding. (See <xref linkend="sql-createdatabase"/> for the precise rules.)
ru: Указанная локаль операционной системы устанавливается в качестве категории локали <symbol>LC_COLLATE</symbol>. Эта локаль должна быть применимой к кодировке текущей базы данных. (Точные правила описаны в <xref remap="6" linkend="sql-createdatabase"/>.)

source: Use the specified operating system locale for the <symbol>LC_CTYPE</symbol> locale category. The locale must be applicable to the current database encoding. (See <xref linkend="sql-createdatabase"/> for the precise rules.)
ru: Указанная локаль операционной системы устанавливается в качестве категории локали <symbol>LC_CTYPE</symbol>. Эта локаль должна быть применимой к кодировке текущей базы данных. (Точные правила описаны в <xref remap="6" linkend="sql-createdatabase"/>.)

source: The name of an existing collation to copy. The new collation will have the same properties as the existing one, but it will be an independent object.
ru: Имя копируемого существующего правила сортировки. Новое правило сортировки получит те же свойства, что и существующее, но будет независимым объектом.

source: Use <command>DROP COLLATION</command> to remove user-defined collations.
ru: Для удаления созданных пользователем правил сортировки применяется команда <command>DROP COLLATION</command>.

source: See <xref linkend="collation"/> for more information about collation support in PostgreSQL.
ru: Дополнительные сведения о поддержке правил сортировки можно найти в <xref remap="6" linkend="collation"/>.

source: Examples
ru: Примеры

source: To create a collation from the operating system locale <literal>fr_FR.utf8</literal> (assuming the current database encoding is <literal>UTF8</literal>): <placeholder-1/>
ru: Создание правила сортировки из локали операционной системы <literal>fr_FR.utf8</literal> (предполагается, что кодировка текущей базы данных — <literal>UTF8</literal>): <placeholder-1/>

source: To create a collation from an existing collation: <placeholder-1/> This can be convenient to be able to use operating-system-independent collation names in applications.
ru: Создание правила сортировки из уже существующего: <placeholder-1/> Иногда удобно использовать в приложениях имена правил сортировки, не зависящие от операционной системы.

source: Compatibility
ru: Совместимость

source: There is a <command>CREATE COLLATION</command> statement in the SQL standard, but it is limited to copying an existing collation. The syntax to create a new collation is a <productname>PostgreSQL</productname> extension.
ru: Оператор <command>CREATE COLLATION</command> определён в стандарте SQL, но его действие ограничено копированием существующего правила сортировки. Синтаксис создания нового правила сортировки представляет собой расширение <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
