Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_table.po
Languages: as, ru

source: The <literal>CHECK</literal> clause specifies an expression producing a Boolean result which new or updated rows must satisfy for an insert or update operation to succeed. Expressions evaluating to TRUE or UNKNOWN succeed. Should any row of an insert or update operation produce a FALSE result, an error exception is raised and the insert or update does not alter the database. A check constraint specified as a column constraint should reference that column's value only, while an expression appearing in a table constraint can reference multiple columns.
ru: В ограничении <literal>CHECK</literal> задаётся выражение, возвращающее булевский результат, по которому определяется, будет ли успешна операция добавления или изменения для конкретных строк. Операция выполняется успешно, если результат выражения равен TRUE или UNKNOWN. Если же для какой-нибудь строки, задействованной в операции добавления или изменения, будет получен результат FALSE, возникает ошибка, и эта операция не меняет ничего в базе данных. Ограничение-проверка, заданное как ограничение столбца, должно ссылаться только на значение самого столбца, тогда как ограничение на уровне таблицы может ссылаться и на несколько столбцов.

source: Currently, <literal>CHECK</literal> expressions cannot contain subqueries nor refer to variables other than columns of the current row. The system column <literal>tableoid</literal> may be referenced, but not any other system column.
ru: В настоящее время выражения <literal>CHECK</literal> не могут содержать подзапросы или ссылаться на переменные, кроме как на столбцы текущей строки. Также допустима ссылка на системный столбец <literal>tableoid</literal>, но не на другие системные столбцы.

source: A constraint marked with <literal>NO INHERIT</literal> will not propagate to child tables.
ru: Ограничение с пометкой <literal>NO INHERIT</literal> не будет наследоваться дочерними таблицами.

source: When a table has multiple <literal>CHECK</literal> constraints, they will be tested for each row in alphabetical order by name, after checking <literal>NOT NULL</literal> constraints. (<productname>PostgreSQL</productname> versions before 9.5 did not honor any particular firing order for <literal>CHECK</literal> constraints.)
ru: Когда для таблицы задано несколько ограничений <literal>CHECK</literal>, они будут проверяться для каждой строки в алфавитном порядке имён после проверки ограничений <literal>NOT NULL</literal>. (До версии 9.5 в <productname>PostgreSQL</productname> не было установлено никакого определённого порядка обработки ограничений <literal>CHECK</literal>.)

source: The <literal>DEFAULT</literal> clause assigns a default data value for the column whose column definition it appears within. The value is any variable-free expression (subqueries and cross-references to other columns in the current table are not allowed). The data type of the default expression must match the data type of the column.
ru: Предложение <literal>DEFAULT</literal> задаёт значение по умолчанию для столбца, в определении которого оно присутствует. Значение задаётся выражением без переменных (подзапросы и перекрёстные ссылки на другие столбцы текущей таблицы в нём не допускаются). Тип данных выражения, задающего значение по умолчанию, должен соответствовать типу данных столбца.

source: The default expression will be used in any insert operation that does not specify a value for the column. If there is no default for a column, then the default is null.
ru: Это выражение будет использоваться во всех операциях добавления данных, в которых не задаётся значение данного столбца. Если значение по умолчанию не определено, таким значением будет NULL.

source: <literal>UNIQUE</literal> (column constraint)
ru: <literal>UNIQUE</literal> (ограничение столбца)

source: <literal>UNIQUE ( <replaceable class="parameter">column_name</replaceable> [, ... ] )</literal> (table constraint)
ru: <literal>UNIQUE ( <replaceable class="parameter">имя_столбца</replaceable> [, ... ] )</literal> (ограничение таблицы)

source: The <literal>UNIQUE</literal> constraint specifies that a group of one or more columns of a table can contain only unique values. The behavior of the unique table constraint is the same as that for column constraints, with the additional capability to span multiple columns.
ru: Ограничение <literal>UNIQUE</literal> определяет, что группа из одного или нескольких столбцов таблицы может содержать только уникальные значения. Ограничение уникальности для таблицы ведёт себя точно так же, как ограничение для столбца, но может охватывать несколько столбцов.

source: For the purpose of a unique constraint, null values are not considered equal.
ru: При проверке ограничения уникальности значения NULL не считаются равными.

source: Each unique table constraint must name a set of columns that is different from the set of columns named by any other unique or primary key constraint defined for the table. (Otherwise it would just be the same constraint listed twice.)
ru: В каждом ограничении уникальности для таблицы должен задаваться набор столбцов, отличный от набора любого другого ограничения уникальности или первичного ключа в данной таблице. (Иначе это будет одно и то же ограничение, определённое многократно.)

source: <literal>PRIMARY KEY</literal> (column constraint)
ru: <literal>PRIMARY KEY</literal> (ограничение столбца)

source: <literal>PRIMARY KEY ( <replaceable class="parameter">column_name</replaceable> [, ... ] )</literal> (table constraint)
ru: <literal>PRIMARY KEY ( <replaceable class="parameter">имя_столбца</replaceable> [, ... ] )</literal> (ограничение таблицы)

source: The <literal>PRIMARY KEY</literal> constraint specifies that a column or columns of a table can contain only unique (non-duplicate), nonnull values. Only one primary key can be specified for a table, whether as a column constraint or a table constraint.
ru: Ограничение <literal>PRIMARY KEY</literal> определяет, что столбец или столбцы таблицы могут содержать только уникальные (без повторений) значения, отличные от NULL. Для таблицы может быть задан только один первичный ключ, будь то ограничение столбца или ограничение таблицы.

source: The primary key constraint should name a set of columns that is different from the set of columns named by any unique constraint defined for the same table. (Otherwise, the unique constraint is redundant and will be discarded.)
ru: В определении первичного ключа должен задаваться набор столбцов, отличный от набора любого другого ограничения уникальности, установленного для данной таблицы. (В противном случае уникальное ограничение оказывается избыточным и будет отброшено.)

source: <literal>PRIMARY KEY</literal> enforces the same data constraints as a combination of <literal>UNIQUE</literal> and <literal>NOT NULL</literal>, but identifying a set of columns as the primary key also provides metadata about the design of the schema, since a primary key implies that other tables can rely on this set of columns as a unique identifier for rows.
ru: <literal>PRIMARY KEY</literal> устанавливает для данных те же ограничения, что и сочетание <literal>UNIQUE</literal> и <literal>NOT NULL</literal>, но образование первичного ключа из набора столбцов также добавляет метаданные о конструкции схемы, так как первичный ключ подразумевает, что другие таблицы могут ссылаться на этот набор столбцов, как на уникальный идентификатор строк.

source: The <literal>EXCLUDE</literal> clause defines an exclusion constraint, which guarantees that if any two rows are compared on the specified column(s) or expression(s) using the specified operator(s), not all of these comparisons will return <literal>TRUE</literal>. If all of the specified operators test for equality, this is equivalent to a <literal>UNIQUE</literal> constraint, although an ordinary unique constraint will be faster. However, exclusion constraints can specify constraints that are more general than simple equality. For example, you can specify a constraint that no two rows in the table contain overlapping circles (see <xref linkend="datatype-geometric"/>) by using the <literal>&amp;&amp;</literal> operator.
ru: Предложение <literal>EXCLUDE</literal> определяет ограничение-исключение, которое гарантирует, что для любых двух строк, сравниваемых по указанным столбцам или выражениям с указанными операторами, результат не будет равен <literal>TRUE</literal> для всех сравнений. Если все указанные операторы проверяют равенство, это ограничение равносильно ограничению <literal>UNIQUE</literal>, хотя обычное ограничение уникальности будет работать быстрее. С другой стороны, в ограничениях-исключениях можно задавать более общие условия, чем простое условие на равенство. Например, можно задать ограничение, требующее, чтобы никакие две строки в таблице не содержали пересекающихся кругов (см. <xref remap="4" linkend="datatype-geometric"/>), применив оператор <literal>&amp;&amp;</literal>.

source: Exclusion constraints are implemented using an index, so each specified operator must be associated with an appropriate operator class (see <xref linkend="indexes-opclass"/>) for the index access method <replaceable>index_method</replaceable>. The operators are required to be commutative. Each <replaceable class="parameter">exclude_element</replaceable> can optionally specify an operator class and/or ordering options; these are described fully under <xref linkend="sql-createindex"/>.
ru: Ограничения-исключения реализуются с помощью индексов, так что каждый указанный в них оператор должен быть связан с соответствующим классом операторов (см. <xref remap="4" linkend="indexes-opclass"/>) для <replaceable>метода_индекса</replaceable>. Кроме того, операторы должны быть коммутативными. В каждом <replaceable class="parameter">элементе_исключения</replaceable> можно дополнительно указать класс оператора и/или параметры сортировки, подробно описанные в <xref remap="6" linkend="sql-createindex"/>.

source: The access method must support <literal>amgettuple</literal> (see <xref linkend="indexam"/>); at present this means <acronym>GIN</acronym> cannot be used. Although it's allowed, there is little point in using B-tree or hash indexes with an exclusion constraint, because this does nothing that an ordinary unique constraint doesn't do better. So in practice the access method will always be <acronym>GiST</acronym> or <acronym>SP-GiST</acronym>.
ru: Метод индекса должен поддерживать <literal>amgettuple</literal> (см. <xref remap="4" linkend="indexam"/>); в настоящее время это означает, что метод <acronym>GIN</acronym> здесь применять нельзя. Хотя в ограничении-исключении можно использовать B-деревья и хеш-индексы, в этом мало смысла, так как такой подход ничем не лучше обычного ограничения уникальности. Так что на практике методом индекса всегда будет <acronym>GiST</acronym> или <acronym>SP-GiST</acronym>.

source: The <replaceable class="parameter">predicate</replaceable> allows you to specify an exclusion constraint on a subset of the table; internally this creates a partial index. Note that parentheses are required around the predicate.
ru: Параметр <replaceable class="parameter">предикат</replaceable> позволяет указать ограничение-исключение для подмножества таблицы; внутри при этом создаётся частичный индекс. Заметьте, что предикат необходимо заключить в скобки.

source: <literal>REFERENCES <replaceable class="parameter">reftable</replaceable> [ ( <replaceable class="parameter">refcolumn</replaceable> ) ] [ MATCH <replaceable class="parameter">matchtype</replaceable> ] [ ON DELETE <replaceable class="parameter">action</replaceable> ] [ ON UPDATE <replaceable class="parameter">action</replaceable> ]</literal> (column constraint)
ru: <literal>REFERENCES <replaceable class="parameter">внешняя_таблица</replaceable> [ ( <replaceable class="parameter">внешний_столбец</replaceable> ) ] [ MATCH <replaceable class="parameter">тип_совпадения</replaceable> ] [ ON DELETE <replaceable class="parameter">действие</replaceable> ] [ ON UPDATE <replaceable class="parameter">действие</replaceable> ]</literal> (ограничение столбца)

source: <literal>FOREIGN KEY ( <replaceable class="parameter">column_name</replaceable> [, ... ] ) REFERENCES <replaceable class="parameter">reftable</replaceable> [ ( <replaceable class="parameter">refcolumn</replaceable> [, ... ] ) ] [ MATCH <replaceable class="parameter">matchtype</replaceable> ] [ ON DELETE <replaceable class="parameter">action</replaceable> ] [ ON UPDATE <replaceable class="parameter">action</replaceable> ]</literal> (table constraint)
ru: <literal>FOREIGN KEY ( <replaceable class="parameter">имя_столбца</replaceable> [, ... ] ) REFERENCES <replaceable class="parameter">внешняя_таблица</replaceable> [ ( <replaceable class="parameter">внешний_столбец</replaceable> [, ... ] ) ] [ MATCH <replaceable class="parameter">тип_совпадения</replaceable> ] [ ON DELETE <replaceable class="parameter">действие</replaceable> ] [ ON UPDATE <replaceable class="parameter">действие</replaceable> ]</literal> (ограничение таблицы)

source: These clauses specify a foreign key constraint, which requires that a group of one or more columns of the new table must only contain values that match values in the referenced column(s) of some row of the referenced table. If the <replaceable class="parameter">refcolumn</replaceable> list is omitted, the primary key of the <replaceable class="parameter">reftable</replaceable> is used. The referenced columns must be the columns of a non-deferrable unique or primary key constraint in the referenced table. Note that foreign key constraints cannot be defined between temporary tables and permanent tables.
ru: Эти предложения определяют ограничение внешнего ключа, требующее, чтобы указанная группа из одного или нескольких столбцов новой таблицы содержала только такие значения, которым соответствуют значения в заданных внешних столбцах некоторой строки во внешней таблице. Если список <replaceable class="parameter">внешних_столбцов</replaceable> опущен, в качестве него используется первичный ключ <replaceable class="parameter">внешней_таблицы</replaceable>. В качестве внешних столбцов должны указываться столбцы неоткладываемого уникального ограничения или ограничение первичного ключа во внешней таблице. Заметьте, что ограничения внешнего ключа, связывающие временные и постоянные таблицы, определить нельзя.

source: A value inserted into the referencing column(s) is matched against the values of the referenced table and referenced columns using the given match type. There are three match types: <literal>MATCH FULL</literal>, <literal>MATCH PARTIAL</literal>, and <literal>MATCH SIMPLE</literal> (which is the default). <literal>MATCH FULL</literal> will not allow one column of a multicolumn foreign key to be null unless all foreign key columns are null; if they are all null, the row is not required to have a match in the referenced table. <literal>MATCH SIMPLE</literal> allows any of the foreign key columns to be null; if any of them are null, the row is not required to have a match in the referenced table. <literal>MATCH PARTIAL</literal> is not yet implemented. (Of course, <literal>NOT NULL</literal> constraints can be applied to the referencing column(s) to prevent these cases from arising.)
ru: Значения, вставляемые в ссылающиеся столбцы, сверяются со значениями во внешних столбцах внешней таблицы с учётом заданного типа совпадения. Возможны три типа совпадения: <literal>MATCH FULL</literal> (полное совпадение), <literal>MATCH PARTIAL</literal> (частичное совпадение) и тип по умолчанию, <literal>MATCH SIMPLE</literal> (простое совпадение). С <literal>MATCH FULL</literal> ни один из столбцов составного внешнего ключа не может содержать NULL, кроме случая, когда все внешние столбцы NULL; в этом случае, строка может не иметь соответствия во внешней таблице. С <literal>MATCH SIMPLE</literal> любой из столбцов внешнего ключа может содержать NULL; при этом строка с NULL в одном из таких столбцов может не иметь соответствия во внешней таблице. Тип <literal>MATCH PARTIAL</literal> ещё не реализован. (Разумеется, чтобы вопросы со сравнением NULL не возникали, к столбцам, ссылающимся на внешние, можно применить ограничения <literal>NOT NULL</literal>.)

source: Produce an error indicating that the deletion or update would create a foreign key constraint violation. If the constraint is deferred, this error will be produced at constraint check time if there still exist any referencing rows. This is the default action.
ru: Выдать ошибку, показывающую, что при удалении или изменении записи произойдёт нарушение ограничения внешнего ключа. Для отложенных ограничений ошибка произойдёт в момент проверки ограничения, если строки, ссылающиеся на эту запись, по-прежнему будут существовать. Этот вариант действия подразумевается по умолчанию.

source: Produce an error indicating that the deletion or update would create a foreign key constraint violation. This is the same as <literal>NO ACTION</literal> except that the check is not deferrable.
ru: Выдать ошибку, показывающую, что при удалении или изменении записи произойдёт нарушение ограничения внешнего ключа. Этот вариант подобен <literal>NO ACTION</literal>, но эта проверка будет неоткладываемой.

source: Delete any rows referencing the deleted row, or update the values of the referencing column(s) to the new values of the referenced columns, respectively.
ru: Удалить все строки, ссылающиеся на удаляемую запись, либо поменять значения в ссылающихся столбцах на новые значения во внешних столбцах, в соответствии с операцией.

source: Set the referencing column(s) to null.
ru: Установить ссылающиеся столбцы равными NULL.

source: Set the referencing column(s) to their default values. (There must be a row in the referenced table matching the default values, if they are not null, or the operation will fail.)
ru: Установить в ссылающихся столбцах значения по умолчанию. (Если эти значения не равны NULL, во внешней таблице должна быть строка, соответствующая набору значений по умолчанию; в противном случае операция завершится ошибкой.)

source: In addition, when the data in the referenced columns is changed, certain actions are performed on the data in this table's columns. The <literal>ON DELETE</literal> clause specifies the action to perform when a referenced row in the referenced table is being deleted. Likewise, the <literal>ON UPDATE</literal> clause specifies the action to perform when a referenced column in the referenced table is being updated to a new value. If the row is updated, but the referenced column is not actually changed, no action is done. Referential actions other than the <literal>NO ACTION</literal> check cannot be deferred, even if the constraint is declared deferrable. There are the following possible actions for each clause: <placeholder-1/>
ru: Кроме того, при изменении значений во внешних столбцах с данными в столбцах этой таблицы могут производиться определённые действия. Предложение <literal>ON DELETE</literal> задаёт действие, производимое при удалении некоторой строки во внешней таблице. Предложение <literal>ON UPDATE</literal> подобным образом задаёт действие, производимое при изменении значения в целевых столбцах внешней таблицы. Если строка изменена, но это изменение не затронуло целевые столбцы, никакое действие не производится. Ссылочные действия, кроме <literal>NO ACTION</literal>, нельзя сделать откладываемыми, даже если ограничение объявлено как откладываемое. Для каждого предложения возможные следующие варианты действий: <placeholder-1/>

source: If the referenced column(s) are changed frequently, it might be wise to add an index to the referencing column(s) so that referential actions associated with the foreign key constraint can be performed more efficiently.
ru: Если внешние столбцы меняются часто, будет разумным добавить индекс для ссылающихся столбцов, чтобы действия по обеспечению ссылочной целостности, связанные с ограничением внешнего ключа, выполнялись более эффективно.

source: This controls whether the constraint can be deferred. A constraint that is not deferrable will be checked immediately after every command. Checking of constraints that are deferrable can be postponed until the end of the transaction (using the <xref linkend="sql-set-constraints"/> command). <literal>NOT DEFERRABLE</literal> is the default. Currently, only <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, <literal>EXCLUDE</literal>, and <literal>REFERENCES</literal> (foreign key) constraints accept this clause. <literal>NOT NULL</literal> and <literal>CHECK</literal> constraints are not deferrable. Note that deferrable constraints cannot be used as conflict arbitrators in an <command>INSERT</command> statement that includes an <literal>ON CONFLICT DO UPDATE</literal> clause.
ru: Это предложение определяет, может ли ограничение быть отложенным. Неоткладываемое ограничение будет проверяться немедленно после каждой команды. Проверка откладываемых ограничений может быть отложена до завершения транзакции (обычно с помощью команды <xref linkend="sql-set-constraints"/>). По умолчанию подразумевается вариант <literal>NOT DEFERRABLE</literal>. В настоящее время это предложение принимают только ограничения <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, <literal>EXCLUDE</literal> и <literal>REFERENCES</literal> (внешний ключ). Ограничения <literal>NOT NULL</literal> и <literal>CHECK</literal> не могут быть отложенными. Заметьте, что откладываемые ограничения не могут применяться в качестве решающих при конфликте в операторе <command>INSERT</command> с предложением <literal>ON CONFLICT DO UPDATE</literal>.

source: If a constraint is deferrable, this clause specifies the default time to check the constraint. If the constraint is <literal>INITIALLY IMMEDIATE</literal>, it is checked after each statement. This is the default. If the constraint is <literal>INITIALLY DEFERRED</literal>, it is checked only at the end of the transaction. The constraint check time can be altered with the <xref linkend="sql-set-constraints"/> command.
ru: Для откладываемых ограничений это предложение определяет, когда ограничение должно проверяться по умолчанию. Ограничение с характеристикой <literal>INITIALLY IMMEDIATE</literal> (подразумеваемой по умолчанию) проверяется после каждого оператора. Ограничение <literal>INITIALLY DEFERRED</literal>, напротив, проверяется только в конце транзакции. Время проверки ограничения можно изменить явно с помощью команды <xref linkend="sql-set-constraints"/>.
