Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_trigger.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new trigger
ru: создать триггер

source: referenced_table_name
ru: ссылающаяся_таблица

source: condition
ru: условие

source: function_name
ru: имя_функции

source: arguments
ru: аргументы

source: where <placeholder-1/> can be one of:
ru: Здесь допускается <placeholder-1/>:

source: Description
ru: Описание

source: <command>CREATE TRIGGER</command> creates a new trigger. The trigger will be associated with the specified table, view, or foreign table and will execute the specified function <replaceable class="parameter">function_name</replaceable> when certain events occur.
ru: <command>CREATE TRIGGER</command> создаёт новый триггер. Триггер будет связан с указанной таблицей, представлением или сторонней таблицей и будет выполнять заданную функцию <replaceable class="parameter">имя_функции</replaceable> при определённых событиях.

source: The trigger can be specified to fire before the operation is attempted on a row (before constraints are checked and the <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> is attempted); or after the operation has completed (after constraints are checked and the <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> has completed); or instead of the operation (in the case of inserts, updates or deletes on a view). If the trigger fires before or instead of the event, the trigger can skip the operation for the current row, or change the row being inserted (for <command>INSERT</command> and <command>UPDATE</command> operations only). If the trigger fires after the event, all changes, including the effects of other triggers, are <quote>visible</quote> to the trigger.
ru: Триггер можно настроить так, чтобы он срабатывал до операции со строкой (до проверки ограничений и попытки выполнить <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>) или после её завершения (после проверки ограничений и выполнения <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>), либо вместо операции (при добавлении, изменении и удалении строк в представлении). Если триггер срабатывает до или вместо события, он может пропустить операцию с текущей строкой, либо изменить добавляемую строку (только для операций <command>INSERT</command> и <command>UPDATE</command>). Если триггер срабатывает после события, он <quote>видит</quote> все изменения, включая результат действия других триггеров.

source: A trigger that is marked <literal>FOR EACH ROW</literal> is called once for every row that the operation modifies. For example, a <command>DELETE</command> that affects 10 rows will cause any <literal>ON DELETE</literal> triggers on the target relation to be called 10 separate times, once for each deleted row. In contrast, a trigger that is marked <literal>FOR EACH STATEMENT</literal> only executes once for any given operation, regardless of how many rows it modifies (in particular, an operation that modifies zero rows will still result in the execution of any applicable <literal>FOR EACH STATEMENT</literal> triggers). Note that with an <command>INSERT</command> with an <literal>ON CONFLICT DO UPDATE</literal> clause, both <command>INSERT</command> and <command>UPDATE</command> statement level trigger will be fired.
ru: Триггер с пометкой <literal>FOR EACH ROW</literal> вызывается один раз для каждой строки, изменяемой в процессе операции. Например, операция <command>DELETE</command>, удаляющая 10 строк, приведёт к срабатыванию всех триггеров <literal>ON DELETE</literal> в целевом отношении 10 раз подряд, по одному разу для каждой удаляемой строки. Триггер с пометкой <literal>FOR EACH STATEMENT</literal>, напротив, вызывается только один раз для конкретной операции, вне зависимости от того, как много строк она изменила (в частности, при выполнении операции, изменяющей ноль строк, всё равно будут вызваны все триггеры <literal>FOR EACH STATEMENT</literal>). Заметьте, что при выполнении <command>INSERT</command> с предложением <literal>ON CONFLICT DO UPDATE</literal> сработают оба триггера уровня операторов, для <command>INSERT</command> и для <command>UPDATE</command>.

source: Triggers that are specified to fire <literal>INSTEAD OF</literal> the trigger event must be marked <literal>FOR EACH ROW</literal>, and can only be defined on views. <literal>BEFORE</literal> and <literal>AFTER</literal> triggers on a view must be marked as <literal>FOR EACH STATEMENT</literal>.
ru: Триггеры, срабатывающие в режиме <literal>INSTEAD OF</literal>, должны быть помечены <literal>FOR EACH ROW</literal> и могут быть определены только для представлений. Триггеры <literal>BEFORE</literal> и <literal>AFTER</literal> для представлений должны быть помечены <literal>FOR EACH STATEMENT</literal>.

source: In addition, triggers may be defined to fire for <command>TRUNCATE</command>, though only <literal>FOR EACH STATEMENT</literal>.
ru: Кроме того, триггеры можно определить и для команды <command>TRUNCATE</command>, но только типа <literal>FOR EACH STATEMENT</literal>.

source: The following table summarizes which types of triggers may be used on tables, views, and foreign tables:
ru: В следующей таблице перечисляются типы триггеров, которые могут использоваться для таблиц, представлений и сторонних таблиц:

source: When
ru: Когда

source: Event
ru: Событие

source: Row-level
ru: На уровне строк

source: Statement-level
ru: На уровне оператора

source: Tables and foreign tables
ru: Таблицы и сторонние таблицы

source: Tables, views, and foreign tables
ru: Таблицы, представления и сторонние таблицы

source: Tables
ru: Таблицы

source: Views
ru: Представления

source: Also, a trigger definition can specify a Boolean <literal>WHEN</literal> condition, which will be tested to see whether the trigger should be fired. In row-level triggers the <literal>WHEN</literal> condition can examine the old and/or new values of columns of the row. Statement-level triggers can also have <literal>WHEN</literal> conditions, although the feature is not so useful for them since the condition cannot refer to any values in the table.
ru: Кроме того, в определении триггера можно указать булевское условие <literal>WHEN</literal>, которое определит, вызывать триггер или нет. В триггерах на уровне строк условия <literal>WHEN</literal> могут проверять старые и/или новые значения столбцов в строке. Триггеры на уровне оператора так же могут содержать условие <literal>WHEN</literal>, хотя для них это не столь полезно, так как в этом условии нельзя ссылаться на какие-либо значения в таблице.

source: If multiple triggers of the same kind are defined for the same event, they will be fired in alphabetical order by name.
ru: Если для одного события определено несколько триггеров одного типа, они будут срабатывать в алфавитном порядке их имён.

source: When the <literal>CONSTRAINT</literal> option is specified, this command creates a <firstterm>constraint trigger</firstterm>. This is the same as a regular trigger except that the timing of the trigger firing can be adjusted using <xref linkend="sql-set-constraints"/>. Constraint triggers must be <literal>AFTER ROW</literal> triggers on tables. They can be fired either at the end of the statement causing the triggering event, or at the end of the containing transaction; in the latter case they are said to be <firstterm>deferred</firstterm>. A pending deferred-trigger firing can also be forced to happen immediately by using <command>SET CONSTRAINTS</command>. Constraint triggers are expected to raise an exception when the constraints they implement are violated.
ru: Когда указывается параметр <literal>CONSTRAINT</literal>, эта команда создаёт <firstterm>триггер ограничения</firstterm>. Он подобен обычным триггерам, но отличается тем, что время его срабатывания можно изменить командой <xref linkend="sql-set-constraints"/>. Триггеры ограничений должны работать в режиме <literal>AFTER ROW</literal>. Они могут срабатывать либо в конце оператора, вызвавшего целевое событие, либо в конце содержащей его транзакции; в последнем случае они называются <firstterm>отложенными</firstterm>. Срабатывание ожидающего отложенного триггера можно вызвать немедленно, воспользовавшись командой <command>SET CONSTRAINTS</command>. Предполагается, что триггеры ограничений будут генерировать исключения при нарушении ограничений.

source: <command>SELECT</command> does not modify any rows so you cannot create <command>SELECT</command> triggers. Rules and views are more appropriate in such cases.
ru: <command>SELECT</command> не изменяет никакие строки, поэтому создавать триггеры для <command>SELECT</command> нельзя. В случае подобной потребности будут более уместны правила и представления.

source: Refer to <xref linkend="triggers"/> for more information about triggers.
ru: За дополнительными сведениями о триггерах обратитесь к <xref remap="3" linkend="triggers"/>.

source: Parameters
ru: Параметры

source: The name to give the new trigger. This must be distinct from the name of any other trigger for the same table. The name cannot be schema-qualified &mdash; the trigger inherits the schema of its table. For a constraint trigger, this is also the name to use when modifying the trigger's behavior using <command>SET CONSTRAINTS</command>.
ru: Имя, назначаемое новому триггеру. Это имя должно отличаться от имени любого другого триггера в этой же таблице. Имя не может быть дополнено схемой &mdash; триггер наследует схему от своей таблицы. Для триггеров ограничений это имя также используется, когда требуется скорректировать поведение триггера с помощью команды <command>SET CONSTRAINTS</command>.

source: Determines whether the function is called before, after, or instead of the event. A constraint trigger can only be specified as <literal>AFTER</literal>.
ru: Определяет, будет ли заданная функция вызываться до, после или вместо события. Для триггера ограничения можно указать только <literal>AFTER</literal>.

source: One of <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, or <literal>TRUNCATE</literal>; this specifies the event that will fire the trigger. Multiple events can be specified using <literal>OR</literal>.
ru: Принимает одно из значений: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> или <literal>TRUNCATE</literal>; этот параметр определяет событие, при котором будет срабатывать триггер. Несколько событий можно указать, добавив между ними слово <literal>OR</literal>.

source: For <literal>UPDATE</literal> events, it is possible to specify a list of columns using this syntax: <synopsis>UPDATE OF <replaceable>column_name1</replaceable> [, <replaceable>column_name2</replaceable> ... ]</synopsis> The trigger will only fire if at least one of the listed columns is mentioned as a target of the <command>UPDATE</command> command.
ru: Для событий <literal>UPDATE</literal> можно указать список столбцов, используя такую запись: <synopsis>UPDATE OF <replaceable>имя_столбца1</replaceable> [, <replaceable>имя_столбца2</replaceable> ... ]</synopsis> Такой триггер сработает, только если в указанном в целевой команде <command>UPDATE</command> списке столбцов найдётся минимум одна из перечисленных.

source: <literal>INSTEAD OF UPDATE</literal> events do not support lists of columns.
ru: Для событий <literal>INSTEAD OF UPDATE</literal> список столбцов задать нельзя.

source: The name (optionally schema-qualified) of the table, view, or foreign table the trigger is for.
ru: Имя (возможно, дополненное схемой) таблицы, представления или сторонней таблицы, для которых предназначен триггер.

source: The (possibly schema-qualified) name of another table referenced by the constraint. This option is used for foreign-key constraints and is not recommended for general use. This can only be specified for constraint triggers.
ru: Имя (возможно, дополненное схемой) другой таблицы, на которую ссылается ограничение. Оно используется для ограничений внешнего ключа и не рекомендуется для обычного применения. Это указание допускается только для триггеров ограничений.

source: The default timing of the trigger. See the <xref linkend="sql-createtable"/> documentation for details of these constraint options. This can only be specified for constraint triggers.
ru: Время срабатывания триггера по умолчанию. Подробнее возможные варианты описаны в документации <xref linkend="sql-createtable"/>. Это указание допускается только для триггеров ограничений.

source: This specifies whether the trigger procedure should be fired once for every row affected by the trigger event, or just once per SQL statement. If neither is specified, <literal>FOR EACH STATEMENT</literal> is the default. Constraint triggers can only be specified <literal>FOR EACH ROW</literal>.
ru: Определяет, будет ли процедура триггера срабатывать один раз для каждой строки, либо для SQL-оператора. Если не указано ничего, подразумевается <literal>FOR EACH STATEMENT</literal> (для оператора). Для триггеров ограничений можно указать только <literal>FOR EACH ROW</literal>.

source: A Boolean expression that determines whether the trigger function will actually be executed. If <literal>WHEN</literal> is specified, the function will only be called if the <replaceable class="parameter">condition</replaceable> returns <literal>true</literal>. In <literal>FOR EACH ROW</literal> triggers, the <literal>WHEN</literal> condition can refer to columns of the old and/or new row values by writing <literal>OLD.<replaceable class="parameter">column_name</replaceable></literal> or <literal>NEW.<replaceable class="parameter">column_name</replaceable></literal> respectively. Of course, <literal>INSERT</literal> triggers cannot refer to <literal>OLD</literal> and <literal>DELETE</literal> triggers cannot refer to <literal>NEW</literal>.
ru: Булевское выражение, определяющее, будет ли выполняться функция триггера. Если для триггера задано указание <literal>WHEN</literal>, функция будет вызываться, только когда <replaceable class="parameter">условие</replaceable> возвращает <literal>true</literal>. В триггерах <literal>FOR EACH ROW</literal> условие <literal>WHEN</literal> может ссылаться на значения столбца в старой и/или новой строке, в виде <literal>OLD.<replaceable class="parameter">имя_столбца</replaceable></literal> и <literal>NEW.<replaceable class="parameter">имя_столбца</replaceable></literal>, соответственно. Разумеется, триггеры <literal>INSERT</literal> не могут ссылаться на <literal>OLD</literal>, а триггеры <literal>DELETE</literal> не могут ссылаться на <literal>NEW</literal>.

source: <literal>INSTEAD OF</literal> triggers do not support <literal>WHEN</literal> conditions.
ru: Триггеры <literal>INSTEAD OF</literal> не поддерживают условия <literal>WHEN</literal>.

source: Currently, <literal>WHEN</literal> expressions cannot contain subqueries.
ru: В настоящее время выражения <literal>WHEN</literal> не могут содержать подзапросы.

source: Note that for constraint triggers, evaluation of the <literal>WHEN</literal> condition is not deferred, but occurs immediately after the row update operation is performed. If the condition does not evaluate to true then the trigger is not queued for deferred execution.
ru: Учтите, что для триггеров ограничений вычисление условия <literal>WHEN</literal> не откладывается, а выполняется немедленно после операции, изменяющей строки. Если результат условия — ложь, сам триггер не откладывается для последующего выполнения.

source: A user-supplied function that is declared as taking no arguments and returning type <literal>trigger</literal>, which is executed when the trigger fires.
ru: Заданная пользователем функция, объявленная как функция без аргументов и возвращающая тип <literal>trigger</literal>, которая будет вызываться при срабатывании триггера.

source: An optional comma-separated list of arguments to be provided to the function when the trigger is executed. The arguments are literal string constants. Simple names and numeric constants can be written here, too, but they will all be converted to strings. Please check the description of the implementation language of the trigger function to find out how these arguments can be accessed within the function; it might be different from normal function arguments.
ru: Необязательный список аргументов через запятую, которые будут переданы функции при срабатывании триггера. В качестве аргументов функции передаются строковые константы. И хотя в этом списке можно записать и простые имена или числовые константы, они тоже будут преобразованы в строки. Порядок обращения к таким аргументам в функции триггера может отличаться от обычных аргументов, поэтому его следует уточнить в описании языка реализации этой функции.

source: To create a trigger on a table, the user must have the <literal>TRIGGER</literal> privilege on the table. The user must also have <literal>EXECUTE</literal> privilege on the trigger function.
ru: Чтобы создать триггер, пользователь должен иметь право <literal>TRIGGER</literal> для этой таблицы. Также пользователь должен иметь право <literal>EXECUTE</literal> для триггерной функции.

source: Use <xref linkend="sql-droptrigger"/> to remove a trigger.
ru: Для удаления триггера применяется команда <xref linkend="sql-droptrigger"/>.

source: A column-specific trigger (one defined using the <literal>UPDATE OF <replaceable>column_name</replaceable></literal> syntax) will fire when any of its columns are listed as targets in the <command>UPDATE</command> command's <literal>SET</literal> list. It is possible for a column's value to change even when the trigger is not fired, because changes made to the row's contents by <literal>BEFORE UPDATE</literal> triggers are not considered. Conversely, a command such as <literal>UPDATE ... SET x = x ...</literal> will fire a trigger on column <literal>x</literal>, even though the column's value did not change.
ru: Триггер для избранных столбцов (определённый с помощью <literal>UPDATE OF <replaceable>имя_столбца</replaceable></literal>) будет срабатывать, когда его столбцы перечислены в качестве целевых в списке <literal>SET</literal> команды <command>UPDATE</command>. Изменения, вносимые в строки триггерами <literal>BEFORE UPDATE</literal>, при этом не учитываются, поэтому значения столбцов можно изменить так, что триггер не сработает. И наоборот, при выполнении команды <literal>UPDATE ... SET x = x ...</literal> триггер для столбца <literal>x</literal> сработает, хотя значение столбца не меняется.

source: In a <literal>BEFORE</literal> trigger, the <literal>WHEN</literal> condition is evaluated just before the function is or would be executed, so using <literal>WHEN</literal> is not materially different from testing the same condition at the beginning of the trigger function. Note in particular that the <literal>NEW</literal> row seen by the condition is the current value, as possibly modified by earlier triggers. Also, a <literal>BEFORE</literal> trigger's <literal>WHEN</literal> condition is not allowed to examine the system columns of the <literal>NEW</literal> row (such as <literal>oid</literal>), because those won't have been set yet.
ru: В триггере <literal>BEFORE</literal> условие <literal>WHEN</literal> вычисляется непосредственно перед возможным вызовом функции, поэтому проверка <literal>WHEN</literal> существенно не отличается от проверки того же условия в начале функции триггера. В частности, учтите, что строка <literal>NEW</literal>, которую видит ограничение, содержит текущие значения, возможно, изменённые предыдущими триггерами. Кроме того, в триггере <literal>BEFORE</literal> условие <literal>WHEN</literal> не может проверять системные столбцы в строке <literal>NEW</literal> (например, <literal>oid</literal>), так как они ещё не установлены.

source: In an <literal>AFTER</literal> trigger, the <literal>WHEN</literal> condition is evaluated just after the row update occurs, and it determines whether an event is queued to fire the trigger at the end of statement. So when an <literal>AFTER</literal> trigger's <literal>WHEN</literal> condition does not return true, it is not necessary to queue an event nor to re-fetch the row at end of statement. This can result in significant speedups in statements that modify many rows, if the trigger only needs to be fired for a few of the rows.
ru: В триггере <literal>AFTER</literal> условие <literal>WHEN</literal> проверяется сразу после изменения строки, и если оно выполняется, событие запоминается, чтобы вызвать триггер в конце оператора. Если же для триггера <literal>AFTER</literal> условие <literal>WHEN</literal> не выполняется, нет необходимости запоминать событие для последующей обработки или заново перечитывать строку в конце оператора. Это приводит к значительному ускорению операторов, изменяющих множество строк, когда триггер должен срабатывать только для некоторых из них.

source: In <productname>PostgreSQL</productname> versions before 7.3, it was necessary to declare trigger functions as returning the placeholder type <type>opaque</type>, rather than <type>trigger</type>. To support loading of old dump files, <command>CREATE TRIGGER</command> will accept a function declared as returning <type>opaque</type>, but it will issue a notice and change the function's declared return type to <type>trigger</type>.
ru: В <productname>PostgreSQL</productname> до версии 7.3 обязательно требовалось объявлять триггерные функции, как возвращающие фиктивный тип <type>opaque</type>, а не <type>trigger</type>. Для поддержки загрузки старых файлов экспорта БД, команда <command>CREATE TRIGGER</command> принимает функции с объявленным типом результата <type>opaque</type>, но при этом выдаётся предупреждение и тип результата меняется на <type>trigger</type>.

source: Examples
ru: Примеры

source: Execute the function <function>check_account_update</function> whenever a row of the table <literal>accounts</literal> is about to be updated: <placeholder-1/> The same, but only execute the function if column <literal>balance</literal> is specified as a target in the <command>UPDATE</command> command: <placeholder-2/> This form only executes the function if column <literal>balance</literal> has in fact changed value: <placeholder-3/> Call a function to log updates of <literal>accounts</literal>, but only if something changed: <placeholder-4/> Execute the function <function>view_insert_row</function> for each row to insert rows into the tables underlying a view: <placeholder-5/>
ru: Выполнение функции <function>check_account_update</function> перед любым изменением строк в таблице <literal>accounts</literal>: <placeholder-1/> То же самое, но функция триггера будет выполняться, только если столбец <literal>balance</literal> присутствует в списке целевых столбцов команды <command>UPDATE</command>: <placeholder-2/> В этом примере функция будет выполняться, если значение столбца <literal>balance</literal> в действительности изменилось: <placeholder-3/> Вызов функции, ведущей журнал изменений в <literal>accounts</literal>, но только если что-то изменилось: <placeholder-4/> Выполнение для каждой строки функции <function>view_insert_row</function>, которая будет вставлять строки в нижележащие таблицы представления: <placeholder-5/>

source: <xref linkend="trigger-example"/> contains a complete example of a trigger function written in C.
ru: В <xref remap="6" linkend="trigger-example"/> приведён полный пример функции триггера, написанной на C.

source: Compatibility
ru: Совместимость
