Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_role.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new database role
ru: создать роль в базе данных

source: name
ru: имя

source: option
ru: параметр

source: where <placeholder-1/> can be:
ru: Здесь <placeholder-1/>:

source: connlimit
ru: предел_подключений

source: password
ru: пароль

source: timestamp
ru: дата_время

source: role_name
ru: имя_роли

source: Description
ru: Описание

source: <command>CREATE ROLE</command> adds a new role to a <productname>PostgreSQL</productname> database cluster. A role is an entity that can own database objects and have database privileges; a role can be considered a <quote>user</quote>, a <quote>group</quote>, or both depending on how it is used. Refer to <xref linkend="user-manag"/> and <xref linkend="client-authentication"/> for information about managing users and authentication. You must have <literal>CREATEROLE</literal> privilege or be a database superuser to use this command.
ru: <command>CREATE ROLE</command> добавляет новую роль в кластер баз данных <productname>PostgreSQL</productname>. Роль — это сущность, которая может владеть объектами и иметь определённые права в базе; роль может представлять <quote>пользователя</quote>, <quote>группу</quote> или и то, и другое, в зависимости от варианта использования. За информацией об управлении пользователями и проверке подлинности обратитесь к <xref remap="3" linkend="user-manag"/> и <xref remap="3" linkend="client-authentication"/>. Чтобы выполнить эту команду, необходимо быть суперпользователем или иметь право <literal>CREATEROLE</literal>.

source: Note that roles are defined at the database cluster level, and so are valid in all databases in the cluster.
ru: Учтите, что роли определяются на уровне кластера баз данных, так что они действуют во всех базах в кластере.

source: Parameters
ru: Параметры

source: The name of the new role.
ru: Имя создаваемой роли.

source: These clauses determine whether the new role is a <quote>superuser</quote>, who can override all access restrictions within the database. Superuser status is dangerous and should be used only when really needed. You must yourself be a superuser to create a new superuser. If not specified, <literal>NOSUPERUSER</literal> is the default.
ru: Эти предложения определяют, будет ли эта роль <quote>суперпользователем</quote>, который может переопределить все ограничения доступа в базе данных. Статус суперпользователя несёт опасность и назначать его следует только в случае необходимости. Создать нового суперпользователя может только суперпользователь. В отсутствие этих предложений по умолчанию подразумевается <literal>NOSUPERUSER</literal>.

source: These clauses define a role's ability to create databases. If <literal>CREATEDB</literal> is specified, the role being defined will be allowed to create new databases. Specifying <literal>NOCREATEDB</literal> will deny a role the ability to create databases. If not specified, <literal>NOCREATEDB</literal> is the default.
ru: Эти предложения определяют, сможет ли роль создавать базы данных. Указание <literal>CREATEDB</literal> даёт новой роли это право, а <literal>NOCREATEDB</literal> запрещает роли создавать базы данных. По умолчанию подразумевается <literal>NOCREATEDB</literal>.

source: These clauses determine whether a role will be permitted to create new roles (that is, execute <command>CREATE ROLE</command>). A role with <literal>CREATEROLE</literal> privilege can also alter and drop other roles. If not specified, <literal>NOCREATEROLE</literal> is the default.
ru: Эти предложения определяют, сможет ли роль создавать новые роли (т. е. выполнять <command>CREATE ROLE</command>). Роль с правом <literal>CREATEROLE</literal> может также изменять и удалять другие роли. По умолчанию подразумевается <literal>NOCREATEROLE</literal>.

source: These clauses determine whether a role <quote>inherits</quote> the privileges of roles it is a member of. A role with the <literal>INHERIT</literal> attribute can automatically use whatever database privileges have been granted to all roles it is directly or indirectly a member of. Without <literal>INHERIT</literal>, membership in another role only grants the ability to <command>SET ROLE</command> to that other role; the privileges of the other role are only available after having done so. If not specified, <literal>INHERIT</literal> is the default.
ru: Эти предложения определяют, будет ли роль <quote>наследовать</quote> права ролей, членом которых она является. Роль с атрибутом <literal>INHERIT</literal> может автоматически использовать в базе данных любые права, назначенные всем ролям, в которые она включена, непосредственно или опосредованно. Без <literal>INHERIT</literal> членство в другой роли позволяет только выполнить <command>SET ROLE</command> и переключиться на эту роль; правами, назначенными другой роли, можно будет пользоваться только после этого. По умолчанию подразумевается <literal>INHERIT</literal>.

source: These clauses determine whether a role is allowed to log in; that is, whether the role can be given as the initial session authorization name during client connection. A role having the <literal>LOGIN</literal> attribute can be thought of as a user. Roles without this attribute are useful for managing database privileges, but are not users in the usual sense of the word. If not specified, <literal>NOLOGIN</literal> is the default, except when <command>CREATE ROLE</command> is invoked through its alternative spelling <xref linkend="sql-createuser"/>.
ru: Эти предложения определяют, разрешается ли новой роли вход на сервер; то есть, может ли эта роль стать начальным авторизованным именем при подключении клиента. Можно считать, что роль с атрибутом <literal>LOGIN</literal> соответствует пользователю. Роли без этого атрибута бывают полезны для управления доступом в базе данных, но это не пользователи в обычном понимании. По умолчанию подразумевается вариант <literal>NOLOGIN</literal>, за исключением вызова <command>CREATE ROLE</command> в виде <xref linkend="sql-createuser"/>.

source: These clauses determine whether a role is allowed to initiate streaming replication or put the system in and out of backup mode. A role having the <literal>REPLICATION</literal> attribute is a very highly privileged role, and should only be used on roles actually used for replication. If not specified, <literal>NOREPLICATION</literal> is the default.
ru: Эти предложения определяют, сможет ли новая роль запускать потоковую репликацию или переключать систему в режим резервного копирования и из него. Роль с атрибутом <literal>REPLICATION</literal> получает очень широкие полномочия, поэтому его следует назначать, только если роль фактически применяется для репликации. По умолчанию подразумевается <literal>NOREPLICATION</literal>.

source: These clauses determine whether a role bypasses every row-level security (RLS) policy. <literal>NOBYPASSRLS</literal> is the default. Note that pg_dump will set <literal>row_security</literal> to <literal>OFF</literal> by default, to ensure all contents of a table are dumped out. If the user running pg_dump does not have appropriate permissions, an error will be returned. The superuser and owner of the table being dumped always bypass RLS.
ru: Эти предложения определяют, будут ли для роли игнорироваться все политики защиты на уровне строк (RLS). Значение по умолчанию — <literal>NOBYPASSRLS</literal>. Заметьте, что pg_dump по умолчанию отключает <literal>row_security</literal> (устанавливает значение <literal>OFF</literal>) для уверенности, что выгружено всё содержимое таблицы. Если пользователь, запускающий pg_dump, не будет иметь необходимых прав, он получит ошибку. Суперпользователь и владелец выгружаемой таблицы всегда обходят защиту RLS.

source: If role can log in, this specifies how many concurrent connections the role can make. -1 (the default) means no limit.
ru: Если роли разрешён вход, этот параметр определяет максимальное число одновременных подключений, разрешённых для этой роли. Значение -1 (по умолчанию) отключает ограничение.

source: Sets the role's password. (A password is only of use for roles having the <literal>LOGIN</literal> attribute, but you can nonetheless define one for roles without it.) If you do not plan to use password authentication you can omit this option. If no password is specified, the password will be set to null and password authentication will always fail for that user. A null password can optionally be written explicitly as <literal>PASSWORD NULL</literal>.
ru: Задаёт пароль роли. (Пароль полезен только для ролей с атрибутом <literal>LOGIN</literal>, но задать его можно и для ролей без такого атрибута.) Если проверка подлинности по паролю не будет использоваться, этот параметр можно опустить. При указании пустого значения будет задан пароль NULL, что не позволит данному пользователю пройти проверку подлинности по паролю. При желании пароль NULL можно установить явно, указав <literal>PASSWORD NULL</literal>.

source: These key words control whether the password is stored encrypted in the system catalogs. (If neither is specified, the default behavior is determined by the configuration parameter <xref linkend="guc-password-encryption"/>.) If the presented password string is already in MD5-encrypted format, then it is stored encrypted as-is, regardless of whether <literal>ENCRYPTED</literal> or <literal>UNENCRYPTED</literal> is specified (since the system cannot decrypt the specified encrypted password string). This allows reloading of encrypted passwords during dump/restore.
ru: Эти ключевые слова определяют, будет ли пароль храниться в системных каталогах в зашифрованном виде. (При отсутствии явного указания поведение по умолчанию определяется конфигурационным параметром <xref linkend="guc-password-encryption"/>.) Если пароль представлен в виде MD5-хеша, он сохраняется как есть, вне зависимости от того, присутствует ли указание <literal>ENCRYPTED</literal> или <literal>UNENCRYPTED</literal> (так как система не может расшифровать зашифрованный пароль). Это позволяет выгружать/загружать зашифрованные пароли при экспорте/импорте данных.

source: Note that older clients might lack support for the MD5 authentication mechanism that is needed to work with passwords that are stored encrypted.
ru: Учтите, что старые клиенты могут не поддерживать механизм проверки подлинности с MD5, необходимый для использования паролей, хранящихся в зашифрованном виде.

source: <literal>VALID UNTIL</literal> '<replaceable class="parameter">timestamp</replaceable>'
ru: <literal>VALID UNTIL</literal> '<replaceable class="parameter">дата_время</replaceable>'

source: The <literal>VALID UNTIL</literal> clause sets a date and time after which the role's password is no longer valid. If this clause is omitted the password will be valid for all time.
ru: Предложение <literal>VALID UNTIL</literal> устанавливает дату и время, после которого пароль роли перестаёт действовать. Если это предложение отсутствует, срок действия пароля будет неограниченным.

source: The <literal>IN ROLE</literal> clause lists one or more existing roles to which the new role will be immediately added as a new member. (Note that there is no option to add the new role as an administrator; use a separate <command>GRANT</command> command to do that.)
ru: В предложении <literal>IN ROLE</literal> перечисляются одна или несколько существующих ролей, в которые будет немедленно включена новая роль. (Заметьте, что добавить новую роль с правами администратора таким образом нельзя; для этого надо отдельно выполнить команду <command>GRANT</command>.)

source: <literal>IN GROUP</literal> is an obsolete spelling of <literal>IN ROLE</literal>.
ru: <literal>IN GROUP</literal> — устаревшее написание предложения <literal>IN ROLE</literal>.

source: The <literal>ROLE</literal> clause lists one or more existing roles which are automatically added as members of the new role. (This in effect makes the new role a <quote>group</quote>.)
ru: В предложении <literal>ROLE</literal> перечисляются одна или несколько существующих ролей, которые автоматически становятся членами создаваемой роли. (По сути таким образом новая роль становится <quote>группой</quote>.)

source: The <literal>ADMIN</literal> clause is like <literal>ROLE</literal>, but the named roles are added to the new role <literal>WITH ADMIN OPTION</literal>, giving them the right to grant membership in this role to others.
ru: Предложение <literal>ADMIN</literal> подобно <literal>ROLE</literal>, но перечисленные в нём роли включаются в новую роль с атрибутом <literal>WITH ADMIN OPTION</literal>, что даёт им право включать в эту роль другие роли.

source: The <literal>USER</literal> clause is an obsolete spelling of the <literal>ROLE</literal> clause.
ru: Предложение <literal>USER</literal> является устаревшим написанием предложения <literal>ROLE</literal>.

source: The <literal>SYSID</literal> clause is ignored, but is accepted for backwards compatibility.
ru: Предложение <literal>SYSID</literal> игнорируется, но принимается для обратной совместимости.

source: Notes
ru: Замечания

source: Use <xref linkend="sql-alterrole"/> to change the attributes of a role, and <xref linkend="sql-droprole"/> to remove a role. All the attributes specified by <command>CREATE ROLE</command> can be modified by later <command>ALTER ROLE</command> commands.
ru: Для изменения атрибутов роли применяется <xref linkend="sql-alterrole"/>, а для удаления роли — <xref linkend="sql-droprole"/>. Все атрибуты, заданные в <command>CREATE ROLE</command>, могут быть изменены позднее командами <command>ALTER ROLE</command>.

source: The preferred way to add and remove members of roles that are being used as groups is to use <xref linkend="sql-grant"/> and <xref linkend="sql-revoke"/>.
ru: Для добавления и удаления членов ролей, используемых в качестве групп, рекомендуется использовать <xref linkend="sql-grant"/> и <xref linkend="sql-revoke"/>.

source: The <literal>VALID UNTIL</literal> clause defines an expiration time for a password only, not for the role <foreignphrase>per se</foreignphrase>. In particular, the expiration time is not enforced when logging in using a non-password-based authentication method.
ru: Предложение <literal>VALID UNTIL</literal> определяет срок действия только пароля, но не роли как таковой. В частности, ограничение срока пароля не действует при входе пользователя без проверки подлинности по паролю.

source: The <literal>INHERIT</literal> attribute governs inheritance of grantable privileges (that is, access privileges for database objects and role memberships). It does not apply to the special role attributes set by <command>CREATE ROLE</command> and <command>ALTER ROLE</command>. For example, being a member of a role with <literal>CREATEDB</literal> privilege does not immediately grant the ability to create databases, even if <literal>INHERIT</literal> is set; it would be necessary to become that role via <xref linkend="sql-set-role"/> before creating a database.
ru: Атрибут <literal>INHERIT</literal> управляет наследованием назначаемых прав (то есть правами доступа к объектам баз данных и членством в ролях). Его действие не распространяется на специальные атрибуты, устанавливаемые командами <command>CREATE ROLE</command> и <command>ALTER ROLE</command>. Например, членства в роли с правом <literal>CREATEDB</literal> недостаточно для получения права создавать базы данных, даже если установлен атрибут <literal>INHERIT</literal>; чтобы воспользоваться правом создавать базы данных, необходимо переключиться на эту роль, выполнив <xref linkend="sql-set-role"/>.

source: The <literal>INHERIT</literal> attribute is the default for reasons of backwards compatibility: in prior releases of <productname>PostgreSQL</productname>, users always had access to all privileges of groups they were members of. However, <literal>NOINHERIT</literal> provides a closer match to the semantics specified in the SQL standard.
ru: Атрибут <literal>INHERIT</literal> устанавливается по умолчанию в целях обратной совместимости: в предыдущих выпусках <productname>PostgreSQL</productname> пользователи всегда обладали всеми правами групп, в которые они были включены. Однако <literal>NOINHERIT</literal> по смыслу ближе к тому, что описано в стандарте SQL.

source: Be careful with the <literal>CREATEROLE</literal> privilege. There is no concept of inheritance for the privileges of a <literal>CREATEROLE</literal>-role. That means that even if a role does not have a certain privilege but is allowed to create other roles, it can easily create another role with different privileges than its own (except for creating roles with superuser privileges). For example, if the role <quote>user</quote> has the <literal>CREATEROLE</literal> privilege but not the <literal>CREATEDB</literal> privilege, nonetheless it can create a new role with the <literal>CREATEDB</literal> privilege. Therefore, regard roles that have the <literal>CREATEROLE</literal> privilege as almost-superuser-roles.
ru: Будьте осторожны с правом <literal>CREATEROLE</literal>. На роли, создаваемые командой <literal>CREATEROLE</literal>, не распространяется концепция наследования. Это значит, что даже если роль не имеет определённого права, но может создавать другие роли, она вполне способна создать другую роль с отличным набором прав (за исключением создания ролей с правами суперпользователя). Например, если роль <quote>user</quote> имеет право <literal>CREATEROLE</literal>, но не <literal>CREATEDB</literal>, она, тем не менее, может создать новую роль с правом <literal>CREATEDB</literal>. Поэтому роль с правом <literal>CREATEROLE</literal> следует воспринимать как роль почти суперпользователя.

source: <productname>PostgreSQL</productname> includes a program <xref linkend="app-createuser"/> that has the same functionality as <command>CREATE ROLE</command> (in fact, it calls this command) but can be run from the command shell.
ru: <productname>PostgreSQL</productname> включает программу <xref linkend="app-createuser"/>, которая предоставляет ту же функциональность, что и команда <command>CREATE ROLE</command> (на самом деле она вызывает эту команду), но может запускаться в командной оболочке.

source: The <literal>CONNECTION LIMIT</literal> option is only enforced approximately; if two new sessions start at about the same time when just one connection <quote>slot</quote> remains for the role, it is possible that both will fail. Also, the limit is never enforced for superusers.
ru: Ограничение <literal>CONNECTION LIMIT</literal> действует только приблизительно; если одновременно запускаются два сеанса, тогда как для этой роли остаётся только одно <quote>свободное место</quote>, может так случиться, что будут отклонены оба подключения. Кроме того, это ограничение не распространяется на суперпользователей.

source: Caution must be exercised when specifying an unencrypted password with this command. The password will be transmitted to the server in cleartext, and it might also be logged in the client's command history or the server log. The command <xref linkend="app-createuser"/>, however, transmits the password encrypted. Also, <xref linkend="app-psql"/> contains a command <command>\password</command> that can be used to safely change the password later.
ru: Указывая в этой команде незашифрованный пароль, следует проявлять осторожность. Пароль будет передаваться на сервер открытым текстом и может также записываться в историю команд клиента или в протокол работы сервера. Команда <xref linkend="app-createuser"/>, однако, передаёт пароль зашифрованным. Кроме того, в <xref linkend="app-psql"/> есть команда <command>\password</command>, с помощью которой можно безопасно сменить пароль позже.

source: Examples
ru: Примеры

source: Create a role that can log in, but don't give it a password: <placeholder-1/>
ru: Создание роли, для которой разрешён вход, но не задан пароль: <placeholder-1/>

source: Create a role with a password: <placeholder-1/> (<command>CREATE USER</command> is the same as <command>CREATE ROLE</command> except that it implies <literal>LOGIN</literal>.)
ru: Создание роли с паролем: <placeholder-1/> (<command>CREATE USER</command> действует так же, как <command>CREATE ROLE</command>, но подразумевает ещё и атрибут <literal>LOGIN</literal>.)

source: Create a role with a password that is valid until the end of 2004. After one second has ticked in 2005, the password is no longer valid. <placeholder-1/>
ru: Создание роли с паролем, действующим до конца 2004 г., то есть пароль перестаёт действовать в первую же секунду 2005 г. <placeholder-1/>

source: Create a role that can create databases and manage roles: <placeholder-1/>
ru: Создание роли, которая может создавать базы данных и управлять ролями: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <command>CREATE ROLE</command> statement is in the SQL standard, but the standard only requires the syntax <synopsis> CREATE ROLE <replaceable class="parameter">name</replaceable> [ WITH ADMIN <replaceable class="parameter">role_name</replaceable> ] </synopsis> Multiple initial administrators, and all the other options of <command>CREATE ROLE</command>, are <productname>PostgreSQL</productname> extensions.
ru: Оператор <command>CREATE ROLE</command> описан в стандарте SQL, но стандарт требует поддержки только следующего синтаксиса: <synopsis> CREATE ROLE <replaceable class="parameter">имя</replaceable> [ WITH ADMIN <replaceable class="parameter">имя_роли</replaceable> ] </synopsis> Возможность создавать множество начальных администраторов и все другие параметры <command>CREATE ROLE</command> относятся к расширениям <productname>PostgreSQL</productname>.

source: The SQL standard defines the concepts of users and roles, but it regards them as distinct concepts and leaves all commands defining users to be specified by each database implementation. In <productname>PostgreSQL</productname> we have chosen to unify users and roles into a single kind of entity. Roles therefore have many more optional attributes than they do in the standard.
ru: В стандарте SQL определяются концепции пользователей и ролей, но в нём они рассматриваются как отдельные сущности, а все команды создания пользователей считаются внутренней спецификой СУБД. В <productname>PostgreSQL</productname> мы решили объединить пользователей и роли в единую сущность, так что роли получили дополнительные атрибуты, не описанные в стандарте.

source: The behavior specified by the SQL standard is most closely approximated by giving users the <literal>NOINHERIT</literal> attribute, while roles are given the <literal>INHERIT</literal> attribute.
ru: Поведение, наиболее близкое к описанному в стандарте SQL, можно получить, если создавать пользователей с атрибутом <literal>NOINHERIT</literal>, а роли — с атрибутом <literal>INHERIT</literal>.

source: See Also
ru: См. также
