Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_tstemplate.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new text search template
ru: создать шаблон текстового поиска

source: name
ru: имя

source: init_function
ru: функция_инициализации

source: lexize_function
ru: функция_выделения_лексем

source: Description
ru: Описание

source: <command>CREATE TEXT SEARCH TEMPLATE</command> creates a new text search template. Text search templates define the functions that implement text search dictionaries. A template is not useful by itself, but must be instantiated as a dictionary to be used. The dictionary typically specifies parameters to be given to the template functions.
ru: <command>CREATE TEXT SEARCH TEMPLATE</command> создаёт новый шаблон текстового поиска. Шаблоны текстового поиска определяют функции для реализации словарей текстового поиска. Шаблон сам по себе бесполезен, но его экземпляр нужно создать для словаря. Словарь обычно определяет параметры, передаваемые функциям шаблона.

source: If a schema name is given then the text search template is created in the specified schema. Otherwise it is created in the current schema.
ru: Если указывается имя схемы, шаблон текстового поиска создаётся в указанной схеме. В противном случае он создаётся в текущей схеме.

source: You must be a superuser to use <command>CREATE TEXT SEARCH TEMPLATE</command>. This restriction is made because an erroneous text search template definition could confuse or even crash the server. The reason for separating templates from dictionaries is that a template encapsulates the <quote>unsafe</quote> aspects of defining a dictionary. The parameters that can be set when defining a dictionary are safe for unprivileged users to set, and so creating a dictionary need not be a privileged operation.
ru: Выполнить <command>CREATE TEXT SEARCH TEMPLATE</command> может только суперпользователь. Это ограничение введено потому, что ошибочное определение шаблона текстового поиска может вызвать нарушения или даже сбой в работе сервера. Смысл отделения шаблонов от словарей в том, что шаблон покрывает <quote>небезопасные</quote> аспекты определения словаря. Параметры, которые можно задать при определении словаря, не могут причинить вред, поэтому создавать словари разрешено и непривилегированным пользователям.

source: Refer to <xref linkend="textsearch"/> for further information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="textsearch"/>.

source: Parameters
ru: Параметры

source: The name of the text search template to be created. The name can be schema-qualified.
ru: Имя создаваемого шаблона текстового поиска, возможно, дополненное схемой.

source: The name of the init function for the template.
ru: Имя функции инициализации для шаблона.

source: The name of the lexize function for the template.
ru: Имя функции выделения лексем.

source: The function names can be schema-qualified if necessary. Argument types are not given, since the argument list for each type of function is predetermined. The lexize function is required, but the init function is optional.
ru: Имена функций могут быть дополнены именем схемы, если требуется. Типы аргументов не указываются, так как список аргументов для всех типов функций предопределён. Функция выделения лексем является обязательной, а функция инициализации может отсутствовать.

source: The arguments can appear in any order, not only the one shown above.
ru: Аргументы могут перечисляться в любом порядке, не только в том, что показан выше.

source: Compatibility
ru: Совместимость

source: There is no <command>CREATE TEXT SEARCH TEMPLATE</command> statement in the SQL standard.
ru: Оператор <command>CREATE TEXT SEARCH TEMPLATE</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
