Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_table.po
Languages: as, ru

source: This clause specifies optional storage parameters for a table or index; see <xref linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/> for more information. The <literal>WITH</literal> clause for a table can also include <literal>OIDS=TRUE</literal> (or just <literal>OIDS</literal>) to specify that rows of the new table should have OIDs (object identifiers) assigned to them, or <literal>OIDS=FALSE</literal> to specify that the rows should not have OIDs. If <literal>OIDS</literal> is not specified, the default setting depends upon the <xref linkend="guc-default-with-oids"/> configuration parameter. (If the new table inherits from any tables that have OIDs, then <literal>OIDS=TRUE</literal> is forced even if the command says <literal>OIDS=FALSE</literal>.)
ru: Это предложение определяет необязательные параметры хранения для таблицы или индекса (за подробными сведениями о них обратитесь к <xref remap="3" linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/>). Предложение <literal>WITH</literal> для таблицы может также включать указание <literal>OIDS=TRUE</literal> (или просто <literal>OIDS</literal>), устанавливающее, что каждая строка таблицы должна иметь собственный OID (Object IDentifier, идентификатор объекта), или указание <literal>OIDS=FALSE</literal>, устанавливающее, что строки не содержат OID. Если указание <literal>OIDS</literal> отсутствует, значение этого свойства по умолчанию зависит от конфигурационного параметра <xref linkend="guc-default-with-oids"/>. (Если новая таблица унаследована от каких-либо таблиц, имеющих OID, свойство <literal>OIDS=TRUE</literal> задаётся принудительно, даже если в команде явно написано <literal>OIDS=FALSE</literal>.)

source: If <literal>OIDS=FALSE</literal> is specified or implied, the new table does not store OIDs and no OID will be assigned for a row inserted into it. This is generally considered worthwhile, since it will reduce OID consumption and thereby postpone the wraparound of the 32-bit OID counter. Once the counter wraps around, OIDs can no longer be assumed to be unique, which makes them considerably less useful. In addition, excluding OIDs from a table reduces the space required to store the table on disk by 4 bytes per row (on most machines), slightly improving performance.
ru: Если явно указано <literal>OIDS=FALSE</literal> или это подразумевается, в новой таблице не будут храниться значения OID и новый OID не будет генерироваться для каждой добавляемой в неё строки. Для обычных таблиц такое поведение предпочтительнее, так как оно сокращает потребление OID и тем самым откладывает наложение 32-битного счётчика OID. Как только происходит наложение, значения OID больше нельзя считать уникальными, что делает их значительно менее полезными. К тому же, исключение столбца OID из таблицы сокращает объём, необходимый для хранения таблицы на диске, на 4 байта для каждой строки (на большинстве платформ), что несколько улучшает производительность.

source: To remove OIDs from a table after it has been created, use <xref linkend="sql-altertable"/>.
ru: Для удаления данных OID из таблицы после её создания воспользуйтесь командой <xref linkend="sql-altertable"/>.

source: These are obsolescent syntaxes equivalent to <literal>WITH (OIDS)</literal> and <literal>WITH (OIDS=FALSE)</literal>, respectively. If you wish to give both an <literal>OIDS</literal> setting and storage parameters, you must use the <literal>WITH ( ... )</literal> syntax; see above.
as: Это устаревшее написание указаний <literal>WITH (OIDS)</literal> и <literal>WITH (OIDS=FALSE)</literal>, соответственно. Если требуется определить одновременно свойство <literal>OIDS</literal> и параметры хранения, необходимо использовать синтаксис <literal>WITH ( ... )</literal>; см. ниже.
ru: Это устаревшее написание указаний <literal>WITH (OIDS)</literal> и <literal>WITH (OIDS=FALSE)</literal>, соответственно. Если требуется определить одновременно свойство <literal>OIDS</literal> и параметры хранения, необходимо использовать синтаксис <literal>WITH ( ... )</literal>; см. ниже.

source: No special action is taken at the ends of transactions. This is the default behavior.
as: Никакое специальное действие в конце транзакции не выполняется. Это поведение по умолчанию.
ru: Никакое специальное действие в конце транзакции не выполняется. Это поведение по умолчанию.

source: All rows in the temporary table will be deleted at the end of each transaction block. Essentially, an automatic <xref linkend="sql-truncate"/> is done at each commit.
as: Все строки в этой временной таблице будут удаляться в конце каждого блока транзакции. По сути, при каждой фиксации транзакции будет автоматически выполняться <xref linkend="sql-truncate"/>.
ru: Все строки в этой временной таблице будут удаляться в конце каждого блока транзакции. По сути, при каждой фиксации транзакции будет автоматически выполняться <xref linkend="sql-truncate"/>.

source: The temporary table will be dropped at the end of the current transaction block.
as: Эта временная таблица будет удаляться в конце текущего блока транзакции.
ru: Эта временная таблица будет удаляться в конце текущего блока транзакции.

source: The behavior of temporary tables at the end of a transaction block can be controlled using <literal>ON COMMIT</literal>. The three options are: <placeholder-1/>
as: Поведением временных таблиц в конце блока транзакции позволяет управлять предложение <literal>ON COMMIT</literal>, которое принимает три параметра: <placeholder-1/>
ru: Поведением временных таблиц в конце блока транзакции позволяет управлять предложение <literal>ON COMMIT</literal>, которое принимает три параметра: <placeholder-1/>

source: The <replaceable class="parameter">tablespace_name</replaceable> is the name of the tablespace in which the new table is to be created. If not specified, <xref linkend="guc-default-tablespace"/> is consulted, or <xref linkend="guc-temp-tablespaces"/> if the table is temporary.
as: Здесь <replaceable class="parameter">табл_пространство</replaceable> — имя табличного пространства, в котором будет создаваться новая таблица. Если оно не указано, выбирается <xref linkend="guc-default-tablespace"/> или <xref linkend="guc-temp-tablespaces"/>, если таблица временная.
ru: Здесь <replaceable class="parameter">табл_пространство</replaceable> — имя табличного пространства, в котором будет создаваться новая таблица. Если оно не указано, выбирается <xref linkend="guc-default-tablespace"/> или <xref linkend="guc-temp-tablespaces"/>, если таблица временная.

source: This clause allows selection of the tablespace in which the index associated with a <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, or <literal>EXCLUDE</literal> constraint will be created. If not specified, <xref linkend="guc-default-tablespace"/> is consulted, or <xref linkend="guc-temp-tablespaces"/> if the table is temporary.
ru: Это предложение позволяет выбрать табличное пространство, в котором будут создаваться индексы, связанные с ограничениями <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal> или <literal>EXCLUDE</literal>. Если оно не указано, выбирается <xref linkend="guc-default-tablespace"/> или <xref linkend="guc-temp-tablespaces"/>, если таблица временная.

source: Storage Parameters
ru: Параметры хранения

source: <primary>storage parameters</primary>
ru: <primary>параметры хранения</primary>

source: The <literal>WITH</literal> clause can specify <firstterm>storage parameters</firstterm> for tables, and for indexes associated with a <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, or <literal>EXCLUDE</literal> constraint. Storage parameters for indexes are documented in <xref linkend="sql-createindex"/>. The storage parameters currently available for tables are listed below. For many of these parameters, as shown, there is an additional parameter with the same name prefixed with <literal>toast.</literal>, which controls the behavior of the table's secondary <acronym>TOAST</acronym> table, if any (see <xref linkend="storage-toast"/> for more information about TOAST). If a table parameter value is set and the equivalent <literal>toast.</literal> parameter is not, the TOAST table will use the table's parameter value.
ru: Предложение <literal>WITH</literal> позволяет установить <firstterm>параметры хранения</firstterm> для таблиц и индексов, связанных с ограничениями <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal> и <literal>EXCLUDE</literal>. Параметры хранения для индексов документированы в <xref remap="6" linkend="sql-createindex"/>. Поддерживаемые в настоящее время параметры хранения для таблиц перечислены ниже. Как показано, для каждого параметра существует дополнительный параметр с тем же именем и префиксом <literal>toast.</literal>, который управляет поведением вторичной таблицы <acronym>TOAST</acronym>, если она есть (за дополнительными сведениями о TOAST обратитесь к <xref remap="3" linkend="storage-toast"/>). Если значение некоторого параметра задано для таблицы, а значение равнозначного параметра <literal>toast.</literal> не определено, для таблицы TOAST будет применяться значение параметра основной таблицы.

source: The fillfactor for a table is a percentage between 10 and 100. 100 (complete packing) is the default. When a smaller fillfactor is specified, <command>INSERT</command> operations pack table pages only to the indicated percentage; the remaining space on each page is reserved for updating rows on that page. This gives <command>UPDATE</command> a chance to place the updated copy of a row on the same page as the original, which is more efficient than placing it on a different page. For a table whose entries are never updated, complete packing is the best choice, but in heavily updated tables smaller fillfactors are appropriate. This parameter cannot be set for TOAST tables.
ru: Фактор заполнения для таблицы, задаваемый в процентах, от 10 до 100. Значение по умолчанию — 100 (плотное заполнение). При меньшем факторе заполнения операции <command>INSERT</command> упаковывают данные в страницы только до заданного процента; оставшееся место резервируется для изменения строк на этой странице. В результате <command>UPDATE</command> получает шанс поместить изменённую копию строки в ту же страницу, что и исходную, что гораздо эффективнее, чем размещать её на другой странице. Для таблиц, записи в которых никогда не меняются, лучшим выбором будет плотное заполнение, но для активно изменяемых таблиц лучше выбрать меньший фактор заполнения. Этот параметр нельзя задать для таблиц TOAST.

source: This sets the number of workers that should be used to assist a parallel scan of this table. If not set, the system will determine a value based on the relation size. The actual number of workers chosen by the planner may be less, for example due to the setting of <xref linkend="guc-max-worker-processes"/>.
ru: Данный параметр задаёт число рабочих процессов, которые должны задействоваться при параллельном сканировании таблицы. Если это значение не задано, система будет определять его, исходя из размера отношения. Фактическое число рабочих процессов может быть меньше, например, вследствие ограничения <xref linkend="guc-max-worker-processes"/>.

source: Enables or disables the autovacuum daemon for a particular table. If true, the autovacuum daemon will perform automatic <command>VACUUM</command> and/or <command>ANALYZE</command> operations on this table following the rules discussed in <xref linkend="autovacuum"/>. If false, this table will not be autovacuumed, except to prevent transaction ID wraparound. See <xref linkend="vacuum-for-wraparound"/> for more about wraparound prevention. Note that the autovacuum daemon does not run at all (except to prevent transaction ID wraparound) if the <xref linkend="guc-autovacuum"/> parameter is false; setting individual tables' storage parameters does not override that. Therefore there is seldom much point in explicitly setting this storage parameter to <literal>true</literal>, only to <literal>false</literal>.
ru: Включает или отключает демон автоочистки для определённой таблицы. Со значением true демон автоочистки будет автоматически выполнять операции <command>VACUUM</command> и/или <command>ANALYZE</command> в этой таблице, согласно правилам, описанным в <xref remap="6" linkend="autovacuum"/>. Со значением false эта таблица не будет подвергаться автоочистке, если только это не потребуется для предотвращения зацикливания идентификаторов транзакций. Более подробно предотвращение зацикливания описывается в <xref remap="6" linkend="vacuum-for-wraparound"/>. Заметьте, что демон автоочистки не будет запускаться вовсе (если только это не потребуется для предотвращения зацикливания), если параметр <xref linkend="guc-autovacuum"/> имеет значение false; это нельзя переопределить, установив параметры хранения для отдельных таблиц. Таким образом, явно устанавливать для этого параметра значение <literal>true</literal> практически не имеет смысла — полезно только значение <literal>false</literal>.

source: Per-table value for <xref linkend="guc-autovacuum-vacuum-threshold"/> parameter.
ru: Значение параметра <xref linkend="guc-autovacuum-vacuum-threshold"/> для таблицы.

source: Per-table value for <xref linkend="guc-autovacuum-vacuum-scale-factor"/> parameter.
ru: Значение параметра <xref linkend="guc-autovacuum-vacuum-scale-factor"/> для таблицы.

source: Per-table value for <xref linkend="guc-autovacuum-analyze-threshold"/> parameter.
ru: Значение параметра <xref linkend="guc-autovacuum-analyze-threshold"/> для таблицы.

source: Per-table value for <xref linkend="guc-autovacuum-analyze-scale-factor"/> parameter.
ru: Значение параметра <xref linkend="guc-autovacuum-analyze-scale-factor"/> для таблицы.

source: Per-table value for <xref linkend="guc-autovacuum-vacuum-cost-delay"/> parameter.
ru: Значение параметра <xref linkend="guc-autovacuum-vacuum-cost-delay"/> для таблицы.

source: Per-table value for <xref linkend="guc-autovacuum-vacuum-cost-limit"/> parameter.
ru: Значение параметра <xref linkend="guc-autovacuum-vacuum-cost-limit"/> для таблицы.

source: Per-table value for <xref linkend="guc-vacuum-freeze-min-age"/> parameter. Note that autovacuum will ignore per-table <literal>autovacuum_freeze_min_age</literal> parameters that are larger than half the system-wide <xref linkend="guc-autovacuum-freeze-max-age"/> setting.
ru: Значение параметра <xref linkend="guc-vacuum-freeze-min-age"/> для таблицы. Учтите, что система будет игнорировать установленные для таблиц значения <literal>autovacuum_freeze_min_age</literal>, превышающие половину системного <xref linkend="guc-autovacuum-freeze-max-age"/>.

source: Per-table value for <xref linkend="guc-autovacuum-freeze-max-age"/> parameter. Note that autovacuum will ignore per-table <literal>autovacuum_freeze_max_age</literal> parameters that are larger than the system-wide setting (it can only be set smaller).
ru: Значение параметра <xref linkend="guc-autovacuum-freeze-max-age"/> для таблицы. Учтите, что система будет игнорировать установленные для таблиц значения <literal>autovacuum_freeze_max_age</literal>, превышающие значение системного параметра (они могут быть только меньше).

source: Per-table value for <xref linkend="guc-vacuum-freeze-table-age"/> parameter.
ru: Значение параметра <xref linkend="guc-vacuum-freeze-table-age"/> для таблицы.

source: Per-table value for <xref linkend="guc-vacuum-multixact-freeze-min-age"/> parameter. Note that autovacuum will ignore per-table <literal>autovacuum_multixact_freeze_min_age</literal> parameters that are larger than half the system-wide <xref linkend="guc-autovacuum-multixact-freeze-max-age"/> setting.
ru: Значение параметра <xref linkend="guc-vacuum-multixact-freeze-min-age"/> для таблицы. Учтите, что демон автоочистки будет игнорировать установленные для таблиц значения <literal>autovacuum_multixact_freeze_min_age</literal>, превышающие половину значения системного параметра <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>.

source: Per-table value for <xref linkend="guc-autovacuum-multixact-freeze-max-age"/> parameter. Note that autovacuum will ignore per-table <literal>autovacuum_multixact_freeze_max_age</literal> parameters that are larger than the system-wide setting (it can only be set smaller).
ru: Значение параметра <xref linkend="guc-autovacuum-multixact-freeze-max-age"/> для таблицы. Учтите, что система автоочистки будет игнорировать установленные для таблиц параметры <literal>autovacuum_multixact_freeze_max_age</literal>, превышающие системный параметр (они могут быть только меньше).

source: Per-table value for <xref linkend="guc-vacuum-multixact-freeze-table-age"/> parameter.
ru: Значения параметра <xref linkend="guc-vacuum-multixact-freeze-table-age"/> для таблицы.

source: Per-table value for <xref linkend="guc-log-autovacuum-min-duration"/> parameter.
ru: Значения параметра <xref linkend="guc-log-autovacuum-min-duration"/> для таблицы.

source: Declare the table as an additional catalog table for purposes of logical replication. See <xref linkend="logicaldecoding-capabilities"/> for details. This parameter cannot be set for TOAST tables.
ru: Объявляет таблицу как дополнительную таблицу каталога, например для целей логической репликации. За подробностями обратитесь к <xref remap="3" linkend="logicaldecoding-capabilities"/>. Для таблиц TOAST этот параметр задать нельзя.

source: Notes
as: Замечания
ru: Замечания

source: Using OIDs in new applications is not recommended: where possible, using a <literal>SERIAL</literal> or other sequence generator as the table's primary key is preferred. However, if your application does make use of OIDs to identify specific rows of a table, it is recommended to create a unique constraint on the <structfield>oid</structfield> column of that table, to ensure that OIDs in the table will indeed uniquely identify rows even after counter wraparound. Avoid assuming that OIDs are unique across tables; if you need a database-wide unique identifier, use the combination of <structfield>tableoid</structfield> and row OID for the purpose.
ru: Применять OID в новых приложениях не рекомендуется: по возможности лучше использовать в качестве первичного ключа таблицы <literal>SERIAL</literal> или другой генератор последовательности. Однако, если в вашем приложении для идентификации строк применяется OID, рекомендуется создать уникальное ограничение по столбцу <structfield>oid</structfield> в этой таблице, чтобы значения OID в этой таблице на самом деле однозначно идентифицировали строки даже после зацикливания счётчика. Также не стоит полагать, что значения OID уникальны в разных таблицах; если вам требуется идентификатор, уникальный в базе данных, воспользуйтесь для этого комбинацией <structfield>tableoid</structfield> и OID строки.

source: The use of <literal>OIDS=FALSE</literal> is not recommended for tables with no primary key, since without either an OID or a unique data key, it is difficult to identify specific rows.
ru: Применять <literal>OIDS=FALSE</literal> не рекомендуется для таблиц без первичного ключа, так как без OID или уникального ключа данных сложно идентифицировать определённые строки.

source: <productname>PostgreSQL</productname> automatically creates an index for each unique constraint and primary key constraint to enforce uniqueness. Thus, it is not necessary to create an index explicitly for primary key columns. (See <xref linkend="sql-createindex"/> for more information.)
ru: <productname>PostgreSQL</productname> автоматически создаёт индекс, гарантирующий уникальность, для каждого ограничения уникальности и ограничения первичного ключа. Поэтому явно создавать индекс для столбцов первичного ключа не требуется. (За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-createindex"/>.)

source: Unique constraints and primary keys are not inherited in the current implementation. This makes the combination of inheritance and unique constraints rather dysfunctional.
ru: Ограничения уникальности и первичные ключи в текущей реализации не наследуются. Вследствие этого ограничения уникальности довольно плохо сочетаются с наследованием.

source: A table cannot have more than 1600 columns. (In practice, the effective limit is usually lower because of tuple-length constraints.)
ru: В таблице не может быть больше 1600 столбцов. (На практике фактический предел обычно ниже из-за ограничения на длину записи.)

source: Examples
as: Примеры
ru: Примеры

source: Create table <structname>films</structname> and table <structname>distributors</structname>: <placeholder-1/>
ru: Создание таблицы <structname>films</structname> и таблицы <structname>distributors</structname>: <placeholder-1/>

source: Create a table with a 2-dimensional array: <placeholder-1/>
ru: Создание таблицы с двумерным массивом: <placeholder-1/>

source: Define a unique table constraint for the table <literal>films</literal>. Unique table constraints can be defined on one or more columns of the table: <placeholder-1/>
ru: Определение ограничения уникальности для таблицы <literal>films</literal>. Ограничения уникальности могут быть определены для одного или нескольких столбцов таблицы: <placeholder-1/>

source: Define a check column constraint: <placeholder-1/>
ru: Определение ограничения-проверки для столбца: <placeholder-1/>

source: Define a check table constraint: <placeholder-1/>
ru: Определение ограничения-проверки для таблицы: <placeholder-1/>

source: Define a primary key table constraint for the table <structname>films</structname>: <placeholder-1/>
ru: Определение ограничения первичного ключа для таблицы <structname>films</structname>: <placeholder-1/>

source: Define a primary key constraint for table <structname>distributors</structname>. The following two examples are equivalent, the first using the table constraint syntax, the second the column constraint syntax: <placeholder-1/>
ru: Определение ограничения первичного ключа для таблицы <structname>distributors</structname>. Следующие два примера равнозначны, но в первом используется синтаксис ограничений для таблицы, а во втором — для столбца: <placeholder-1/>

source: Assign a literal constant default value for the column <literal>name</literal>, arrange for the default value of column <literal>did</literal> to be generated by selecting the next value of a sequence object, and make the default value of <literal>modtime</literal> be the time at which the row is inserted: <placeholder-1/>
ru: Определение значений по умолчанию: для столбца <literal>name</literal> значением по умолчанию будет строка, для столбца <literal>did</literal> — следующее значение объекта последовательности, а для <literal>modtime</literal> — время, когда была вставлена запись: <placeholder-1/>

source: Define two <literal>NOT NULL</literal> column constraints on the table <classname>distributors</classname>, one of which is explicitly given a name: <placeholder-1/>
ru: Определение двух ограничений <literal>NOT NULL</literal> для столбцов таблицы <classname>distributors</classname>, при этом одному ограничению даётся явное имя: <placeholder-1/>

source: Define a unique constraint for the <literal>name</literal> column: <placeholder-1/> The same, specified as a table constraint: <placeholder-2/>
ru: Определение ограничения уникальности для столбца <literal>name</literal>: <placeholder-1/> То же самое условие, но в виде ограничения таблицы: <placeholder-2/>

source: Create the same table, specifying 70% fill factor for both the table and its unique index: <placeholder-1/>
ru: Создание такой же таблицы с фактором заполнения 70% для таблицы и её уникального индекса: <placeholder-1/>
