Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_domain.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new domain
ru: создать домен

source: name
ru: имя

source: data_type
ru: тип_данных

source: collation
ru: правило_сортировки

source: expression
ru: выражение

source: constraint
ru: ограничение

source: where <placeholder-1/> is:
ru: Здесь <placeholder-1/>:

source: constraint_name
ru: имя_ограничения

source: Description
ru: Описание

source: <command>CREATE DOMAIN</command> creates a new domain. A domain is essentially a data type with optional constraints (restrictions on the allowed set of values). The user who defines a domain becomes its owner.
ru: <command>CREATE DOMAIN</command> создаёт новый домен. Домен по сути представляет собой тип данных с дополнительными условиями (ограничивающими допустимый набор значений). Владельцем домена становится пользователь его создавший.

source: If a schema name is given (for example, <literal>CREATE DOMAIN myschema.mydomain ...</literal>) then the domain is created in the specified schema. Otherwise it is created in the current schema. The domain name must be unique among the types and domains existing in its schema.
ru: Если задаётся имя схемы (например, <literal>CREATE DOMAIN myschema.mydomain ...</literal>), домен создаётся в указанной схеме, в противном случае — в текущей. Имя домена должно быть уникальным среди имён типов и доменов, существующих в этой схеме.

source: Domains are useful for abstracting common constraints on fields into a single location for maintenance. For example, several tables might contain email address columns, all requiring the same CHECK constraint to verify the address syntax. Define a domain rather than setting up each table's constraint individually.
ru: Домены полезны для абстрагирования и вынесения общих характеристик разных полей в единое место для упрощения сопровождения. Например, в нескольких таблицах может присутствовать столбец, содержащий электронный адрес, и для всех требуются одинаковые ограничения CHECK, проверяющие синтаксис адреса. В этом случае лучше определить домен, а не задавать для каждой таблицы отдельные ограничения.

source: To be able to create a domain, you must have <literal>USAGE</literal> privilege on the underlying type.
ru: Чтобы создать домен, необходимо иметь право <literal>USAGE</literal> для нижележащего типа.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of a domain to be created.
ru: Имя (возможно, дополненное схемой) создаваемого домена.

source: The underlying data type of the domain. This can include array specifiers.
ru: Нижележащий тип данных домена (может включать определение массива с этим типом).

source: An optional collation for the domain. If no collation is specified, the underlying data type's default collation is used. The underlying type must be collatable if <literal>COLLATE</literal> is specified.
ru: Необязательное указание правила сортировки для домена. Если это указание отсутствует, используется правило сортировки по умолчанию нижележащего типа данных. Указать <literal>COLLATE</literal> можно, только если нижележащий тип данных является сортируемым.

source: The <literal>DEFAULT</literal> clause specifies a default value for columns of the domain data type. The value is any variable-free expression (but subqueries are not allowed). The data type of the default expression must match the data type of the domain. If no default value is specified, then the default value is the null value.
ru: Предложение <literal>DEFAULT</literal> определяет значение по умолчанию для столбцов, типом данных которых является этот домен. Значением может быть любое выражение без переменных (подзапросы также не допускаются). Тип данных этого выражения должен соответствовать типу данных домена. Если значение по умолчанию не указано, им будет значение NULL.

source: The default expression will be used in any insert operation that does not specify a value for the column. If a default value is defined for a particular column, it overrides any default associated with the domain. In turn, the domain default overrides any default value associated with the underlying data type.
ru: Значение по умолчанию будет использоваться в любой операции добавления строк, в которой не задано значение для этого столбца. Если значение по умолчанию установлено для конкретного столбца, оно будет переопределять значение по умолчанию, связанное с доменом. В свою очередь, значение по умолчанию для домена переопределяет любое значение по умолчанию, связанное с нижележащим типом данных.

source: An optional name for a constraint. If not specified, the system generates a name.
ru: Имя ограничения. Если не указано явно, имя будет сгенерировано системой.

source: Values of this domain are prevented from being null (but see notes below).
ru: Значения этого домена будут отличны от NULL (но см. замечания ниже).

source: Values of this domain are allowed to be null. This is the default.
ru: Этот домен может содержать значение NULL. Это свойство домена по умолчанию.

source: This clause is only intended for compatibility with nonstandard SQL databases. Its use is discouraged in new applications.
ru: Это предложение предназначено только для совместимости с нестандартными базами данных SQL. Использовать его в новых приложениях не рекомендуется.

source: <literal>CHECK</literal> clauses specify integrity constraints or tests which values of the domain must satisfy. Each constraint must be an expression producing a Boolean result. It should use the key word <literal>VALUE</literal> to refer to the value being tested. Expressions evaluating to TRUE or UNKNOWN succeed. If the expression produces a FALSE result, an error is reported and the value is not allowed to be converted to the domain type.
ru: Предложения <literal>CHECK</literal> задают ограничения целостности или проверки, которым должны удовлетворять значения домена. Каждое ограничение должно представлять собой выражение, выдающее результат типа Boolean. Проверяемое значение в этом выражении обозначается ключевым словом <literal>VALUE</literal>. Если выражение выдаёт FALSE, сообщается об ошибке и приведение значения к типу домена запрещается.

source: Currently, <literal>CHECK</literal> expressions cannot contain subqueries nor refer to variables other than <literal>VALUE</literal>.
ru: В настоящее время выражения <literal>CHECK</literal> не могут содержать переменные, кроме <literal>VALUE</literal>, и подзапросы.

source: When a domain has multiple <literal>CHECK</literal> constraints, they will be tested in alphabetical order by name. (<productname>PostgreSQL</productname> versions before 9.5 did not honor any particular firing order for <literal>CHECK</literal> constraints.)
ru: Когда для домена задано несколько ограничений <literal>CHECK</literal>, они будут проверяться в алфавитном порядке имён. (До версии 9.5 в <productname>PostgreSQL</productname> не было установлено никакого определённого порядка обработки ограничений <literal>CHECK</literal>.)

source: Notes
ru: Замечания

source: Domain constraints, particularly <literal>NOT NULL</literal>, are checked when converting a value to the domain type. It is possible for a column that is nominally of the domain type to read as null despite there being such a constraint. For example, this can happen in an outer-join query, if the domain column is on the nullable side of the outer join. A more subtle example is <placeholder-1/> The empty scalar sub-SELECT will produce a null value that is considered to be of the domain type, so no further constraint checking is applied to it, and the insertion will succeed.
ru: Ограничения домена, в частности <literal>NOT NULL</literal>, проверяются при преобразовании значения к типу домена. Однако из столбца, который номинально имеет тип домена, всё же можно прочитать NULL, несмотря на такое ограничение. Например, это может происходить в запросе внешнего соединения, если столбец домена окажется в обнуляемой стороне внешнего соединения. Более тонкий пример: <placeholder-1/> Пустой скалярный вложенный SELECT выдаст значение NULL, типом которого будет считаться домен, так что к этому значению не будут применены дополнительные проверки ограничений и строка будет успешно добавлена.

source: It is very difficult to avoid such problems, because of SQL's general assumption that a null value is a valid value of every data type. Best practice therefore is to design a domain's constraints so that a null value is allowed, and then to apply column <literal>NOT NULL</literal> constraints to columns of the domain type as needed, rather than directly to the domain type.
ru: Избежать таких проблем очень сложно, так как в SQL вообще предполагается, что значение NULL является подходящим для любого типа данных. Таким образом, лучше всего разрабатывать ограничения так, чтобы значения NULL допускались, а затем при необходимости применять ограничения <literal>NOT NULL</literal> к столбцам доменного типа, а не непосредственно к самому этому типу.

source: Examples
ru: Примеры

source: This example creates the <type>us_postal_code</type> data type and then uses the type in a table definition. A regular expression test is used to verify that the value looks like a valid US postal code: <placeholder-1/>
ru: В этом примере создаётся тип данных <type>us_postal_code</type> (почтовый индекс США), который затем используется в определении таблицы. Для проверки значения на соответствие формату почтовых индексов США применяется проверка с регулярными выражениями: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The command <command>CREATE DOMAIN</command> conforms to the SQL standard.
ru: Команда <command>CREATE DOMAIN</command> соответствует стандарту SQL.

source: See Also
ru: См. также
