Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_table.po
Languages: as, ru

source: SQL - Language Statements
as: Операторы языка SQL
ru: Операторы языка SQL

source: define a new table
ru: создать таблицу

source: table_name
as: имя_таблицы
ru: имя_таблицы

source: column_name
as: имя_столбца
ru: имя_столбца

source: data_type
ru: тип_данных

source: collation
ru: правило_сортировки

source: column_constraint
ru: ограничение_столбца

source: table_constraint
ru: ограничение_таблицы

source: source_table
ru: исходная_таблица

source: like_option
ru: вариант_копирования

source: parent_table
ru: таблица_родитель

source: storage_parameter
as: параметр_хранения
ru: параметр_хранения

source: value
as: значение
ru: значение

source: tablespace_name
as: табл_пространство
ru: табл_пространство

source: type_name
ru: имя_типа

source: where <placeholder-1/> is:
ru: Здесь <placeholder-1/>:

source: constraint_name
ru: имя_ограничения

source: expression
ru: выражение

source: default_expr
ru: выражение_по_умолчанию

source: index_parameters
ru: параметры_индекса

source: reftable
ru: целевая_таблица

source: refcolumn
ru: целевой_столбец

source: action
ru: действие

source: and <placeholder-1/> is:
ru: и <placeholder-1/>:

source: index_method
ru: метод_индекса

source: exclude_element
ru: элемент_исключения

source: operator
ru: оператор

source: predicate
ru: предикат

source: <placeholder-1/> in <placeholder-2/>, <placeholder-3/>, and <placeholder-4/> constraints are:
ru: <placeholder-1/> в ограничениях <placeholder-2/>, <placeholder-3/> и <placeholder-4/>:

source: <placeholder-1/> in an <placeholder-2/> constraint is:
ru: <placeholder-1/> в ограничении <placeholder-2/>:

source: opclass
ru: класс_операторов

source: Description
as: Описание
ru: Описание

source: <command>CREATE TABLE</command> will create a new, initially empty table in the current database. The table will be owned by the user issuing the command.
ru: <command>CREATE TABLE</command> создаёт новую, изначально пустую таблицу в текущей базе данных. Владельцем таблицы будет пользователь, выполнивший эту команду.

source: If a schema name is given (for example, <literal>CREATE TABLE myschema.mytable ...</literal>) then the table is created in the specified schema. Otherwise it is created in the current schema. Temporary tables exist in a special schema, so a schema name cannot be given when creating a temporary table. The name of the table must be distinct from the name of any other table, sequence, index, view, or foreign table in the same schema.
ru: Если задано имя схемы (например, <literal>CREATE TABLE myschema.mytable ...</literal>), таблица создаётся в указанной схеме, в противном случае — в текущей. Временные таблицы существуют в специальной схеме, так что при создании таких таблиц имя схемы задать нельзя. Имя таблицы должно отличаться от имён других таблиц, последовательностей, индексов, представлений или сторонних таблиц в этой схеме.

source: <command>CREATE TABLE</command> also automatically creates a data type that represents the composite type corresponding to one row of the table. Therefore, tables cannot have the same name as any existing data type in the same schema.
ru: <command>CREATE TABLE</command> также автоматически создаёт составной тип данных, соответствующий одной строке таблицы. Таким образом, имя таблицы не может совпадать с именем существующего типа в этой же схеме.

source: The optional constraint clauses specify constraints (tests) that new or updated rows must satisfy for an insert or update operation to succeed. A constraint is an SQL object that helps define the set of valid values in the table in various ways.
ru: Необязательные предложения ограничений задают ограничения (проверки), которым должны удовлетворять добавляемые или изменяемые строки, чтобы операция добавления или изменения была выполнена успешно. Ограничение представляет собой SQL-объект, помогающий некоторым способом определить множество допустимых значений в таблице.

source: There are two ways to define constraints: table constraints and column constraints. A column constraint is defined as part of a column definition. A table constraint definition is not tied to a particular column, and it can encompass more than one column. Every column constraint can also be written as a table constraint; a column constraint is only a notational convenience for use when the constraint only affects one column.
ru: Определить ограничения можно двумя способами: в виде ограничений таблицы и в виде ограничений столбца. Ограничение столбца определяется как часть определения столбца, а ограничение таблицы не привязывается к конкретному столбцу и может задействовать несколько столбцов. Любые ограничения столбцов можно также записать в виде ограничения таблицы, они введены просто для удобства записи в случаях, когда ограничение затрагивает только один столбец.

source: To be able to create a table, you must have <literal>USAGE</literal> privilege on all column types or the type in the <literal>OF</literal> clause, respectively.
ru: Чтобы создать таблицу, необходимо иметь право <literal>USAGE</literal> для типов всех столбцов или типа в предложении <literal>OF</literal>, соответственно.

source: Parameters
as: Параметры
ru: Параметры

source: <literal>TEMPORARY</literal> or <literal>TEMP</literal>
as: <literal>TEMPORARY</literal> или <literal>TEMP</literal>
ru: <literal>TEMPORARY</literal> или <literal>TEMP</literal>

source: If specified, the table is created as a temporary table. Temporary tables are automatically dropped at the end of a session, or optionally at the end of the current transaction (see <literal>ON COMMIT</literal> below). Existing permanent tables with the same name are not visible to the current session while the temporary table exists, unless they are referenced with schema-qualified names. Any indexes created on a temporary table are automatically temporary as well.
ru: С таким указанием таблица создаётся как временная. Временные таблицы автоматически удаляются в конце сеанса или могут удаляться в конце текущей транзакции (см. описание <literal>ON COMMIT</literal> ниже). Существующая постоянная таблица с тем же именем не будет видна в текущем сеансе, пока существует временная, однако к ней можно обратиться, дополнив имя указанием схемы. Все индексы, создаваемые для временной таблицы, так же автоматически становятся временными.

source: The <link linkend="autovacuum">autovacuum daemon</link> cannot access and therefore cannot vacuum or analyze temporary tables. For this reason, appropriate vacuum and analyze operations should be performed via session SQL commands. For example, if a temporary table is going to be used in complex queries, it is wise to run <command>ANALYZE</command> on the temporary table after it is populated.
ru: <link linkend="autovacuum">Демон автоочистки</link> не может прочитать и, как следствие, сжимать и анализировать временные таблицы. По этой причине соответствующие операции очистки и анализа следует выполнять, вызывая SQL-команды в рамках сеанса. Например, если временную таблицу планируется использовать в сложных запросах, будет разумным выполнить для неё <command>ANALYZE</command> после того, как она будет наполнена.

source: Optionally, <literal>GLOBAL</literal> or <literal>LOCAL</literal> can be written before <literal>TEMPORARY</literal> or <literal>TEMP</literal>. This presently makes no difference in <productname>PostgreSQL</productname> and is deprecated; see <xref linkend="sql-createtable-compatibility" endterm="sql-createtable-compatibility-title"/>.
ru: По желанию можно добавить указание <literal>GLOBAL</literal> или <literal>LOCAL</literal> перед <literal>TEMPORARY</literal> или <literal>TEMP</literal>. В настоящее время это не имеет значения для <productname>PostgreSQL</productname> и считается устаревшей возможностью; см. <xref remap="4" linkend="sql-createtable-compatibility" endterm="sql-createtable-compatibility-title"/>.

source: If specified, the table is created as an unlogged table. Data written to unlogged tables is not written to the write-ahead log (see <xref linkend="wal"/>), which makes them considerably faster than ordinary tables. However, they are not crash-safe: an unlogged table is automatically truncated after a crash or unclean shutdown. The contents of an unlogged table are also not replicated to standby servers. Any indexes created on an unlogged table are automatically unlogged as well.
ru: С этим указанием таблица создаётся как нежурналируемая. Данные, записываемые в нежурналируемые таблицы, не проходят через журнал упреждающей записи (см. <xref remap="4" linkend="wal"/>), в результате чего такие таблицы работают гораздо быстрее обычных. Однако, они не защищены от сбоя; при сбое или аварийном отключении сервера нежурналируемая таблица автоматически усекается. Кроме того, содержимое нежурналируемой таблицы не реплицируется на резервные серверы. Любые индексы, создаваемые для нежурналируемой таблицы, автоматически становятся нежурналируемыми.

source: Do not throw an error if a relation with the same name already exists. A notice is issued in this case. Note that there is no guarantee that the existing relation is anything like the one that would have been created.
ru: Не считать ошибкой, если отношение с таким именем уже существует. В этом случае будет выдано замечание. Заметьте, что нет никакой гарантии, что существующее отношение как-то соотносится с тем, которое могло бы быть создано.

source: The name (optionally schema-qualified) of the table to be created.
as: Имя (возможно, дополненное схемой) создаваемой таблицы.
ru: Имя (возможно, дополненное схемой) создаваемой таблицы.

source: Creates a <firstterm>typed table</firstterm>, which takes its structure from the specified composite type (name optionally schema-qualified). A typed table is tied to its type; for example the table will be dropped if the type is dropped (with <literal>DROP TYPE ... CASCADE</literal>).
ru: Создаёт <firstterm>типизированную таблицу</firstterm>, структура которой определяется указанным составным типом (его имя может быть дополнено схемой). Типизированная таблица привязана к породившему её типу; например, при удалении типа (командой <literal>DROP TYPE ... CASCADE</literal>) будет удалена и эта таблица.

source: When a typed table is created, then the data types of the columns are determined by the underlying composite type and are not specified by the <literal>CREATE TABLE</literal> command. But the <literal>CREATE TABLE</literal> command can add defaults and constraints to the table and can specify storage parameters.
ru: Когда создаётся типизированная таблица, типы данных её столбцов определяются нижележащим составным типом, а не задаются командой <literal>CREATE TABLE</literal>. Но <literal>CREATE TABLE</literal> может добавить в таблицу значения по умолчанию и ограничения, а также задать параметры её хранения.

source: The name of a column to be created in the new table.
ru: Имя столбца, создаваемого в новой таблице.

source: The data type of the column. This can include array specifiers. For more information on the data types supported by <productname>PostgreSQL</productname>, refer to <xref linkend="datatype"/>.
ru: Тип данных столбца (может включать определение массива с этим типом). За дополнительными сведениями о типах данных, которые поддерживает <productname>PostgreSQL</productname>, обратитесь к <xref remap="3" linkend="datatype"/>.

source: The <literal>COLLATE</literal> clause assigns a collation to the column (which must be of a collatable data type). If not specified, the column data type's default collation is used.
ru: Предложение <literal>COLLATE</literal> назначает правило сортировки для столбца (который должен иметь тип, поддерживающий сортировку). Если оно отсутствует, используется правило сортировки по умолчанию, установленное для типа данных столбца.

source: The optional <literal>INHERITS</literal> clause specifies a list of tables from which the new table automatically inherits all columns. Parent tables can be plain tables or foreign tables.
ru: Необязательное предложение <literal>INHERITS</literal> определяет список таблиц, от которых новая таблица будет автоматически наследовать все столбцы. Родительские таблицы могут быть обычными или сторонними таблицами.

source: Use of <literal>INHERITS</literal> creates a persistent relationship between the new child table and its parent table(s). Schema modifications to the parent(s) normally propagate to children as well, and by default the data of the child table is included in scans of the parent(s).
ru: При использовании <literal>INHERITS</literal> создаётся постоянная связь дочерней таблицы с родительскими. Изменения схемы в родительских таблицах обычно также отражаются в дочерних, и по умолчанию при чтении родительских таблиц в результат включаются данные дочерней таблицы.

source: If the same column name exists in more than one parent table, an error is reported unless the data types of the columns match in each of the parent tables. If there is no conflict, then the duplicate columns are merged to form a single column in the new table. If the column name list of the new table contains a column name that is also inherited, the data type must likewise match the inherited column(s), and the column definitions are merged into one. If the new table explicitly specifies a default value for the column, this default overrides any defaults from inherited declarations of the column. Otherwise, any parents that specify default values for the column must all specify the same default, or an error will be reported.
ru: Когда в нескольких родительских таблицах оказываются столбцы с одним именем, происходит ошибка, за исключением случая, когда типы данных всех этих столбцов в таблицах совпадают. В этом случае одноимённые столбцы объединяются и формируют один столбец в новой таблице. Если имя столбца новой таблицы совпадает с именем одного из унаследованных столбцов, их типы так же должны совпадать, и в этом случае определения столбцов тоже сливаются в одну. Если в новой таблице явно указывается значение по умолчанию для нового столбца, это значение переопределяет любые значения по умолчанию, унаследованные этим столбцом. В противном случае, если значения по умолчанию определяются в разных родительских таблицах, эти определения должны совпадать, иначе произойдёт ошибка.

source: <literal>CHECK</literal> constraints are merged in essentially the same way as columns: if multiple parent tables and/or the new table definition contain identically-named <literal>CHECK</literal> constraints, these constraints must all have the same check expression, or an error will be reported. Constraints having the same name and expression will be merged into one copy. A constraint marked <literal>NO INHERIT</literal> in a parent will not be considered. Notice that an unnamed <literal>CHECK</literal> constraint in the new table will never be merged, since a unique name will always be chosen for it.
ru: Ограничения <literal>CHECK</literal> объединяются вместе по сути так же, как и столбцы: если несколько родительских таблиц и/или определение новой таблицы содержат одноимённые ограничения <literal>CHECK</literal>, этим ограничениям должны соответствовать одинаковые выражения проверки, в противном случае произойдёт ошибка. В случае совпадения выражения, эти ограничения с данным выражением объединяются в одно. При этом ограничения со свойством <literal>NO INHERIT</literal> в родительской таблице исключаются из рассмотрения. Заметьте, что безымянное ограничение <literal>CHECK</literal> в новой таблице никогда не сливается с другими, так как для него всегда выбирается уникальное имя.

source: Column <literal>STORAGE</literal> settings are also copied from parent tables.
ru: Параметры <literal>STORAGE</literal> для столбца так же копируются из родительских таблиц.

source: The <literal>LIKE</literal> clause specifies a table from which the new table automatically copies all column names, their data types, and their not-null constraints.
ru: Предложение <literal>LIKE</literal> определяет таблицу, из которой в новую таблицу будут автоматически скопированы все имена столбцов, их типы данных и их ограничения на NULL.

source: Unlike <literal>INHERITS</literal>, the new table and original table are completely decoupled after creation is complete. Changes to the original table will not be applied to the new table, and it is not possible to include data of the new table in scans of the original table.
ru: В отличие от <literal>INHERITS</literal>, новая и исходная таблица становятся полностью независимыми после завершения создания. Изменения в исходной таблице не отражаются в новой, а данные новой таблицы не включаются в результат чтения исходной.

source: Default expressions for the copied column definitions will only be copied if <literal>INCLUDING DEFAULTS</literal> is specified. Defaults that call database-modification functions, like <function>nextval</function>, create a linkage between the original and new tables. The default behavior is to exclude default expressions, resulting in the copied columns in the new table having null defaults.
ru: Выражения значений по умолчанию в определениях копируемых столбцов переносятся в новую таблицу, если дополнительно указано <literal>INCLUDING DEFAULTS</literal>. Если такие выражения вызывают функции, модифицирующие БД, как например, <function>nextval</function>, при этом создаётся связь исходной таблицы с новой. Без явного указания такие выражения не переносятся, вследствие чего в новой таблице скопированные столбцы получают значения по умолчанию NULL.

source: Not-null constraints are always copied to the new table. <literal>CHECK</literal> constraints will be copied only if <literal>INCLUDING CONSTRAINTS</literal> is specified. Indexes, <literal>PRIMARY KEY</literal>, and <literal>UNIQUE</literal> constraints on the original table will be created on the new table only if the <literal>INCLUDING INDEXES</literal> clause is specified. No distinction is made between column constraints and table constraints.
ru: Ограничения NULL копируются в новую таблицу всегда, а ограничения <literal>CHECK</literal> копируются только при явном указании <literal>INCLUDING CONSTRAINTS</literal>. Индексы, свойство <literal>PRIMARY KEY</literal> и ограничения <literal>UNIQUE</literal> из исходной таблицы копируются в новую, только если явно указано <literal>INCLUDING INDEXES</literal>. Это в равной мере касается как ограничений таблиц, так и столбцов.

source: <literal>STORAGE</literal> settings for the copied column definitions will only be copied if <literal>INCLUDING STORAGE</literal> is specified. The default behavior is to exclude <literal>STORAGE</literal> settings, resulting in the copied columns in the new table having type-specific default settings. For more on <literal>STORAGE</literal> settings, see <xref linkend="storage-toast"/>.
ru: Параметры <literal>STORAGE</literal> будут перенесены в определение копируемых столбцов, только если явно указывается <literal>INCLUDING STORAGE</literal>. По умолчанию параметры <literal>STORAGE</literal> исключаются, вследствие чего скопированные столбцы в новой таблице получают параметры по умолчанию, определённые соответствующим типом. Подробнее параметры <literal>STORAGE</literal> описаны в <xref remap="6" linkend="storage-toast"/>.

source: Comments for the copied columns, constraints, and indexes will only be copied if <literal>INCLUDING COMMENTS</literal> is specified. The default behavior is to exclude comments, resulting in the copied columns and constraints in the new table having no comments.
ru: Комментарии для скопированных столбцов, ограничений и индексов будут копироваться, только если явно указано <literal>INCLUDING COMMENTS</literal>. По умолчанию комментарии исключаются, вследствие чего скопированные столбцы и ограничения в новой таблице оказываются без комментариев.

source: <literal>INCLUDING ALL</literal> is an abbreviated form of <literal>INCLUDING DEFAULTS INCLUDING CONSTRAINTS INCLUDING INDEXES INCLUDING STORAGE INCLUDING COMMENTS</literal>.
ru: Предложение <literal>INCLUDING ALL</literal> является сокращённой формой развёрнутого предложения <literal>INCLUDING DEFAULTS INCLUDING CONSTRAINTS INCLUDING INDEXES INCLUDING STORAGE INCLUDING COMMENTS</literal>.

source: Note also that unlike <literal>INHERITS</literal>, columns and constraints copied by <literal>LIKE</literal> are not merged with similarly named columns and constraints. If the same name is specified explicitly or in another <literal>LIKE</literal> clause, an error is signaled.
ru: Заметьте также, что в отличие от <literal>INHERITS</literal>, столбцы и ограничения, копируемые командой <literal>LIKE</literal> не объединяются с одноимёнными столбцами и ограничениями. Если дублирующееся имя указывается явно или возникает в другом предложении <literal>LIKE</literal>, происходит ошибка.

source: The <literal>LIKE</literal> clause can also be used to copy columns from views, foreign tables, or composite types. Inapplicable options (e.g., <literal>INCLUDING INDEXES</literal> from a view) are ignored.
ru: Предложение <literal>LIKE</literal> может также применяться для копирования столбцов из представлений, сторонних таблиц и составных типов. Неприменимые параметры (например, <literal>INCLUDING INDEXES</literal> для представления) при этом игнорируются.

source: An optional name for a column or table constraint. If the constraint is violated, the constraint name is present in error messages, so constraint names like <literal>col must be positive</literal> can be used to communicate helpful constraint information to client applications. (Double-quotes are needed to specify constraint names that contain spaces.) If a constraint name is not specified, the system generates a name.
ru: Необязательное имя столбца или ограничения таблицы. При нарушении ограничения его имя будет выводиться в сообщении об ошибках, так что имена ограничений вида <literal>столбец должен быть положительным</literal> могут сообщить полезную информацию об ограничении клиентскому приложению. (Имена ограничений, включающие пробелы, необходимо заключать в двойные кавычки.) Если имя ограничения не указано, система генерирует имя автоматически.

source: The column is not allowed to contain null values.
ru: Данный столбец не принимает значения NULL.

source: The column is allowed to contain null values. This is the default.
ru: Данный столбец может содержать значения NULL (по умолчанию).

source: This clause is only provided for compatibility with non-standard SQL databases. Its use is discouraged in new applications.
ru: Это предложение предназначено только для совместимости с нестандартными базами данных SQL. Использовать его в новых приложениях не рекомендуется.
