Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/create_policy.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new row level security policy for a table
ru: создать новую политику защиты на уровне строк для таблицы

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: role_name
ru: имя_роли

source: using_expression
ru: выражение_USING

source: check_expression
ru: выражение_CHECK

source: Description
ru: Описание

source: The <command>CREATE POLICY</command> command defines a new row-level security policy for a table. Note that row-level security must be enabled on the table (using <command>ALTER TABLE ... ENABLE ROW LEVEL SECURITY</command>) in order for created policies to be applied.
ru: Команда <command>CREATE POLICY</command> определяет для таблицы новую политику защиты на уровне строк. Заметьте, что для таблицы должна быть включена защита на уровне строк (using <command>ALTER TABLE ... ENABLE ROW LEVEL SECURITY</command>), чтобы созданные политики действовали.

source: A policy grants the permission to select, insert, update, or delete rows that match the relevant policy expression. Existing table rows are checked against the expression specified in <literal>USING</literal>, while new rows that would be created via <literal>INSERT</literal> or <literal>UPDATE</literal> are checked against the expression specified in <literal>WITH CHECK</literal>. When a <literal>USING</literal> expression returns true for a given row then that row is visible to the user, while if false or null is returned then the row is not visible. When a <literal>WITH CHECK</literal> expression returns true for a row then that row is inserted or updated, while if false or null is returned then an error occurs.
ru: Политика даёт разрешение на выборку, добавление, изменение или удаление строк, удовлетворяющих соответствующему выражению политики. Существующие строки таблицы проверяются по выражению, указанному в <literal>USING</literal>, тогда как строки, которые могут быть созданы командами <literal>INSERT</literal> или <literal>UPDATE</literal> проверяются по выражению, указанному в <literal>WITH CHECK</literal>. Когда выражение <literal>USING</literal> истинно для заданной строки, эта строка видна пользователю, а если ложно или выдаёт NULL, строка не видна. Когда выражение <literal>WITH CHECK</literal> истинно для заданной строки, эта строка добавляется или изменяется, а если ложно или выдаёт NULL, происходит ошибка.

source: For <command>INSERT</command> and <command>UPDATE</command> statements, <literal>WITH CHECK</literal> expressions are enforced after <literal>BEFORE</literal> triggers are fired, and before any actual data modifications are made. Thus a <literal>BEFORE ROW</literal> trigger may modify the data to be inserted, affecting the result of the security policy check. <literal>WITH CHECK</literal> expressions are enforced before any other constraints.
ru: Для операторов <command>INSERT</command> и <command>UPDATE</command> выражения <literal>WITH CHECK</literal> применяются после срабатывания триггеров <literal>BEFORE</literal>, но до того, как будут собственно модифицированы данные. Таким образом, триггер <literal>BEFORE ROW</literal> может изменить данные, подлежащие добавлению, и повлиять на результат условия политики защиты. Выражения <literal>WITH CHECK</literal> обрабатываются до каких-либо других ограничений.

source: Policy names are per-table. Therefore, one policy name can be used for many different tables and have a definition for each table which is appropriate to that table.
ru: Имена политик задаются на уровне таблицы. Таким образом, одно имя политики можно использовать в нескольких разных таблицах и в каждой дать отдельное, подходящее этой таблице определение политики.

source: Policies can be applied for specific commands or for specific roles. The default for newly created policies is that they apply for all commands and roles, unless otherwise specified. If multiple policies apply to a given statement, they will be combined using OR (although <literal>ON CONFLICT DO UPDATE</literal> and <literal>INSERT</literal> policies are not combined in this way, but rather enforced as noted at each stage of <literal>ON CONFLICT</literal> execution).
ru: Политики можно применять к определённым командам или избранным ролям. По умолчанию создаваемые политики применяются ко всем командам и ролям, если нет других указаний. Если к заданному оператору применяются несколько политик, они будут объединены логическим сложением (хотя политики <literal>ON CONFLICT DO UPDATE</literal> и <literal>INSERT</literal> таким образом не складываются, а применяются как отмечено на каждой стадии выполнения <literal>ON CONFLICT</literal>).

source: For commands that can have both <literal>USING</literal> and <literal>WITH CHECK</literal> policies (<literal>ALL</literal> and <literal>UPDATE</literal>), if no <literal>WITH CHECK</literal> policy is defined, then the <literal>USING</literal> policy will be used both for which rows are visible (normal <literal>USING</literal> case) and for which rows will be allowed to be added (<literal>WITH CHECK</literal> case).
ru: Для команд, допускающих наличие политик <literal>USING</literal> и <literal>WITH CHECK</literal> (<literal>ALL</literal> и <literal>UPDATE</literal>), в отсутствие политики <literal>WITH CHECK</literal> политика <literal>USING</literal> будет определять и видимость строк (обычное предназначение <literal>USING</literal>), и разрешение на добавление строк (предназначение <literal>WITH CHECK</literal>).

source: If row-level security is enabled for a table, but no applicable policies exist, a <quote>default deny</quote> policy is assumed, so that no rows will be visible or updatable.
ru: Если для таблицы включена защита на уровне строк, но применимые политики отсутствуют, предполагается политика <quote>запрета по умолчанию</quote>, так что никакие строки нельзя будет увидеть или изменить.

source: Parameters
ru: Параметры

source: The name of the policy to be created. This must be distinct from the name of any other policy for the table.
ru: Имя создаваемой политики. Оно должно отличаться от имён других политик для этой таблицы.

source: The name (optionally schema-qualified) of the table the policy applies to.
ru: Имя (возможно, дополненное схемой) существующей таблицы (или представления), к которой применяется эта политика.

source: command
ru: команда

source: The command to which the policy applies. Valid options are <command>ALL</command>, <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command>. <command>ALL</command> is the default. See below for specifics regarding how these are applied.
ru: Команда, к которой применяется политика. Допустимые варианты: <command>ALL</command>, <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. <command>ALL</command> (все) подразумевается по умолчанию. Особенности их применения описаны ниже.

source: The role(s) to which the policy is to be applied. The default is <literal>PUBLIC</literal>, which will apply the policy to all roles.
ru: Роль (роли), к которой применяется политика. По умолчанию подразумевается <literal>PUBLIC</literal>, то есть политика применяется ко всем ролям.

source: Any <acronym>SQL</acronym> conditional expression (returning <type>boolean</type>). The conditional expression cannot contain any aggregate or window functions. This expression will be added to queries that refer to the table if row level security is enabled. Rows for which the expression returns true will be visible. Any rows for which the expression returns false or null will not be visible to the user (in a <command>SELECT</command>), and will not be available for modification (in an <command>UPDATE</command> or <command>DELETE</command>). Such rows are silently suppressed; no error is reported.
ru: Произвольное условное выражение <acronym>SQL</acronym> (возвращающее <type>boolean</type>). Это условное выражение не может содержать агрегатные или оконные функции. Когда включена защита на уровне строк, оно добавляется в запросы, обращающиеся к данной таблице, и в их результатах оказываются видимыми только те строки, для которых оно выдаёт true. Все строки, для которых это выражение возвращает false или NULL, не будут видны пользователю (в запросе <command>SELECT</command>), и не будут доступны для модификации (запросами <command>UPDATE</command> или <command>DELETE</command>). Такая строка просто пропускается, ошибка при этом не выдаётся.

source: Any <acronym>SQL</acronym> conditional expression (returning <type>boolean</type>). The conditional expression cannot contain any aggregate or window functions. This expression will be used in <command>INSERT</command> and <command>UPDATE</command> queries against the table if row level security is enabled. Only rows for which the expression evaluates to true will be allowed. An error will be thrown if the expression evaluates to false or null for any of the records inserted or any of the records that result from the update. Note that the <replaceable class="parameter">check_expression</replaceable> is evaluated against the proposed new contents of the row, not the original contents.
ru: Произвольное условное выражение <acronym>SQL</acronym> (возвращающее <type>boolean</type>). Это условное выражение не может содержать агрегатные или оконные функции. Когда включена защита на уровне строк, оно применяется в запросах <command>INSERT</command> и <command>UPDATE</command> к этой таблице, так что в них принимаются только те строки, для которых оно выдаёт true. Если это выражение выдаёт false или NULL для любой из добавляемых записей или записей, получаемых при изменении, выдаётся ошибка. Заметьте, что <replaceable class="parameter">ограничение_проверки</replaceable> вычисляется для предлагаемого нового содержимого строки, а не для существующих данных.

source: Per-Command Policies
ru: Политики по командам

source: Using <literal>ALL</literal> for a policy means that it will apply to all commands, regardless of the type of command. If an <literal>ALL</literal> policy exists and more specific policies exist, then both the <literal>ALL</literal> policy and the more specific policy (or policies) will be combined using OR, as usual for overlapping policies. Additionally, <literal>ALL</literal> policies will be applied to both the selection side of a query and the modification side, using the <literal>USING</literal> expression for both cases if only a <literal>USING</literal> expression has been defined.
ru: Указание <literal>ALL</literal> для политики означает, что она применяется ко всем командам, вне зависимости от типа. Если существует политика <literal>ALL</literal> и другие более детализированные политики, тогда и политика <literal>ALL</literal>, и более детализированная политика (или политики) объединяются логическим сложением, как обычно при наложении политик. Кроме того, политики <literal>ALL</literal> с выражением <literal>USING</literal> будут применяться и к стороне выборки, и к стороне изменения данных в запросе, если определено только выражение <literal>USING</literal>.

source: As an example, if an <literal>UPDATE</literal> is issued, then the <literal>ALL</literal> policy will be applicable both to what the <literal>UPDATE</literal> will be able to select as rows to be updated (applying the <literal>USING</literal> expression), and to the resulting updated rows, to check if they are permitted to be added to the table (applying the <literal>WITH CHECK</literal> expression, if defined, and the <literal>USING</literal> expression otherwise). If an <command>INSERT</command> or <command>UPDATE</command> command attempts to add rows to the table that do not pass the <literal>ALL</literal> policy's <literal>WITH CHECK</literal> expression, the entire command will be aborted.
ru: Например, когда выполняется <literal>UPDATE</literal>, политика <literal>ALL</literal> будет фильтровать и строки, которые сможет прочитать <literal>UPDATE</literal> для изменения (применяя выражение <literal>USING</literal>), и окончательные изменённые строки, проверяя, можно ли записать их в таблицу (применяя выражение <literal>WITH CHECK</literal>, если оно определено, или <literal>USING</literal> в противном случае). Если команда <command>INSERT</command> или <command>UPDATE</command> пытается добавить в таблицу строки, не удовлетворяющие выражению <literal>WITH CHECK</literal> политики <literal>ALL</literal>, вся команда будет прервана.

source: Using <literal>SELECT</literal> for a policy means that it will apply to <literal>SELECT</literal> queries and whenever <literal>SELECT</literal> permissions are required on the relation the policy is defined for. The result is that only those records from the relation that pass the <literal>SELECT</literal> policy will be returned during a <literal>SELECT</literal> query, and that queries that require <literal>SELECT</literal> permissions, such as <literal>UPDATE</literal>, will also only see those records that are allowed by the <literal>SELECT</literal> policy. A <literal>SELECT</literal> policy cannot have a <literal>WITH CHECK</literal> expression, as it only applies in cases where records are being retrieved from the relation.
ru: Указание <literal>SELECT</literal> для политики означает, что она применяется к запросам <literal>SELECT</literal> и тогда, когда при обращении к отношению, для которого определена политика, задействуется право <literal>SELECT</literal>. В результате запрос <literal>SELECT</literal> выдаст только те записи из отношения, которые удовлетворят политике <literal>SELECT</literal>, и запрос, использующий право <literal>SELECT</literal>, например, запрос <literal>UPDATE</literal>, увидит только записи, разрешённые политикой <literal>SELECT</literal>. Для политики <literal>SELECT</literal> не может задаваться выражение <literal>WITH CHECK</literal>, так как оно действует только когда записи читаются из отношения.

source: Using <literal>INSERT</literal> for a policy means that it will apply to <literal>INSERT</literal> commands. Rows being inserted that do not pass this policy will result in a policy violation error, and the entire <literal>INSERT</literal> command will be aborted. An <literal>INSERT</literal> policy cannot have a <literal>USING</literal> expression, as it only applies in cases where records are being added to the relation.
ru: Указание <literal>INSERT</literal> для политики означает, что она применяется к командам <literal>INSERT</literal>. Если вставляемые строки не проходят проверку политики, выдаётся ошибка нарушения политики и вся команда <literal>INSERT</literal> прерывается. Для политики <literal>INSERT</literal> не может задаваться выражение <literal>USING</literal>, так как она действует только когда в отношение добавляются записи.

source: Note that <literal>INSERT</literal> with <literal>ON CONFLICT DO UPDATE</literal> checks <literal>INSERT</literal> policies' <literal>WITH CHECK</literal> expressions only for rows appended to the relation by the <literal>INSERT</literal> path.
ru: Заметьте, что <literal>INSERT</literal> с указанием <literal>ON CONFLICT DO UPDATE</literal> проверяет выражения <literal>WITH CHECK</literal> политик <literal>INSERT</literal> только для строк, добавляемых в отношение по пути <literal>INSERT</literal>.

source: Using <literal>UPDATE</literal> for a policy means that it will apply to <literal>UPDATE</literal> commands (or auxiliary <literal>ON CONFLICT DO UPDATE</literal> clauses of <literal>INSERT</literal> commands). Since <literal>UPDATE</literal> involves pulling an existing record and then making changes to some portion (but possibly not all) of the record, <literal>UPDATE</literal> policies accept both a <literal>USING</literal> expression and a <literal>WITH CHECK</literal> expression. The <literal>USING</literal> expression determines which records the <literal>UPDATE</literal> command will see to operate against, while the <literal>WITH CHECK</literal> expression defines which modified rows are allowed to be stored back into the relation.
ru: Указание <literal>UPDATE</literal> для политики означает, что она применяется к командам <literal>UPDATE</literal> (или дополнительным предложениям <literal>ON CONFLICT DO UPDATE</literal> команд <literal>INSERT</literal>). Так как действие <literal>UPDATE</literal> подразумевает извлечение существующей записи и последующее изменение в ней полей (возможно, не всех), политики <literal>UPDATE</literal> принимают и выражение <literal>USING</literal>, и выражение <literal>WITH CHECK</literal>. Выражение <literal>USING</literal> определяет, какие строки будет обрабатывать команда <literal>UPDATE</literal>, тогда как выражение <literal>WITH CHECK</literal> определяет, какие изменённые строки можно снова записать в отношение.

source: When an <literal>UPDATE</literal> command is used with a <literal>WHERE</literal> clause or a <literal>RETURNING</literal> clause, <literal>SELECT</literal> rights are also required on the relation being updated and the appropriate <literal>SELECT</literal> and <literal>ALL</literal> policies will be combined (using OR for any overlapping <literal>SELECT</literal> related policies found) with the <literal>USING</literal> clause of the <literal>UPDATE</literal> policy using AND. Therefore, in order for a user to be able to <literal>UPDATE</literal> specific rows, the user must have access to the row(s) through a <literal>SELECT</literal> or <literal>ALL</literal> policy and the row(s) must pass the <literal>UPDATE</literal> policy's <literal>USING</literal> expression.
ru: Когда выполняется команда <literal>UPDATE</literal> с предложением <literal>WHERE</literal> или <literal>RETURNING</literal>, для обращения к целевому отношению также требуются права <literal>SELECT</literal>, так что соответствующие политики <literal>SELECT</literal> и <literal>ALL</literal> будут объединены (логическим сложением всех найденных связанных политик <literal>SELECT</literal>), а затем совмещены (логическим умножением) с предложением <literal>USING</literal> политики <literal>UPDATE</literal>. Таким образом, чтобы пользователь мог изменять определённые строки (выполняя <literal>UPDATE</literal>), ему должен быть разрешён доступ к ним политикой <literal>SELECT</literal> или <literal>ALL</literal> и эти строки должны удовлетворять выражению <literal>USING</literal> политики <literal>UPDATE</literal>.

source: Any rows whose updated values do not pass the <literal>WITH CHECK</literal> expression will cause an error, and the entire command will be aborted. If only a <literal>USING</literal> clause is specified, then that clause will be used for both <literal>USING</literal> and <literal>WITH CHECK</literal> cases.
ru: Если в какой-либо строке изменённые значения не будут удовлетворять выражению <literal>WITH CHECK</literal>, произойдёт ошибка и вся команда будет прервана. Если указывается только предложение <literal>USING</literal>, его выражение будет применяться и в качестве <literal>USING</literal>, и в качестве выражения <literal>WITH CHECK</literal>.

source: Note, however, that <literal>INSERT</literal> with <literal>ON CONFLICT DO UPDATE</literal> requires that an <literal>UPDATE</literal> policy <literal>USING</literal> expression always be enforced as a <literal>WITH CHECK</literal> expression. This <literal>UPDATE</literal> policy must always pass when the <literal>UPDATE</literal> path is taken. Any existing row that necessitates that the <literal>UPDATE</literal> path be taken must pass the (<literal>UPDATE</literal> or <literal>ALL</literal>) <literal>USING</literal> qualifications (combined using OR), which are always enforced as <literal>WITH CHECK</literal> options in this context. (The <literal>UPDATE</literal> path will <emphasis>never</emphasis> be silently avoided; an error will be thrown instead.) Finally, the final row appended to the relation must pass any <literal>WITH CHECK</literal> options that a conventional <literal>UPDATE</literal> is required to pass.
ru: Заметьте однако, что <literal>INSERT</literal> с <literal>ON CONFLICT DO UPDATE</literal> требует, чтобы выражение <literal>USING</literal> политики <literal>UPDATE</literal> всегда действовало как выражение <literal>WITH CHECK</literal>. Эта политика <literal>UPDATE</literal> должна всегда выполняться, когда выбирается путь <literal>UPDATE</literal>. Любая существующая строка, из-за которой выбирается путь <literal>UPDATE</literal>, должна удовлетворять проверкам (политик <literal>UPDATE</literal> или <literal>ALL</literal>) <literal>USING</literal> (объединённым логическим сложением), которые всегда действуют как <literal>WITH CHECK</literal> в данном контексте. (Путь <literal>UPDATE</literal> <emphasis>никогда</emphasis> не игнорируется, так что в случае невыполнения условия выдаётся ошибка.) Наконец, окончательная строка, добавляемая в отношение, должна проходить все проверки <literal>WITH CHECK</literal>, которые должны быть пройдены и при обычном <literal>UPDATE</literal>.

source: Using <literal>DELETE</literal> for a policy means that it will apply to <literal>DELETE</literal> commands. Only rows that pass this policy will be seen by a <literal>DELETE</literal> command. There can be rows that are visible through a <literal>SELECT</literal> that are not available for deletion, if they do not pass the <literal>USING</literal> expression for the <literal>DELETE</literal> policy.
ru: Указание <literal>DELETE</literal> для политики означает, что она применяется к командам <literal>DELETE</literal>. Команда <literal>DELETE</literal> будет видеть только те строки, которые позволит эта политика. При этом строки могут быть видны через <literal>SELECT</literal>, но удалить их будет нельзя, если они не удовлетворяют выражению <literal>USING</literal> политики <literal>DELETE</literal>.

source: When a <literal>DELETE</literal> command is used with a <literal>WHERE</literal> clause or a <literal>RETURNING</literal> clause, <literal>SELECT</literal> rights are also required on the relation being updated and the appropriate <literal>SELECT</literal> and <literal>ALL</literal> policies will be combined (using OR for any overlapping <literal>SELECT</literal> related policies found) with the <literal>USING</literal> clause of the <literal>DELETE</literal> policy using AND. Therefore, in order for a user to be able to <literal>DELETE</literal> specific rows, the user must have access to the row(s) through a <literal>SELECT</literal> or <literal>ALL</literal> policy and the row(s) must pass the <literal>DELETE</literal> policy's <literal>USING</literal> expression.
ru: Когда выполняется команда <literal>DELETE</literal> с предложением <literal>WHERE</literal> или <literal>RETURNING</literal>, для обращения к целевому отношению также требуются права <literal>SELECT</literal>, так что соответствующие политики <literal>SELECT</literal> и <literal>ALL</literal> будут объединены (логическим сложением всех найденных связанных политик <literal>SELECT</literal>), а затем совмещены (логическим умножением) с предложением <literal>USING</literal> политики <literal>DELETE</literal>. Таким образом, чтобы пользователь мог удалить определённые строки (выполняя <literal>DELETE</literal>), ему должен быть разрешён доступ к ним политикой <literal>SELECT</literal> или <literal>ALL</literal> и эти строки должны удовлетворять выражению <literal>USING</literal> политики <literal>DELETE</literal>.
