Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/declare.po
Languages: ru

source: <primary>cursor</primary><secondary>DECLARE</secondary>
ru: <primary>курсор</primary><secondary>DECLARE</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a cursor
ru: определить курсор

source: name
ru: имя

source: query
ru: запрос

source: Description
ru: Описание

source: <command>DECLARE</command> allows a user to create cursors, which can be used to retrieve a small number of rows at a time out of a larger query. After the cursor is created, rows are fetched from it using <xref linkend="sql-fetch"/>.
ru: Оператор <command>DECLARE</command> позволяет пользователю создавать курсоры, с помощью которых можно выбирать по очереди некоторое количество строк из результата большого запроса. Когда курсор создан, через него можно получать строки, применяя команду <xref linkend="sql-fetch"/>.

source: This page describes usage of cursors at the SQL command level. If you are trying to use cursors inside a <application>PL/pgSQL</application> function, the rules are different &mdash; see <xref linkend="plpgsql-cursors"/>.
ru: На этой странице описывается применение курсоров на уровне команд SQL. Если вы попытаетесь использовать курсоры внутри функции <application>PL/pgSQL</application>, правила будут другими &mdash; см. <xref remap="4" linkend="plpgsql-cursors"/>.

source: Parameters
ru: Параметры

source: The name of the cursor to be created.
ru: Имя создаваемого курсора.

source: Causes the cursor to return data in binary rather than in text format.
ru: Курсор с таким свойством возвращает данные в двоичном, а не текстовом формате.

source: Indicates that data retrieved from the cursor should be unaffected by updates to the table(s) underlying the cursor that occur after the cursor is created. In <productname>PostgreSQL</productname>, this is the default behavior; so this key word has no effect and is only accepted for compatibility with the SQL standard.
ru: Указывает, что данные, считываемые из курсора, не должны зависеть от изменений, которые могут происходить в нижележащих таблицах после создания курсора. В <productname>PostgreSQL</productname> это поведение подразумевается по умолчанию, так что это ключевое слово ни на что не влияет и принимается только для совместимости со стандартом SQL.

source: <literal>SCROLL</literal> specifies that the cursor can be used to retrieve rows in a nonsequential fashion (e.g., backward). Depending upon the complexity of the query's execution plan, specifying <literal>SCROLL</literal> might impose a performance penalty on the query's execution time. <literal>NO SCROLL</literal> specifies that the cursor cannot be used to retrieve rows in a nonsequential fashion. The default is to allow scrolling in some cases; this is not the same as specifying <literal>SCROLL</literal>. See <xref linkend="sql-declare-notes" endterm="sql-declare-notes-title"/> for details.
ru: Указание <literal>SCROLL</literal> определяет, что курсор может прокручивать набор данных и получать строки непоследовательно (например, в обратном порядке). В зависимости от сложности плана запроса указание <literal>SCROLL</literal> может отрицательно отразиться на скорости выполнения запроса. Указание <literal>NO SCROLL</literal>, напротив, определяет, что через курсор нельзя будет получать строки в произвольном порядке. По умолчанию прокрутка в некоторых случаях разрешается; но это не равнозначно эффекту указания <literal>SCROLL</literal>. За подробностями обратитесь к <xref remap="3" linkend="sql-declare-notes" endterm="sql-declare-notes-title"/>.

source: <literal>WITH HOLD</literal> specifies that the cursor can continue to be used after the transaction that created it successfully commits. <literal>WITHOUT HOLD</literal> specifies that the cursor cannot be used outside of the transaction that created it. If neither <literal>WITHOUT HOLD</literal> nor <literal>WITH HOLD</literal> is specified, <literal>WITHOUT HOLD</literal> is the default.
ru: Указание <literal>WITH HOLD</literal> определяет, что курсор можно продолжать использовать после успешной фиксации создавшей его транзакции. <literal>WITHOUT HOLD</literal> определяет, что курсор нельзя будет использовать за рамками транзакции, создавшей его. Если не указано ни <literal>WITHOUT HOLD</literal>, ни <literal>WITH HOLD</literal>, по умолчанию подразумевается <literal>WITHOUT HOLD</literal>.

source: A <xref linkend="sql-select"/> or <xref linkend="sql-values"/> command which will provide the rows to be returned by the cursor.
ru: Команда <xref linkend="sql-select"/> или <xref linkend="sql-values"/>, выдающая строки, которые будут получены через курсор.

source: The key words <literal>BINARY</literal>, <literal>INSENSITIVE</literal>, and <literal>SCROLL</literal> can appear in any order.
ru: Ключевые слова <literal>BINARY</literal>, <literal>INSENSITIVE</literal> и <literal>SCROLL</literal> могут указываться в любом порядке.

source: Notes
ru: Замечания

source: Normal cursors return data in text format, the same as a <command>SELECT</command> would produce. The <literal>BINARY</literal> option specifies that the cursor should return data in binary format. This reduces conversion effort for both the server and client, at the cost of more programmer effort to deal with platform-dependent binary data formats. As an example, if a query returns a value of one from an integer column, you would get a string of <literal>1</literal> with a default cursor, whereas with a binary cursor you would get a 4-byte field containing the internal representation of the value (in big-endian byte order).
ru: Обычный курсор выдаёт данные в текстовом виде, в каком их выдаёт <command>SELECT</command>. Однако с указанием <literal>BINARY</literal> курсор может выдавать их и в двоичном формате. Это упрощает операции преобразования данных для сервера и клиента, за счёт дополнительных усилий, требующихся от программиста для работы с платформозависимыми двоичными форматами. Например, если запрос получает значение 1 из целочисленного столбца, обычный курсор выдаст строку, содержащую <literal>1</literal>, тогда как через двоичный курсор будет получено четырёхбайтовое поле, содержащее внутреннее представление значения (с сетевым порядком байтов).

source: Binary cursors should be used carefully. Many applications, including <application>psql</application>, are not prepared to handle binary cursors and expect data to come back in the text format.
ru: Двоичные курсоры должны применяться с осмотрительностью. Многие приложения, в том числе <application>psql</application>, не приспособлены к работе с двоичными курсорами и ожидают, что данные будут поступать в текстовом формате.

source: When the client application uses the <quote>extended query</quote> protocol to issue a <command>FETCH</command> command, the Bind protocol message specifies whether data is to be retrieved in text or binary format. This choice overrides the way that the cursor is defined. The concept of a binary cursor as such is thus obsolete when using extended query protocol &mdash; any cursor can be treated as either text or binary.
ru: Когда клиентское приложение выполняет команду <command>FETCH</command>, используя протокол <quote>расширенных запросов</quote>, в сообщении Bind этого протокола указывается, в каком формате, текстовом или двоичном, должны быть получены данные. Это указание переопределяет свойство курсора, заданное в его объявлении. Таким образом, концепция курсора, объявляемого двоичным, становится устаревшей при использовании протокола расширенных запросов &mdash; любой курсор может быть прочитан как текстовый или двоичный.

source: Unless <literal>WITH HOLD</literal> is specified, the cursor created by this command can only be used within the current transaction. Thus, <command>DECLARE</command> without <literal>WITH HOLD</literal> is useless outside a transaction block: the cursor would survive only to the completion of the statement. Therefore <productname>PostgreSQL</productname> reports an error if such a command is used outside a transaction block. Use <xref linkend="sql-begin"/> and <xref linkend="sql-commit"/> (or <xref linkend="sql-rollback"/>) to define a transaction block.
ru: Если в команде объявления курсора не указано <literal>WITH HOLD</literal>, созданный ей курсор может использоваться только в текущей транзакции. Таким образом, оператор <command>DECLARE</command> без <literal>WITH HOLD</literal> бесполезен вне блока транзакции: курсор будет существовать только до завершения этого оператора. Поэтому <productname>PostgreSQL</productname> сообщает об ошибке, если такая команда выполняется вне блока транзакции. Чтобы определить блок транзакции, примените команды <xref linkend="sql-begin"/> и <xref linkend="sql-commit"/> (или <xref linkend="sql-rollback"/>).

source: If <literal>WITH HOLD</literal> is specified and the transaction that created the cursor successfully commits, the cursor can continue to be accessed by subsequent transactions in the same session. (But if the creating transaction is aborted, the cursor is removed.) A cursor created with <literal>WITH HOLD</literal> is closed when an explicit <command>CLOSE</command> command is issued on it, or the session ends. In the current implementation, the rows represented by a held cursor are copied into a temporary file or memory area so that they remain available for subsequent transactions.
ru: Если в объявлении курсора указано <literal>WITH HOLD</literal> и транзакция, создавшая курсор, успешно фиксируется, к этому курсору могут продолжать обращаться последующие транзакции в этом сеансе. (Но если создавшая курсор транзакция прерывается, курсор уничтожается.) Курсор со свойством <literal>WITH HOLD</literal> (удерживаемый) может быть закрыт явно, командой <command>CLOSE</command>, либо неявно, по завершении сеанса. В текущей реализации строки, представляемые удерживаемым курсором, копируются во временный файл или в область памяти, так что они остаются доступными для следующих транзакций.

source: <literal>WITH HOLD</literal> may not be specified when the query includes <literal>FOR UPDATE</literal> or <literal>FOR SHARE</literal>.
ru: Объявить курсор со свойством <literal>WITH HOLD</literal> можно, только если запрос не содержит указаний <literal>FOR UPDATE</literal> и <literal>FOR SHARE</literal>.

source: The <literal>SCROLL</literal> option should be specified when defining a cursor that will be used to fetch backwards. This is required by the SQL standard. However, for compatibility with earlier versions, <productname>PostgreSQL</productname> will allow backward fetches without <literal>SCROLL</literal>, if the cursor's query plan is simple enough that no extra overhead is needed to support it. However, application developers are advised not to rely on using backward fetches from a cursor that has not been created with <literal>SCROLL</literal>. If <literal>NO SCROLL</literal> is specified, then backward fetches are disallowed in any case.
ru: Указание <literal>SCROLL</literal> добавляется при определении курсора, который будет выбирать данные в обратном порядке. Это поведение требуется стандартом SQL. Однако для совместимости с предыдущими версиями, <productname>PostgreSQL</productname> допускает выборку в обратном направлении и без указания <literal>SCROLL</literal>, если план запроса курсора достаточно прост, чтобы реализовать прокрутку назад без дополнительных операций. Тем не менее, разработчикам приложений не следует рассчитывать на то, что курсор, созданный без указания <literal>SCROLL</literal>, можно будет прокручивать назад. С указанием <literal>NO SCROLL</literal> прокрутка назад запрещается в любом случае.

source: Backward fetches are also disallowed when the query includes <literal>FOR UPDATE</literal> or <literal>FOR SHARE</literal>; therefore <literal>SCROLL</literal> may not be specified in this case.
ru: Выборка в обратном направлении также запрещается, если запрос содержит указания <literal>FOR UPDATE</literal> и <literal>FOR SHARE</literal>; в этом случае указание <literal>SCROLL</literal> не принимается.

source: Scrollable and <literal>WITH HOLD</literal> cursors may give unexpected results if they invoke any volatile functions (see <xref linkend="xfunc-volatility"/>). When a previously fetched row is re-fetched, the functions might be re-executed, perhaps leading to results different from the first time. One workaround for such cases is to declare the cursor <literal>WITH HOLD</literal> and commit the transaction before reading any rows from it. This will force the entire output of the cursor to be materialized in temporary storage, so that volatile functions are executed exactly once for each row.
ru: Прокручиваемые и удерживаемые (<literal>WITH HOLD</literal>) курсоры могут выдавать неожиданные результаты, если они вызывают изменчивые функции (см. <xref remap="4" linkend="xfunc-volatility"/>). Когда повторно выбирается ранее прочитанная строка, функции могут вызываться снова и выдавать результаты, отличные от полученных в первый раз. Один из способов обойти эту проблему — объявить курсор с указанием <literal>WITH HOLD</literal> и зафиксировать транзакцию, прежде чем читать из него какие-либо строки. В этом случае весь набор данных курсора будет материализован во временном хранилище, так что изменчивые функции будут выполнены для каждой строки лишь единожды.

source: If the cursor's query includes <literal>FOR UPDATE</literal> or <literal>FOR SHARE</literal>, then returned rows are locked at the time they are first fetched, in the same way as for a regular <xref linkend="sql-select"/> command with these options. In addition, the returned rows will be the most up-to-date versions; therefore these options provide the equivalent of what the SQL standard calls a <quote>sensitive cursor</quote>. (Specifying <literal>INSENSITIVE</literal> together with <literal>FOR UPDATE</literal> or <literal>FOR SHARE</literal> is an error.)
ru: Если запрос в определении курсора включает указания <literal>FOR UPDATE</literal> или <literal>FOR SHARE</literal>, возвращаемые курсором строки блокируются в момент первой выборки, так же, как это происходит при выполнении <xref linkend="sql-select"/> с этими указаниями. Кроме того, при чтении строк будут возвращаться их наиболее актуальные версии; таким образом, с этими указаниями курсор будет вести себя как <quote>чувствительный курсор</quote>, определённый в стандарте SQL. (Указать <literal>INSENSITIVE</literal> для курсора с запросом <literal>FOR UPDATE</literal> или <literal>FOR SHARE</literal> нельзя.)

source: It is generally recommended to use <literal>FOR UPDATE</literal> if the cursor is intended to be used with <command>UPDATE ... WHERE CURRENT OF</command> or <command>DELETE ... WHERE CURRENT OF</command>. Using <literal>FOR UPDATE</literal> prevents other sessions from changing the rows between the time they are fetched and the time they are updated. Without <literal>FOR UPDATE</literal>, a subsequent <literal>WHERE CURRENT OF</literal> command will have no effect if the row was changed since the cursor was created.
ru: Обычно рекомендуется использовать <literal>FOR UPDATE</literal>, если курсор предназначается для применения в командах <command>UPDATE ... WHERE CURRENT OF</command> и <command>DELETE ... WHERE CURRENT OF</command>. Указание <literal>FOR UPDATE</literal> предотвращает изменение строк другими сеансами после того, как они были считаны, и до того, как выполнится команда. Без <literal>FOR UPDATE</literal> последующая команда с <literal>WHERE CURRENT OF</literal> не сработает, если строка будет изменена после создания курсора.

source: Another reason to use <literal>FOR UPDATE</literal> is that without it, a subsequent <literal>WHERE CURRENT OF</literal> might fail if the cursor query does not meet the SQL standard's rules for being <quote>simply updatable</quote> (in particular, the cursor must reference just one table and not use grouping or <literal>ORDER BY</literal>). Cursors that are not simply updatable might work, or might not, depending on plan choice details; so in the worst case, an application might work in testing and then fail in production.
ru: Ещё одна причина использовать указание <literal>FOR UPDATE</literal> в том, что без него последующие команды с <literal>WHERE CURRENT OF</literal> могут выдать ошибку, если запрос курсора не удовлетворяет оговоренному в стандарте SQL критерию <quote>простой изменяемости</quote> (в частности, курсор должен ссылаться только на одну таблицу и не должен использовать группировку и сортировку (<literal>ORDER BY</literal>)). Курсоры, не удовлетворяющие этому критерию, могут работать, либо не работать, в зависимости от конкретного выбранного плана; так что в худшем случае приложение может работать в тестовой, но сломается в производственной среде.

source: The main reason not to use <literal>FOR UPDATE</literal> with <literal>WHERE CURRENT OF</literal> is if you need the cursor to be scrollable, or to be insensitive to the subsequent updates (that is, continue to show the old data). If this is a requirement, pay close heed to the caveats shown above.
ru: Не использовать же <literal>FOR UPDATE</literal> для команд с <literal>WHERE CURRENT OF</literal> в основном имеет смысл, только если требуется получить прокручиваемый курсор или курсор, не отражающий последующие изменения (то есть, продолжающий показывать прежние данные). Если это действительно необходимо, обязательно учтите при реализации приведённые выше замечания.

source: The SQL standard only makes provisions for cursors in embedded <acronym>SQL</acronym>. The <productname>PostgreSQL</productname> server does not implement an <command>OPEN</command> statement for cursors; a cursor is considered to be open when it is declared. However, <application>ECPG</application>, the embedded SQL preprocessor for <productname>PostgreSQL</productname>, supports the standard SQL cursor conventions, including those involving <command>DECLARE</command> and <command>OPEN</command> statements.
ru: В стандарте SQL механизм курсоров предусмотрен только для встраиваемого <acronym>SQL</acronym>. Сервер <productname>PostgreSQL</productname> не реализует для курсоров оператор <command>OPEN</command>; курсор считается открытым при объявлении. Однако <application>ECPG</application>, встраиваемый препроцессор SQL для <productname>PostgreSQL</productname>, следует соглашениям стандарта, в том числе поддерживая для курсоров операторы <command>DECLARE</command> и <command>OPEN</command>.

source: You can see all available cursors by querying the <link linkend="view-pg-cursors"><structname>pg_cursors</structname></link> system view.
ru: Получить список всех доступных курсоров можно, обратившись к системному представлению <link linkend="view-pg-cursors"><structname>pg_cursors</structname></link>.

source: Examples
ru: Примеры

source: To declare a cursor: <placeholder-1/> See <xref linkend="sql-fetch"/> for more examples of cursor usage.
ru: Объявление курсора: <placeholder-1/> Другие примеры использования курсора можно найти в <xref remap="6" linkend="sql-fetch"/>.

source: Compatibility
ru: Совместимость

source: The SQL standard says that it is implementation-dependent whether cursors are sensitive to concurrent updates of the underlying data by default. In <productname>PostgreSQL</productname>, cursors are insensitive by default, and can be made sensitive by specifying <literal>FOR UPDATE</literal>. Other products may work differently.
ru: В стандарте SQL говорится, что чувствительность курсоров к параллельному обновлению нижележащих данных по умолчанию определяется реализацией. В <productname>PostgreSQL</productname> курсоры по умолчанию нечувствительные, а чувствительными их можно сделать с помощью указания <literal>FOR UPDATE</literal>. Другие СУБД могут работать иначе.

source: The SQL standard allows cursors only in embedded <acronym>SQL</acronym> and in modules. <productname>PostgreSQL</productname> permits cursors to be used interactively.
ru: Стандарт SQL допускает курсоры только во встраиваемом <acronym>SQL</acronym> и в модулях. <productname>PostgreSQL</productname> позволяет использовать курсоры интерактивно.

source: Binary cursors are a <productname>PostgreSQL</productname> extension.
ru: Двоичные курсоры являются расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
