Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/do.po
Languages: ru

source: <primary>anonymous code blocks</primary>
ru: <primary>анонимные блоки кода</primary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: execute an anonymous code block
ru: выполнить анонимный блок кода

source: lang_name
ru: имя_языка

source: code
ru: код

source: Description
ru: Описание

source: <command>DO</command> executes an anonymous code block, or in other words a transient anonymous function in a procedural language.
ru: <command>DO</command> выполняет анонимный блок кода или, другими словами, разовую анонимную функцию на процедурном языке.

source: The code block is treated as though it were the body of a function with no parameters, returning <type>void</type>. It is parsed and executed a single time.
ru: Блок кода воспринимается, как если бы это было тело функции, которая не имеет параметров и возвращает <type>void</type>. Этот код разбирается и выполняется один раз.

source: The optional <literal>LANGUAGE</literal> clause can be written either before or after the code block.
ru: Необязательное предложение <literal>LANGUAGE</literal> можно записать до или после блока кода.

source: Parameters
ru: Параметры

source: The procedural language code to be executed. This must be specified as a string literal, just as in <command>CREATE FUNCTION</command>. Use of a dollar-quoted literal is recommended.
ru: Выполняемый код на процедурном языке. Он должен задаваться в виде текстовой строки (её рекомендуется заключать в доллары), как и код в <command>CREATE FUNCTION</command>.

source: The name of the procedural language the code is written in. If omitted, the default is <literal>plpgsql</literal>.
ru: Имя процедурного языка, на котором написан код. По умолчанию подразумевается <literal>plpgsql</literal>.

source: Notes
ru: Замечания

source: The procedural language to be used must already have been installed into the current database by means of <command>CREATE LANGUAGE</command>. <literal>plpgsql</literal> is installed by default, but other languages are not.
ru: Применяемый процедурный язык должен быть уже зарегистрирован в текущей базе с помощью команды <command>CREATE LANGUAGE</command>. По умолчанию зарегистрирован только <literal>plpgsql</literal>, но не другие языки.

source: The user must have <literal>USAGE</literal> privilege for the procedural language, or must be a superuser if the language is untrusted. This is the same privilege requirement as for creating a function in the language.
ru: Пользователь должен иметь право <literal>USAGE</literal> для данного процедурного языка, либо быть суперпользователем, если этот язык недоверенный. Такие же требования действуют и при создании функции на этом языке.

source: Examples
ru: Примеры

source: Grant all privileges on all views in schema <literal>public</literal> to role <literal>webuser</literal>: <placeholder-1/>
ru: Следующий код даст все права для всех представлений в схеме <literal>public</literal> роли <literal>webuser</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>DO</command> statement in the SQL standard.
ru: Оператор <command>DO</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
