Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_opclass.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove an operator class
ru: удалить класс операторов

source: index_method
ru: метод_индекса

source: Description
ru: Описание

source: <command>DROP OPERATOR CLASS</command> drops an existing operator class. To execute this command you must be the owner of the operator class.
ru: <command>DROP OPERATOR CLASS</command> удаляет существующий класс операторов. Выполнить эту команду может только владелец класса операторов.

source: <command>DROP OPERATOR CLASS</command> does not drop any of the operators or functions referenced by the class. If there are any indexes depending on the operator class, you will need to specify <literal>CASCADE</literal> for the drop to complete.
ru: <command>DROP OPERATOR CLASS</command> не удаляет операторы или функции, связанные с этим классом. Если же существуют индексы, зависящие от этого класса, класс будет удалён успешно (вместе с индексами), только если добавить указание <literal>CASCADE</literal>.

source: Parameters
ru: Параметры

source: Do not throw an error if the operator class does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если класс операторов не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing operator class.
ru: Имя (возможно, дополненное схемой) существующего класса операторов.

source: The name of the index access method the operator class is for.
ru: Имя индексного метода, для которого предназначен этот класс операторов.

source: Automatically drop objects that depend on the operator class.
ru: Автоматически удалять объекты, зависящие от данного класса операторов.

source: Refuse to drop the operator class if any objects depend on it. This is the default.
ru: Отказать в удалении класса операторов, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: <command>DROP OPERATOR CLASS</command> will not drop the operator family containing the class, even if there is nothing else left in the family (in particular, in the case where the family was implicitly created by <command>CREATE OPERATOR CLASS</command>). An empty operator family is harmless, but for the sake of tidiness you might wish to remove the family with <command>DROP OPERATOR FAMILY</command>; or perhaps better, use <command>DROP OPERATOR FAMILY</command> in the first place.
ru: <command>DROP OPERATOR CLASS</command> не удалит семейство операторов, содержавшее этот класс, даже если в этом семействе больше ничего не останется (в том числе, если семейство было неявно создано командой <command>CREATE OPERATOR CLASS</command>). Пустое семейство операторов безвредно, но порядка ради затем следует удалить и его, командой <command>DROP OPERATOR FAMILY</command>; или, возможно, выполнить <command>DROP OPERATOR FAMILY</command> в первую очередь.

source: Examples
ru: Примеры

source: Remove the B-tree operator class <literal>widget_ops</literal>: <placeholder-1/> This command will not succeed if there are any existing indexes that use the operator class. Add <literal>CASCADE</literal> to drop such indexes along with the operator class.
ru: Удаление класса операторов B-дерева с именем <literal>widget_ops</literal>: <placeholder-1/> Эта команда не будет выполнена, если в базе существуют индексы, использующие этот класс. Чтобы удалить такие индексы вместе с классом операторов, нужно добавить указание <literal>CASCADE</literal>.

source: Compatibility
ru: Совместимость

source: There is no <command>DROP OPERATOR CLASS</command> statement in the SQL standard.
ru: Команда <command>DROP OPERATOR CLASS</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
