Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_access_method.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove an access method
ru: удалить метод доступа

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP ACCESS METHOD</command> removes an existing access method. Only superusers can drop access methods.
ru: <command>DROP ACCESS METHOD</command> удаляет существующий метод доступа. Удалять методы доступа разрешено только суперпользователям.

source: Parameters
ru: Параметры

source: Do not throw an error if the access method does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если метод доступа не существует. В этом случае будет выдано замечание.

source: The name of an existing access method.
ru: Имя существующего метода доступа.

source: Automatically drop objects that depend on the access method (such as operator classes, operator families, indexes).
ru: Автоматически удалять объекты, зависящие от данного метода доступа (например, классы и семейства операторов, а также индексы).

source: Refuse to drop the access method if any objects depend on it. This is the default.
ru: Отказать в удалении метода доступа, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: Drop the access method <literal>heptree</literal>: <placeholder-1/>
ru: Удаление метода доступа <literal>heptree</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP ACCESS METHOD</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>DROP ACCESS METHOD</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
