Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_role.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a database role
ru: удалить роль в базе данных

source: Description
ru: Описание

source: <command>DROP ROLE</command> removes the specified role(s). To drop a superuser role, you must be a superuser yourself; to drop non-superuser roles, you must have <literal>CREATEROLE</literal> privilege.
ru: <command>DROP ROLE</command> удаляет указанные роли. Удалить роль суперпользователя может только суперпользователь, а чтобы удалить роль обычного пользователя, достаточно иметь право <literal>CREATEROLE</literal>.

source: A role cannot be removed if it is still referenced in any database of the cluster; an error will be raised if so. Before dropping the role, you must drop all the objects it owns (or reassign their ownership) and revoke any privileges the role has been granted on other objects. The <xref linkend="sql-reassign-owned"/> and <xref linkend="sql-drop-owned"/> commands can be useful for this purpose; see <xref linkend="role-removal"/> for more discussion.
ru: Если на эту роль есть ссылки в какой-либо базе данных в кластере, возникнет ошибка и роль не будет удалена. Прежде чем удалять роль, необходимо удалить все принадлежащие ей объекты (или сменить их владельца), а также лишить её данных ей прав для других объектов. Для этой цели можно применить команды <xref linkend="sql-reassign-owned"/> и <xref linkend="sql-drop-owned"/>; за подробностями обратитесь к <xref remap="3" linkend="role-removal"/>.

source: However, it is not necessary to remove role memberships involving the role; <command>DROP ROLE</command> automatically revokes any memberships of the target role in other roles, and of other roles in the target role. The other roles are not dropped nor otherwise affected.
ru: Однако ликвидировать членство в ролях, связанное с этой ролью, не требуется; <command>DROP ROLE</command> автоматически исключит данную роль из других ролей, и третьи роли из данной. Сами роли при этом не удаляются и другим образом никак не затрагиваются.

source: Parameters
ru: Параметры

source: Do not throw an error if the role does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если роль не существует. В этом случае будет выдано замечание.

source: The name of the role to remove.
ru: Имя роли, подлежащей удалению.

source: <productname>PostgreSQL</productname> includes a program <xref linkend="app-dropuser"/> that has the same functionality as this command (in fact, it calls this command) but can be run from the command shell.
ru: <productname>PostgreSQL</productname> включает программу <xref linkend="app-dropuser"/>, которая предоставляет ту же функциональность (на самом деле она вызывает эту команду), но может запускаться в командной оболочке.

source: Examples
ru: Примеры

source: To drop a role: <placeholder-1/>
ru: Удаление роли: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The SQL standard defines <command>DROP ROLE</command>, but it allows only one role to be dropped at a time, and it specifies different privilege requirements than <productname>PostgreSQL</productname> uses.
ru: В стандарте SQL определена команда <command>DROP ROLE</command>, но она может удалять только по одной роли, а для её выполнения требуются другие права, не такие как в <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
