Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_tstemplate.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a text search template
ru: удалить шаблон текстового поиска

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP TEXT SEARCH TEMPLATE</command> drops an existing text search template. You must be a superuser to use this command.
ru: <command>DROP TEXT SEARCH TEMPLATE</command> удаляет существующий шаблон текстового поиска. Выполнить эту команду может только суперпользователь.

source: Parameters
ru: Параметры

source: Do not throw an error if the text search template does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если шаблон текстового поиска не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing text search template.
ru: Имя (возможно, дополненное схемой) существующего шаблона текстового поиска.

source: Automatically drop objects that depend on the text search template.
ru: Автоматически удалять объекты, зависящие от данного шаблона текстового поиска.

source: Refuse to drop the text search template if any objects depend on it. This is the default.
ru: Отказать в удалении шаблона текстового поиска, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: Remove the text search template <literal>thesaurus</literal>: <placeholder-1/> This command will not succeed if there are any existing text search dictionaries that use the template. Add <literal>CASCADE</literal> to drop such dictionaries along with the template.
ru: Удаление шаблона текстового поиска <literal>thesaurus</literal>: <placeholder-1/> Эта команда не будет выполнена, если существуют словари текстового поиска, использующие этот шаблон. Чтобы удалить такие словари вместе с шаблоном, следует добавить указание <literal>CASCADE</literal>.

source: Compatibility
ru: Совместимость

source: There is no <command>DROP TEXT SEARCH TEMPLATE</command> statement in the SQL standard.
ru: Оператор <command>DROP TEXT SEARCH TEMPLATE</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
