Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_index.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove an index
ru: удалить индекс

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP INDEX</command> drops an existing index from the database system. To execute this command you must be the owner of the index.
ru: <command>DROP INDEX</command> удаляет существующий индекс из базы данных. Выполнить эту команду может только владелец индекса.

source: Parameters
ru: Параметры

source: Drop the index without locking out concurrent selects, inserts, updates, and deletes on the index's table. A normal <command>DROP INDEX</command> acquires exclusive lock on the table, blocking other accesses until the index drop can be completed. With this option, the command instead waits until conflicting transactions have completed.
ru: С этим указанием индекс удаляется, не блокируя параллельные операции выборки, добавления, изменения и удаления данных в таблице индекса. Обычный оператор <command>DROP INDEX</command> запрашивает исключительную блокировку для таблицы, запрещая другим обращаться к ней до завершения удаления. Если же добавлено это указание, команда, напротив, будет ждать завершения конфликтующих транзакций.

source: There are several caveats to be aware of when using this option. Only one index name can be specified, and the <literal>CASCADE</literal> option is not supported. (Thus, an index that supports a <literal>UNIQUE</literal> or <literal>PRIMARY KEY</literal> constraint cannot be dropped this way.) Also, regular <command>DROP INDEX</command> commands can be performed within a transaction block, but <command>DROP INDEX CONCURRENTLY</command> cannot.
ru: Применяя это указание, надо учитывать несколько особенностей. В частности, при этом можно задать имя только одного индекса, а параметр <literal>CASCADE</literal> не поддерживается. (Таким образом, индекс, поддерживающий ограничение <literal>UNIQUE</literal> или <literal>PRIMARY KEY</literal>, так удалить нельзя.) Кроме того, обычную команду <command>DROP INDEX</command> можно выполнить в блоке транзакции, а <command>DROP INDEX CONCURRENTLY</command> — нет.

source: Do not throw an error if the index does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если индекс не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an index to remove.
ru: Имя (возможно, дополненное схемой) индекса, подлежащего удалению.

source: Automatically drop objects that depend on the index.
ru: Автоматически удалять объекты, зависящие от данного индекса.

source: Refuse to drop the index if any objects depend on it. This is the default.
ru: Отказать в удалении индекса, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: This command will remove the index <literal>title_idx</literal>: <placeholder-1/>
ru: Эта команда удалит индекс <literal>title_idx</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP INDEX</command> is a <productname>PostgreSQL</productname> language extension. There are no provisions for indexes in the SQL standard.
ru: <command>DROP INDEX</command> является языковым расширением <productname>PostgreSQL</productname>. Средства обеспечения индексов в стандарте SQL не описаны.

source: See Also
ru: См. также
