Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_foreign_table.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a foreign table
ru: удалить стороннюю таблицу

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP FOREIGN TABLE</command> removes a foreign table. Only the owner of a foreign table can remove it.
ru: <command>DROP FOREIGN TABLE</command> удаляет стороннюю таблицу. Удалить стороннюю таблицу может только её владелец.

source: Parameters
ru: Параметры

source: Do not throw an error if the foreign table does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если сторонняя таблица не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of the foreign table to drop.
ru: Имя (возможно, дополненное схемой) сторонней таблицы, подлежащей удалению.

source: Automatically drop objects that depend on the foreign table (such as views).
ru: Автоматически удалять объекты, зависящие от данной сторонней таблицы (например, представления).

source: Refuse to drop the foreign table if any objects depend on it. This is the default.
ru: Отказать в удалении сторонней таблицы, если от неё зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To destroy two foreign tables, <literal>films</literal> and <literal>distributors</literal>: <placeholder-1/>
ru: Удаление двух сторонних таблиц, <literal>films</literal> и <literal>distributors</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: This command conforms to the ISO/IEC 9075-9 (SQL/MED), except that the standard only allows one foreign table to be dropped per command, and apart from the <literal>IF EXISTS</literal> option, which is a <productname>PostgreSQL</productname> extension.
ru: Эта команда соответствует ISO/IEC 9075-9 (SQL/MED), но возможность удалять в одной команде несколько таблиц и указание <literal>IF EXISTS</literal> являются расширениями <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
