Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_database.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a database
ru: удалить базу данных

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP DATABASE</command> drops a database. It removes the catalog entries for the database and deletes the directory containing the data. It can only be executed by the database owner. Also, it cannot be executed while you or anyone else are connected to the target database. (Connect to <literal>postgres</literal> or any other database to issue this command.)
ru: Оператор <command>DROP DATABASE</command> удаляет базу данных. Он удаляет из каталогов записи, относящиеся к базе данных, а также удаляет каталог, содержащий данные. Выполнить эту команду может только владелец базы данных. Кроме того, удалить базу нельзя, пока к ней подключены вы или кто-то ещё. (Чтобы выполнить эту команду, подключитесь к <literal>postgres</literal> или любой другой базе данных.)

source: <command>DROP DATABASE</command> cannot be undone. Use it with care!
ru: Действие команды <command>DROP DATABASE</command> нельзя отменить. Используйте её с осторожностью!

source: Parameters
ru: Параметры

source: Do not throw an error if the database does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если база данных не существует. В этом случае будет выдано замечание.

source: The name of the database to remove.
ru: Имя базы данных, подлежащей удалению.

source: Notes
ru: Замечания

source: <command>DROP DATABASE</command> cannot be executed inside a transaction block.
ru: <command>DROP DATABASE</command> нельзя выполнять внутри блока транзакции.

source: This command cannot be executed while connected to the target database. Thus, it might be more convenient to use the program <xref linkend="app-dropdb"/> instead, which is a wrapper around this command.
ru: Эту команду нельзя выполнить, если установлено подключение к удаляемой базе данных. Поэтому может быть удобнее вместо неё использовать программу <xref linkend="app-dropdb"/>, которая сама вызывает эту команду внутри.

source: Compatibility
ru: Совместимость

source: There is no <command>DROP DATABASE</command> statement in the SQL standard.
ru: Оператор <command>DROP DATABASE</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
