Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_tsparser.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a text search parser
ru: удалить анализатор текстового поиска

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP TEXT SEARCH PARSER</command> drops an existing text search parser. You must be a superuser to use this command.
ru: <command>DROP TEXT SEARCH PARSER</command> удаляет существующий анализатор текстового поиска. Выполнить эту команду может только суперпользователь.

source: Parameters
ru: Параметры

source: Do not throw an error if the text search parser does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если анализатор текстового поиска не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing text search parser.
ru: Имя (возможно, дополненное схемой) существующего анализатора текстового поиска.

source: Automatically drop objects that depend on the text search parser.
ru: Автоматически удалять объекты, зависящие от данного анализатора текстового поиска.

source: Refuse to drop the text search parser if any objects depend on it. This is the default.
ru: Отказать в удалении анализатора текстового поиска, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: Remove the text search parser <literal>my_parser</literal>: <placeholder-1/> This command will not succeed if there are any existing text search configurations that use the parser. Add <literal>CASCADE</literal> to drop such configurations along with the parser.
ru: Удаление анализатора текстового поиска <literal>my_parser</literal>: <placeholder-1/> Эта команда не будет выполнена, если существуют конфигурации текстового поиска, использующие это анализатор. Чтобы удалить такие конфигурации вместе с анализатором, следует добавить указание <literal>CASCADE</literal>.

source: Compatibility
ru: Совместимость

source: There is no <command>DROP TEXT SEARCH PARSER</command> statement in the SQL standard.
ru: Оператор <command>DROP TEXT SEARCH PARSER</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
