Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/drop_materialized_view.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a materialized view
ru: удалить материализованное представление

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP MATERIALIZED VIEW</command> drops an existing materialized view. To execute this command you must be the owner of the materialized view.
ru: <command>DROP MATERIALIZED VIEW</command> удаляет существующее материализованное представление. Выполнить эту команду может только владелец материализованного представления.

source: Parameters
ru: Параметры

source: Do not throw an error if the materialized view does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если материализованное представление не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of the materialized view to remove.
ru: Имя (возможно, дополненное схемой) материализованного представления, подлежащего удалению.

source: Automatically drop objects that depend on the materialized view (such as other materialized views, or regular views).
ru: Автоматически удалять объекты, зависящие от данного материализованного представления (например, другие материализованные или обычные представления).

source: Refuse to drop the materialized view if any objects depend on it. This is the default.
ru: Отказать в удалении материализованного представления, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: This command will remove the materialized view called <literal>order_summary</literal>: <placeholder-1/>
ru: Эта команда удаляет материализованное представление с именем <literal>order_summary</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP MATERIALIZED VIEW</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>DROP MATERIALIZED VIEW</command> — расширение <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
