Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/execute.po
Languages: ru

source: <primary>prepared statements</primary><secondary>executing</secondary>
ru: <primary>подготовленные операторы</primary><secondary>выполнение</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: execute a prepared statement
ru: выполнить подготовленный оператор

source: parameter
ru: параметр

source: Description
ru: Описание

source: <command>EXECUTE</command> is used to execute a previously prepared statement. Since prepared statements only exist for the duration of a session, the prepared statement must have been created by a <command>PREPARE</command> statement executed earlier in the current session.
ru: <command>EXECUTE</command> выполняет подготовленный ранее оператор. Так как подготовленные операторы существуют только в рамках сеанса, они должны создаваться командой <command>PREPARE</command>, выполненной в текущем сеансе ранее.

source: If the <command>PREPARE</command> statement that created the statement specified some parameters, a compatible set of parameters must be passed to the <command>EXECUTE</command> statement, or else an error is raised. Note that (unlike functions) prepared statements are not overloaded based on the type or number of their parameters; the name of a prepared statement must be unique within a database session.
ru: Если команда <command>PREPARE</command>, создающая оператор, определяет некоторый набор параметров, команде <command>EXECUTE</command> должны быть переданы подходящие значения этих параметров; в противном случае возникнет ошибка. Заметьте, что подготовленные операторы (в отличие от функций) не перегружаются в зависимости от типа или числа параметров; имя подготовленного оператора должно быть уникальным в рамках текущего сеанса.

source: For more information on the creation and usage of prepared statements, see <xref linkend="sql-prepare"/>.
ru: Чтобы узнать больше о создании и использовании подготовленных операторов, обратитесь к <xref remap="3" linkend="sql-prepare"/>.

source: Parameters
ru: Параметры

source: The name of the prepared statement to execute.
ru: Имя подготовленного оператора, который будет выполнен.

source: The actual value of a parameter to the prepared statement. This must be an expression yielding a value that is compatible with the data type of this parameter, as was determined when the prepared statement was created.
ru: Фактическое значение параметра подготовленного оператора. Это может быть выражение, выдающее значение, совместимое с типом данных этого параметра, который был определён при создании подготовленного оператора.

source: Outputs
ru: Выводимая информация

source: The command tag returned by <command>EXECUTE</command> is that of the prepared statement, and not <literal>EXECUTE</literal>.
ru: Метка команды, возвращаемая <command>EXECUTE</command>, соответствует подготовленному оператору, а не оператору <literal>EXECUTE</literal>.

source: Examples
ru: Примеры

source: Compatibility
ru: Совместимость

source: The SQL standard includes an <command>EXECUTE</command> statement, but it is only for use in embedded SQL. This version of the <command>EXECUTE</command> statement also uses a somewhat different syntax.
ru: В стандарте SQL есть оператор <command>EXECUTE</command>, но он предназначен только для применения во встраиваемом SQL. Эта версия оператора <command>EXECUTE</command> имеет также несколько другой синтаксис.

source: See Also
ru: См. также
