Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/explain.po
Languages: ru

source: <primary>prepared statements</primary><secondary>showing the query plan</secondary>
ru: <primary>подготовленные операторы</primary><secondary>показ плана запроса</secondary>

source: <primary>cursor</primary><secondary>showing the query plan</secondary>
ru: <primary>курсор</primary><secondary>показ плана запроса</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: show the execution plan of a statement
ru: показать план выполнения оператора

source: option
ru: параметр

source: statement
ru: оператор

source: where <placeholder-1/> can be one of:
ru: Здесь допускается <placeholder-1/>:

source: Description
ru: Описание

source: This command displays the execution plan that the <productname>PostgreSQL</productname> planner generates for the supplied statement. The execution plan shows how the table(s) referenced by the statement will be scanned &mdash; by plain sequential scan, index scan, etc. &mdash; and if multiple tables are referenced, what join algorithms will be used to bring together the required rows from each input table.
ru: Эта команда выводит план выполнения, генерируемый планировщиком <productname>PostgreSQL</productname> для заданного оператора. План выполнения показывает, как будут сканироваться таблицы, затрагиваемые оператором &mdash; просто последовательно, по индексу и т. д. &mdash; а если запрос связывает несколько таблиц, какой алгоритм соединения будет выбран для объединения считанных из них строк.

source: The most critical part of the display is the estimated statement execution cost, which is the planner's guess at how long it will take to run the statement (measured in cost units that are arbitrary, but conventionally mean disk page fetches). Actually two numbers are shown: the start-up cost before the first row can be returned, and the total cost to return all the rows. For most queries the total cost is what matters, but in contexts such as a subquery in <literal>EXISTS</literal>, the planner will choose the smallest start-up cost instead of the smallest total cost (since the executor will stop after getting one row, anyway). Also, if you limit the number of rows to return with a <literal>LIMIT</literal> clause, the planner makes an appropriate interpolation between the endpoint costs to estimate which plan is really the cheapest.
ru: Наибольший интерес в выводимой информации представляет ожидаемая стоимость выполнения оператора, которая показывает, сколько, по мнению планировщика, будет выполняться этот оператор (это значение измеряется в единицах стоимости, которые не имеют точного определения, но обычно это обращение к странице на диске). Фактически выводятся два числа: стоимость запуска до выдачи первой строки и общая стоимость выдачи всех строк. Для большинства запросов важна общая стоимость, но в таких контекстах, как подзапрос в <literal>EXISTS</literal>, планировщик будет минимизировать стоимость запуска, а не общую стоимость (так как исполнение запроса всё равно завершится сразу после получения одной строки). Кроме того, если количество возвращаемых строк ограничивается предложением <literal>LIMIT</literal>, планировщик интерполирует стоимость между двумя этими числами, выбирая наиболее выгодный план.

source: The <literal>ANALYZE</literal> option causes the statement to be actually executed, not only planned. Then actual run time statistics are added to the display, including the total elapsed time expended within each plan node (in milliseconds) and the total number of rows it actually returned. This is useful for seeing whether the planner's estimates are close to reality.
ru: С параметром <literal>ANALYZE</literal> оператор будет выполнен на самом деле, а не только запланирован. При этом в вывод добавляются фактические сведения о времени выполнения, включая общее время, затраченное на каждый узел плана (в миллисекундах) и общее число строк, выданных в результате. Это помогает понять, насколько близки к реальности предварительные оценки планировщика.

source: Keep in mind that the statement is actually executed when the <literal>ANALYZE</literal> option is used. Although <command>EXPLAIN</command> will discard any output that a <command>SELECT</command> would return, other side effects of the statement will happen as usual. If you wish to use <command>EXPLAIN ANALYZE</command> on an <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>CREATE TABLE AS</command>, or <command>EXECUTE</command> statement without letting the command affect your data, use this approach: <placeholder-1/>
ru: Имейте в виду, что с указанием <literal>ANALYZE</literal> оператор действительно выполняется. Хотя <command>EXPLAIN</command> отбрасывает результат, который вернул бы <command>SELECT</command>, в остальном все действия выполняются как обычно. Если вы хотите выполнить <command>EXPLAIN ANALYZE</command> с командой <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>CREATE TABLE AS</command> или <command>EXECUTE</command>, не допуская изменения данных этой командой, воспользуйтесь таким приёмом: <placeholder-1/>

source: Only the <literal>ANALYZE</literal> and <literal>VERBOSE</literal> options can be specified, and only in that order, without surrounding the option list in parentheses. Prior to <productname>PostgreSQL</productname> 9.0, the unparenthesized syntax was the only one supported. It is expected that all new options will be supported only in the parenthesized syntax.
ru: Без скобок для этого оператора можно указать только параметры <literal>ANALYZE</literal> и <literal>VERBOSE</literal> и только в таком порядке. В <productname>PostgreSQL</productname> до версии 9.0 поддерживался только синтаксис без скобок, однако в дальнейшем ожидается, что все новые параметры будут восприниматься только в скобках.

source: Parameters
ru: Параметры

source: Carry out the command and show actual run times and other statistics. This parameter defaults to <literal>FALSE</literal>.
ru: Выполнить команду и вывести фактическое время выполнения и другую статистику. По умолчанию этот параметр равен <literal>FALSE</literal>.

source: Display additional information regarding the plan. Specifically, include the output column list for each node in the plan tree, schema-qualify table and function names, always label variables in expressions with their range table alias, and always print the name of each trigger for which statistics are displayed. This parameter defaults to <literal>FALSE</literal>.
ru: Вывести дополнительную информацию о плане запроса. В частности, включить список столбцов результата для каждого узла в дереве плана, дополнить схемой имена таблиц и функций, всегда указывать для переменных в выражениях псевдоним их таблицы, а также выводить имена всех триггеров, для которых выдаётся статистика. По умолчанию этот параметр равен <literal>FALSE</literal>.

source: Include information on the estimated startup and total cost of each plan node, as well as the estimated number of rows and the estimated width of each row. This parameter defaults to <literal>TRUE</literal>.
ru: Вывести рассчитанную стоимость запуска и общую стоимость каждого узла плана, а также рассчитанное число строк и ширину каждой строки. Этот параметр по умолчанию равен <literal>TRUE</literal>.

source: Include information on buffer usage. Specifically, include the number of shared blocks hit, read, dirtied, and written, the number of local blocks hit, read, dirtied, and written, and the number of temp blocks read and written. A <emphasis>hit</emphasis> means that a read was avoided because the block was found already in cache when needed. Shared blocks contain data from regular tables and indexes; local blocks contain data from temporary tables and indexes; while temp blocks contain short-term working data used in sorts, hashes, Materialize plan nodes, and similar cases. The number of blocks <emphasis>dirtied</emphasis> indicates the number of previously unmodified blocks that were changed by this query; while the number of blocks <emphasis>written</emphasis> indicates the number of previously-dirtied blocks evicted from cache by this backend during query processing. The number of blocks shown for an upper-level node includes those used by all its child nodes. In text format, only non-zero values are printed. This parameter may only be used when <literal>ANALYZE</literal> is also enabled. It defaults to <literal>FALSE</literal>.
ru: Включить информацию об использовании буфера. В частности, вывести число попаданий, блоков прочитанных, загрязненных и записанных в разделяемом и локальном буфере, а также число прочитанных и записанных временных блоков. <emphasis>Попаданием</emphasis> считается ситуация, когда требуемый блок уже находится в кеше и чтения с диска удаётся избежать. Блоки в общем буфере содержат данные обычных таблиц и индексов, в локальном — данные временных таблиц и индексов, а временные блоки предназначены для краткосрочного использования при выполнении сортировки, хеширования, материализации и подобных узлов плана. Число <emphasis>загрязнённых</emphasis> блоков показывает, сколько ранее не модифицированных блоков изменила данная операция; тогда как число <emphasis>записанных</emphasis> блоков показывает, сколько ранее загрязнённых блоков данный серверный процесс вынес из кеша при обработке запроса. Значения, указываемые для узла верхнего уровня, включают значения всех его дочерних узлов. В текстовом формате выводятся только ненулевые значения. Этот параметр действует только в режиме <literal>ANALYZE</literal>. По умолчанию его значение равно <literal>FALSE</literal>.

source: Include actual startup time and time spent in each node in the output. The overhead of repeatedly reading the system clock can slow down the query significantly on some systems, so it may be useful to set this parameter to <literal>FALSE</literal> when only actual row counts, and not exact times, are needed. Run time of the entire statement is always measured, even when node-level timing is turned off with this option. This parameter may only be used when <literal>ANALYZE</literal> is also enabled. It defaults to <literal>TRUE</literal>.
ru: Включить в вывод фактическое время запуска и время, затраченное на каждый узел. Постоянное чтение системных часов может значительно замедлить запрос, так что если достаточно знать фактическое число строк, имеет смысл сделать этот параметр равным <literal>FALSE</literal>. Время выполнения всего оператора замеряется всегда, даже когда этот параметр выключен и на уровне узлов время не подсчитывается. Этот параметр действует только в режиме <literal>ANALYZE</literal>. По умолчанию его значение равно <literal>TRUE</literal>.

source: Specify the output format, which can be TEXT, XML, JSON, or YAML. Non-text output contains the same information as the text output format, but is easier for programs to parse. This parameter defaults to <literal>TEXT</literal>.
ru: Установить один из следующих форматов вывода: TEXT, XML, JSON или YAML. Последние три формата содержат ту же информацию, что и текстовый, но больше подходят для программного разбора. По умолчанию выбирается формат <literal>TEXT</literal>.

source: Specifies whether the selected option should be turned on or off. You can write <literal>TRUE</literal>, <literal>ON</literal>, or <literal>1</literal> to enable the option, and <literal>FALSE</literal>, <literal>OFF</literal>, or <literal>0</literal> to disable it. The <replaceable class="parameter">boolean</replaceable> value can also be omitted, in which case <literal>TRUE</literal> is assumed.
ru: Включает или отключает заданный параметр. Для включения параметра можно написать <literal>TRUE</literal>, <literal>ON</literal> или <literal>1</literal>, а для отключения — <literal>FALSE</literal>, <literal>OFF</literal> или <literal>0</literal>. Значение <replaceable class="parameter">boolean</replaceable> можно опустить, в этом случае подразумевается <literal>TRUE</literal>.

source: Any <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>VALUES</command>, <command>EXECUTE</command>, <command>DECLARE</command>, <command>CREATE TABLE AS</command>, or <command>CREATE MATERIALIZED VIEW AS</command> statement, whose execution plan you wish to see.
ru: Любой оператор <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>VALUES</command>, <command>EXECUTE</command>, <command>DECLARE</command>, <command>CREATE TABLE AS</command> и <command>CREATE MATERIALIZED VIEW AS</command>, план выполнения которого вас интересует.

source: Outputs
ru: Выводимая информация

source: The command's result is a textual description of the plan selected for the <replaceable class="parameter">statement</replaceable>, optionally annotated with execution statistics. <xref linkend="using-explain"/> describes the information provided.
ru: Результатом команды будет текстовое описание плана, выбранного для <replaceable class="parameter">оператора</replaceable>, возможно, дополненное статистикой выполнения. Представленная информация описана в <xref remap="6" linkend="using-explain"/>.

source: Notes
ru: Замечания

source: In order to allow the <productname>PostgreSQL</productname> query planner to make reasonably informed decisions when optimizing queries, the <link linkend="catalog-pg-statistic"><structname>pg_statistic</structname></link> data should be up-to-date for all tables used in the query. Normally the <link linkend="autovacuum">autovacuum daemon</link> will take care of that automatically. But if a table has recently had substantial changes in its contents, you might need to do a manual <xref linkend="sql-analyze"/> rather than wait for autovacuum to catch up with the changes.
ru: Чтобы планировщик запросов <productname>PostgreSQL</productname> был достаточно информирован для эффективной оптимизации запросов, данные в <link linkend="catalog-pg-statistic"><structname>pg_statistic</structname></link> должны быть актуальными для всех таблиц, задействованных в запросе. Обычно об этом автоматически заботится <link linkend="autovacuum">демон автоочистки</link>. Но если в таблице недавно произошли значительные изменения, может потребоваться вручную выполнить <xref linkend="sql-analyze"/>, не дожидаясь, пока автоочистка обработает эти изменения.

source: In order to measure the run-time cost of each node in the execution plan, the current implementation of <command>EXPLAIN ANALYZE</command> adds profiling overhead to query execution. As a result, running <command>EXPLAIN ANALYZE</command> on a query can sometimes take significantly longer than executing the query normally. The amount of overhead depends on the nature of the query, as well as the platform being used. The worst case occurs for plan nodes that in themselves require very little time per execution, and on machines that have relatively slow operating system calls for obtaining the time of day.
ru: Измеряя фактическую стоимость выполнения каждого узла в плане, текущая реализация <command>EXPLAIN ANALYZE</command> привносит накладные расходы профилирования в выполнение запроса. В результате этого, при запуске запроса командой <command>EXPLAIN ANALYZE</command> он может выполняться значительно дольше, чем при обычном выполнении. Объём накладных расходов зависит от природы запроса, а также от используемой платформы. Худшая ситуация наблюдается для узлов плана, которые сами по себе выполняются очень быстро, и в операционных системах, где получение текущего времени относительно длительная операция.

source: Examples
ru: Примеры

source: To show the plan for a simple query on a table with a single <type>integer</type> column and 10000 rows: <placeholder-1/>
ru: Получение плана простого запроса для таблицы, содержащей единственный столбец типа <type>integer</type>, с 10000 строк: <placeholder-1/>

source: Here is the same query, with JSON output formatting: <placeholder-1/>
ru: План того же запроса, но выведенный в формате JSON: <placeholder-1/>

source: If there is an index and we use a query with an indexable <literal>WHERE</literal> condition, <command>EXPLAIN</command> might show a different plan: <placeholder-1/>
ru: Если в таблице есть индекс, а в запросе присутствует условие <literal>WHERE</literal>, для которого полезен этот индекс, <command>EXPLAIN</command> может показать другой план: <placeholder-1/>

source: Here is the same query, but in YAML format: <placeholder-1/> XML format is left as an exercise for the reader.
ru: План того же запроса, но в формате YAML: <placeholder-1/> Рассмотрение формата XML оставлено в качестве упражнения для читателя.

source: Here is the same plan with cost estimates suppressed: <placeholder-1/>
ru: План того же запроса без вывода оценок стоимости: <placeholder-1/>

source: Here is an example of a query plan for a query using an aggregate function: <placeholder-1/>
ru: Пример плана для запроса с агрегатной функцией: <placeholder-1/>

source: Here is an example of using <command>EXPLAIN EXECUTE</command> to display the execution plan for a prepared query: <placeholder-1/>
ru: Пример использования <command>EXPLAIN EXECUTE</command> для отображения плана выполнения подготовленного запроса: <placeholder-1/>

source: Of course, the specific numbers shown here depend on the actual contents of the tables involved. Also note that the numbers, and even the selected query strategy, might vary between <productname>PostgreSQL</productname> releases due to planner improvements. In addition, the <command>ANALYZE</command> command uses random sampling to estimate data statistics; therefore, it is possible for cost estimates to change after a fresh run of <command>ANALYZE</command>, even if the actual distribution of data in the table has not changed.
ru: Разумеется, конкретные числа, показанные здесь, зависят от фактического содержимого задействованных таблиц. Также учтите, что эти числа и даже выбранная стратегия выполнения запроса могут меняться от версии к версии <productname>PostgreSQL</productname> вследствие усовершенствования планировщика. Кроме того, команда <command>ANALYZE</command> при обработке статистических данных производит случайные выборки, так что оценки стоимости могут меняться при каждом чистом запуске <command>ANALYZE</command>, даже когда фактическое распределение данных в таблице не меняется.

source: Compatibility
ru: Совместимость

source: There is no <command>EXPLAIN</command> statement defined in the SQL standard.
ru: Оператор <command>EXPLAIN</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
