Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/import_foreign_schema.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: import table definitions from a foreign server
ru: импортировать определения таблиц со стороннего сервера

source: remote_schema
ru: удалённая_схема

source: server_name
ru: имя_сервера

source: local_schema
ru: локальная_схема

source: option
ru: параметр

source: Description
ru: Описание

source: <command>IMPORT FOREIGN SCHEMA</command> creates foreign tables that represent tables existing on a foreign server. The new foreign tables will be owned by the user issuing the command and are created with the correct column definitions and options to match the remote tables.
ru: <command>IMPORT FOREIGN SCHEMA</command> создаёт сторонние таблицы, которые представляют таблицы, существующие на стороннем сервере. Новые сторонние таблицы будут принадлежать пользователю, выполняющему команду, и будут содержать корректные определения столбцов и параметры, соответствующие удалённым таблицам.

source: By default, all tables and views existing in a particular schema on the foreign server are imported. Optionally, the list of tables can be limited to a specified subset, or specific tables can be excluded. The new foreign tables are all created in the target schema, which must already exist.
ru: По умолчанию импортируются все таблицы и представления, существующие в определённой схеме на стороннем сервере. По желанию список таблиц можно ограничить некоторым подмножеством, или исключить из него конкретные таблицы. Новые сторонние таблицы создаются в целевой схеме, которая должна уже существовать.

source: To use <command>IMPORT FOREIGN SCHEMA</command>, the user must have <literal>USAGE</literal> privilege on the foreign server, as well as <literal>CREATE</literal> privilege on the target schema.
ru: Чтобы использовать <command>IMPORT FOREIGN SCHEMA</command>, необходимо иметь право <literal>USAGE</literal> для стороннего сервера, а также право <literal>CREATE</literal> в целевой схеме.

source: Parameters
ru: Параметры

source: The remote schema to import from. The specific meaning of a remote schema depends on the foreign data wrapper in use.
ru: Удалённая схема, из которой будут импортированы объекты. Что именно представляет собой удалённая схема, зависит от применяемой обёртки сторонних данных.

source: Import only foreign tables matching one of the given table names. Other tables existing in the foreign schema will be ignored.
ru: Импортировать только сторонние таблицы с заданными именами. Другие таблицы, существующие в сторонней схеме, будут проигнорированы.

source: Exclude specified foreign tables from the import. All tables existing in the foreign schema will be imported except the ones listed here.
ru: Исключить из импорта указанные сторонние таблицы. Данная команда импортирует все таблицы, существующие в сторонней схеме, за исключением перечисленных в этом предложении.

source: The foreign server to import from.
ru: Сторонний сервер, с которого импортируется схема.

source: The schema in which the imported foreign tables will be created.
ru: Схема, в которой будут созданы импортируемые сторонние таблицы.

source: Options to be used during the import. The allowed option names and values are specific to each foreign data wrapper.
ru: Параметры, которые должны применяться при импорте. Допустимые имена параметров и их значения зависят от обёртки сторонних данных.

source: Examples
ru: Примеры

source: Import table definitions from a remote schema <structname>foreign_films</structname> on server <structname>film_server</structname>, creating the foreign tables in local schema <structname>films</structname>: <placeholder-1/>
ru: Импорт определений таблиц из удалённой схемы <structname>foreign_films</structname> на сервере <structname>film_server</structname> с созданием сторонних таблиц в локальной схеме <structname>films</structname>: <placeholder-1/>

source: As above, but import only the two tables <structname>actors</structname> and <literal>directors</literal> (if they exist): <placeholder-1/>
ru: Та же операция, но импортируются только таблицы <structname>actors</structname> и <literal>directors</literal> (если они существуют): <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <command>IMPORT FOREIGN SCHEMA</command> command conforms to the <acronym>SQL</acronym> standard, except that the <literal>OPTIONS</literal> clause is a <productname>PostgreSQL</productname> extension.
ru: Команда <command>IMPORT FOREIGN SCHEMA</command> соответствует стандарту <acronym>SQL</acronym>, за исключением параметра <literal>OPTIONS</literal>, являющегося расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
