Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/insert.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: create new rows in a table
ru: добавить строки в таблицу

source: with_query
ru: запрос_WITH

source: table_name
ru: имя_таблицы

source: alias
ru: псевдоним

source: column_name
ru: имя_столбца

source: expression
ru: выражение

source: query
ru: запрос

source: conflict_target
ru: объект_конфликта

source: conflict_action
ru: действие_при_конфликте

source: output_expression
ru: выражение_результата

source: output_name
ru: имя_результата

source: where <placeholder-1/> can be one of:
ru: Здесь допускается <placeholder-1/>:

source: index_column_name
ru: имя_столбца_индекса

source: index_expression
ru: выражение_индекса

source: collation
ru: правило_сортировки

source: opclass
ru: класс_операторов

source: index_predicate
ru: предикат_индекса

source: constraint_name
ru: имя_ограничения

source: and <placeholder-1/> is one of:
ru: и <placeholder-1/> может быть следующим:

source: sub-SELECT
ru: вложенный_SELECT

source: condition
ru: условие

source: Description
ru: Описание

source: <command>INSERT</command> inserts new rows into a table. One can insert one or more rows specified by value expressions, or zero or more rows resulting from a query.
ru: <command>INSERT</command> добавляет строки в таблицу. Эта команда может добавить одну или несколько строк, сформированных выражениями значений, либо ноль или более строк, выданных дополнительным запросом.

source: The target column names can be listed in any order. If no list of column names is given at all, the default is all the columns of the table in their declared order; or the first <replaceable>N</replaceable> column names, if there are only <replaceable>N</replaceable> columns supplied by the <literal>VALUES</literal> clause or <replaceable>query</replaceable>. The values supplied by the <literal>VALUES</literal> clause or <replaceable>query</replaceable> are associated with the explicit or implicit column list left-to-right.
ru: Имена целевых столбцов могут перечисляться в любом порядке. Если список с именами столбцов отсутствует, по умолчанию целевыми столбцами становятся все столбцы заданной таблицы; либо первые <replaceable>N</replaceable> из них, если только <replaceable>N</replaceable> столбцов поступает от предложения <literal>VALUES</literal> или <replaceable>запроса</replaceable>. Значения, получаемые от предложения <literal>VALUES</literal> или <replaceable>запроса</replaceable>, связываются с явно или неявно определённым списком столбцов слева направо.

source: Each column not present in the explicit or implicit column list will be filled with a default value, either its declared default value or null if there is none.
ru: Все столбцы, не представленные в явном или неявном списке столбцов, получат значения по умолчанию, если для них заданы эти значения, либо NULL в противном случае.

source: If the expression for any column is not of the correct data type, automatic type conversion will be attempted.
ru: Если выражение для любого столбца выдаёт другой тип данных, система попытается автоматически привести его к нужному.

source: <literal>ON CONFLICT</literal> can be used to specify an alternative action to raising a unique constraint or exclusion constraint violation error. (See <xref linkend="sql-on-conflict" endterm="sql-on-conflict-title"/> below.)
ru: Предложение <literal>ON CONFLICT</literal> позволяет задать действие, заменяющее возникновение ошибки при нарушении ограничения уникальности или ограничения-исключения. (См. описание <xref linkend="sql-on-conflict" endterm="sql-on-conflict-title"/> ниже.)

source: The optional <literal>RETURNING</literal> clause causes <command>INSERT</command> to compute and return value(s) based on each row actually inserted (or updated, if an <literal>ON CONFLICT DO UPDATE</literal> clause was used). This is primarily useful for obtaining values that were supplied by defaults, such as a serial sequence number. However, any expression using the table's columns is allowed. The syntax of the <literal>RETURNING</literal> list is identical to that of the output list of <command>SELECT</command>. Only rows that were successfully inserted or updated will be returned. For example, if a row was locked but not updated because an <literal>ON CONFLICT DO UPDATE ... WHERE</literal> clause <replaceable class="parameter">condition</replaceable> was not satisfied, the row will not be returned.
ru: С необязательным предложением <literal>RETURNING</literal> команда <command>INSERT</command> вычислит и возвратит значения для каждой фактически добавленной строки (или изменённой, если применялось предложение <literal>ON CONFLICT DO UPDATE</literal>). В основном это полезно для получения значений, присвоенных по умолчанию, например, последовательного номера записи. Однако в этом предложении можно задать любое выражение со столбцами таблицы. Список <literal>RETURNING</literal> имеет тот же синтаксис, что и список результатов <command>SELECT</command>. В результате будут возвращены те строки, которые были успешно вставлены или изменены. Например, если строка была заблокирована, но не изменена, из-за того, что <replaceable class="parameter">условие</replaceable> в предложении <literal>ON CONFLICT DO UPDATE ... WHERE</literal> не удовлетворено, эта строка возвращена не будет.

source: You must have <literal>INSERT</literal> privilege on a table in order to insert into it. If <literal>ON CONFLICT DO UPDATE</literal> is present, <literal>UPDATE</literal> privilege on the table is also required.
ru: Чтобы добавлять строки в таблицу, необходимо иметь право <literal>INSERT</literal> для неё. Если присутствует предложение <literal>ON CONFLICT DO UPDATE</literal>, также требуется иметь право <literal>UPDATE</literal> для этой таблицы.

source: If a column list is specified, you only need <literal>INSERT</literal> privilege on the listed columns. Similarly, when <literal>ON CONFLICT DO UPDATE</literal> is specified, you only need <literal>UPDATE</literal> privilege on the column(s) that are listed to be updated. However, <literal>ON CONFLICT DO UPDATE</literal> also requires <literal>SELECT</literal> privilege on any column whose values are read in the <literal>ON CONFLICT DO UPDATE</literal> expressions or <replaceable>condition</replaceable>.
ru: Если указывается список столбцов, достаточно иметь право <literal>INSERT</literal> только для перечисленных столбцов. Аналогично, с предложением <literal>ON CONFLICT DO UPDATE</literal> достаточно иметь право <literal>UPDATE</literal> только для столбцов, которые будут изменены. Однако предложение <literal>ON CONFLICT DO UPDATE</literal> также требует наличия права <literal>SELECT</literal> для всех столбцов, значения которых считываются в выражениях <literal>ON CONFLICT DO UPDATE</literal> или в <replaceable>условии</replaceable>.

source: Use of the <literal>RETURNING</literal> clause requires <literal>SELECT</literal> privilege on all columns mentioned in <literal>RETURNING</literal>. If you use the <replaceable class="parameter">query</replaceable> clause to insert rows from a query, you of course need to have <literal>SELECT</literal> privilege on any table or column used in the query.
ru: Для применения предложения <literal>RETURNING</literal> требуется право <literal>SELECT</literal> для всех столбцов, перечисленных в <literal>RETURNING</literal>. Если для добавления строк применяется <replaceable class="parameter">запрос</replaceable>, для всех таблиц или столбцов, задействованных в этом запросе, разумеется, необходимо иметь право <literal>SELECT</literal>.

source: Parameters
ru: Параметры

source: Inserting
ru: Добавление

source: This section covers parameters that may be used when only inserting new rows. Parameters <emphasis>exclusively</emphasis> used with the <literal>ON CONFLICT</literal> clause are described separately.
ru: В этом разделе рассматриваются параметры, применяемые только при добавлении новых строк. Параметры, применяемые <emphasis>исключительно</emphasis> с предложением <literal>ON CONFLICT</literal>, описываются отдельно.

source: The <literal>WITH</literal> clause allows you to specify one or more subqueries that can be referenced by name in the <command>INSERT</command> query. See <xref linkend="queries-with"/> and <xref linkend="sql-select"/> for details.
ru: Предложение <literal>WITH</literal> позволяет задать один или несколько подзапросов, на которые затем можно ссылаться по имени в запросе <command>INSERT</command>. Подробнее об этом см. <xref remap="4" linkend="queries-with"/> и <xref remap="4" linkend="sql-select"/>.

source: It is possible for the <replaceable class="parameter">query</replaceable> (<command>SELECT</command> statement) to also contain a <literal>WITH</literal> clause. In such a case both sets of <replaceable>with_query</replaceable> can be referenced within the <replaceable class="parameter">query</replaceable>, but the second one takes precedence since it is more closely nested.
ru: Заданный <replaceable class="parameter">запрос</replaceable> (оператор <command>SELECT</command>) также может содержать предложение <literal>WITH</literal>. В этом случае в <replaceable class="parameter">запросе</replaceable> можно обращаться к обоим <replaceable>запросам_WITH</replaceable>, но второй будет иметь приоритет, так как он вложен ближе.

source: The name (optionally schema-qualified) of an existing table.
ru: Имя (возможно, дополненное схемой) существующей таблицы.

source: A substitute name for <replaceable class="parameter">table_name</replaceable>. When an alias is provided, it completely hides the actual name of the table. This is particularly useful when <literal>ON CONFLICT DO UPDATE</literal> targets a table named excluded, since that's also the name of the special table representing rows proposed for insertion.
ru: Альтернативное имя, заменяющее <replaceable class="parameter">имя_таблицы</replaceable>. Когда указывается это имя, оно полностью скрывает реальное имя таблицы. Это особенно полезно, когда в предложении <literal>ON CONFLICT DO UPDATE</literal> фигурирует таблица с именем excluded, так как это имя дано и специальной таблице, представляющей строки, предназначенные для добавления.

source: The name of a column in the table named by <replaceable class="parameter">table_name</replaceable>. The column name can be qualified with a subfield name or array subscript, if needed. (Inserting into only some fields of a composite column leaves the other fields null.) When referencing a column with <literal>ON CONFLICT DO UPDATE</literal>, do not include the table's name in the specification of a target column. For example, <literal>INSERT INTO table_name ... ON CONFLICT DO UPDATE SET table_name.col = 1</literal> is invalid (this follows the general behavior for <command>UPDATE</command>).
ru: Имя столбца в таблице <replaceable class="parameter">имя_таблицы</replaceable>. Это имя столбца при необходимости может быть дополнено именем вложенного поля или индексом в массиве. (Когда данные вставляются только в некоторые поля столбца составного типа, в другие поля записывается NULL.) Обращаясь к столбцу в предложении <literal>ON CONFLICT DO UPDATE</literal>, включать имя таблицы в ссылку на целевой столбец не нужно. Например, запись <literal>INSERT INTO table_name ... ON CONFLICT DO UPDATE SET table_name.col = 1</literal> некорректна (это согласуется с общим поведением команды <command>UPDATE</command>).

source: All columns will be filled with their default values.
ru: Все столбцы получат значения по умолчанию.

source: An expression or value to assign to the corresponding column.
ru: Выражение или значение, которое будет присвоено соответствующему столбцу.

source: The corresponding column will be filled with its default value.
ru: Соответствующий столбец получит значение по умолчанию.

source: A query (<command>SELECT</command> statement) that supplies the rows to be inserted. Refer to the <xref linkend="sql-select"/> statement for a description of the syntax.
ru: Запрос (оператор <command>SELECT</command>), который выдаст строки для добавления в таблицу. Его синтаксис описан в справке оператора <xref linkend="sql-select"/>.

source: An expression to be computed and returned by the <command>INSERT</command> command after each row is inserted or updated. The expression can use any column names of the table named by <replaceable class="parameter">table_name</replaceable>. Write <literal>*</literal> to return all columns of the inserted or updated row(s).
ru: Выражение, которое будет вычисляться и возвращаться командой <command>INSERT</command> после добавления или изменения каждой строки. В этом выражении можно использовать имена любых столбцов таблицы <replaceable class="parameter">имя_таблицы</replaceable>. Чтобы получить все столбцы, достаточно написать <literal>*</literal>.

source: A name to use for a returned column.
ru: Имя, назначаемое возвращаемому столбцу.

source: <literal>ON CONFLICT</literal> Clause
ru: Предложение <literal>ON CONFLICT</literal>

source: The optional <literal>ON CONFLICT</literal> clause specifies an alternative action to raising a unique violation or exclusion constraint violation error. For each individual row proposed for insertion, either the insertion proceeds, or, if an <emphasis>arbiter</emphasis> constraint or index specified by <parameter>conflict_target</parameter> is violated, the alternative <parameter>conflict_action</parameter> is taken. <literal>ON CONFLICT DO NOTHING</literal> simply avoids inserting a row as its alternative action. <literal>ON CONFLICT DO UPDATE</literal> updates the existing row that conflicts with the row proposed for insertion as its alternative action.
ru: Необязательное предложение <literal>ON CONFLICT</literal> задаёт действие, заменяющее возникновение ошибки при нарушении ограничения уникальности или ограничения-исключения. Для каждой отдельной строки, предложенной для добавления, добавление либо выполняется успешно, либо, если нарушается <emphasis>решающее</emphasis> ограничение или индекс, задаваемые как <parameter>объект_конфликта</parameter>, выполняется альтернативное <parameter>действие_конфликта</parameter>. Вариант <literal>ON CONFLICT DO NOTHING</literal> в качестве альтернативного действия просто отменяет добавление строки. Вариант <literal>ON CONFLICT DO UPDATE</literal> изменяет существующую строку, вызвавшую конфликт со строкой, предложенной для добавления.

source: <parameter>conflict_target</parameter> can perform <emphasis>unique index inference</emphasis>. When performing inference, it consists of one or more <replaceable class="parameter">index_column_name</replaceable> columns and/or <replaceable class="parameter">index_expression</replaceable> expressions, and an optional <replaceable class="parameter">index_predicate</replaceable>. All <replaceable class="parameter">table_name</replaceable> unique indexes that, without regard to order, contain exactly the <parameter>conflict_target</parameter>-specified columns/expressions are inferred (chosen) as arbiter indexes. If an <replaceable class="parameter">index_predicate</replaceable> is specified, it must, as a further requirement for inference, satisfy arbiter indexes. Note that this means a non-partial unique index (a unique index without a predicate) will be inferred (and thus used by <literal>ON CONFLICT</literal>) if such an index satisfying every other criteria is available. If an attempt at inference is unsuccessful, an error is raised.
ru: Задаваемый <parameter>объект_конфликта</parameter> может <emphasis>выбирать уникальный индекс</emphasis>. Определение объекта, позволяющее выбрать индекс, включает один или несколько столбцов (их определяет <replaceable class="parameter">имя_столбца_индекса</replaceable>) и/или <replaceable class="parameter">выражение_индекса</replaceable> и необязательный <replaceable class="parameter">предикат_индекса</replaceable>. Все уникальные индексы в таблице <replaceable class="parameter">имя_таблицы</replaceable>, которые, без учёта порядка столбцов, содержат в точности столбцы/выражения, определяющие <parameter>объект_конфликта</parameter>, выбираются как решающие индексы. Если указывается <replaceable class="parameter">предикат_индекса</replaceable>, он должен, в качестве дополнительного требования выбора, удовлетворять индексам. Заметьте, что это означает, что не частичный уникальный индекс (уникальный индекс без предиката) будет выбран (и будет использоваться в <literal>ON CONFLICT</literal>), если такой индекс удовлетворяет всем остальным критериям. Если попытка выбрать индекс оказывается неудачной, выдаётся ошибка.

source: <literal>ON CONFLICT DO UPDATE</literal> guarantees an atomic <command>INSERT</command> or <command>UPDATE</command> outcome; provided there is no independent error, one of those two outcomes is guaranteed, even under high concurrency. This is also known as <firstterm>UPSERT</firstterm> &mdash; <quote>UPDATE or INSERT</quote>.
ru: <literal>ON CONFLICT DO UPDATE</literal> гарантирует атомарный результат команды <command>INSERT</command> или <command>UPDATE</command>; при отсутствии внешних ошибок гарантируется один из двух этих исходов, даже при большой параллельной активности. Эта операция также известна как <firstterm>UPSERT</firstterm> &mdash; <quote>UPDATE или INSERT</quote>.

source: Specifies which conflicts <literal>ON CONFLICT</literal> takes the alternative action on by choosing <firstterm>arbiter indexes</firstterm>. Either performs <emphasis>unique index inference</emphasis>, or names a constraint explicitly. For <literal>ON CONFLICT DO NOTHING</literal>, it is optional to specify a <parameter>conflict_target</parameter>; when omitted, conflicts with all usable constraints (and unique indexes) are handled. For <literal>ON CONFLICT DO UPDATE</literal>, a <parameter>conflict_target</parameter> <emphasis>must</emphasis> be provided.
ru: Определяет, для какого именно конфликта в <literal>ON CONFLICT</literal> будет предпринято альтернативное действие, устанавливая <firstterm>решающие индексы</firstterm>. Это указание позволяет осуществить <emphasis>выбор уникального индекса</emphasis> или явно задаёт имя ограничения. Для <literal>ON CONFLICT DO NOTHING</literal> <parameter>объект_конфликта</parameter> может не указываться; в этом случае игнорироваться будут все конфликты с любыми ограничениями (и уникальными индексами). Для <literal>ON CONFLICT DO UPDATE</literal> <parameter>объект_конфликта</parameter> <emphasis>должен</emphasis> указываться.

source: <parameter>conflict_action</parameter> specifies an alternative <literal>ON CONFLICT</literal> action. It can be either <literal>DO NOTHING</literal>, or a <literal>DO UPDATE</literal> clause specifying the exact details of the <literal>UPDATE</literal> action to be performed in case of a conflict. The <literal>SET</literal> and <literal>WHERE</literal> clauses in <literal>ON CONFLICT DO UPDATE</literal> have access to the existing row using the table's name (or an alias), and to rows proposed for insertion using the special <varname>excluded</varname> table. <literal>SELECT</literal> privilege is required on any column in the target table where corresponding <varname>excluded</varname> columns are read.
ru: Параметр <parameter>действие_при_конфликте</parameter> задаёт альтернативное действие в случае конфликта. Это может быть либо <literal>DO NOTHING</literal> (не делать ничего), либо предложение <literal>DO UPDATE</literal> (произвести изменение), в котором указываются точные детали операции <literal>UPDATE</literal>, выполняемой в случае конфликта. Предложения <literal>SET</literal> и <literal>WHERE</literal> в <literal>ON CONFLICT DO UPDATE</literal> могут обращаться к существующей строке по имени таблицы (или псевдониму) или к строкам, предлагаемым для добавления, используя специальную таблицу <varname>excluded</varname>. Для чтения столбцов <varname>excluded</varname> необходимо иметь право <literal>SELECT</literal> для соответствующих столбцов в целевой таблице.

source: Note that the effects of all per-row <literal>BEFORE INSERT</literal> triggers are reflected in <varname>excluded</varname> values, since those effects may have contributed to the row being excluded from insertion.
ru: Заметьте, что эффект действий всех триггеров уровня строк <literal>BEFORE INSERT</literal> отражается в значениях <varname>excluded</varname>, так как в результате этих действий строка может быть исключена из множества добавляемых.

source: The name of a <replaceable class="parameter">table_name</replaceable> column. Used to infer arbiter indexes. Follows <command>CREATE INDEX</command> format. <literal>SELECT</literal> privilege on <replaceable class="parameter">index_column_name</replaceable> is required.
ru: Имя столбца в таблице <replaceable class="parameter">имя_таблицы</replaceable>. Используется для выбора решающих индексов. Задаётся в формате <command>CREATE INDEX</command>. Чтобы запрос выполнился, для столбца <replaceable class="parameter">имя_столбца_индекса</replaceable> требуется право <literal>SELECT</literal>.

source: Similar to <replaceable class="parameter">index_column_name</replaceable>, but used to infer expressions on <replaceable class="parameter">table_name</replaceable> columns appearing within index definitions (not simple columns). Follows <command>CREATE INDEX</command> format. <literal>SELECT</literal> privilege on any column appearing within <replaceable class="parameter">index_expression</replaceable> is required.
ru: Подобно указанию <replaceable class="parameter">имя_столбца_индекса</replaceable>, но применяется для выбора индекса по выражениям со столбцами таблицы <replaceable class="parameter">имя_таблицы</replaceable>, фигурирующим в определениях индексов (не по простым столбцам). Задаётся в формате <command>CREATE INDEX</command>. Для всех столбцов, к которым обращается <replaceable class="parameter">выражение_индекса</replaceable>, необходимо иметь право <literal>SELECT</literal>.

source: When specified, mandates that corresponding <replaceable class="parameter">index_column_name</replaceable> or <replaceable class="parameter">index_expression</replaceable> use a particular collation in order to be matched during inference. Typically this is omitted, as collations usually do not affect whether or not a constraint violation occurs. Follows <command>CREATE INDEX</command> format.
ru: Когда задаётся, устанавливает, что соответствующие <replaceable class="parameter">имя_столбца_индекса</replaceable> или <replaceable class="parameter">выражение_индекса</replaceable> должны использовать определённый порядок сортировки, чтобы этот индекс мог быть выбран. Обычно это указание опускается, так как от правил сортировки чаще всего не зависит, произойдёт ли нарушение ограничений или нет. Задаётся в формате <command>CREATE INDEX</command>.
