Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/insert.po
Languages: ru

source: When specified, mandates that corresponding <replaceable class="parameter">index_column_name</replaceable> or <replaceable class="parameter">index_expression</replaceable> use particular operator class in order to be matched during inference. Typically this is omitted, as the <emphasis>equality</emphasis> semantics are often equivalent across a type's operator classes anyway, or because it's sufficient to trust that the defined unique indexes have the pertinent definition of equality. Follows <command>CREATE INDEX</command> format.
ru: Когда задаётся, устанавливает, что соответствующие <replaceable class="parameter">имя_столбца_индекса</replaceable> или <replaceable class="parameter">выражение_индекса</replaceable> должны использовать определённый класс, чтобы индекс мог быть выбран. Обычно это указание опускается, потому что семантика <emphasis>равенства</emphasis> часто всё равно одна и та же в разных классах операторов типа, или потому что достаточно рассчитывать на то, что заданные уникальные индексы имеют адекватное определение равенства. Задаётся в формате <command>CREATE INDEX</command>.

source: Used to allow inference of partial unique indexes. Any indexes that satisfy the predicate (which need not actually be partial indexes) can be inferred. Follows <command>CREATE INDEX</command> format. <literal>SELECT</literal> privilege on any column appearing within <replaceable class="parameter">index_predicate</replaceable> is required.
ru: Используется для выбора частичных уникальных индексов. Выбраны могут быть любые индексы, удовлетворяющие предикату (при этом они могут не быть собственно частичными индексами). Задаётся в формате <command>CREATE INDEX</command>. Для всех столбцов, задействованных в <replaceable class="parameter">предикате_индекса</replaceable>, требуется право <literal>SELECT</literal>.

source: Explicitly specifies an arbiter <emphasis>constraint</emphasis> by name, rather than inferring a constraint or index.
ru: Явно задаёт решающее <emphasis>ограничение</emphasis> по имени, что заменяет неявный выбор ограничения или индекса.

source: An expression that returns a value of type <type>boolean</type>. Only rows for which this expression returns <literal>true</literal> will be updated, although all rows will be locked when the <literal>ON CONFLICT DO UPDATE</literal> action is taken. Note that <replaceable>condition</replaceable> is evaluated last, after a conflict has been identified as a candidate to update.
ru: Выражение, выдающее значение типа <type>boolean</type>. Изменены будут только те строки, для которых это выражение выдаст <literal>true</literal>, хотя при выборе действия <literal>ON CONFLICT DO UPDATE</literal> заблокируются все строки. Заметьте, что <replaceable>условие</replaceable> вычисляется в конце, после того как конфликт был признан претендующим на выполнение изменения.

source: Note that exclusion constraints are not supported as arbiters with <literal>ON CONFLICT DO UPDATE</literal>. In all cases, only <literal>NOT DEFERRABLE</literal> constraints and unique indexes are supported as arbiters.
ru: Заметьте, что ограничения-исключения не могут быть решающими в <literal>ON CONFLICT DO UPDATE</literal>. Во всех случаях в качестве решающих поддерживаются только неоткладываемые (<literal>NOT DEFERRABLE</literal>) ограничения и уникальные индексы.

source: <command>INSERT</command> with an <literal>ON CONFLICT DO UPDATE</literal> clause is a <quote>deterministic</quote> statement. This means that the command will not be allowed to affect any single existing row more than once; a cardinality violation error will be raised when this situation arises. Rows proposed for insertion should not duplicate each other in terms of attributes constrained by an arbiter index or constraint.
ru: Команда <command>INSERT</command> с предложением <literal>ON CONFLICT DO UPDATE</literal> является <quote>детерминированной</quote>. Это означает, что этой команде не разрешено воздействовать на любую существующую строку больше одного раза; в случае такой ситуации возникнет ошибка нарушения мощности множества. Строки, предлагаемые для добавления, не должны дублироваться с точки зрения атрибутов, ограничиваемых решающим индексом или ограничением.

source: It is often preferable to use unique index inference rather than naming a constraint directly using <literal>ON CONFLICT ON CONSTRAINT</literal> <replaceable class="parameter"> constraint_name</replaceable>. Inference will continue to work correctly when the underlying index is replaced by another more or less equivalent index in an overlapping way, for example when using <literal>CREATE UNIQUE INDEX ... CONCURRENTLY</literal> before dropping the index being replaced.
ru: Часто предпочтительнее использовать неявный выбор уникального индекса вместо непосредственного указания ограничения в виде <literal>ON CONFLICT ON CONSTRAINT</literal> <replaceable class="parameter">имя_ограничения</replaceable>. Выбор продолжит корректно работать, когда нижележащий индекс будет заменён другим более или менее равнозначным индексом методом наложения, например, с использованием <literal>CREATE UNIQUE INDEX ... CONCURRENTLY</literal> и последующим удалением заменяемого индекса.

source: Outputs
ru: Выводимая информация

source: On successful completion, an <command>INSERT</command> command returns a command tag of the form <screen>INSERT <replaceable>oid</replaceable> <replaceable class="parameter">count</replaceable></screen> The <replaceable class="parameter">count</replaceable> is the number of rows inserted or updated. If <replaceable class="parameter">count</replaceable> is exactly one, and the target table has OIDs, then <replaceable class="parameter">oid</replaceable> is the <acronym>OID</acronym> assigned to the inserted row. The single row must have been inserted rather than updated. Otherwise <replaceable class="parameter">oid</replaceable> is zero.
ru: В случае успешного завершения, <command>INSERT</command> возвращает метку команды в виде <screen>INSERT <replaceable>oid</replaceable> <replaceable class="parameter">число</replaceable></screen> Здесь <replaceable class="parameter">число</replaceable> представляет количество добавленных или изменённых строк. Если <replaceable class="parameter">число</replaceable> равняется одному, а целевая таблица содержит oid, то в качестве <replaceable class="parameter">oid</replaceable> выводится <acronym>OID</acronym>, назначенный добавленной строке. Эта одна строка должна быть добавлена, но не изменена. В противном случае в качестве <replaceable class="parameter">oid</replaceable> выводится ноль.

source: If the <command>INSERT</command> command contains a <literal>RETURNING</literal> clause, the result will be similar to that of a <command>SELECT</command> statement containing the columns and values defined in the <literal>RETURNING</literal> list, computed over the row(s) inserted or updated by the command.
ru: Если команда <command>INSERT</command> содержит предложение <literal>RETURNING</literal>, её результат будет похож на результат оператора <command>SELECT</command> (с теми же столбцами и значениями, что содержатся в списке <literal>RETURNING</literal>), полученный для строк, добавленных или изменённых этой командой.

source: Examples
ru: Примеры

source: Insert a single row into table <literal>films</literal>: <placeholder-1/>
ru: Добавление одной строки в таблицу <literal>films</literal>: <placeholder-1/>

source: In this example, the <literal>len</literal> column is omitted and therefore it will have the default value: <placeholder-1/>
ru: В этом примере столбец <literal>len</literal> опускается и, таким образом, получает значение по умолчанию: <placeholder-1/>

source: This example uses the <literal>DEFAULT</literal> clause for the date columns rather than specifying a value: <placeholder-1/>
ru: В этом примере для столбца с датой задаётся указание <literal>DEFAULT</literal>, а не явное значение: <placeholder-1/>

source: To insert a row consisting entirely of default values: <placeholder-1/>
ru: Добавление строки, полностью состоящей из значений по умолчанию: <placeholder-1/>

source: To insert multiple rows using the multirow <command>VALUES</command> syntax: <placeholder-1/>
ru: Добавление нескольких строк с использованием многострочного синтаксиса <command>VALUES</command>: <placeholder-1/>

source: This example inserts some rows into table <literal>films</literal> from a table <literal>tmp_films</literal> with the same column layout as <literal>films</literal>: <placeholder-1/>
ru: В этом примере в таблицу <literal>films</literal> вставляются некоторые строки из таблицы <literal>tmp_films</literal>, имеющей ту же структуру столбцов, что и <literal>films</literal>: <placeholder-1/>

source: -- Create an empty 3x3 gameboard for noughts-and-crosses INSERT INTO tictactoe (game, board[1:3][1:3]) VALUES (1, '{{" "," "," "},{" "," "," "},{" "," "," "}}'); -- The subscripts in the above example aren't really needed INSERT INTO tictactoe (game, board) VALUES (2, '{{X," "," "},{" ",O," "},{" ",X," "}}');
ru: -- Создание пустого поля 3x3 для игры в крестики-нолики INSERT INTO tictactoe (game, board[1:3][1:3]) VALUES (1, '{{" "," "," "},{" "," "," "},{" "," "," "}}'); -- Указания индексов в предыдущей команда могут быть опущены INSERT INTO tictactoe (game, board) VALUES (2, '{{X," "," "},{" ",O," "},{" ",X," "}}');

source: This example inserts into array columns: <placeholder-1/>
ru: Этот пример демонстрирует добавление данных в столбцы с типом массива: <placeholder-1/>

source: Insert a single row into table <literal>distributors</literal>, returning the sequence number generated by the <literal>DEFAULT</literal> clause: <placeholder-1/>
ru: Добавление одной строки в таблицу <literal>distributors</literal> и получение последовательного номера, сгенерированного благодаря указанию <literal>DEFAULT</literal>: <placeholder-1/>

source: Increment the sales count of the salesperson who manages the account for Acme Corporation, and record the whole updated row along with current time in a log table: <placeholder-1/>
ru: Увеличение счётчика продаж для продавца, занимающегося компанией Acme Corporation, и сохранение всей изменённой строки вместе с текущим временем в таблице журнала: <placeholder-1/>

source: Insert or update new distributors as appropriate. Assumes a unique index has been defined that constrains values appearing in the <literal>did</literal> column. Note that the special <varname>excluded</varname> table is used to reference values originally proposed for insertion: <placeholder-1/>
ru: Добавить дистрибьюторов или изменить существующие данные должным образом. Предполагается, что в таблице определён уникальный индекс, ограничивающий значения в столбце <literal>did</literal>. Заметьте, что для обращения к значениям, изначально предлагаемым для добавления, используется специальная таблица <varname>excluded</varname>: <placeholder-1/>

source: Insert a distributor, or do nothing for rows proposed for insertion when an existing, excluded row (a row with a matching constrained column or columns after before row insert triggers fire) exists. Example assumes a unique index has been defined that constrains values appearing in the <literal>did</literal> column: <placeholder-1/>
ru: Добавить дистрибьютора или не делать ничего для строк, предложенных для добавления, если уже есть существующая исключающая строка (строка, содержащая конфликтующие значения в столбце или столбцах после срабатывания триггеров перед добавлением строки). В данном примере предполагается, что определён уникальный индекс, ограничивающий значения в столбце <literal>did</literal>: <placeholder-1/>

source: -- Don't update existing distributors based in a certain ZIP code INSERT INTO distributors AS d (did, dname) VALUES (8, 'Anvil Distribution') ON CONFLICT (did) DO UPDATE SET dname = EXCLUDED.dname || ' (formerly ' || d.dname || ')' WHERE d.zipcode &lt;&gt; '21201'; -- Name a constraint directly in the statement (uses associated -- index to arbitrate taking the DO NOTHING action) INSERT INTO distributors (did, dname) VALUES (9, 'Antwerp Design') ON CONFLICT ON CONSTRAINT distributors_pkey DO NOTHING;
ru: -- Не менять данные существующих дистрибьюторов в зависимости от почтового индекса INSERT INTO distributors AS d (did, dname) VALUES (8, 'Anvil Distribution') ON CONFLICT (did) DO UPDATE SET dname = EXCLUDED.dname || ' (formerly ' || d.dname || ')' WHERE d.zipcode &lt;&gt; '21201'; -- Указать имя ограничения непосредственно в операторе (связанный индекс -- применяется для принятия решения о выполнении действия DO NOTHING) INSERT INTO distributors (did, dname) VALUES (9, 'Antwerp Design') ON CONFLICT ON CONSTRAINT distributors_pkey DO NOTHING;

source: Insert or update new distributors as appropriate. Example assumes a unique index has been defined that constrains values appearing in the <literal>did</literal> column. <literal>WHERE</literal> clause is used to limit the rows actually updated (any existing row not updated will still be locked, though): <placeholder-1/>
ru: Добавить дистрибьюторов или изменить существующие данные должным образом. В данном примере предполагается, что в таблице определён уникальный индекс, ограничивающий значения в столбце <literal>did</literal>. Предложение <literal>WHERE</literal> позволяет ограничить набор фактически изменяемых строк (однако любая существующая строка, не подлежащая изменению, всё же будет заблокирована): <placeholder-1/>

source: -- This statement could infer a partial unique index on "did" -- with a predicate of "WHERE is_active", but it could also -- just use a regular unique constraint on "did" INSERT INTO distributors (did, dname) VALUES (10, 'Conrad International') ON CONFLICT (did) WHERE is_active DO NOTHING;
ru: -- Этот оператор может выбрать частичный уникальный индекс по "did" -- с предикатом "WHERE is_active", а может и просто использовать -- обычное ограничение уникальности по столбцу "did" INSERT INTO distributors (did, dname) VALUES (10, 'Conrad International') ON CONFLICT (did) WHERE is_active DO NOTHING;

source: Insert new distributor if possible; otherwise <literal>DO NOTHING</literal>. Example assumes a unique index has been defined that constrains values appearing in the <literal>did</literal> column on a subset of rows where the <literal>is_active</literal> Boolean column evaluates to <literal>true</literal>: <placeholder-1/>
ru: Добавить дистрибьютора, если возможно; в противном случае не делать ничего (<literal>DO NOTHING</literal>). В данном примере предполагается, что в таблице определён уникальный индекс, ограничивающий значения в столбце <literal>did</literal> по подмножеству строк, в котором булевский столбец <literal>is_active</literal> содержит <literal>true</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>INSERT</command> conforms to the SQL standard, except that the <literal>RETURNING</literal> clause is a <productname>PostgreSQL</productname> extension, as is the ability to use <literal>WITH</literal> with <command>INSERT</command>, and the ability to specify an alternative action with <literal>ON CONFLICT</literal>. Also, the case in which a column name list is omitted, but not all the columns are filled from the <literal>VALUES</literal> clause or <replaceable>query</replaceable>, is disallowed by the standard.
ru: <command>INSERT</command> соответствует стандарту SQL, но предложение <literal>RETURNING</literal> относится к расширениям <productname>PostgreSQL</productname>, как и возможность применять <literal>WITH</literal> с <command>INSERT</command> и возможность задавать альтернативное действие с <literal>ON CONFLICT</literal>. Кроме того, ситуация, когда список столбцов опущен, но не все столбцы получают значения из предложения <literal>VALUES</literal> или <replaceable>запроса</replaceable>, стандартом не допускается.

source: Possible limitations of the <replaceable class="parameter">query</replaceable> clause are documented under <xref linkend="sql-select"/>.
ru: Возможные ограничения предложения <replaceable class="parameter">запрос</replaceable> описаны в справке <xref linkend="sql-select"/>.
