Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/lock.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: lock a table
ru: заблокировать таблицу

source: lockmode
ru: режим_блокировки

source: where <placeholder-1/> is one of:
ru: Где возможные варианты <placeholder-1/>:

source: Description
ru: Описание

source: <command>LOCK TABLE</command> obtains a table-level lock, waiting if necessary for any conflicting locks to be released. If <literal>NOWAIT</literal> is specified, <command>LOCK TABLE</command> does not wait to acquire the desired lock: if it cannot be acquired immediately, the command is aborted and an error is emitted. Once obtained, the lock is held for the remainder of the current transaction. (There is no <command>UNLOCK TABLE</command> command; locks are always released at transaction end.)
ru: <command>LOCK TABLE</command> получает блокировку на уровне таблицы, при необходимости ожидая освобождения таблицы от других конфликтующих блокировок. Если указано <literal>NOWAIT</literal>, <command>LOCK TABLE</command> не ждёт, пока таблица освободится: если блокировку нельзя получить немедленно, команда прерывается и выдаётся ошибка. Как только блокировка получена, она удерживается до завершения текущей транзакции. (Команды <command>UNLOCK TABLE</command> не существует; блокировки всегда освобождаются в конце транзакции.)

source: When acquiring locks automatically for commands that reference tables, <productname>PostgreSQL</productname> always uses the least restrictive lock mode possible. <command>LOCK TABLE</command> provides for cases when you might need more restrictive locking. For example, suppose an application runs a transaction at the <literal>READ COMMITTED</literal> isolation level and needs to ensure that data in a table remains stable for the duration of the transaction. To achieve this you could obtain <literal>SHARE</literal> lock mode over the table before querying. This will prevent concurrent data changes and ensure subsequent reads of the table see a stable view of committed data, because <literal>SHARE</literal> lock mode conflicts with the <literal>ROW EXCLUSIVE</literal> lock acquired by writers, and your <command>LOCK TABLE <replaceable class="parameter">name</replaceable> IN SHARE MODE</command> statement will wait until any concurrent holders of <literal>ROW EXCLUSIVE</literal> mode locks commit or roll back. Thus, once you obtain the lock, there are no uncommitted writes outstanding; furthermore none can begin until you release the lock.
ru: Запрашивая автоматические блокировки для команд, работающих с таблицами, <productname>PostgreSQL</productname> всегда выбирает наименее ограничивающий режим блокировки из возможных. Оператор <command>LOCK TABLE</command> предназначен для случаев, когда требуется более сильная блокировка. Например, предположим, что приложение выполняет транзакцию на уровне изоляции <literal>READ COMMITTED</literal> и оно должно получать неизменные данные на протяжении всей транзакции. Для достижения этой цели можно получить для таблицы блокировку в режиме <literal>SHARE</literal>, прежде чем обращаться к ней. В результате параллельные изменения данных будут исключены и при последующих чтениях будет получено стабильное представление зафиксированных данных, так как режим блокировки <literal>SHARE</literal> конфликтует с блокировкой <literal>ROW EXCLUSIVE</literal>, запрашиваемой при записи, а <command>LOCK TABLE <replaceable class="parameter">имя</replaceable> IN SHARE MODE</command> будет ждать, пока параллельные транзакции с блокировкой <literal>ROW EXCLUSIVE</literal> не будут зафиксированы или отменены. Таким образом, в момент получения такой блокировки не останется ни одной открытой незафиксированной операции записи; кроме того, никто не сможет записывать в таблицу, пока блокировка не будет снята.

source: To achieve a similar effect when running a transaction at the <literal>REPEATABLE READ</literal> or <literal>SERIALIZABLE</literal> isolation level, you have to execute the <command>LOCK TABLE</command> statement before executing any <command>SELECT</command> or data modification statement. A <literal>REPEATABLE READ</literal> or <literal>SERIALIZABLE</literal> transaction's view of data will be frozen when its first <command>SELECT</command> or data modification statement begins. A <command>LOCK TABLE</command> later in the transaction will still prevent concurrent writes &mdash; but it won't ensure that what the transaction reads corresponds to the latest committed values.
ru: Чтобы получить похожий эффект в транзакции на уровне изоляции <literal>REPEATABLE READ</literal> или <literal>SERIALIZABLE</literal>, необходимо выполнить оператор <command>LOCK TABLE</command> перед первым <command>SELECT</command> или оператором, изменяющим данные. Представление данных для транзакции уровня <literal>REPEATABLE READ</literal> или <literal>SERIALIZABLE</literal> будет заморожено в момент, когда начнёт выполняться этот запрос. Если команда <command>LOCK TABLE</command> выполняется в транзакции позже, она так же исключает параллельную запись, но не даёт гарантии, что транзакция будет читать последние зафиксированные данные.

source: If a transaction of this sort is going to change the data in the table, then it should use <literal>SHARE ROW EXCLUSIVE</literal> lock mode instead of <literal>SHARE</literal> mode. This ensures that only one transaction of this type runs at a time. Without this, a deadlock is possible: two transactions might both acquire <literal>SHARE</literal> mode, and then be unable to also acquire <literal>ROW EXCLUSIVE</literal> mode to actually perform their updates. (Note that a transaction's own locks never conflict, so a transaction can acquire <literal>ROW EXCLUSIVE</literal> mode when it holds <literal>SHARE</literal> mode &mdash; but not if anyone else holds <literal>SHARE</literal> mode.) To avoid deadlocks, make sure all transactions acquire locks on the same objects in the same order, and if multiple lock modes are involved for a single object, then transactions should always acquire the most restrictive mode first.
ru: Если в транзакции такого рода требуется изменять данные в таблице, для неё следует использовать режим блокировки <literal>SHARE ROW EXCLUSIVE</literal> вместо <literal>SHARE</literal>. Этот режим гарантирует, что в один момент времени будет выполняться только одна транзакция такого типа. Без этого ограничения возможна взаимоблокировка: две транзакции могут одновременно получить блокировки <literal>SHARE</literal>, после чего они не смогут получить блокировку <literal>ROW EXCLUSIVE</literal>, чтобы собственно выполнить изменения. (Заметьте, что собственные блокировки транзакции никогда не конфликтуют, так что транзакция может получить блокировку <literal>ROW EXCLUSIVE</literal>, когда она владеет блокировкой <literal>SHARE</literal> &mdash; но не тогда, когда блокировку <literal>SHARE</literal> удерживает другая транзакция.) Чтобы не допустить взаимоблокировок, убедитесь, что все транзакции запрашивают блокировки одних объектов в одинаковом порядке, и если для одного объекта запрашиваются блокировки в разных режимах, транзакции всегда должны запрашивать самую строгую блокировку.

source: More information about the lock modes and locking strategies can be found in <xref linkend="explicit-locking"/>.
ru: Дополнительно о режимах и стратегиях блокировки можно узнать в <xref remap="6" linkend="explicit-locking"/>.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing table to lock. If <literal>ONLY</literal> is specified before the table name, only that table is locked. If <literal>ONLY</literal> is not specified, the table and all its descendant tables (if any) are locked. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Имя (возможно, дополненное схемой) существующей таблицы, для которой запрашивается блокировка. Если перед именем таблицы указано <literal>ONLY</literal>, блокируется только заданная таблица. Без <literal>ONLY</literal> блокируется и заданная таблица, и все её потомки (если таковые есть). После имени таблицы можно также добавить необязательное указание <literal>*</literal>, чтобы явно обозначить, что блокировка затрагивает и все дочерние таблицы.

source: The command <literal>LOCK TABLE a, b;</literal> is equivalent to <literal>LOCK TABLE a; LOCK TABLE b;</literal>. The tables are locked one-by-one in the order specified in the <command>LOCK TABLE</command> command.
ru: Команда <literal>LOCK TABLE a, b;</literal> равнозначна последовательности <literal>LOCK TABLE a; LOCK TABLE b;</literal>. Таблицы блокируются по одной в порядке, заданном в команде <command>LOCK TABLE</command>.

source: The lock mode specifies which locks this lock conflicts with. Lock modes are described in <xref linkend="explicit-locking"/>.
ru: Режим блокировки определяет, с какой блокировкой будет конфликтовать данная. Режимы блокировок описаны в <xref remap="6" linkend="explicit-locking"/>.

source: If no lock mode is specified, then <literal>ACCESS EXCLUSIVE</literal>, the most restrictive mode, is used.
ru: Если режим блокировки не указан, применяется самый строгий режим, <literal>ACCESS EXCLUSIVE</literal>.

source: Specifies that <command>LOCK TABLE</command> should not wait for any conflicting locks to be released: if the specified lock(s) cannot be acquired immediately without waiting, the transaction is aborted.
ru: Указывает, что <command>LOCK TABLE</command> не должна ожидать освобождения конфликтующих блокировок: если запрошенная блокировка не может быть получена немедленно, транзакция прерывается.

source: <literal>LOCK TABLE ... IN ACCESS SHARE MODE</literal> requires <literal>SELECT</literal> privileges on the target table. <literal>LOCK TABLE ... IN ROW EXCLUSIVE MODE</literal> requires <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, or <literal>TRUNCATE</literal> privileges on the target table. All other forms of <command>LOCK</command> require table-level <literal>UPDATE</literal>, <literal>DELETE</literal>, or <literal>TRUNCATE</literal> privileges.
ru: <literal>LOCK TABLE ... IN ACCESS SHARE MODE</literal> требует наличия права <literal>SELECT</literal> в целевой таблице. <literal>LOCK TABLE ... IN ROW EXCLUSIVE MODE</literal> требует наличия прав <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> или <literal>TRUNCATE</literal> для целевой таблицы. Все другие формы <command>LOCK</command> требуют наличия права <literal>UPDATE</literal>, <literal>DELETE</literal> или <literal>TRUNCATE</literal> на уровне таблицы.

source: <command>LOCK TABLE</command> is useless outside a transaction block: the lock would remain held only to the completion of the statement. Therefore <productname>PostgreSQL</productname> reports an error if <command>LOCK</command> is used outside a transaction block. Use <xref linkend="sql-begin"/> and <xref linkend="sql-commit"/> (or <xref linkend="sql-rollback"/>) to define a transaction block.
ru: Вне блока транзакции команда <command>LOCK TABLE</command> бесполезна: блокировка сохранится только до завершения операции. Поэтому <productname>PostgreSQL</productname> выдаёт ошибку при попытке применить <command>LOCK</command> не в блоке транзакции. Чтобы определить блок транзакции, используйте <xref linkend="sql-begin"/> и <xref linkend="sql-commit"/> (или <xref linkend="sql-rollback"/>).

source: Examples
ru: Примеры

source: BEGIN WORK; LOCK TABLE films IN SHARE MODE; SELECT id FROM films WHERE name = 'Star Wars: Episode I - The Phantom Menace'; -- Do ROLLBACK if record was not returned INSERT INTO films_user_comments VALUES (_id_, 'GREAT! I was waiting for it for so long!'); COMMIT WORK;
ru: BEGIN WORK; LOCK TABLE films IN SHARE MODE; SELECT id FROM films WHERE name = 'Star Wars: Episode I - The Phantom Menace'; -- Если запись не будет возвращена, произойдёт откат транзакции INSERT INTO films_user_comments VALUES (_id_, 'GREAT! I was waiting for it for so long!'); COMMIT WORK;

source: Obtain a <literal>SHARE</literal> lock on a primary key table when going to perform inserts into a foreign key table: <placeholder-1/>
ru: Получение блокировки <literal>SHARE</literal> для первичного ключа таблицы при добавлении записи в подчинённую таблицу: <placeholder-1/>

source: Take a <literal>SHARE ROW EXCLUSIVE</literal> lock on a primary key table when going to perform a delete operation: <placeholder-1/>
ru: Установление блокировки <literal>SHARE ROW EXCLUSIVE</literal> в таблице первичного ключа перед выполнением операции удаления: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>LOCK TABLE</command> in the SQL standard, which instead uses <command>SET TRANSACTION</command> to specify concurrency levels on transactions. <productname>PostgreSQL</productname> supports that too; see <xref linkend="sql-set-transaction"/> for details.
ru: Команда <command>LOCK TABLE</command> отсутствует в стандарте SQL, в нём уровни изоляции транзакции определяются командой <command>SET TRANSACTION</command>. <productname>PostgreSQL</productname> поддерживает и этот вариант; подробнее это описано в <xref remap="6" linkend="sql-set-transaction"/>.

source: Except for <literal>ACCESS SHARE</literal>, <literal>ACCESS EXCLUSIVE</literal>, and <literal>SHARE UPDATE EXCLUSIVE</literal> lock modes, the <productname>PostgreSQL</productname> lock modes and the <command>LOCK TABLE</command> syntax are compatible with those present in <productname>Oracle</productname>.
ru: За исключением <literal>ACCESS SHARE</literal>, <literal>ACCESS EXCLUSIVE</literal> и <literal>SHARE UPDATE EXCLUSIVE</literal>, режимы блокировки в <productname>PostgreSQL</productname> и синтаксис <command>LOCK TABLE</command> совместимы с теми, что представлены в СУБД <productname>Oracle</productname>.
