Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/pgarchivecleanup.po
Languages: ru

source: Application
ru: Приложение

source: clean up <placeholder-1/> WAL archive files
ru: вычистить файлы архивов WAL <placeholder-1/>

source: option
ru: параметр

source: archivelocation
ru: расположение_архива

source: oldestkeptwalfile
ru: старейший_сохраняемый_файл

source: Description
ru: Описание

source: <application>pg_archivecleanup</application> is designed to be used as an <literal>archive_cleanup_command</literal> to clean up WAL file archives when running as a standby server (see <xref linkend="warm-standby"/>). <application>pg_archivecleanup</application> can also be used as a standalone program to clean WAL file archives.
ru: Утилита <application>pg_archivecleanup</application> предназначена для использования в качестве <literal>archive_cleanup_command</literal> для удаления старых файлов WAL на резервном сервере (см. <xref remap="4" linkend="warm-standby"/>). <application>pg_archivecleanup</application> можно использовать и как отдельную программу для выполнения тех же действий.

source: archive_cleanup_command = 'pg_archivecleanup <replaceable>archivelocation</replaceable> %r'
ru: archive_cleanup_command = 'pg_archivecleanup <replaceable>расположение_архива</replaceable> %r'

source: To configure a standby server to use <application>pg_archivecleanup</application>, put this into its <filename>recovery.conf</filename> configuration file: <placeholder-1/> where <replaceable>archivelocation</replaceable> is the directory from which WAL segment files should be removed.
ru: Чтобы использовать <application>pg_archivecleanup</application> на резервном сервере, добавьте эту строку в файл конфигурации <filename>recovery.conf</filename>: <placeholder-1/> Здесь <replaceable>расположение_архива</replaceable> определяет каталог, из которого должны удаляться файлы сегментов WAL.

source: When used within <xref linkend="archive-cleanup-command"/>, all WAL files logically preceding the value of the <literal>%r</literal> argument will be removed from <replaceable>archivelocation</replaceable>. This minimizes the number of files that need to be retained, while preserving crash-restart capability. Use of this parameter is appropriate if the <replaceable>archivelocation</replaceable> is a transient staging area for this particular standby server, but <emphasis>not</emphasis> when the <replaceable>archivelocation</replaceable> is intended as a long-term WAL archive area, or when multiple standby servers are recovering from the same archive location.
ru: Вызываемая в качестве <xref linkend="archive-cleanup-command"/>, эта программа просматривает <replaceable>расположение_архива</replaceable> и удаляет все файлы WAL, логически предшествующие значению аргумента <literal>%r</literal>. Целью этой операции является сокращение числа сохраняемых файлов без потери возможности восстановления при перезапуске. Такой вариант использования уместен, когда <replaceable>расположение_архива</replaceable> указывает на область рабочих файлов конкретного резервного сервера, но <emphasis>не</emphasis> когда <replaceable>расположение_архива</replaceable> — каталог с архивом WAL для долговременного хранения, или когда несколько резервных серверов восстанавливают записи WAL из одного расположения.

source: When used as a standalone program all WAL files logically preceding the <replaceable>oldestkeptwalfile</replaceable> will be removed from <replaceable>archivelocation</replaceable>. In this mode, if you specify a <filename>.partial</filename> or <filename>.backup</filename> file name, then only the file prefix will be used as the <replaceable>oldestkeptwalfile</replaceable>. This treatment of <filename>.backup</filename> file name allows you to remove all WAL files archived prior to a specific base backup without error. For example, the following example will remove all files older than WAL file name <filename>000000010000003700000010</filename>: <placeholder-1/>
ru: При отдельном использовании этой программы из каталога <replaceable>расположение_архива</replaceable> будут удалены все файлы WAL, логически предшествующие файлу <replaceable>старейший_сохраняемый_файл</replaceable>. В этом режиме, если вы укажете имя файла с расширением <filename>.partial</filename> или <filename>.backup</filename>, <replaceable>старейший_сохраняемый_файл</replaceable> будет определяться по имени без расширения. Благодаря такой интерпретации расширения <filename>.backup</filename> будут корректно удалены все файлы WAL, заархивированные до определённой базовой копии. Например, следующая команда удалит все файлы старее файла WAL с именем <filename>000000010000003700000010</filename>: <placeholder-1/>

source: <application>pg_archivecleanup</application> assumes that <replaceable>archivelocation</replaceable> is a directory readable and writable by the server-owning user.
ru: <application>pg_archivecleanup</application> рассчитывает на то, что <replaceable>расположение_архива</replaceable> доступно для чтения и записи пользователю, владеющему серверным процессом.

source: Options
ru: Параметры

source: Print lots of debug logging output on <filename>stderr</filename>.
ru: Выводить подробные отладочные сообщения в <filename>stderr</filename>.

source: Print the names of the files that would have been removed on <filename>stdout</filename> (performs a dry run).
ru: Вывести имена файлов, которые должны быть удалены, в <filename>stdout</filename> (не выполняя удаление).

source: Print the <application>pg_archivecleanup</application> version and exit.
ru: Вывести версию <application>pg_archivecleanup</application> и завершиться.

source: extension
ru: расширение

source: When using the program as a standalone utility, provide an extension that will be stripped from all file names before deciding if they should be deleted. This is typically useful for cleaning up archives that have been compressed during storage, and therefore have had an extension added by the compression program. For example: <literal>-x .gz</literal>.
ru: При отдельном использовании этой программы укажите расширение, которое будет убрано из имён файлов до принятия решения об удалении определённых файлов. Это обычно полезно для очистки файлов архивов, которые сжимаются для хранения и получают расширение, задаваемое программой сжатия. Например: <literal>-x .gz</literal>.

source: Show help about <application>pg_archivecleanup</application> command line arguments, and exit.
ru: Вывести справку об аргументах командной строки <application>pg_archivecleanup</application> и завершиться.

source: <application>pg_archivecleanup</application> accepts the following command-line arguments: <placeholder-1/>
ru: <application>pg_archivecleanup</application> принимает следующие аргументы командной строки: <placeholder-1/>

source: Notes
ru: Замечания

source: <application>pg_archivecleanup</application> is designed to work with <productname>PostgreSQL</productname> 8.0 and later when used as a standalone utility, or with <productname>PostgreSQL</productname> 9.0 and later when used as an archive cleanup command.
ru: Программа <application>pg_archivecleanup</application> рассчитана на работу с <productname>PostgreSQL</productname> 8.0 и новее как отдельная утилита, а также с <productname>PostgreSQL</productname> 9.0 и новее как команда очистки архива.

source: <application>pg_archivecleanup</application> is written in C and has an easy-to-modify source code, with specifically designated sections to modify for your own needs
ru: Программа <application>pg_archivecleanup</application> написана на C; её исходный код легко поддаётся модификации (он содержит секции, предназначенные для изменения при надобности)

source: Examples
ru: Примеры

source: On Linux or Unix systems, you might use: <placeholder-1/> where the archive directory is physically located on the standby server, so that the <varname>archive_command</varname> is accessing it across NFS, but the files are local to the standby. This will:
ru: В системах Linux или Unix можно использовать команду: <placeholder-1/> Предполагается, что каталог архива физически располагается на резервном сервере, так что команда <varname>archive_command</varname> обращается к нему по NFS, но для резервного сервера эти файлы локальные. Эта команда будет:

source: produce debugging output in <filename>cleanup.log</filename>
ru: выводить отладочную информацию в <filename>cleanup.log</filename>

source: remove no-longer-needed files from the archive directory
ru: удалять ставшие ненужными файлы из каталога архива

source: See Also
ru: См. также
