Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/pgupgrade.po
Languages: ru

source: Application
ru: Приложение

source: upgrade a <placeholder-1/> server instance
ru: обновить экземпляр сервера <placeholder-1/>

source: oldbindir
ru: старый_каталог_bin

source: newbindir
ru: новый_каталог_bin

source: olddatadir
ru: старый_каталог_данных

source: newdatadir
ru: новый_каталог_данных

source: option
ru: параметр

source: Description
ru: Описание

source: <application>pg_upgrade</application> (formerly called <application>pg_migrator</application>) allows data stored in <productname>PostgreSQL</productname> data files to be upgraded to a later <productname>PostgreSQL</productname> major version without the data dump/reload typically required for major version upgrades, e.g. from 8.4.7 to the current major release of <productname>PostgreSQL</productname>. It is not required for minor version upgrades, e.g. from 9.0.1 to 9.0.4.
ru: Программа <application>pg_upgrade</application> (ранее называвшаяся <application>pg_migrator</application>) позволяет обновить данные в каталоге базы данных <productname>PostgreSQL</productname> до последней основной версии <productname>PostgreSQL</productname> без операции выгрузки/перезагрузки данных, обычно необходимой при обновлениях основной версии, например, при переходе от 8.4.7 к текущей основной версии <productname>PostgreSQL</productname>. Эти действия не требуются при установке корректирующей версии, например, при переходе от 9.0.1 к 9.0.4.

source: Major PostgreSQL releases regularly add new features that often change the layout of the system tables, but the internal data storage format rarely changes. <application>pg_upgrade</application> uses this fact to perform rapid upgrades by creating new system tables and simply reusing the old user data files. If a future major release ever changes the data storage format in a way that makes the old data format unreadable, <application>pg_upgrade</application> will not be usable for such upgrades. (The community will attempt to avoid such situations.)
ru: С выходом новых основных версий в PostgreSQL регулярно добавляются новые возможности, которые часто меняют структуру системных таблицы, но внутренний формат хранения меняется редко. Учитывая этот факт, <application>pg_upgrade</application> позволяет выполнить быстрое обновление, создавая системные таблицы заново, но сохраняя старые файлы данных. Если при обновлении основной версии формат хранения данных изменится так, что данные в старом формате окажутся нечитаемыми, <application>pg_upgrade</application> не сможет произвести такое обновление. (Сообщество разработчиков постарается не допустить подобных ситуаций.)

source: <application>pg_upgrade</application> does its best to make sure the old and new clusters are binary-compatible, e.g. by checking for compatible compile-time settings, including 32/64-bit binaries. It is important that any external modules are also binary compatible, though this cannot be checked by <application>pg_upgrade</application>.
ru: Программа <application>pg_upgrade</application> делает всё возможное, чтобы убедиться в том, что старый и новый кластеры двоично-совместимы, в частности проверяя параметры времени компиляции и разрядность (32/64 бита) исполняемых файлов. Важно, чтобы и все внешние модули тоже были двоично-совместимыми, хотя это <application>pg_upgrade</application> проверить не может.

source: pg_upgrade supports upgrades from 8.4.X and later to the current major release of <productname>PostgreSQL</productname>, including snapshot and alpha releases.
ru: pg_upgrade поддерживает обновление с версии 8.4.X и новее до текущей основной версии <productname>PostgreSQL</productname>, включая альфа-выпуски и сборки снимков кода.

source: Options
ru: Параметры

source: bindir
ru: каталог_bin

source: the old PostgreSQL executable directory; environment variable <envar>PGBINOLD</envar>
ru: каталог с исполняемыми файлами старой версии PostgreSQL; переменная окружения <envar>PGBINOLD</envar>

source: the new PostgreSQL executable directory; environment variable <envar>PGBINNEW</envar>
ru: каталог с исполняемыми файлами новой версии PostgreSQL; переменная окружения <envar>PGBINNEW</envar>

source: check clusters only, don't change any data
ru: только проверить кластеры, не изменять никакие данные

source: the old cluster data directory; environment variable <envar>PGDATAOLD</envar>
ru: каталог данных старого кластера; переменная окружения <envar>PGDATAOLD</envar>

source: the new cluster data directory; environment variable <envar>PGDATANEW</envar>
ru: каталог данных нового кластера; переменная окружения <envar>PGDATANEW</envar>

source: number of simultaneous processes or threads to use
ru: число одновременно задействуемых процессов или потоков

source: use hard links instead of copying files to the new cluster (use junction points on Windows)
ru: использовать жёсткие ссылки вместо копирования файлов в новый кластер (в Windows использовать точки соединения)

source: options
ru: параметры

source: options to be passed directly to the old <command>postgres</command> command; multiple option invocations are appended
ru: параметры, передаваемые непосредственно старой программе <command>postgres</command>; несколько параметров складываются вместе

source: options to be passed directly to the new <command>postgres</command> command; multiple option invocations are appended
ru: параметры, передаваемые непосредственно новой программе <command>postgres</command>; несколько параметров складываются вместе

source: port
ru: порт

source: the old cluster port number; environment variable <envar>PGPORTOLD</envar>
ru: номер порта старого кластера; переменная окружения <envar>PGPORTOLD</envar>

source: the new cluster port number; environment variable <envar>PGPORTNEW</envar>
ru: номер порта нового кластера; переменная окружения <envar>PGPORTNEW</envar>

source: retain SQL and log files even after successful completion
ru: сохранить SQL и журналы сообщений даже при успешном завершении

source: username
ru: имя_пользователя

source: cluster's install user name; environment variable <envar>PGUSER</envar>
ru: имя пользователя, установившего кластер; переменная окружения <envar>PGUSER</envar>

source: enable verbose internal logging
ru: включить подробные внутренние сообщения

source: display version information, then exit
ru: показать версию, а затем завершиться

source: show help, then exit
ru: показать справку, а затем завершиться

source: <application>pg_upgrade</application> accepts the following command-line arguments: <placeholder-1/>
ru: <application>pg_upgrade</application> принимает следующие аргументы командной строки: <placeholder-1/>

source: Usage
ru: Использование

source: These are the steps to perform an upgrade with <application>pg_upgrade</application>:
ru: Далее описан план обновления с использованием <application>pg_upgrade</application>:

source: Optionally move the old cluster
ru: Переместить старый кластер (необязательно)

source: If you are using a version-specific installation directory, e.g. <filename>/opt/PostgreSQL/9.1</filename>, you do not need to move the old cluster. The graphical installers all use version-specific installation directories.
ru: Если ваш каталог инсталляции привязан к версии, например, <filename>/opt/PostgreSQL/9.1</filename>, перемещать его не требуется. Все графические инсталляторы выбирают при установке каталоги, привязанные к версии.

source: If your installation directory is not version-specific, e.g. <filename>/usr/local/pgsql</filename>, it is necessary to move the current PostgreSQL install directory so it does not interfere with the new <productname>PostgreSQL</productname> installation. Once the current <productname>PostgreSQL</productname> server is shut down, it is safe to rename the PostgreSQL installation directory; assuming the old directory is <filename>/usr/local/pgsql</filename>, you can do: <placeholder-1/> to rename the directory.
ru: Если ваш каталог инсталляции не привязан к версии, например <filename>/usr/local/pgsql</filename>, необходимо переместить каталог текущей инсталляции PostgreSQL, чтобы он не конфликтовал с новой инсталляцией <productname>PostgreSQL</productname>. Когда текущий сервер <productname>PostgreSQL</productname> отключён, каталог этой инсталляции PostgreSQL можно безопасно переместить; если старый каталог <filename>/usr/local/pgsql</filename>, его можно переименовать, выполнив: <placeholder-1/>

source: For source installs, build the new version
ru: Собрать новую версию при установке из исходного кода

source: Build the new PostgreSQL source with <command>configure</command> flags that are compatible with the old cluster. <application>pg_upgrade</application> will check <command>pg_controldata</command> to make sure all settings are compatible before starting the upgrade.
ru: Соберите из исходного кода новую версию PostgreSQL с флагами <command>configure</command>, совместимыми с флагами старого кластера. Программа <application>pg_upgrade</application> проверит результаты <command>pg_controldata</command>, чтобы убедиться, что все параметры совместимы, прежде чем начинать обновление.

source: Install the new PostgreSQL binaries
ru: Установить новые исполняемые файлы PostgreSQL

source: Install the new server's binaries and support files. <application>pg_upgrade</application> is included in a default installation.
ru: Установите новые исполняемые файлы сервера и вспомогательные файлы. Программа <application>pg_upgrade</application> включена в инсталляцию по умолчанию.

source: For source installs, if you wish to install the new server in a custom location, use the <literal>prefix</literal> variable: <placeholder-1/>
ru: При установке из исходного кода, если вы хотите разместить сервер в нестандартном каталоге, воспользуйтесь переменной <literal>prefix</literal>: <placeholder-1/>

source: Initialize the new PostgreSQL cluster
ru: Инициализировать новый кластер PostgreSQL

source: Initialize the new cluster using <command>initdb</command>. Again, use compatible <command>initdb</command> flags that match the old cluster. Many prebuilt installers do this step automatically. There is no need to start the new cluster.
ru: Инициализируйте новый кластер, используя <command>initdb</command>. При этом так же необходимо указать флаги <command>initdb</command>, совместимые с флагами в старом кластере. Многие готовые инсталляторы выполняют это действие автоматически. Запускать новый кластер не требуется.

source: Install custom shared object files
ru: Установить дополнительные разделяемые объектные файлы

source: Install any custom shared object files (or DLLs) used by the old cluster into the new cluster, e.g. <filename>pgcrypto.so</filename>, whether they are from <filename>contrib</filename> or some other source. Do not install the schema definitions, e.g. <filename>pgcrypto.sql</filename>, because these will be upgraded from the old cluster. Also, any custom full text search files (dictionary, synonym, thesaurus, stop words) must also be copied to the new cluster.
ru: Установите в новый кластер все нестандартные разделяемые объектные файлы (или DLL), которые использовались в старом кластере, например, <filename>pgcrypto.so</filename>, где бы они ни находились — в <filename>contrib</filename> или в другом месте. Устанавливать определения схемы, например <filename>pgcrypto.sql</filename>, не требуется, так как они будут перенесены из старого кластера. Кроме того, в новый кластер нужно скопировать и все нестандартные файлы поддержки полнотекстового поиска (словари, тезаурусы, списки синонимов и стоп-слов).

source: Adjust authentication
ru: Настроить аутентификацию

source: <command>pg_upgrade</command> will connect to the old and new servers several times, so you might want to set authentication to <literal>peer</literal> in <filename>pg_hba.conf</filename> or use a <filename>~/.pgpass</filename> file (see <xref linkend="libpq-pgpass"/>).
ru: Программа <command>pg_upgrade</command> будет подключаться к новому и старому серверу несколько раз, так что имеет смысл установить режим аутентификации <literal>peer</literal> в <filename>pg_hba.conf</filename> или использовать файл <filename>~/.pgpass</filename> (см. <xref remap="4" linkend="libpq-pgpass"/>).

source: Stop both servers
ru: Остановить оба сервера

source: Make sure both database servers are stopped using, on Unix, e.g.: <placeholder-1/> or on Windows, using the proper service names: <placeholder-2/>
ru: Убедитесь в том, что оба сервера баз данных остановлены. Для этого в Unix можно выполнить: <placeholder-1/> А в Windows, с соответствующими именами служб: <placeholder-2/>

source: Streaming replication and log-shipping standby servers can remain running until a later step.
ru: Серверы резерва с потоковой репликацией и трансляцией журнала могут продолжать работать до последнего шага.

source: Verify standby servers
ru: Проверить резервные серверы

source: If you are upgrading Streaming Replication and Log-Shipping standby servers, verify that the old standby servers are caught up by running <application>pg_controldata</application> against the old primary and standby clusters. Verify that the <quote>Latest checkpoint location</quote> values match in all clusters. (There will be a mismatch if old standby servers were shut down before the old primary.)
ru: Если вы производите обновления серверов резерва с потоковой репликацией, удостоверьтесь, что старые серверы резерва находятся в актуальном состоянии, запустив <application>pg_controldata</application> в старых ведущем и резервных кластерах. Убедитесь в том, что значения <quote>Положение последней контрольной точки</quote> во всех кластерах совпадают. (Несовпадение будет иметь место, если старые резервные серверы будут отключены раньше, чем старый ведущий.)

source: Run <application>pg_upgrade</application>
ru: Запустить <application>pg_upgrade</application>

source: Always run the <application>pg_upgrade</application> binary of the new server, not the old one. <application>pg_upgrade</application> requires the specification of the old and new cluster's data and executable (<filename>bin</filename>) directories. You can also specify user and port values, and whether you want the data linked instead of copied (the default).
ru: Всегда запускайте программу <application>pg_upgrade</application> от нового сервера, а не от старого. <application>pg_upgrade</application> требует указания каталогов данных старого и нового кластера, а также каталогов исполняемых файлов (<filename>bin</filename>). Вы можете также определить имя пользователя и номера портов, и следует ли ограничиться ссылкой на данные, а не копировать их (по умолчанию).

source: If you use link mode, the upgrade will be much faster (no file copying) and use less disk space, but you will not be able to access your old cluster once you start the new cluster after the upgrade. Link mode also requires that the old and new cluster data directories be in the same file system. (Tablespaces and <filename>pg_xlog</filename> can be on different file systems.) See <literal>pg_upgrade --help</literal> for a full list of options.
ru: Если выбрать вариант со ссылкой на данные, обновление выполнится гораздо быстрее (так как файлы не копируются) и потребует меньше места на диске, но вы лишитесь возможности обращаться к вашему старому кластеру, запустив новый после обновления. Этот вариант также требует, чтобы каталоги данных старого и нового кластера располагались в одной файловой системе. (Табличные пространства и <filename>pg_xlog</filename> могут находиться в других файловых системах.) Полный список параметров вы можете получить, выполнив <literal>pg_upgrade --help</literal>.

source: The <option>--jobs</option> option allows multiple CPU cores to be used for copying/linking of files and to dump and reload database schemas in parallel; a good place to start is the maximum of the number of CPU cores and tablespaces. This option can dramatically reduce the time to upgrade a multi-database server running on a multiprocessor machine.
ru: Параметр <option>--jobs</option> позволяет задействовать для копирования/связывания файлов и для выгрузки/перезагрузки схем баз данных несколько процессорных ядер. В качестве начального значения параметра стоит выбрать максимум из числа процессорных ядер и числа табличных пространств. Этот параметр может радикально сократить время обновления сервера со множеством баз данных, работающего в многопроцессорной системе.

source: For Windows users, you must be logged into an administrative account, and then start a shell as the <literal>postgres</literal> user and set the proper path: <placeholder-1/> and then run <application>pg_upgrade</application> with quoted directories, e.g.: <placeholder-2/> Once started, <command>pg_upgrade</command> will verify the two clusters are compatible and then do the upgrade. You can use <command>pg_upgrade --check</command> to perform only the checks, even if the old server is still running. <command>pg_upgrade --check</command> will also outline any manual adjustments you will need to make after the upgrade. If you are going to be using link mode, you should use the <option>--link</option> option with <option>--check</option> to enable link-mode-specific checks. <command>pg_upgrade</command> requires write permission in the current directory.
ru: В Windows вы должны войти в систему с административными полномочиями, затем запустить командную строку от имени пользователя <literal>postgres</literal>, задать подходящий путь: <placeholder-1/> Наконец, запустить <application>pg_upgrade</application> с путями каталогов в кавычках, например, так: <placeholder-2/> При запуске <command>pg_upgrade</command> проверит два кластера на совместимость и, если всё в порядке, выполнит обновление. Также возможно запустить <command>pg_upgrade --check</command>, чтобы ограничиться только проверками (при этом старый сервер может продолжать работать). Команда <command>pg_upgrade --check</command> также сообщит, какие коррективы вам нужно будет внести вручную после обновления. Если вы планируете использовать режим ссылок на данные, укажите вместе с <option>--check</option> параметр <option>--link</option>, чтобы были проведены специальные проверки для этого режима. Программе <command>pg_upgrade</command> требуются права на запись в текущий каталог.

source: Obviously, no one should be accessing the clusters during the upgrade. <application>pg_upgrade</application> defaults to running servers on port 50432 to avoid unintended client connections. You can use the same port number for both clusters when doing an upgrade because the old and new clusters will not be running at the same time. However, when checking an old running server, the old and new port numbers must be different.
ru: Очевидно, никто не должен обращаться к кластерам в процессе обновления. Программа <application>pg_upgrade</application> по умолчанию запускает серверы с портом 50432, чтобы не допустить нежелательных клиентских подключений. В процессе обновления оба кластера могут использовать один номер порта, так как они не будут работать одновременно. Однако для проверки старого работающего сервера новый порт должен отличаться от старого.

source: If an error occurs while restoring the database schema, <command>pg_upgrade</command> will exit and you will have to revert to the old cluster as outlined in <xref linkend="pgupgrade-step-revert"/> below. To try <command>pg_upgrade</command> again, you will need to modify the old cluster so the pg_upgrade schema restore succeeds. If the problem is a <filename>contrib</filename> module, you might need to uninstall the <filename>contrib</filename> module from the old cluster and install it in the new cluster after the upgrade, assuming the module is not being used to store user data.
ru: Если при восстановлении схемы базы данных происходит ошибка, <command>pg_upgrade</command> завершает свою работу и вы должны вернуться к старому кластеру, как описывается ниже в <xref linkend="pgupgrade-step-revert"/>. Чтобы попробовать <command>pg_upgrade</command> ещё раз, вы должны внести коррективы в старом кластере, чтобы pg_upgrade могла успешно восстановить схему. Если проблема возникла в модуле <filename>contrib</filename>, может потребоваться удалить этот модуль <filename>contrib</filename> в старом кластере, а затем установить его в новом после обновления (предполагается, что этот модуль не хранит пользовательские данные).

source: Upgrade Streaming Replication and Log-Shipping standby servers
ru: Обновить серверы резерва с потоковой репликацией и трансляцией журнала

source: If you have Streaming Replication (see <xref linkend="streaming-replication"/>) or Log-Shipping (see <xref linkend="warm-standby"/>) standby servers, follow these steps to upgrade them. You will not be running <application>pg_upgrade</application> on the standby servers, but rather <application>rsync</application>. Do not start any servers yet.
ru: Если вы используете серверы резерва с потоковой репликацией (см. <xref remap="4" linkend="streaming-replication"/>) или трансляцией журнала (см. <xref remap="4" linkend="warm-standby"/>), обновите их, выполнив следующие действия. На серверах резерва нужно будет запускать не <application>pg_upgrade</application>, а <application>rsync</application>. Не запускайте никакие серверы на этом этапе.

source: Install the new PostgreSQL binaries on standby servers
ru: Установите новые исполняемые файлы PostgreSQL на резервных серверах

source: Make sure the new binaries and support files are installed on all standby servers.
ru: Убедитесь в том, что на всех резервных серверах установлены новые исполняемые и вспомогательные файлы.

source: Make sure the new standby data directories do <emphasis>not</emphasis> exist
ru: Убедитесь в том, что новые каталоги данных на резервных серверах <emphasis>не</emphasis> существуют

source: Make sure the new standby data directories do <emphasis>not</emphasis> exist or are empty. If <application>initdb</application> was run, delete the standby server data directories.
ru: Новые каталоги данных резерва должны <emphasis>отсутствовать</emphasis> либо быть пустыми. Если запускалась программа <application>initdb</application>, удалите каталоги данных резервных серверов.

source: Install the same custom shared object files on the new standbys that you installed in the new master cluster.
ru: Установите на новых резервных серверах те же дополнительные разделяемые объектные файлы, что вы установили в новом ведущем кластере.

source: Stop standby servers
ru: Остановите резервные серверы

source: If the standby servers are still running, stop them now using the above instructions.
ru: Если резервные серверы продолжают работу, остановите их, следуя приведённым выше инструкциям.

source: Save configuration files
ru: Сохраните файлы конфигурации

source: Save any configuration files from the standbys you need to keep, e.g. <filename>postgresql.conf</filename>, <literal>recovery.conf</literal>, as these will be overwritten or removed in the next step.
ru: Сохраните все нужные вам файлы конфигурации с резервных серверов, в частности <filename>postgresql.conf</filename> и <literal>recovery.conf</literal>, так как они будут перезаписаны или удалены на следующем этапе.

source: Start and stop the new master cluster
ru: Запустите и остановите новый ведущий кластер

source: In the new master cluster, change <varname>wal_level</varname> to <literal>replica</literal> in the <filename>postgresql.conf</filename> file and then start and stop the cluster.
ru: В новом главном кластере измените <varname>wal_level</varname> на <literal>replica</literal> в <filename>postgresql.conf</filename> и запустите, а затем остановите кластер.

source: Run <application>rsync</application>
ru: Запустите <application>rsync</application>
