Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/pgupgrade.po
Languages: ru

source: From a directory that is above the old and new database cluster directories, run this for each slave: <placeholder-1/> where <option>old_pgdata</option> and <option>new_pgdata</option> are relative to the current directory, and <option>remote_dir</option> is <emphasis>above</emphasis> the old and new cluster directories on the standby server. The old and new relative cluster paths must match on the master and standby server. Consult the <application>rsync</application> manual page for details on specifying the remote directory, e.g. <literal>standbyhost:/opt/PostgreSQL/</literal>. <application>rsync</application> will be fast when <application>pg_upgrade</application>'s <option>--link</option> mode is used because it will create hard links on the remote server rather than transferring user data.
ru: В каталоге, внутри которого находятся каталоги старого и нового кластера, для каждого ведомого сервера выполните: <placeholder-1/> Здесь каталоги <option>old_pgdata</option> и <option>new_pgdata</option> задаются относительно текущего каталога, а <option>remote_dir</option> находится <emphasis>над</emphasis> каталогами старого и нового кластера на резервном сервере. Относительные пути старого и нового кластера на главном и резервном сервере должны совпадать. Обратитесь к странице руководства <application>rsync</application> за подробным описанием указания удалённого каталога, например в виде <literal>standbyhost:/opt/PostgreSQL/</literal>. Операция <application>rsync</application> выполнится быстро, когда <application>pg_upgrade</application> запускается в режиме <option>--link</option>, так как при этом вместо передачи пользовательских данных будут созданы жёсткие ссылки на удалённый сервер.

source: If you have tablespaces, you will need to run a similar <application>rsync</application> command for each tablespace directory. If you have relocated <filename>pg_xlog</filename> outside the data directories, <application>rsync</application> must be run on those directories too.
ru: Если у вас есть табличные пространства, вам потребуется выполнить подобную команду <application>rsync</application> для каталогов всех табличных пространств. Если вы вынесли <filename>pg_xlog</filename> за пределы каталогов данных, нужно будет запустить <application>rsync</application> и для этих каталогов.

source: Configure streaming replication and log-shipping standby servers
ru: Настройте серверы резерва с потоковой репликацией и трансляцией журнала

source: Configure the servers for log shipping. (You do not need to run <function>pg_start_backup()</function> and <function>pg_stop_backup()</function> or take a file system backup as the slaves are still synchronized with the master.)
ru: Настройте серверы для трансляции журнала. (Запускать <function>pg_start_backup()</function> и <function>pg_stop_backup()</function> или делать копию файловой системы не нужно, так как ведомые серверы остаются синхронизированными с ведущим.)

source: Restore <filename>pg_hba.conf</filename>
ru: Восстановить <filename>pg_hba.conf</filename>

source: If you modified <filename>pg_hba.conf</filename>, restore its original settings. It might also be necessary to adjust other configuration files in the new cluster to match the old cluster, e.g. <filename>postgresql.conf</filename>.
ru: Если вы изменяли <filename>pg_hba.conf</filename>, восстановите его исходное состояние. Также может потребоваться скорректировать другие файлы конфигурации в новом кластере, чтобы они соответствовали старому, например <filename>postgresql.conf</filename>.

source: Start the new server
ru: Запустить новый сервер

source: The new server can now be safely started, and then any <application>rsync</application>'ed standby servers.
ru: Теперь можно безопасно запустить новый сервер, а затем резервные серверы, синхронизированные с ним с помощью <application>rsync</application>.

source: Post-Upgrade processing
ru: Действия после обновления

source: If any post-upgrade processing is required, pg_upgrade will issue warnings as it completes. It will also generate script files that must be run by the administrator. The script files will connect to each database that needs post-upgrade processing. Each script should be run using: <placeholder-1/> The scripts can be run in any order and can be deleted once they have been run.
ru: Если после обновления требуются какие-то дополнительные действия, программа pg_upgrade выдаст предупреждения об этом по завершении работы. Она также сгенерирует файлы скриптов, которые должны запускаться администратором. Эти скрипты будут подключаться к каждой базе данных, требующей дополнительных операций. Каждый такой скрипт следует выполнять командой: <placeholder-1/> Эти скрипты могут выполняться в любом порядке, а после выполнения их можно удалить.

source: In general it is unsafe to access tables referenced in rebuild scripts until the rebuild scripts have run to completion; doing so could yield incorrect results or poor performance. Tables not referenced in rebuild scripts can be accessed immediately.
ru: Обычно к таблицам, задействованным в перестраивающих базу скриптах, опасно обращаться, пока эти скрипты не сделают свою работу; при этом можно получить некорректный результат или плохую производительность. К таблицам, не задействованным в таких скриптах, можно обращаться немедленно.

source: Statistics
ru: Статистика

source: Because optimizer statistics are not transferred by <command>pg_upgrade</command>, you will be instructed to run a command to regenerate that information at the end of the upgrade. You might need to set connection parameters to match your new cluster.
ru: Так как статистика оптимизатора не передаётся в процессе работы <command>pg_upgrade</command>, вы получите указание запустить соответствующую команду для воссоздания этой информации после обновления. Возможно, для этого вам понадобится установить параметры подключения к новому кластеру.

source: Delete old cluster
ru: Удалить старый кластер

source: Once you are satisfied with the upgrade, you can delete the old cluster's data directories by running the script mentioned when <command>pg_upgrade</command> completes. (Automatic deletion is not possible if you have user-defined tablespaces inside the old data directory.) You can also delete the old installation directories (e.g. <filename>bin</filename>, <filename>share</filename>).
ru: Если вы удовлетворены результатами обновления, вы можете удалить каталоги данных старого кластера, запустив скрипт, упомянутый в выводе <command>pg_upgrade</command> после обновления. (Автоматическое удаление невозможно, если в старом каталоге данных находятся дополнительные табличные пространства.) Также вы можете удалить каталоги старой инсталляции (например, <filename>bin</filename>, <filename>share</filename>).

source: Reverting to old cluster
ru: Возврат к старому кластеру

source: If you ran <command>pg_upgrade</command> with <option>--check</option>, no modifications were made to the old cluster and you can re-use it anytime.
ru: Если <command>pg_upgrade</command> запускалась с ключом <option>--check</option>, никакие изменения в старом кластере не производились и его использование можно продолжить в любой момент.

source: If you ran <command>pg_upgrade</command> with <option>--link</option>, the data files are shared between the old and new cluster. If you started the new cluster, the new server has written to those shared files and it is unsafe to use the old cluster.
ru: Если <command>pg_upgrade</command> запускалась с параметром <option>--link</option>, файлы данных будут разделяться старым и новым кластером. Если новый кластер уже запускался, он произвёл запись в эти файлы, так что использовать старый кластер небезопасно.

source: If you ran <command>pg_upgrade</command> <emphasis>without</emphasis> <option>--link</option> or did not start the new server, the old cluster was not modified except that, if linking started, a <literal>.old</literal> suffix was appended to <filename>$PGDATA/global/pg_control</filename>. To reuse the old cluster, possibly remove the <filename>.old</filename> suffix from <filename>$PGDATA/global/pg_control</filename>; you can then restart the old cluster.
ru: Если <command>pg_upgrade</command> запускалась <emphasis>без</emphasis> ключа <option>--link</option> или новый сервер не запускался, старый кластер не претерпел никаких изменений, за исключением того, что в режиме ссылки на данные к имени <filename>$PGDATA/global/pg_control</filename> было добавлено окончание <literal>.old</literal>. Чтобы продолжить использование старого кластера, можно просто убрать окончание <filename>.old</filename> из имени файла <filename>$PGDATA/global/pg_control</filename>; после этого старый кластер можно будет перезапустить.

source: If, after running <command>pg_upgrade</command>, you wish to revert to the old cluster, there are several options: <placeholder-1/>
ru: Если выполнив команду <command>pg_upgrade</command>, вы захотите вернуться к старому кластеру, возможны следующие варианты: <placeholder-1/>

source: Notes
ru: Замечания

source: <application>pg_upgrade</application> does not support upgrading of databases containing these <type>reg*</type> OID-referencing system data types: <type>regproc</type>, <type>regprocedure</type>, <type>regoper</type>, <type>regoperator</type>, <type>regconfig</type>, and <type>regdictionary</type>. (<type>regtype</type> can be upgraded.)
ru: <application>pg_upgrade</application> не поддерживает обновление баз данных, содержащих следующие ссылающиеся на OID системные типы данных <type>reg*</type>: <type>regproc</type>, <type>regprocedure</type>, <type>regoper</type>, <type>regoperator</type>, <type>regconfig</type> и <type>regdictionary</type>. (Обновление <type>regtype</type> возможно.)

source: All failure, rebuild, and reindex cases will be reported by <application>pg_upgrade</application> if they affect your installation; post-upgrade scripts to rebuild tables and indexes will be generated automatically. If you are trying to automate the upgrade of many clusters, you should find that clusters with identical database schemas require the same post-upgrade steps for all cluster upgrades; this is because the post-upgrade steps are based on the database schemas, and not user data.
ru: Программа <application>pg_upgrade</application> сообщит обо всех актуальных для вашей инсталляции ошибках и потребностях перестроения или переиндексации базы; при этом будут созданы завершающие обновление скрипты, перестраивающие таблицы или индексы. Если вы попытаетесь автоматизировать обновление множества серверов, вы обнаружите, что для кластеров с одинаковыми схемами баз данных потребуются одинаковые действия после обновления; это объясняется тем, что эти действия диктуются схемой базы данных, а не данными пользователей.

source: For deployment testing, create a schema-only copy of the old cluster, insert dummy data, and upgrade that.
ru: Для проверки развёртывания новой версии создайте копию только схемы старого кластера, наполните этот кластер фиктивными данными, и попробуйте обновить его.

source: If you are upgrading a pre-<productname>PostgreSQL</productname> 9.2 cluster that uses a configuration-file-only directory, you must pass the real data directory location to <application>pg_upgrade</application>, and pass the configuration directory location to the server, e.g. <literal>-d /real-data-directory -o '-D /configuration-directory'</literal>.
ru: Если вы производите обновление кластера <productname>PostgreSQL</productname> версии до 9.2, в которой используется каталог только с файлами конфигурации, вы должны передать расположение собственно каталога с данными программе <application>pg_upgrade</application>, а расположение каталога конфигурации передать серверу, например <literal>-d /каталог-данных -o '-D /каталог-конфигурации'</literal>.

source: If using a pre-9.1 old server that is using a non-default Unix-domain socket directory or a default that differs from the default of the new cluster, set <envar>PGHOST</envar> to point to the old server's socket location. (This is not relevant on Windows.)
ru: Если вы используете старый сервер версии до 9.1, работающий с нестандартным каталогом доменных сокетов Unix, либо его стандартное расположение отличается от принятого в новой версии, задайте в <envar>PGHOST</envar> расположение сокета старого сервера. (К Windows это не относится.)

source: If you want to use link mode and you do not want your old cluster to be modified when the new cluster is started, make a copy of the old cluster and upgrade that in link mode. To make a valid copy of the old cluster, use <command>rsync</command> to create a dirty copy of the old cluster while the server is running, then shut down the old server and run <command>rsync --checksum</command> again to update the copy with any changes to make it consistent. (<option>--checksum</option> is necessary because <command>rsync</command> only has file modification-time granularity of one second.) You might want to exclude some files, e.g. <filename>postmaster.pid</filename>, as documented in <xref linkend="backup-lowlevel-base-backup"/>. If your file system supports file system snapshots or copy-on-write file copies, you can use that to make a backup of the old cluster and tablespaces, though the snapshot and copies must be created simultaneously or while the database server is down.
ru: Если вы хотите использовать режим ссылок на данные, но не хотите каких-либо изменений в старом кластере при запуске нового, сделайте копию старого кластера и обновите его в этом режиме. Чтобы получить рабочую копию старого кластера, воспользуйтесь командой <command>rsync</command> и создайте предварительную копию кластера при работающем сервере, а затем отключите старый сервер и ещё раз запустите <command>rsync --checksum</command>, чтобы привести эту копию в согласованное состояние. (Ключ <option>--checksum</option> необходим, потому что <command>rsync</command> различает время с точностью только до секунд.) При этом вы можете исключить некоторые файлы, например <filename>postmaster.pid</filename>, как описано в <xref remap="6" linkend="backup-lowlevel-base-backup"/>. Если ваша файловая система поддерживает снимки файловой системы или копирование при записи, вы можете воспользоваться этим для создания копии старого кластера и табличных пространств; при этом важно, чтобы такие снимки и копии файлов создавались одномоментно или когда сервер баз данных отключён.

source: See Also
ru: См. также
