Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/prepare.po
Languages: ru

source: <primary>prepared statements</primary><secondary>creating</secondary>
ru: <primary>подготовленные операторы</primary><secondary>создание</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: prepare a statement for execution
ru: подготовить оператор к выполнению

source: name
ru: имя

source: data_type
ru: тип_данных

source: statement
ru: оператор

source: Description
ru: Описание

source: <command>PREPARE</command> creates a prepared statement. A prepared statement is a server-side object that can be used to optimize performance. When the <command>PREPARE</command> statement is executed, the specified statement is parsed, analyzed, and rewritten. When an <command>EXECUTE</command> command is subsequently issued, the prepared statement is planned and executed. This division of labor avoids repetitive parse analysis work, while allowing the execution plan to depend on the specific parameter values supplied.
ru: <command>PREPARE</command> создаёт подготовленный оператор. Подготовленный оператор представляет собой объект на стороне сервера, позволяющий оптимизировать производительность приложений. Когда выполняется <command>PREPARE</command>, указанный оператор разбирается, анализируется и переписывается. При последующем выполнении команды <command>EXECUTE</command> подготовленный оператор планируется и исполняется. Такое разделение труда исключает повторный разбор запроса, при этом позволяет выбрать наилучший план выполнения в зависимости от определённых значений параметров.

source: Prepared statements can take parameters: values that are substituted into the statement when it is executed. When creating the prepared statement, refer to parameters by position, using <literal>$1</literal>, <literal>$2</literal>, etc. A corresponding list of parameter data types can optionally be specified. When a parameter's data type is not specified or is declared as <literal>unknown</literal>, the type is inferred from the context in which the parameter is used (if possible). When executing the statement, specify the actual values for these parameters in the <command>EXECUTE</command> statement. Refer to <xref linkend="sql-execute"/> for more information about that.
ru: Подготовленные операторы могут принимать параметры — значения, которые подставляются в оператор, когда он собственно выполняется. При создании подготовленного оператора к этим параметрам можно обращаться по порядковому номеру, используя запись <literal>$1</literal>, <literal>$2</literal> и т. д. Дополнительно можно указать список соответствующих типов данных параметров. Если тип данных параметра не указан или объявлен как <literal>unknown</literal> (неизвестный), тип выводится из контекста, в котором используется этот параметр (если это возможно). При выполнении оператора фактические значения параметров передаются команде <command>EXECUTE</command>. За подробностями обратитесь к <xref remap="3" linkend="sql-execute"/>.

source: Prepared statements only last for the duration of the current database session. When the session ends, the prepared statement is forgotten, so it must be recreated before being used again. This also means that a single prepared statement cannot be used by multiple simultaneous database clients; however, each client can create their own prepared statement to use. Prepared statements can be manually cleaned up using the <xref linkend="sql-deallocate"/> command.
ru: Подготовленные операторы существуют только в рамках текущего сеанса работы с БД. Когда сеанс завершается, система забывает подготовленный оператор, так что его надо будет создать снова, чтобы использовать дальше. Это также означает, что один подготовленный оператор не может использоваться одновременно несколькими клиентами базы данных; но каждый клиент может создать собственный подготовленный оператор и использовать его. Освободить подготовленный оператор можно вручную, выполнив команду <xref linkend="sql-deallocate"/>.

source: Prepared statements potentially have the largest performance advantage when a single session is being used to execute a large number of similar statements. The performance difference will be particularly significant if the statements are complex to plan or rewrite, e.g. if the query involves a join of many tables or requires the application of several rules. If the statement is relatively simple to plan and rewrite but relatively expensive to execute, the performance advantage of prepared statements will be less noticeable.
ru: Подготовленные операторы потенциально дают наибольший выигрыш в производительности, когда в одном сеансе выполняется большое число однотипных операторов. Отличие в производительности особенно значительно, если операторы достаточно сложны для планирования или перезаписи, например, когда в запросе объединяется множество таблиц или необходимо применить несколько правил. Если оператор относительно прост в этом плане, но сложен для выполнения, выигрыш от использования подготовленных операторов будет менее заметным.

source: Parameters
ru: Параметры

source: An arbitrary name given to this particular prepared statement. It must be unique within a single session and is subsequently used to execute or deallocate a previously prepared statement.
ru: Произвольное имя, назначаемое данному подготовленному оператору. Оно должно быть уникальным в рамках одного сеанса; это имя затем используется для выполнения или освобождения ранее подготовленного оператора.

source: The data type of a parameter to the prepared statement. If the data type of a particular parameter is unspecified or is specified as <literal>unknown</literal>, it will be inferred from the context in which the parameter is used. To refer to the parameters in the prepared statement itself, use <literal>$1</literal>, <literal>$2</literal>, etc.
ru: Тип данных параметра подготовленного оператора. Если тип данных конкретного параметра не задан или задан как <literal>unknown</literal>, он будет выводиться из контекста, в котором используется параметр. Для обращения к параметрам в самом подготовленном операторе используется запись <literal>$1</literal>, <literal>$2</literal> и т. д.

source: Any <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, or <command>VALUES</command> statement.
ru: Любой оператор <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command> или <command>VALUES</command>.

source: Notes
ru: Замечания

source: Prepared statements can use generic plans rather than re-planning with each set of supplied <command>EXECUTE</command> values. This occurs immediately for prepared statements with no parameters; otherwise it occurs only after five or more executions produce plans whose estimated cost average (including planning overhead) is more expensive than the generic plan cost estimate. Once a generic plan is chosen, it is used for the remaining lifetime of the prepared statement. Using <command>EXECUTE</command> values which are rare in columns with many duplicates can generate custom plans that are so much cheaper than the generic plan, even after adding planning overhead, that the generic plan might never be used.
ru: Подготовленные операторы могут использовать общие планы, а не перестраивать план для каждого набора переданных значений <command>EXECUTE</command>. Для подготовленных операторов без параметров это происходит сразу; иначе общий план выбирается после пяти и более выполнений, при которых получаются планы с ожидаемой средней стоимостью (включая издержки планирования), превышающей оценку стоимости общего плана. Когда общий план выбран, он будет использоваться до конца жизни подготовленного оператора. При использовании значений <command>EXECUTE</command>, которые редко встречаются в столбцах со множеством дублирующихся значений, могут быть построены специализированные планы настолько выгоднее общего плана, что даже с издержками планирования общий план может не использоваться никогда.

source: A generic plan assumes that each value supplied to <command>EXECUTE</command> is one of the column's distinct values and that column values are uniformly distributed. For example, if statistics record three distinct column values, a generic plan assumes a column equality comparison will match 33% of processed rows. Column statistics also allow generic plans to accurately compute the selectivity of unique columns. Comparisons on non-uniformly-distributed columns and specification of non-existent values affects the average plan cost, and hence if and when a generic plan is chosen.
ru: Для общего плана предполагается, что значения, передаваемые в <command>EXECUTE</command>, являются уникальными значениями в столбце и что эти значения распределены равномерно. Например, если в статистике записаны три различных значения столбца, с общим планом предполагается, что проверке на равенство для столбца будут соответствовать 33% обработанных строк. Статистика по столбцам также позволяет общим планам точно вычислять избирательность для уникальных столбцов. Сравнения по столбцам с неоднородным распределением и указания несуществующих значений влияют на среднюю стоимость плана и следовательно, на то, будет ли выбран общий план и когда.

source: To examine the query plan <productname>PostgreSQL</productname> is using for a prepared statement, use <xref linkend="sql-explain"/>, e.g. <command>EXPLAIN EXECUTE</command>. If a generic plan is in use, it will contain parameter symbols <literal>$<replaceable>n</replaceable></literal>, while a custom plan will have the supplied parameter values substituted into it. The row estimates in the generic plan reflect the selectivity computed for the parameters.
ru: Чтобы узнать, какой план выполнения выбирает <productname>PostgreSQL</productname> для подготовленного оператора, воспользуйтесь <xref linkend="sql-explain"/> (например, напишите <command>EXPLAIN EXECUTE</command>). Если применяется общий план, он будет содержать символы параметров <literal>$<replaceable>n</replaceable></literal>, тогда как в специализированном плане будут подставлены фактические значения параметров. Оценки строк в общем плане отражают избирательность, вычисленную для конкретных параметров.

source: For more information on query planning and the statistics collected by <productname>PostgreSQL</productname> for that purpose, see the <xref linkend="sql-analyze"/> documentation.
ru: Более подробно о планировании запросов и статистике, которую собирает <productname>PostgreSQL</productname> для этих целей, можно узнать в документации <xref linkend="sql-analyze"/>.

source: Although the main point of a prepared statement is to avoid repeated parse analysis and planning of the statement, <productname>PostgreSQL</productname> will force re-analysis and re-planning of the statement before using it whenever database objects used in the statement have undergone definitional (DDL) changes since the previous use of the prepared statement. Also, if the value of <xref linkend="guc-search-path"/> changes from one use to the next, the statement will be re-parsed using the new <varname>search_path</varname>. (This latter behavior is new as of <productname>PostgreSQL</productname> 9.3.) These rules make use of a prepared statement semantically almost equivalent to re-submitting the same query text over and over, but with a performance benefit if no object definitions are changed, especially if the best plan remains the same across uses. An example of a case where the semantic equivalence is not perfect is that if the statement refers to a table by an unqualified name, and then a new table of the same name is created in a schema appearing earlier in the <varname>search_path</varname>, no automatic re-parse will occur since no object used in the statement changed. However, if some other change forces a re-parse, the new table will be referenced in subsequent uses.
ru: Хотя основной смысл подготовленных операторов в том, чтобы избежать многократного разбора и планирования оператора, <productname>PostgreSQL</productname> будет принудительно заново анализировать и планировать выполнение оператора всякий раз, когда объекты базы данных, задействованные в операторе, подвергаются изменениям определения (DDL) со времени предыдущего использования подготовленного оператора. Кроме того, если от одного использования оператора к другому меняется значение <xref linkend="guc-search-path"/>, оператор будет так же разобран заново с новым <varname>search_path</varname>. (Последнее поведение появилось в <productname>PostgreSQL</productname> 9.3.) С этими правилами использование подготовленного оператора по сути почти не отличается от выполнения одного и того же запроса снова и снова, но даёт выигрыш по скорости (если определения объектов не меняются), особенно если оптимальный план от раза к разу не меняется. Однако различия всё же могут проявиться — например, когда оператор обращается к таблице по неполному имени, а затем в схеме, стоящей в пути <varname>search_path</varname> раньше, создаётся другая таблица с таким же именем, автоматический пересмотр запроса не происходит, так как никакой объект в определении оператора не изменился. Однако, если автоматический пересмотр произойдёт в результате других изменений, при последующем выполнении запроса будет задействована новая таблица.

source: You can see all prepared statements available in the session by querying the <link linkend="view-pg-prepared-statements"><structname>pg_prepared_statements</structname></link> system view.
ru: Получить список всех доступных в сеансе подготовленных операторов можно, обратившись к системному представлению <link linkend="view-pg-prepared-statements"><structname>pg_prepared_statements</structname></link>.

source: Examples
ru: Примеры

source: Create a prepared statement for an <command>INSERT</command> statement, and then execute it: <placeholder-1/>
ru: Создание подготовленного оператора для команды <command>INSERT</command>, который затем выполняется: <placeholder-1/>

source: Create a prepared statement for a <command>SELECT</command> statement, and then execute it: <placeholder-1/> Note that the data type of the second parameter is not specified, so it is inferred from the context in which <literal>$2</literal> is used.
ru: Создание подготовленного оператора для команды <command>SELECT</command>, который затем выполняется: <placeholder-1/> Заметьте, что тип данных второго параметра не указывается, так что он выводится из контекста, в котором используется <literal>$2</literal>.

source: Compatibility
ru: Совместимость

source: The SQL standard includes a <command>PREPARE</command> statement, but it is only for use in embedded SQL. This version of the <command>PREPARE</command> statement also uses a somewhat different syntax.
ru: В стандарте SQL есть оператор <command>PREPARE</command>, но он предназначен только для применения во встраиваемом SQL. Эта версия оператора <command>PREPARE</command> имеет также несколько другой синтаксис.

source: See Also
ru: См. также
