Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/reassign_owned.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the ownership of database objects owned by a database role
ru: сменить владельца объектов базы данных, принадлежащих заданной роли

source: old_role
ru: старая_роль

source: new_role
ru: новая_роль

source: Description
ru: Описание

source: <command>REASSIGN OWNED</command> instructs the system to change the ownership of database objects owned by any of the <replaceable class="parameter">old_roles</replaceable> to <replaceable class="parameter">new_role</replaceable>.
ru: <command>REASSIGN OWNED</command> указывает системе сменить владельца объектов баз данных, принадлежащих одной из <replaceable class="parameter">старых_ролей</replaceable>, на <replaceable class="parameter">новую_роль</replaceable>.

source: Parameters
ru: Параметры

source: The name of a role. The ownership of all the objects within the current database, and of all shared objects (databases, tablespaces), owned by this role will be reassigned to <replaceable class="parameter">new_role</replaceable>.
ru: Имя роли. Все объекты в текущей базе данных и все общие объекты (базы данных, табличные пространства), принадлежащие этой роли, станут принадлежать <replaceable class="parameter">новой_роли</replaceable>.

source: The name of the role that will be made the new owner of the affected objects.
ru: Имя роли, которая станет новым владельцем затронутых объектов.

source: <command>REASSIGN OWNED</command> is often used to prepare for the removal of one or more roles. Because <command>REASSIGN OWNED</command> does not affect objects within other databases, it is usually necessary to execute this command in each database that contains objects owned by a role that is to be removed.
ru: <command>REASSIGN OWNED</command> часто применяется при подготовке к удалению одной или нескольких ролей. Так как команда <command>REASSIGN OWNED</command> затрагивает объекты только в текущей базе данных, обычно её нужно выполнять в каждой базе данных, которая содержит объекты, принадлежащие удаляемой роли.

source: <command>REASSIGN OWNED</command> requires privileges on both the source role(s) and the target role.
ru: Для выполнения <command>REASSIGN OWNED</command> требуются права и для исходной, и для целевой роли.

source: The <xref linkend="sql-drop-owned"/> command is an alternative that simply drops all the database objects owned by one or more roles.
ru: Команда <xref linkend="sql-drop-owned"/> предлагает альтернативное решение, просто удаляя все объекты в базе данных, принадлежащие одной или нескольким заданным ролям.

source: The <command>REASSIGN OWNED</command> command does not affect any privileges granted to the <replaceable class="parameter">old_roles</replaceable> for objects that are not owned by them. Use <command>DROP OWNED</command> to revoke such privileges.
ru: Команда <command>REASSIGN OWNED</command> не затрагивает никакие права, которые даны <replaceable class="parameter">старым_ролям</replaceable> для объектов, им не принадлежащим. Отозвать эти права можно, воспользовавшись командой <command>DROP OWNED</command>.

source: See <xref linkend="role-removal"/> for more discussion.
ru: За подробностями обратитесь к <xref remap="3" linkend="role-removal"/>.

source: Compatibility
ru: Совместимость

source: The <command>REASSIGN OWNED</command> command is a <productname>PostgreSQL</productname> extension.
ru: Оператор <command>REASSIGN OWNED</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
