Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/refresh_materialized_view.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: replace the contents of a materialized view
ru: заменить содержимое материализованного представления

source: name
ru: имя

source: Description
ru: Описание

source: <command>REFRESH MATERIALIZED VIEW</command> completely replaces the contents of a materialized view. The old contents are discarded. If <literal>WITH DATA</literal> is specified (or defaults) the backing query is executed to provide the new data, and the materialized view is left in a scannable state. If <literal>WITH NO DATA</literal> is specified no new data is generated and the materialized view is left in an unscannable state.
ru: <command>REFRESH MATERIALIZED VIEW</command> полностью заменяет содержимое материализованного представления. Старое содержимое при этом аннулируется. Если добавлено указание <literal>WITH DATA</literal> (или нет никакого), нижележащий запрос выполняется и выдаёт новые данные, так что материализованное представление остаётся в сканируемом состоянии. Если указано <literal>WITH NO DATA</literal>, новые данные не выдаются и представление оказывается в несканируемом состоянии.

source: <literal>CONCURRENTLY</literal> and <literal>WITH NO DATA</literal> may not be specified together.
ru: Указать <literal>CONCURRENTLY</literal> вместе с <literal>WITH NO DATA</literal> нельзя.

source: Parameters
ru: Параметры

source: Refresh the materialized view without locking out concurrent selects on the materialized view. Without this option a refresh which affects a lot of rows will tend to use fewer resources and complete more quickly, but could block other connections which are trying to read from the materialized view. This option may be faster in cases where a small number of rows are affected.
ru: Обновить материализованное представление, не блокируя параллельные выборки из него. Без данного параметра обновление, затрагивающее много строк, обычно задействует меньше ресурсов и выполнится быстрее, но может препятствовать чтению этого материализованного представления другими сеансами. При этом данный режим может быть быстрее при небольшом количестве строк.

source: This option is only allowed if there is at least one <literal>UNIQUE</literal> index on the materialized view which uses only column names and includes all rows; that is, it must not index on any expressions nor include a <literal>WHERE</literal> clause.
ru: Данный параметр допускается, только если в материализованном представлении есть хотя бы один индекс <literal>UNIQUE</literal>, построенный только по именам столбцов и включающий все строки; то есть, в нём не должно быть выражений и предложения <literal>WHERE</literal>.

source: This option may not be used when the materialized view is not already populated.
ru: Этот параметр нельзя использовать, когда материализованное представление ещё не наполнено.

source: Even with this option only one <literal>REFRESH</literal> at a time may run against any one materialized view.
ru: Даже с этим параметром в один момент времени допускается только одно обновление (<literal>REFRESH</literal>) материализованного представления.

source: The name (optionally schema-qualified) of the materialized view to refresh.
ru: Имя (возможно, дополненное схемой) материализованного представления, подлежащего обновлению.

source: Notes
ru: Замечания

source: While the default index for future <xref linkend="sql-cluster"/> operations is retained, <command>REFRESH MATERIALIZED VIEW</command> does not order the generated rows based on this property. If you want the data to be ordered upon generation, you must use an <literal>ORDER BY</literal> clause in the backing query.
ru: Тогда как индекс по умолчанию для операций <xref linkend="sql-cluster"/> команда <command>REFRESH MATERIALIZED VIEW</command> сохраняет, она не упорядочивает генерируемые строки по нему. Если генерируемые данные необходимо упорядочить, в определяющем запросе нужно явно указать <literal>ORDER BY</literal>.

source: Examples
ru: Примеры

source: This command will replace the contents of the materialized view called <literal>order_summary</literal> using the query from the materialized view's definition, and leave it in a scannable state: <placeholder-1/>
ru: Эта команда заменяет содержимое материализованного представления <literal>order_summary</literal>, используя запрос из определения материализованного представления, и оставляет его в сканируемом состоянии: <placeholder-1/>

source: This command will free storage associated with the materialized view <literal>annual_statistics_basis</literal> and leave it in an unscannable state: <placeholder-1/>
ru: Эта команда освобождает пространство, связанное с материализованным представлением <literal>annual_statistics_basis</literal>, и оставляет это представление в несканируемом состоянии: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>REFRESH MATERIALIZED VIEW</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>REFRESH MATERIALIZED VIEW</command> — расширение <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
