Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/reindex.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: rebuild indexes
ru: перестроить индексы

source: name
ru: имя

source: Description
ru: Описание

source: An index has become corrupted, and no longer contains valid data. Although in theory this should never happen, in practice indexes can become corrupted due to software bugs or hardware failures. <command>REINDEX</command> provides a recovery method.
ru: Индекс был повреждён, его содержимое стало некорректным. Хотя в теории этого не должно случаться, на практике индексы могут испортиться из-за программных ошибок или аппаратных сбоев. В таких случаях <command>REINDEX</command> служит методом восстановления индекса.

source: An index has become <quote>bloated</quote>, that is it contains many empty or nearly-empty pages. This can occur with B-tree indexes in <productname>PostgreSQL</productname> under certain uncommon access patterns. <command>REINDEX</command> provides a way to reduce the space consumption of the index by writing a new version of the index without the dead pages. See <xref linkend="routine-reindex"/> for more information.
ru: Индекс стал <quote>раздутым</quote>, то есть в нём оказалось много пустых или почти пустых страниц. Это может происходить с B-деревьями в <productname>PostgreSQL</productname> при определённых, достаточно редких сценариях использования. <command>REINDEX</command> даёт возможность сократить объём, занимаемый индексом, записывая новую версию индекса без &laquo;мёртвых&raquo; страниц. За подробностями обратитесь к <xref remap="3" linkend="routine-reindex"/>.

source: You have altered a storage parameter (such as fillfactor) for an index, and wish to ensure that the change has taken full effect.
ru: Параметр хранения индекса (например, фактор заполнения) был изменён, и теперь требуется, чтобы это изменение вступило в силу в полной мере.

source: An index build with the <literal>CONCURRENTLY</literal> option failed, leaving an <quote>invalid</quote> index. Such indexes are useless but it can be convenient to use <command>REINDEX</command> to rebuild them. Note that <command>REINDEX</command> will not perform a concurrent build. To build the index without interfering with production you should drop the index and reissue the <command>CREATE INDEX CONCURRENTLY</command> command.
ru: Построение индекса с параметром <literal>CONCURRENTLY</literal> завершилось ошибкой, в результате чего индекс оказался <quote>нерабочим</quote>. Такие индексы бесполезны, но команда <command>REINDEX</command> предоставляет удобный способ перестроить их. Однако заметьте, что <command>REINDEX</command> перестраивает индекс не в параллельном режиме. Чтобы перестроить такой индекс, минимизируя влияние на производственную среду, его следует удалить, а затем снова выполнить команду <command>CREATE INDEX CONCURRENTLY</command>.

source: <command>REINDEX</command> rebuilds an index using the data stored in the index's table, replacing the old copy of the index. There are several scenarios in which to use <command>REINDEX</command>: <placeholder-1/>
ru: <command>REINDEX</command> перестраивает индекс, обрабатывая данные таблицы, к которой относится индекс, и в результате заменяет старую копию индекса. Команда <command>REINDEX</command> применяется в следующих ситуациях: <placeholder-1/>

source: Parameters
ru: Параметры

source: Recreate the specified index.
ru: Перестраивает указанный индекс.

source: Recreate all indexes of the specified table. If the table has a secondary <quote>TOAST</quote> table, that is reindexed as well.
ru: Перестраивает все индексы в указанной таблице. Если у таблицы имеется дополнительная таблица <quote>TOAST</quote>, она так же переиндексируется.

source: Recreate all indexes of the specified schema. If a table of this schema has a secondary <quote>TOAST</quote> table, that is reindexed as well. Indexes on shared system catalogs are also processed. This form of <command>REINDEX</command> cannot be executed inside a transaction block.
ru: Перестраивает все индексы в указанной схеме. Если таблица в этой схеме имеет вторичную таблицу <quote>TOAST</quote>, она также будет переиндексирована. При этом обрабатываются и индексы в общих системных каталогах. Эту форму <command>REINDEX</command> нельзя выполнить в блоке транзакции.

source: Recreate all indexes within the current database. Indexes on shared system catalogs are also processed. This form of <command>REINDEX</command> cannot be executed inside a transaction block.
ru: Перестраивает все индексы в текущей базе данных. При этом обрабатываются также индексы в общих системных каталогах. Эту форму <command>REINDEX</command> нельзя выполнить в блоке транзакции.

source: Recreate all indexes on system catalogs within the current database. Indexes on shared system catalogs are included. Indexes on user tables are not processed. This form of <command>REINDEX</command> cannot be executed inside a transaction block.
ru: Перестраивает все индексы в системных каталогах текущей базы данных. При этом обрабатываются также индексы в общих системных каталогах, но индексы в таблицах пользователя не затрагиваются. Эту форму <command>REINDEX</command> нельзя выполнить в блоке транзакции.

source: The name of the specific index, table, or database to be reindexed. Index and table names can be schema-qualified. Presently, <command>REINDEX DATABASE</command> and <command>REINDEX SYSTEM</command> can only reindex the current database, so their parameter must match the current database's name.
ru: Имя определённого индекса, таблицы или базы данных, подлежащих переиндексации. В настоящее время <command>REINDEX DATABASE</command> и <command>REINDEX SYSTEM</command> могут переиндексировать только текущую базу данных, так что их параметр должен соответствовать имени текущей базы данных.

source: Prints a progress report as each index is reindexed.
ru: Выводит отчёт о прогрессе после переиндексации каждого индекса.

source: Notes
ru: Замечания

source: If you suspect corruption of an index on a user table, you can simply rebuild that index, or all indexes on the table, using <command>REINDEX INDEX</command> or <command>REINDEX TABLE</command>.
ru: В случае подозрений в повреждении индекса таблицы пользователя, этот индекс или все индексы таблицы можно перестроить, используя команду <command>REINDEX INDEX</command> или <command>REINDEX TABLE</command>.

source: Things are more difficult if you need to recover from corruption of an index on a system table. In this case it's important for the system to not have used any of the suspect indexes itself. (Indeed, in this sort of scenario you might find that server processes are crashing immediately at start-up, due to reliance on the corrupted indexes.) To recover safely, the server must be started with the <option>-P</option> option, which prevents it from using indexes for system catalog lookups.
ru: Всё усложняется, если возникает необходимость восстановить повреждённый индекс системной таблицы. В этом случае важно, чтобы система сама не использовала этот индекс. (На самом деле в таких случаях вы, скорее всего, столкнётесь с падением процессов сервера в момент запуска, как раз вследствие испорченных индексов.) Чтобы надёжно восстановить рабочее состояние, сервер следует запускать с параметром <option>-P</option>, который отключает использование индексов при поиске в системных каталогах.

source: One way to do this is to shut down the server and start a single-user <productname>PostgreSQL</productname> server with the <option>-P</option> option included on its command line. Then, <command>REINDEX DATABASE</command>, <command>REINDEX SYSTEM</command>, <command>REINDEX TABLE</command>, or <command>REINDEX INDEX</command> can be issued, depending on how much you want to reconstruct. If in doubt, use <command>REINDEX SYSTEM</command> to select reconstruction of all system indexes in the database. Then quit the single-user server session and restart the regular server. See the <xref linkend="app-postgres"/> reference page for more information about how to interact with the single-user server interface.
ru: Один из вариантов сделать это — выключить сервер <productname>PostgreSQL</productname> и запустить его снова в однопользовательском режиме, с параметром <option>-P</option> в командной строке. Затем можно выполнить <command>REINDEX DATABASE</command>, <command>REINDEX SYSTEM</command>, <command>REINDEX TABLE</command> или <command>REINDEX INDEX</command>, в зависимости от того, что вы хотите восстановить. В случае сомнений выполните <command>REINDEX SYSTEM</command>, чтобы перестроить все системные индексы в базе данных. Затем завершите однопользовательский сеанс сервера и перезапустите сервер в обычном режиме. Чтобы подробнее узнать, как работать с сервером в однопользовательском интерфейсе, обратитесь к справочной странице <xref linkend="app-postgres"/>.

source: Alternatively, a regular server session can be started with <option>-P</option> included in its command line options. The method for doing this varies across clients, but in all <application>libpq</application>-based clients, it is possible to set the <envar>PGOPTIONS</envar> environment variable to <literal>-P</literal> before starting the client. Note that while this method does not require locking out other clients, it might still be wise to prevent other users from connecting to the damaged database until repairs have been completed.
ru: Можно так же запустить обычный экземпляр сервера, но добавить в параметры командной строки <option>-P</option>. В разных клиентах это может делаться по-разному, но во всех клиентах на базе <application>libpq</application> можно установить для переменной окружения <envar>PGOPTIONS</envar> значение <literal>-P</literal> до запуска клиента. Учтите, что хотя этот метод не препятствует работе других клиентов, всё же имеет смысл не позволять им подключаться к повреждённой базе данных до завершения восстановления.

source: <command>REINDEX</command> is similar to a drop and recreate of the index in that the index contents are rebuilt from scratch. However, the locking considerations are rather different. <command>REINDEX</command> locks out writes but not reads of the index's parent table. It also takes an exclusive lock on the specific index being processed, which will block reads that attempt to use that index. In contrast, <command>DROP INDEX</command> momentarily takes an exclusive lock on the parent table, blocking both writes and reads. The subsequent <command>CREATE INDEX</command> locks out writes but not reads; since the index is not there, no read will attempt to use it, meaning that there will be no blocking but reads might be forced into expensive sequential scans.
ru: Действие <command>REINDEX</command> подобно удалению и пересозданию индекса в том смысле, что содержимое индекса пересоздаётся с нуля, но блокировки при этом устанавливаются другие. <command>REINDEX</command> блокирует запись, но не чтение родительской таблицы индекса. Эта команда также устанавливает исключительную блокировку для обрабатываемого индекса, что блокирует чтение таблицы, при котором задействуется этот индекс. <command>DROP INDEX</command>, напротив, моментально устанавливает исключительную блокировку на родительскую таблицу, блокируя и запись, и чтение. Последующая команда <command>CREATE INDEX</command> блокирует запись, но не чтение; так как индекс отсутствует, обращений к нему ни при каком чтении не будет, что означает, что блокироваться чтение не будет, но выполняться оно будет как дорогостоящее последовательное сканирование.

source: Reindexing a single index or table requires being the owner of that index or table. Reindexing a database requires being the owner of the database (note that the owner can therefore rebuild indexes of tables owned by other users). Of course, superusers can always reindex anything.
ru: Для перестраивания одного индекса или индексов таблицы необходимо быть владельцем этого индекса или таблицы. Для переиндексирования базы данных необходимо быть владельцем базы данных (заметьте, что он может таким образом перестроить индексы таблиц, принадлежащих другим пользователям). Разумеется, суперпользователи могут переиндексировать всё без ограничений.

source: Examples
ru: Примеры

source: Rebuild a single index: <placeholder-1/>
ru: Перестроение одного индекса: <placeholder-1/>

source: Rebuild all the indexes on the table <literal>my_table</literal>: <placeholder-1/>
ru: Перестроение всех индексов таблицы <literal>my_table</literal>: <placeholder-1/>

source: Rebuild all indexes in a particular database, without trusting the system indexes to be valid already: <placeholder-1/>
ru: Перестроение всех индексов в определённой базе данных, в предположении, что целостность системных индексов под сомнением: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>REINDEX</command> command in the SQL standard.
ru: Команда <command>REINDEX</command> отсутствует в стандарте SQL.
