Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/release_savepoint.po
Languages: ru

source: <primary>savepoints</primary><secondary>releasing</secondary>
ru: <primary>точки сохранения</primary><secondary>освобождение</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: destroy a previously defined savepoint
ru: высвободить ранее определённую точку сохранения

source: savepoint_name
ru: имя_точки_сохранения

source: Description
ru: Описание

source: <command>RELEASE SAVEPOINT</command> destroys a savepoint previously defined in the current transaction.
ru: <command>RELEASE SAVEPOINT</command> уничтожает точку сохранения, определённую ранее в текущей транзакции.

source: Destroying a savepoint makes it unavailable as a rollback point, but it has no other user visible behavior. It does not undo the effects of commands executed after the savepoint was established. (To do that, see <xref linkend="sql-rollback-to"/>.) Destroying a savepoint when it is no longer needed allows the system to reclaim some resources earlier than transaction end.
ru: После уничтожения точка сохранения становится неприменимой в качестве точки возврата, но никаких других проявлений, видимых для пользователя, эта команда не имеет. Она не отменяет эффекта команд, выполненных после установки точки сохранения. (Для этого предназначена команда <xref linkend="sql-rollback-to"/>.) Уничтожение точки сохранения, когда она становится не нужна, позволяет системе освобождать некоторые ресурсы раньше, чем завершается транзакция.

source: <command>RELEASE SAVEPOINT</command> also destroys all savepoints that were established after the named savepoint was established.
ru: <command>RELEASE SAVEPOINT</command> также уничтожает все точки сохранения, установленные после заданной точки.

source: Parameters
ru: Параметры

source: The name of the savepoint to destroy.
ru: Имя точки сохранения, подлежащей уничтожению.

source: Specifying a savepoint name that was not previously defined is an error.
ru: Указание имени точки сохранения, не определённой ранее, считается ошибкой.

source: It is not possible to release a savepoint when the transaction is in an aborted state.
ru: Освободить точку сохранения в транзакции, находящейся в прерванном состоянии, нельзя.

source: If multiple savepoints have the same name, only the one that was most recently defined is released.
ru: Если одно имя дано нескольким точкам сохранения, освобождена будет только последняя из них.

source: Examples
ru: Примеры

source: To establish and later destroy a savepoint: <placeholder-1/> The above transaction will insert both 3 and 4.
ru: Этот пример показывает, как установить и затем уничтожить точку сохранения: <placeholder-1/> Данная транзакция вставит значения 3 и 4.

source: Compatibility
ru: Совместимость

source: This command conforms to the <acronym>SQL</acronym> standard. The standard specifies that the key word <literal>SAVEPOINT</literal> is mandatory, but <productname>PostgreSQL</productname> allows it to be omitted.
ru: Эта команда соответствует стандарту <acronym>SQL</acronym>. В стандарте говорится, что ключевое слово <literal>SAVEPOINT</literal> является обязательным, но <productname>PostgreSQL</productname> позволяет опускать его.

source: See Also
ru: См. также
