Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/security_label.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define or change a security label applied to an object
ru: определить или изменить метку безопасности, применённую к объекту

source: provider
ru: провайдер

source: object_name
ru: имя_объекта

source: table_name
ru: имя_таблицы

source: column_name
ru: имя_столбца

source: aggregate_name
ru: имя_агрегатной_функции

source: aggregate_signature
ru: сигнатура_агр_функции

source: function_name
ru: имя_функции

source: argmode
ru: режим_аргумента

source: argname
ru: имя_аргумента

source: argtype
ru: тип_аргумента

source: large_object_oid
ru: oid_большого_объекта

source: label
ru: метка

source: where <placeholder-1/> is:
ru: Здесь <placeholder-1/>:

source: Description
ru: Описание

source: <command>SECURITY LABEL</command> applies a security label to a database object. An arbitrary number of security labels, one per label provider, can be associated with a given database object. Label providers are loadable modules which register themselves by using the function <function>register_label_provider</function>.
ru: <command>SECURITY LABEL</command> применяет метку безопасности к объекту базы данных. С определённым объектом может быть связано произвольное количество меток безопасности, по одной для каждого провайдера. Провайдеры меток представляют собой загружаемые модули, которые регистрирует себя, вызывая функцию <function>register_label_provider</function>.

source: <function>register_label_provider</function> is not an SQL function; it can only be called from C code loaded into the backend.
ru: <function>register_label_provider</function> ­­­— это не SQL-функция; её можно вызывать только из скомпилированного кода C, загруженного сервером.

source: The label provider determines whether a given label is valid and whether it is permissible to assign that label to a given object. The meaning of a given label is likewise at the discretion of the label provider. <productname>PostgreSQL</productname> places no restrictions on whether or how a label provider must interpret security labels; it merely provides a mechanism for storing them. In practice, this facility is intended to allow integration with label-based mandatory access control (MAC) systems such as <productname>SE-Linux</productname>. Such systems make all access control decisions based on object labels, rather than traditional discretionary access control (DAC) concepts such as users and groups.
ru: Провайдер меток определяет, допустима ли заданная метка и разрешено ли применять эту метку к указанному объекту. Какой смысл вкладывается в данную метку, так же определяет провайдер меток. <productname>PostgreSQL</productname> не накладывает никаких ограничений на то, как провайдер должен интерпретировать метки безопасности; он просто обеспечивает механизм их хранения. На практике, этот механизм реализован для того, чтобы в базы данных можно было интегрировать системы мандатного управления доступом (MAC) на базе меток, такие как <productname>SE-Linux</productname>. Такие системы принимают все решения по ограничению доступа, учитывая метки объектов, а не традиционные сущности избирательного управления доступом (DAC), такие как пользователи и группы.

source: Parameters
ru: Параметры

source: table_name.column_name
ru: имя_таблицы.имя_столбца

source: The name of the object to be labeled. Names of tables, aggregates, domains, foreign tables, functions, sequences, types, and views can be schema-qualified.
ru: Имя помечаемого объекта. Имена таблиц, агрегатных и обычных функций, доменов, сторонних таблиц, последовательностей и представлений можно дополнить именем схемы.

source: The name of the provider with which this label is to be associated. The named provider must be loaded and must consent to the proposed labeling operation. If exactly one provider is loaded, the provider name may be omitted for brevity.
ru: Имя провайдера, с которым будет связана эта метка. Указанный провайдер должен быть загружен и готов выполнять операцию размечивания. Если загружен всего один провайдер, его имя можно опустить для краткости.

source: The mode of a function or aggregate argument: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal>, or <literal>VARIADIC</literal>. If omitted, the default is <literal>IN</literal>. Note that <command>SECURITY LABEL</command> does not actually pay any attention to <literal>OUT</literal> arguments, since only the input arguments are needed to determine the function's identity. So it is sufficient to list the <literal>IN</literal>, <literal>INOUT</literal>, and <literal>VARIADIC</literal> arguments.
ru: Режим аргумента обычной или агрегатной функции: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal> или <literal>VARIADIC</literal>. По умолчанию подразумевается <literal>IN</literal>. Заметьте, что <command>SECURITY LABEL</command> на самом деле не учитывает аргументы <literal>OUT</literal>, так как для идентификации функции нужны только типы входных аргументов. Поэтому достаточно перечислить только аргументы <literal>IN</literal>, <literal>INOUT</literal> и <literal>VARIADIC</literal>.

source: The name of a function or aggregate argument. Note that <command>SECURITY LABEL</command> does not actually pay any attention to argument names, since only the argument data types are needed to determine the function's identity.
ru: Имя аргумента обычной или агрегатной функции. Заметьте, что на самом деле <command>SECURITY LABEL</command> не обращает внимание на имена аргументов, так как для однозначной идентификации функции достаточно только типов аргументов.

source: The data type of a function or aggregate argument.
ru: Тип данных аргумента обычной или агрегатной функции.

source: The OID of the large object.
ru: OID большого объекта.

source: This is a noise word.
ru: Это слово не несёт смысловой нагрузки.

source: The new security label, written as a string literal; or <literal>NULL</literal> to drop the security label.
ru: Новая метка безопасности, записанная в виде строковой константы, либо <literal>NULL</literal>, если метку безопасности нужно удалить.

source: Examples
ru: Примеры

source: The following example shows how the security label of a table might be changed. <placeholder-1/>
ru: Следующий пример показывает, как можно изменить метку безопасности для таблицы. <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>SECURITY LABEL</command> command in the SQL standard.
ru: Команда <command>SECURITY LABEL</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
