Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/set_transaction.po
Languages: ru

source: <primary>transaction isolation level</primary> <secondary>setting</secondary>
ru: <primary>уровень изоляции транзакции</primary> <secondary>установка</secondary>

source: <primary>read-only transaction</primary> <secondary>setting</secondary>
ru: <primary>транзакция без записи</primary> <secondary>установка</secondary>

source: <primary>deferrable transaction</primary> <secondary>setting</secondary>
ru: <primary>откладываемая транзакция</primary> <secondary>установка</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: set the characteristics of the current transaction
ru: установить характеристики текущей транзакции

source: transaction_mode
ru: режим_транзакции

source: snapshot_id
ru: id_снимка

source: where <placeholder-1/> is one of:
ru: Где возможные варианты <placeholder-1/>:

source: Description
ru: Описание

source: The <command>SET TRANSACTION</command> command sets the characteristics of the current transaction. It has no effect on any subsequent transactions. <command>SET SESSION CHARACTERISTICS</command> sets the default transaction characteristics for subsequent transactions of a session. These defaults can be overridden by <command>SET TRANSACTION</command> for an individual transaction.
ru: Команда <command>SET TRANSACTION</command> устанавливает характеристики текущей транзакции. На последующие транзакции она не влияет. <command>SET SESSION CHARACTERISTICS</command> устанавливает характеристики транзакции по умолчанию для последующих транзакций в рамках сеанса. Заданные по умолчанию характеристики затем можно переопределить для отдельных транзакций командой <command>SET TRANSACTION</command>.

source: The available transaction characteristics are the transaction isolation level, the transaction access mode (read/write or read-only), and the deferrable mode. In addition, a snapshot can be selected, though only for the current transaction, not as a session default.
ru: К характеристикам транзакции относится уровень изоляции транзакции, режим доступа транзакции (чтение/запись или только чтение) и допустимость её откладывания. В дополнение к ним можно выбрать снимок, но только для текущей транзакции, не для сеанса по умолчанию.

source: A statement can only see rows committed before it began. This is the default.
ru: Оператор видит только те строки, которые были зафиксированы до начала его выполнения. Этот уровень устанавливается по умолчанию.

source: All statements of the current transaction can only see rows committed before the first query or data-modification statement was executed in this transaction.
ru: Все операторы текущей транзакции видят только те строки, которые были зафиксированы перед первым запросом на выборку или изменение данных, выполненным в этой транзакции.

source: All statements of the current transaction can only see rows committed before the first query or data-modification statement was executed in this transaction. If a pattern of reads and writes among concurrent serializable transactions would create a situation which could not have occurred for any serial (one-at-a-time) execution of those transactions, one of them will be rolled back with a <literal>serialization_failure</literal> error.
ru: Все операторы текущей транзакции видят только те строки, которые были зафиксированы перед первым запросом на выборку или изменение данных, выполненным в этой транзакции. Если наложение операций чтения и записи параллельных сериализуемых транзакций может привести к ситуации, невозможной при последовательном их выполнении (когда одна транзакция выполняется за другой), произойдёт откат одной из транзакций с ошибкой <literal>serialization_failure</literal> (сбой сериализации).

source: The isolation level of a transaction determines what data the transaction can see when other transactions are running concurrently: <placeholder-1/> The SQL standard defines one additional level, <literal>READ UNCOMMITTED</literal>. In <productname>PostgreSQL</productname> <literal>READ UNCOMMITTED</literal> is treated as <literal>READ COMMITTED</literal>.
ru: Уровень изоляции транзакции определяет, какие данные может видеть транзакция, когда параллельно с ней выполняются другие транзакции: <placeholder-1/> В стандарте SQL определён ещё один уровень, <literal>READ UNCOMMITTED</literal>. В <productname>PostgreSQL</productname> уровень <literal>READ UNCOMMITTED</literal> обрабатывается как <literal>READ COMMITTED</literal>.

source: The transaction isolation level cannot be changed after the first query or data-modification statement (<command>SELECT</command>, <command>INSERT</command>, <command>DELETE</command>, <command>UPDATE</command>, <command>FETCH</command>, or <command>COPY</command>) of a transaction has been executed. See <xref linkend="mvcc"/> for more information about transaction isolation and concurrency control.
ru: Уровень изоляции транзакции нельзя изменить после выполнения первого запроса на выборку или изменение данных (<command>SELECT</command>, <command>INSERT</command>, <command>DELETE</command>, <command>UPDATE</command>, <command>FETCH</command> или <command>COPY</command>) в текущей транзакции. За дополнительными сведениями об изоляции транзакций и управлении параллельным доступом обратитесь к <xref remap="3" linkend="mvcc"/>.

source: The transaction access mode determines whether the transaction is read/write or read-only. Read/write is the default. When a transaction is read-only, the following SQL commands are disallowed: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, and <literal>COPY FROM</literal> if the table they would write to is not a temporary table; all <literal>CREATE</literal>, <literal>ALTER</literal>, and <literal>DROP</literal> commands; <literal>COMMENT</literal>, <literal>GRANT</literal>, <literal>REVOKE</literal>, <literal>TRUNCATE</literal>; and <literal>EXPLAIN ANALYZE</literal> and <literal>EXECUTE</literal> if the command they would execute is among those listed. This is a high-level notion of read-only that does not prevent all writes to disk.
ru: Режим доступа транзакции определяет, будет ли транзакция только читать данные или будет и читать, и писать. По умолчанию подразумевается чтение/запись. В транзакции без записи запрещаются следующие команды SQL: <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> и <literal>COPY FROM</literal>, если только целевая таблица не временная; любые команды <literal>CREATE</literal>, <literal>ALTER</literal> и <literal>DROP</literal>, а также <literal>COMMENT</literal>, <literal>GRANT</literal>, <literal>REVOKE</literal>, <literal>TRUNCATE</literal>; кроме того, запрещаются <literal>EXPLAIN ANALYZE</literal> и <literal>EXECUTE</literal>, если команда, которую они должны выполнить, относится к вышеперечисленным. Это высокоуровневое определение режима только для чтения, которое в принципе не исключает запись на диск.

source: The <literal>DEFERRABLE</literal> transaction property has no effect unless the transaction is also <literal>SERIALIZABLE</literal> and <literal>READ ONLY</literal>. When all three of these properties are selected for a transaction, the transaction may block when first acquiring its snapshot, after which it is able to run without the normal overhead of a <literal>SERIALIZABLE</literal> transaction and without any risk of contributing to or being canceled by a serialization failure. This mode is well suited for long-running reports or backups.
ru: Свойство <literal>DEFERRABLE</literal> оказывает влияние, только если транзакция находится также в режимах <literal>SERIALIZABLE</literal> и <literal>READ ONLY</literal>. Когда для транзакции установлены все три этих свойства, транзакция может быть заблокирована при первой попытке получить свой снимок данных, после чего она сможет выполняться без дополнительных усилий, обычных для режима <literal>SERIALIZABLE</literal>, и без риска привести к сбою сериализации или пострадать от него. Этот режим подходит для длительных операций, например для построения отчётов или резервного копирования.

source: The <literal>SET TRANSACTION SNAPSHOT</literal> command allows a new transaction to run with the same <firstterm>snapshot</firstterm> as an existing transaction. The pre-existing transaction must have exported its snapshot with the <literal>pg_export_snapshot</literal> function (see <xref linkend="functions-snapshot-synchronization"/>). That function returns a snapshot identifier, which must be given to <literal>SET TRANSACTION SNAPSHOT</literal> to specify which snapshot is to be imported. The identifier must be written as a string literal in this command, for example <literal>'000003A1-1'</literal>. <literal>SET TRANSACTION SNAPSHOT</literal> can only be executed at the start of a transaction, before the first query or data-modification statement (<command>SELECT</command>, <command>INSERT</command>, <command>DELETE</command>, <command>UPDATE</command>, <command>FETCH</command>, or <command>COPY</command>) of the transaction. Furthermore, the transaction must already be set to <literal>SERIALIZABLE</literal> or <literal>REPEATABLE READ</literal> isolation level (otherwise, the snapshot would be discarded immediately, since <literal>READ COMMITTED</literal> mode takes a new snapshot for each command). If the importing transaction uses <literal>SERIALIZABLE</literal> isolation level, then the transaction that exported the snapshot must also use that isolation level. Also, a non-read-only serializable transaction cannot import a snapshot from a read-only transaction.
ru: Команда <literal>SET TRANSACTION SNAPSHOT</literal> позволяет выполнить новую транзакцию со <firstterm>снимком данных</firstterm>, который имеет уже существующая. Эта ранее созданная транзакция должна экспортировать этот снимок с помощью функции <literal>pg_export_snapshot</literal> (см. <xref remap="4" linkend="functions-snapshot-synchronization"/>). Эта функция возвращает идентификатор снимка, который и нужно передать команде <literal>SET TRANSACTION SNAPSHOT</literal> в качестве идентификатора импортируемого снимка. В данной команде этот идентификатор должен записываться в виде строковой константы, например <literal>'000003A1-1'</literal>. <literal>SET TRANSACTION SNAPSHOT</literal> можно выполнить только в начале транзакции, до первого запроса на выборку или изменение данных (<command>SELECT</command>, <command>INSERT</command>, <command>DELETE</command>, <command>UPDATE</command>, <command>FETCH</command> или <command>COPY</command>) в текущей транзакции. Более того, для транзакции уже должен быть установлен уровень изоляции <literal>SERIALIZABLE</literal> или <literal>REPEATABLE READ</literal> (в противном случае, снимок будет сразу же потерян, так как на уровне <literal>READ COMMITTED</literal> для каждой команды делается новый снимок). Если импортирующая транзакция работает на уровне изоляции <literal>SERIALIZABLE</literal>, то транзакция, экспортирующая снимок, также должна работать на этом уровне. Кроме того, транзакции в режиме чтение/запись не могут импортировать снимок из транзакции в режиме &laquo;только чтение&raquo;.

source: Notes
ru: Замечания

source: If <command>SET TRANSACTION</command> is executed without a prior <command>START TRANSACTION</command> or <command>BEGIN</command>, it emits a warning and otherwise has no effect.
ru: Если команде <command>SET TRANSACTION</command> не предшествует <command>START TRANSACTION</command> или <command>BEGIN</command>, она выдаёт предупреждение и больше ничего не делает.

source: It is possible to dispense with <command>SET TRANSACTION</command> by instead specifying the desired <replaceable class="parameter">transaction_modes</replaceable> in <command>BEGIN</command> or <command>START TRANSACTION</command>. But that option is not available for <command>SET TRANSACTION SNAPSHOT</command>.
ru: Без <command>SET TRANSACTION</command> можно обойтись, задав требуемые <replaceable class="parameter">режимы_транзакции</replaceable> в операторах <command>BEGIN</command> или <command>START TRANSACTION</command>. Но для <command>SET TRANSACTION SNAPSHOT</command> такой возможности не предусмотрено.

source: The session default transaction modes can also be set by setting the configuration parameters <xref linkend="guc-default-transaction-isolation"/>, <xref linkend="guc-default-transaction-read-only"/>, and <xref linkend="guc-default-transaction-deferrable"/>. (In fact <command>SET SESSION CHARACTERISTICS</command> is just a verbose equivalent for setting these variables with <command>SET</command>.) This means the defaults can be set in the configuration file, via <command>ALTER DATABASE</command>, etc. Consult <xref linkend="runtime-config"/> for more information.
ru: Режимы транзакции для сеанса по умолчанию можно также задать в конфигурационных переменных <xref linkend="guc-default-transaction-isolation"/>, <xref linkend="guc-default-transaction-read-only"/> и <xref linkend="guc-default-transaction-deferrable"/>. (На практике, <command>SET SESSION CHARACTERISTICS</command> — это просто более многословная альтернатива изменению этих переменных командой <command>SET</command>.) Это значит, что значения этих переменных по умолчанию можно задать в файле конфигурации, с помощью команды <command>ALTER DATABASE</command> и т. д. За дополнительными сведениями обратитесь к <xref remap="3" linkend="runtime-config"/>.

source: Examples
ru: Примеры

source: To begin a new transaction with the same snapshot as an already existing transaction, first export the snapshot from the existing transaction. That will return the snapshot identifier, for example: <placeholder-1/> Then give the snapshot identifier in a <command>SET TRANSACTION SNAPSHOT</command> command at the beginning of the newly opened transaction: <placeholder-2/>
ru: Чтобы начать новую транзакцию со снимком данных, который получила уже существующая транзакция, его нужно сначала экспортировать из первой транзакции. При этом будет получен идентификатор снимка, например: <placeholder-1/> Затем этот идентификатор нужно передать команде <command>SET TRANSACTION SNAPSHOT</command> в начале новой транзакции: <placeholder-2/>

source: Compatibility
ru: Совместимость

source: These commands are defined in the <acronym>SQL</acronym> standard, except for the <literal>DEFERRABLE</literal> transaction mode and the <command>SET TRANSACTION SNAPSHOT</command> form, which are <productname>PostgreSQL</productname> extensions.
ru: Эти команды определены в стандарте <acronym>SQL</acronym>, за исключением режима транзакции <literal>DEFERRABLE</literal> и формы <command>SET TRANSACTION SNAPSHOT</command>, которые являются расширениями <productname>PostgreSQL</productname>.

source: <literal>SERIALIZABLE</literal> is the default transaction isolation level in the standard. In <productname>PostgreSQL</productname> the default is ordinarily <literal>READ COMMITTED</literal>, but you can change it as mentioned above.
ru: В стандарте уровнем изоляции по умолчанию является <literal>SERIALIZABLE</literal>. В <productname>PostgreSQL</productname> уровнем по умолчанию обычно считается <literal>READ COMMITTED</literal>, но его можно изменить, как описано выше.

source: In the SQL standard, there is one other transaction characteristic that can be set with these commands: the size of the diagnostics area. This concept is specific to embedded SQL, and therefore is not implemented in the <productname>PostgreSQL</productname> server.
ru: В стандарте SQL есть ещё одна характеристика транзакции, которую нельзя задать этими командами: размер диагностической области. Эта специфическая концепция встраиваемого SQL, поэтому в сервере <productname>PostgreSQL</productname> она не реализована.

source: The SQL standard requires commas between successive <replaceable class="parameter">transaction_modes</replaceable>, but for historical reasons <productname>PostgreSQL</productname> allows the commas to be omitted.
ru: Стандарт SQL требует, чтобы последовательные <replaceable class="parameter">режимы_транзакций</replaceable> разделялись запятыми, но по историческим причинам <productname>PostgreSQL</productname> позволяет опустить запятые.
