Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/set_role.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: set the current user identifier of the current session
ru: установить идентификатор текущего пользователя в рамках сеанса

source: role_name
ru: имя_роли

source: Description
ru: Описание

source: This command sets the current user identifier of the current SQL session to be <replaceable class="parameter">role_name</replaceable>. The role name can be written as either an identifier or a string literal. After <command>SET ROLE</command>, permissions checking for SQL commands is carried out as though the named role were the one that had logged in originally.
ru: Эта команда меняет идентификатор текущего пользователя в активном сеансе SQL на <replaceable class="parameter">имя_роли</replaceable>. Имя роли может быть записано в виде идентификатора или строковой константы. После <command>SET ROLE</command>, права доступа для команд SQL проверяются так, как если бы сеанс изначально был установлен с этим именем роли.

source: The specified <replaceable class="parameter">role_name</replaceable> must be a role that the current session user is a member of. (If the session user is a superuser, any role can be selected.)
ru: Указывая определённое <replaceable class="parameter">имя_роли</replaceable>, текущий пользователь должен являться членом этой роли. (Если пользователь сеанса является суперпользователем, он может выбрать любую роль.)

source: The <literal>SESSION</literal> and <literal>LOCAL</literal> modifiers act the same as for the regular <xref linkend="sql-set"/> command.
ru: Указания <literal>SESSION</literal> и <literal>LOCAL</literal> действуют на эту команду так же, как и на обычную команду <xref linkend="sql-set"/>.

source: The <literal>NONE</literal> and <literal>RESET</literal> forms reset the current user identifier to be the current session user identifier. These forms can be executed by any user.
ru: Формы <literal>NONE</literal> и <literal>RESET</literal> сбрасывают идентификатор текущего пользователя, так что активным становится идентификатор пользователя сеанса. Эти формы могут выполняться любыми пользователями.

source: Notes
ru: Замечания

source: Using this command, it is possible to either add privileges or restrict one's privileges. If the session user role has the <literal>INHERITS</literal> attribute, then it automatically has all the privileges of every role that it could <command>SET ROLE</command> to; in this case <command>SET ROLE</command> effectively drops all the privileges assigned directly to the session user and to the other roles it is a member of, leaving only the privileges available to the named role. On the other hand, if the session user role has the <literal>NOINHERITS</literal> attribute, <command>SET ROLE</command> drops the privileges assigned directly to the session user and instead acquires the privileges available to the named role.
ru: С помощью этой команды можно как добавить права, так и ограничить их. Если роль пользователя сеанса имеет атрибут <literal>INHERITS</literal>, она автоматически получает права всех ролей, на которые может переключиться (с помощью <command>SET ROLE</command>); в этом случае <command>SET ROLE</command> убирает все права, назначенные непосредственно пользователю сеанса и другим ролям, в которые он включён, и оставляет только права, назначенные указанной роли. Если же роль пользователя сеанса имеет атрибут <literal>NOINHERITS</literal>, <command>SET ROLE</command> убирает права, назначенные непосредственно пользователю сеанса, и вместо них назначает права, которые имеет указанная роль.

source: In particular, when a superuser chooses to <command>SET ROLE</command> to a non-superuser role, they lose their superuser privileges.
ru: В частности, когда суперпользователь переключается на роль не суперпользователя (используя <command>SET ROLE</command>), он теряет свои права суперпользователя.

source: <command>SET ROLE</command> has effects comparable to <xref linkend="sql-set-session-authorization"/>, but the privilege checks involved are quite different. Also, <command>SET SESSION AUTHORIZATION</command> determines which roles are allowable for later <command>SET ROLE</command> commands, whereas changing roles with <command>SET ROLE</command> does not change the set of roles allowed to a later <command>SET ROLE</command>.
ru: <command>SET ROLE</command> оказывает действие, сравнимое с <xref linkend="sql-set-session-authorization"/>, но проверка прав выполняется по-другому. Также <command>SET SESSION AUTHORIZATION</command> определяет, какие роли разрешены для последующей <command>SET ROLE</command>, тогда как при смене ролей командой <command>SET ROLE</command> набор ролей, допустимых для последующей команды <command>SET ROLE</command> не меняется.

source: <command>SET ROLE</command> does not process session variables as specified by the role's <xref linkend="sql-alterrole"/> settings; this only happens during login.
ru: <command>SET ROLE</command> не обрабатывает сеансовые переменные, указанные в свойствах роли (<xref linkend="sql-alterrole"/>); они устанавливаются только при подключении.

source: <command>SET ROLE</command> cannot be used within a <literal>SECURITY DEFINER</literal> function.
ru: <command>SET ROLE</command> нельзя использовать внутри функции с характеристикой <literal>SECURITY DEFINER</literal>.

source: Examples
ru: Примеры

source: Compatibility
ru: Совместимость

source: See Also
ru: См. также
