Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/set_constraints.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: set constraint check timing for the current transaction
ru: установить время проверки ограничений для текущей транзакции

source: Description
ru: Описание

source: <command>SET CONSTRAINTS</command> sets the behavior of constraint checking within the current transaction. <literal>IMMEDIATE</literal> constraints are checked at the end of each statement. <literal>DEFERRED</literal> constraints are not checked until transaction commit. Each constraint has its own <literal>IMMEDIATE</literal> or <literal>DEFERRED</literal> mode.
ru: <command>SET CONSTRAINTS</command> определяет, когда будут проверяться ограничения в текущей транзакции. Ограничения <literal>IMMEDIATE</literal> проверяются в конце каждого оператора, а ограничения <literal>DEFERRED</literal> откладываются до фиксации транзакции. Режим <literal>IMMEDIATE</literal> или <literal>DEFERRED</literal> задаётся для каждого ограничения независимо.

source: Upon creation, a constraint is given one of three characteristics: <literal>DEFERRABLE INITIALLY DEFERRED</literal>, <literal>DEFERRABLE INITIALLY IMMEDIATE</literal>, or <literal>NOT DEFERRABLE</literal>. The third class is always <literal>IMMEDIATE</literal> and is not affected by the <command>SET CONSTRAINTS</command> command. The first two classes start every transaction in the indicated mode, but their behavior can be changed within a transaction by <command>SET CONSTRAINTS</command>.
ru: При создании ограничение получает одну из следующих характеристик: <literal>DEFERRABLE INITIALLY DEFERRED</literal> (откладываемое, изначально отложенное), <literal>DEFERRABLE INITIALLY IMMEDIATE</literal> (откладываемое, изначально немедленное) или <literal>NOT DEFERRABLE</literal> (неоткладываемое). Третий вариант всегда подразумевает <literal>IMMEDIATE</literal> и на него команда <command>SET CONSTRAINTS</command> не влияет. Первые два варианта запускаются в каждой транзакции в указанном режиме, но их поведение можно изменить в рамках транзакции командой <command>SET CONSTRAINTS</command>.

source: <command>SET CONSTRAINTS</command> with a list of constraint names changes the mode of just those constraints (which must all be deferrable). Each constraint name can be schema-qualified. The current schema search path is used to find the first matching name if no schema name is specified. <command>SET CONSTRAINTS ALL</command> changes the mode of all deferrable constraints.
ru: <command>SET CONSTRAINTS</command> со списком имён ограничений меняет режим только этих ограничений (все они должны быть откладываемыми). Имя любого ограничения можно дополнить схемой. Если имя схемы не указано, в поисках первого подходящего имени будет просматриваться текущий путь поиска схем. <command>SET CONSTRAINTS ALL</command> меняет режим всех откладываемых ограничений.

source: When <command>SET CONSTRAINTS</command> changes the mode of a constraint from <literal>DEFERRED</literal> to <literal>IMMEDIATE</literal>, the new mode takes effect retroactively: any outstanding data modifications that would have been checked at the end of the transaction are instead checked during the execution of the <command>SET CONSTRAINTS</command> command. If any such constraint is violated, the <command>SET CONSTRAINTS</command> fails (and does not change the constraint mode). Thus, <command>SET CONSTRAINTS</command> can be used to force checking of constraints to occur at a specific point in a transaction.
ru: Когда <command>SET CONSTRAINTS</command> меняет режим ограничения с <literal>DEFERRED</literal> на <literal>IMMEDIATE</literal>, новый режим начинает действовать в обратную сторону: все изменения данных, ожидающие проверки в конце транзакции, вместо этого проверяются в момент выполнения команды <command>SET CONSTRAINTS</command>. Если какое-либо ограничение нарушается, при выполнении <command>SET CONSTRAINTS</command> происходит ошибка (и режим проверки не меняется). Таким образом, с помощью <command>SET CONSTRAINTS</command> можно принудительно проверить ограничения в определённом месте транзакции.

source: Currently, only <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, <literal>REFERENCES</literal> (foreign key), and <literal>EXCLUDE</literal> constraints are affected by this setting. <literal>NOT NULL</literal> and <literal>CHECK</literal> constraints are always checked immediately when a row is inserted or modified (<emphasis>not</emphasis> at the end of the statement). Uniqueness and exclusion constraints that have not been declared <literal>DEFERRABLE</literal> are also checked immediately.
ru: В настоящее время это распространяется только на ограничения <literal>UNIQUE</literal>, <literal>PRIMARY KEY</literal>, <literal>REFERENCES</literal> (внешний ключ) и <literal>EXCLUDE</literal>. Ограничения <literal>NOT NULL</literal> и <literal>CHECK</literal> всегда проверяются немедленно в момент добавления или изменения строки (<emphasis>не</emphasis> в конце оператора). Ограничения уникальности и ограничения-исключения, объявленные без указания <literal>DEFERRABLE</literal>, так же проверяются немедленно.

source: The firing of triggers that are declared as <quote>constraint triggers</quote> is also controlled by this setting &mdash; they fire at the same time that the associated constraint should be checked.
ru: Срабатывание триггеров, объявленных как <quote>триггеры ограничений</quote> так же зависит от этой команды &mdash; они срабатывают в момент, когда должно проверяться соответствующее ограничение.

source: Because <productname>PostgreSQL</productname> does not require constraint names to be unique within a schema (but only per-table), it is possible that there is more than one match for a specified constraint name. In this case <command>SET CONSTRAINTS</command> will act on all matches. For a non-schema-qualified name, once a match or matches have been found in some schema in the search path, schemas appearing later in the path are not searched.
ru: Так как <productname>PostgreSQL</productname> не требует, чтобы имена ограничений были уникальны в схеме (достаточно уникальности в таблице), возможно, что для заданного имени найдётся несколько соответствующих ограничений. В этом случае <command>SET CONSTRAINTS</command> подействует на все эти ограничения. Для имён без указания схемы, её действие будет распространяться только на ограничение(я), найденное в первой из схем; другие схемы просматриваться не будут.

source: This command only alters the behavior of constraints within the current transaction. Issuing this outside of a transaction block emits a warning and otherwise has no effect.
ru: Эта команда меняет поведение ограничений только в текущей транзакции. При выполнении этой команды вне блока транзакции выдаётся предупреждение и больше ничего не происходит.

source: Compatibility
ru: Совместимость

source: This command complies with the behavior defined in the SQL standard, except for the limitation that, in <productname>PostgreSQL</productname>, it does not apply to <literal>NOT NULL</literal> and <literal>CHECK</literal> constraints. Also, <productname>PostgreSQL</productname> checks non-deferrable uniqueness constraints immediately, not at end of statement as the standard would suggest.
ru: Эта команда реализует поведение, описанное в стандарте SQL, с одним исключением — в <productname>PostgreSQL</productname> она не влияет на проверку ограничений <literal>NOT NULL</literal> и <literal>CHECK</literal>. Кроме того, <productname>PostgreSQL</productname> проверяет неоткладываемые ограничения уникальности немедленно, а не в конце оператора, как предлагает стандарт.
