Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/truncate.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: empty a table or set of tables
ru: опустошить таблицу или набор таблиц

source: Description
ru: Описание

source: <command>TRUNCATE</command> quickly removes all rows from a set of tables. It has the same effect as an unqualified <command>DELETE</command> on each table, but since it does not actually scan the tables it is faster. Furthermore, it reclaims disk space immediately, rather than requiring a subsequent <command>VACUUM</command> operation. This is most useful on large tables.
ru: Команда <command>TRUNCATE</command> быстро удаляет все строки из набора таблиц. Она действует так же, как безусловная команда <command>DELETE</command> для каждой таблицы, но гораздо быстрее, так как она фактически не сканирует таблицы. Более того, она немедленно высвобождает дисковое пространство, так что выполнять операцию <command>VACUUM</command> после неё не требуется. Наиболее полезна она для больших таблиц.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of a table to truncate. If <literal>ONLY</literal> is specified before the table name, only that table is truncated. If <literal>ONLY</literal> is not specified, the table and all its descendant tables (if any) are truncated. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Имя (возможно, дополненное схемой) таблицы, подлежащей опустошению. Если перед именем таблицы указано <literal>ONLY</literal>, очищается только заданная таблица. Без <literal>ONLY</literal> очищается и заданная таблица, и все её потомки (если таковые есть). После имени таблицы можно также добавить необязательное указание <literal>*</literal>, чтобы явно обозначить, что блокировка затрагивает и все дочерние таблицы.

source: Automatically restart sequences owned by columns of the truncated table(s).
ru: Автоматически перезапускать последовательности, связанные со столбцами опустошаемой таблицы.

source: Do not change the values of sequences. This is the default.
ru: Не изменять значения последовательностей. Это поведение по умолчанию.

source: Automatically truncate all tables that have foreign-key references to any of the named tables, or to any tables added to the group due to <literal>CASCADE</literal>.
ru: Автоматически опустошать все таблицы, ссылающиеся по внешнему ключу на заданные таблицы, или на таблицы, затронутые в результате действия <literal>CASCADE</literal>.

source: Refuse to truncate if any of the tables have foreign-key references from tables that are not listed in the command. This is the default.
ru: Отказать в опустошении любых таблиц, на которые по внешнему ключу ссылаются другие таблицы, не перечисленные в этой команде. Это поведение по умолчанию.

source: You must have the <literal>TRUNCATE</literal> privilege on a table to truncate it.
ru: Чтобы опустошить таблицу, необходимо иметь право <literal>TRUNCATE</literal> для этой таблицы.

source: <command>TRUNCATE</command> acquires an <literal>ACCESS EXCLUSIVE</literal> lock on each table it operates on, which blocks all other concurrent operations on the table. When <literal>RESTART IDENTITY</literal> is specified, any sequences that are to be restarted are likewise locked exclusively. If concurrent access to a table is required, then the <command>DELETE</command> command should be used instead.
ru: Команда <command>TRUNCATE</command> запрашивает блокировку <literal>ACCESS EXCLUSIVE</literal> для каждой таблицы, которую она обрабатывает. Когда указано <literal>RESTART IDENTITY</literal>, все последовательности, которые должны быть перезапущены, так же блокируются исключительно. В случаях, когда требуется обеспечить параллельный доступ к таблице, следует использовать <command>DELETE</command>.

source: <command>TRUNCATE</command> cannot be used on a table that has foreign-key references from other tables, unless all such tables are also truncated in the same command. Checking validity in such cases would require table scans, and the whole point is not to do one. The <literal>CASCADE</literal> option can be used to automatically include all dependent tables &mdash; but be very careful when using this option, or else you might lose data you did not intend to!
ru: <command>TRUNCATE</command> нельзя использовать с таблицей, на которую по внешнему ключу ссылаются другие таблицы, если только и эти таблицы не опустошаются этой же командой. Проверка допустимости очистки в таких случаях потребовала бы сканирования таблицы, а главная идея данной команды в том, чтобы не делать этого. Для автоматической обработки всех зависимых таблиц можно использовать указание <literal>CASCADE</literal> &mdash; но будьте очень осторожны с ним, иначе вы можете потерять данные, которые не собирались удалять!

source: <command>TRUNCATE</command> will not fire any <literal>ON DELETE</literal> triggers that might exist for the tables. But it will fire <literal>ON TRUNCATE</literal> triggers. If <literal>ON TRUNCATE</literal> triggers are defined for any of the tables, then all <literal>BEFORE TRUNCATE</literal> triggers are fired before any truncation happens, and all <literal>AFTER TRUNCATE</literal> triggers are fired after the last truncation is performed and any sequences are reset. The triggers will fire in the order that the tables are to be processed (first those listed in the command, and then any that were added due to cascading).
ru: При выполнении <command>TRUNCATE</command> не срабатывают никакие триггеры <literal>ON DELETE</literal>, которые могут быть настроены для таблиц. Однако при этом срабатывают триггеры <literal>ON TRUNCATE</literal>. Если триггеры <literal>ON TRUNCATE</literal> определены для любых из этих таблиц, то все триггеры <literal>BEFORE TRUNCATE</literal> срабатывают до того, как происходит опустошение, а все триггеры <literal>AFTER TRUNCATE</literal> срабатывают после того, как завершается опустошение последней таблицы и все последовательности сбрасываются. Триггеры срабатывают по порядку обработки таблиц (сначала для таблиц, перечисленных в команде, затем для тех, что затрагиваются каскадно).

source: <command>TRUNCATE</command> is not MVCC-safe. After truncation, the table will appear empty to concurrent transactions, if they are using a snapshot taken before the truncation occurred. See <xref linkend="mvcc-caveats"/> for more details.
ru: Команда <command>TRUNCATE</command> небезопасна с точки зрения MVCC. После опустошения таблицы она будет выглядеть пустой для параллельных транзакций, если они работают со снимком, полученным до опустошения. За подробностями обратитесь к <xref remap="3" linkend="mvcc-caveats"/>.

source: <command>TRUNCATE</command> is transaction-safe with respect to the data in the tables: the truncation will be safely rolled back if the surrounding transaction does not commit.
ru: <command>TRUNCATE</command> является надёжной транзакционной операцией в отношении данных в таблицах: опустошение будет безопасно отменено, если окружающая транзакция не будет зафиксирована.

source: When <literal>RESTART IDENTITY</literal> is specified, the implied <command>ALTER SEQUENCE RESTART</command> operations are also done transactionally; that is, they will be rolled back if the surrounding transaction does not commit. This is unlike the normal behavior of <command>ALTER SEQUENCE RESTART</command>. Be aware that if any additional sequence operations are done on the restarted sequences before the transaction rolls back, the effects of these operations on the sequences will be rolled back, but not their effects on <function>currval()</function>; that is, after the transaction <function>currval()</function> will continue to reflect the last sequence value obtained inside the failed transaction, even though the sequence itself may no longer be consistent with that. This is similar to the usual behavior of <function>currval()</function> after a failed transaction.
ru: С указанием <literal>RESTART IDENTITY</literal> подразумеваемые операции <command>ALTER SEQUENCE RESTART</command> также выполняются транзакционно; то есть, они будут отменены, если окружающая транзакция не будет зафиксирована. Это отличается от обычного поведения <command>ALTER SEQUENCE RESTART</command>. Учтите, что если до того, как транзакция отменится, будут выполнены какие-либо дополнительные операции с последовательностями, эффект этих операций также будет отменён, но не их влияние на значение <function>currval()</function>; то есть после транзакции <function>currval()</function> продолжит возвращать последнее значение последовательности, полученное внутри прерванной транзакции, хотя сама последовательность уже может быть несогласованной с ним. Подобным образом обычно ведёт себя <function>currval()</function> после сбоя транзакции.

source: <command>TRUNCATE</command> is not currently supported for foreign tables. This implies that if a specified table has any descendant tables that are foreign, the command will fail.
ru: <command>TRUNCATE</command> в настоящее время не поддерживается для сторонних таблиц. Из этого следует, что если у целевой таблицы есть дочерние таблицы, являющиеся сторонними, команда не будет выполнена.

source: Examples
ru: Примеры

source: Truncate the tables <literal>bigtable</literal> and <literal>fattable</literal>: <placeholder-1/>
ru: Опустошение таблиц <literal>bigtable</literal> и <literal>fattable</literal>: <placeholder-1/>

source: The same, and also reset any associated sequence generators: <placeholder-1/>
ru: Та же операция и сброс всех связанных генераторов последовательностей: <placeholder-1/>

source: Truncate the table <literal>othertable</literal>, and cascade to any tables that reference <literal>othertable</literal> via foreign-key constraints: <placeholder-1/>
ru: Опустошение таблицы <literal>othertable</literal> и каскадная обработка всех таблиц, ссылающихся на <literal>othertable</literal> по ограничениям внешнего ключа: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The SQL:2008 standard includes a <command>TRUNCATE</command> command with the syntax <literal>TRUNCATE TABLE <replaceable>tablename</replaceable></literal>. The clauses <literal>CONTINUE IDENTITY</literal>/<literal>RESTART IDENTITY</literal> also appear in that standard, but have slightly different though related meanings. Some of the concurrency behavior of this command is left implementation-defined by the standard, so the above notes should be considered and compared with other implementations if necessary.
ru: Стандарт SQL:2008 включает команду <command>TRUNCATE</command> с синтаксисом <literal>TRUNCATE TABLE <replaceable>имя_таблицы</replaceable></literal>. Предложения <literal>CONTINUE IDENTITY</literal>/<literal>RESTART IDENTITY</literal> также описаны в стандарте, но с небольшими отличиями, хотя их назначение похоже. Поведение этой команды при параллельных операциях, согласно стандарту, отчасти определяются реализацией, так что приведённые выше замечания при необходимости следует учитывать и сопоставлять с другими реализациями.
