Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/unlisten.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: stop listening for a notification
ru: прекратить ожидание уведомления

source: channel
ru: канал

source: Description
ru: Описание

source: <command>UNLISTEN</command> is used to remove an existing registration for <command>NOTIFY</command> events. <command>UNLISTEN</command> cancels any existing registration of the current <productname>PostgreSQL</productname> session as a listener on the notification channel named <replaceable class="parameter">channel</replaceable>. The special wildcard <literal>*</literal> cancels all listener registrations for the current session.
ru: <command>UNLISTEN</command> применяется для отмены существующей подписки на получение событий <command>NOTIFY</command>. <command>UNLISTEN</command> отменяет существующую подписку в текущем сеансе <productname>PostgreSQL</productname> на канал уведомлений с именем <replaceable class="parameter">канал</replaceable>. Специальный знак <literal>*</literal> отменяет все подписки в текущем сеансе.

source: <xref linkend="sql-notify"/> contains a more extensive discussion of the use of <command>LISTEN</command> and <command>NOTIFY</command>.
ru: В описании <xref linkend="sql-notify"/> использование <command>LISTEN</command> и <command>NOTIFY</command> рассматривается более подробно.

source: Parameters
ru: Параметры

source: Name of a notification channel (any identifier).
ru: Имя канала уведомлений (любой идентификатор).

source: All current listen registrations for this session are cleared.
ru: Отменяются все текущие подписки на уведомления для активного сеанса.

source: Notes
ru: Замечания

source: You can unlisten something you were not listening for; no warning or error will appear.
ru: Вы можете также попытаться отменить подписку на канал, на который не подписаны; предупреждений или ошибки при этом не будет.

source: At the end of each session, <command>UNLISTEN *</command> is automatically executed.
ru: <command>UNLISTEN *</command> автоматически выполняется в конце каждого сеанса.

source: A transaction that has executed <command>UNLISTEN</command> cannot be prepared for two-phase commit.
ru: Транзакция, выполнившая <command>UNLISTEN</command>, не может быть подготовлена для двухфазной фиксации.

source: Examples
ru: Примеры

source: To make a registration: <placeholder-1/>
ru: Подписка на получение события: <placeholder-1/>

source: UNLISTEN virtual; NOTIFY virtual; -- no NOTIFY event is received
ru: UNLISTEN virtual; NOTIFY virtual; -- событие NOTIFY не поступает

source: Once <command>UNLISTEN</command> has been executed, further <command>NOTIFY</command> messages will be ignored: <placeholder-1/>
ru: Сразу после выполнения <command>UNLISTEN</command> последующие сообщения <command>NOTIFY</command> игнорируются: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>UNLISTEN</command> command in the SQL standard.
ru: Команда <command>UNLISTEN</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
