Repository: pluzanov/pg-doc-ru
Catalog: 9.6/ref/vacuum.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: garbage-collect and optionally analyze a database
ru: провести сборку мусора и, возможно, проанализировать базу данных

source: table_name
ru: имя_таблицы

source: column_name
ru: имя_столбца

source: Description
ru: Описание

source: <command>VACUUM</command> reclaims storage occupied by dead tuples. In normal <productname>PostgreSQL</productname> operation, tuples that are deleted or obsoleted by an update are not physically removed from their table; they remain present until a <command>VACUUM</command> is done. Therefore it's necessary to do <command>VACUUM</command> periodically, especially on frequently-updated tables.
ru: <command>VACUUM</command> высвобождает пространство, занимаемое &laquo;мёртвыми&raquo; кортежами. При обычных операциях <productname>PostgreSQL</productname> кортежи, удалённые или устаревшие в результате обновления, физически не удаляются из таблицы; они сохраняются в ней, пока не будет выполнена команда <command>VACUUM</command>. Таким образом, периодически необходимо выполнять <command>VACUUM</command>, особенно для часто изменяемых таблиц.

source: With no parameter, <command>VACUUM</command> processes every table in the current database that the current user has permission to vacuum. With a parameter, <command>VACUUM</command> processes only that table.
ru: Без параметра команда <command>VACUUM</command> обрабатывает все таблицы в текущей базе данных, которые может очистить текущий пользователь. Если в параметре передаётся имя таблицы, <command>VACUUM</command> обрабатывает только эту таблицу.

source: <command>VACUUM ANALYZE</command> performs a <command>VACUUM</command> and then an <command>ANALYZE</command> for each selected table. This is a handy combination form for routine maintenance scripts. See <xref linkend="sql-analyze"/> for more details about its processing.
ru: <command>VACUUM ANALYZE</command> выполняет очистку (<command>VACUUM</command>), а затем анализ (<command>ANALYZE</command>) всех указанных таблиц. Это удобная комбинация для регулярного обслуживания БД. За дополнительной информацией об анализе обратитесь к описанию <xref linkend="sql-analyze"/>.

source: Plain <command>VACUUM</command> (without <literal>FULL</literal>) simply reclaims space and makes it available for re-use. This form of the command can operate in parallel with normal reading and writing of the table, as an exclusive lock is not obtained. However, extra space is not returned to the operating system (in most cases); it's just kept available for re-use within the same table. <command>VACUUM FULL</command> rewrites the entire contents of the table into a new disk file with no extra space, allowing unused space to be returned to the operating system. This form is much slower and requires an exclusive lock on each table while it is being processed.
ru: Простая команда <command>VACUUM</command> (без <literal>FULL</literal>) только высвобождает пространство и делает его доступным для повторного использования. Эта форма команды может работать параллельно с обычными операциями чтения и записи таблицы, так она не требует исключительной блокировки. Однако освобождённое место не возвращается операционной системе (в большинстве случаев); оно просто остаётся доступным для размещения данных этой же таблицы. <command>VACUUM FULL</command> переписывает всё содержимое таблицы в новый файл на диске, не содержащий ничего лишнего, что позволяет возвратить неиспользованное пространство операционной системе. Эта форма работает намного медленнее и запрашивает исключительную блокировку для каждой обрабатываемой таблицы.

source: When the option list is surrounded by parentheses, the options can be written in any order. Without parentheses, options must be specified in exactly the order shown above. The parenthesized syntax was added in <productname>PostgreSQL</productname> 9.0; the unparenthesized syntax is deprecated.
ru: Когда список параметров заключается в скобки, параметры могут быть записаны в любом порядке. Без скобок параметры должны указываться именно в том порядке, который показан выше. Синтаксис со скобками появился в <productname>PostgreSQL</productname> 9.0; вариант записи без скобок считается устаревшим.

source: Parameters
ru: Параметры

source: Selects <quote>full</quote> vacuum, which can reclaim more space, but takes much longer and exclusively locks the table. This method also requires extra disk space, since it writes a new copy of the table and doesn't release the old copy until the operation is complete. Usually this should only be used when a significant amount of space needs to be reclaimed from within the table.
ru: Выбирает режим <quote>полной</quote> очистки, который может освободить больше пространства, но выполняется гораздо дольше и запрашивает исключительную блокировку таблицы. Этот режим также требует дополнительное место на диске, так как он записывает новую копию таблицы и не освобождает старую до завершения операции. Обычно это следует использовать, только когда требуется высвободить значительный объём пространства, выделенного таблице.

source: Selects aggressive <quote>freezing</quote> of tuples. Specifying <literal>FREEZE</literal> is equivalent to performing <command>VACUUM</command> with the <xref linkend="guc-vacuum-freeze-min-age"/> and <xref linkend="guc-vacuum-freeze-table-age"/> parameters set to zero. Aggressive freezing is always performed when the table is rewritten, so this option is redundant when <literal>FULL</literal> is specified.
ru: Выбирает агрессивную <quote>заморозку</quote> кортежей. Добавление указания <literal>FREEZE</literal> равносильно выполнению команды <command>VACUUM</command> с параметрами <xref linkend="guc-vacuum-freeze-min-age"/> и <xref linkend="guc-vacuum-freeze-table-age"/>, равными нулю. Агрессивная заморозка всегда выполняется при перезаписи таблицы, поэтому в режиме <literal>FULL</literal> это указание избыточно.

source: Prints a detailed vacuum activity report for each table.
ru: Выводит подробный отчёт об очистке для каждой таблицы.

source: Updates statistics used by the planner to determine the most efficient way to execute a query.
ru: Обновляет статистику, которую использует планировщик для выбора наиболее эффективного способа выполнения запроса.

source: Normally, <command>VACUUM</command> will skip pages based on the <link linkend="vacuum-for-visibility-map">visibility map</link>. Pages where all tuples are known to be frozen can always be skipped, and those where all tuples are known to be visible to all transactions may be skipped except when performing an aggressive vacuum. Furthermore, except when performing an aggressive vacuum, some pages may be skipped in order to avoid waiting for other sessions to finish using them. This option disables all page-skipping behavior, and is intended to be used only the contents of the visibility map are thought to be suspect, which should happen only if there is a hardware or software issue causing database corruption.
ru: Обычно <command>VACUUM</command> пропускает страницы, учитывая <link linkend="vacuum-for-visibility-map">карту видимости</link>. Страницы, на которых, судя по карте, все кортежи заморожены, можно пропускать всегда, а страницы, в которых все кортежи видны всем транзакциям, могут обрабатываться только при агрессивной очистке. Более того, за исключением агрессивной очистки, некоторые страницы можно пропускать, чтобы не ждать, пока другие сеансы закончат их использовать. Этот параметр отключает пропуск страниц и рассчитан для использования только когда целостность карты видимости вызывает подозрения, что возможно при аппаратных или программных сбоях, приводящих к разрушению БД.

source: The name (optionally schema-qualified) of a specific table to vacuum. Defaults to all tables in the current database.
ru: Имя (возможно, дополненное схемой) определённой таблицы, подлежащей очистке. По умолчанию очищаются все таблицы в текущей базе данных.

source: The name of a specific column to analyze. Defaults to all columns. If a column list is specified, <literal>ANALYZE</literal> is implied.
ru: Имя столбца, подлежащего анализу. По умолчанию анализируются все столбцы. Если указан список столбцов, подразумевается операция <literal>ANALYZE</literal>.

source: Outputs
ru: Выводимая информация

source: When <literal>VERBOSE</literal> is specified, <command>VACUUM</command> emits progress messages to indicate which table is currently being processed. Various statistics about the tables are printed as well.
ru: С указанием <literal>VERBOSE</literal> команда <command>VACUUM</command> выдаёт сообщения о процессе очистки, отмечая текущую обрабатываемую таблицу. Также она выводит различные статистические сведения о таблицах.

source: Notes
ru: Замечания

source: To vacuum a table, one must ordinarily be the table's owner or a superuser. However, database owners are allowed to vacuum all tables in their databases, except shared catalogs. (The restriction for shared catalogs means that a true database-wide <command>VACUUM</command> can only be performed by a superuser.) <command>VACUUM</command> will skip over any tables that the calling user does not have permission to vacuum.
ru: Чтобы очистить таблицу, обычно нужно быть владельцем этой таблицы или суперпользователем. Однако владельцам баз данных также разрешено сжимать все таблицы в своих базах, за исключением общих каталогов. (Ограничение в отношении общих каталогов означает, что настоящую глобальную команду <command>VACUUM</command> может выполнить только суперпользователь.) <command>VACUUM</command> при обработке пропускает все таблицы, на очистку которых текущий пользователь не имеет прав.

source: <command>VACUUM</command> cannot be executed inside a transaction block.
ru: <command>VACUUM</command> нельзя выполнять внутри блока транзакции.

source: For tables with <acronym>GIN</acronym> indexes, <command>VACUUM</command> (in any form) also completes any pending index insertions, by moving pending index entries to the appropriate places in the main <acronym>GIN</acronym> index structure. See <xref linkend="gin-fast-update"/> for details.
ru: Для таблиц с индексами <acronym>GIN</acronym>, <command>VACUUM</command> (в любой форме) также завершает все ожидающие операции добавления в индекс, перемещая записи индекса из очереди в соответствующие места в основной структуре индекса <acronym>GIN</acronym>. За подробностями обратитесь к <xref remap="3" linkend="gin-fast-update"/>.

source: We recommend that active production databases be vacuumed frequently (at least nightly), in order to remove dead rows. After adding or deleting a large number of rows, it might be a good idea to issue a <command>VACUUM ANALYZE</command> command for the affected table. This will update the system catalogs with the results of all recent changes, and allow the <productname>PostgreSQL</productname> query planner to make better choices in planning queries.
ru: Мы рекомендуем очищать активные производственные базы данных достаточно часто (как минимум, каждую ночь), чтобы избавляться от &laquo;мёртвых&raquo; строк. После добавления или удаления большого числа строк может быть хорошей идеей выполнить команду <command>VACUUM ANALYZE</command> для каждой затронутой таблицы. При этом результаты всех последних изменений будут отражены в системных каталогах, что позволит планировщику запросов <productname>PostgreSQL</productname> принимать более эффективные решения при планировании.

source: The <option>FULL</option> option is not recommended for routine use, but might be useful in special cases. An example is when you have deleted or updated most of the rows in a table and would like the table to physically shrink to occupy less disk space and allow faster table scans. <command>VACUUM FULL</command> will usually shrink the table more than a plain <command>VACUUM</command> would.
ru: Режим <option>FULL</option> не рекомендуется для обычного применения, но в некоторых случаях он бывает полезен. Например, когда были удалены или изменены почти все строки таблицы, может возникнуть желание физически сжать её, чтобы освободить место на диске и ускорить сканирование этой таблицы. Чаще всего <command>VACUUM FULL</command> сжимает таблицу более эффективно, чем обычный <command>VACUUM</command>.

source: <command>VACUUM</command> causes a substantial increase in I/O traffic, which might cause poor performance for other active sessions. Therefore, it is sometimes advisable to use the cost-based vacuum delay feature. See <xref linkend="runtime-config-resource-vacuum-cost"/> for details.
ru: <command>VACUUM</command> создаёт значительную нагрузку на подсистему ввода/вывода, что может отрицательно сказаться на производительности других активных сеансов. Поэтому иногда полезно использовать возможность задержки очистки с учётом её стоимости. За подробностями обратитесь к <xref remap="3" linkend="runtime-config-resource-vacuum-cost"/>.

source: <productname>PostgreSQL</productname> includes an <quote>autovacuum</quote> facility which can automate routine vacuum maintenance. For more information about automatic and manual vacuuming, see <xref linkend="routine-vacuuming"/>.
ru: <productname>PostgreSQL</productname> включает средство <quote>автоочистки</quote>, которое позволяет автоматизировать регулярную очистку. Чтобы узнать больше об автоматической и ручной очистке, обратитесь к <xref remap="3" linkend="routine-vacuuming"/>.

source: Examples
ru: Примеры

source: The following is an example from running <command>VACUUM</command> on a table in the regression database: <placeholder-1/>
ru: Ниже показан пример выполнения команды <command>VACUUM</command> для таблицы из базы данных regression: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>VACUUM</command> statement in the SQL standard.
ru: Оператор <command>VACUUM</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
